{"url": "https://www.vanityfair.com/hollywood/2018/07/dominic-cooper-mamma-mia-2-interview-cher-amanda-seyfried", "text": "This Friday, the most important movie of the year (it’s been empirically proven, don’t question it) hits theaters: Mamma Mia! Here We Go Again, the extremely sun-kissed sequel to 2008’s international smash Mamma Mia! As a member of a very stacked cast—Meryl Streep! Colin Firth! Christine Baranski! Andy Garcia! Cher!!—Dominic Cooper, playing the genial, abdominally blessed Sky, boyfriend to our charming lead Sophie (played by Amanda Seyfried), has a key role. At the beginning of the sequel, Sky, on a business trip in New York, and Sophie find themselves grappling with the challenges of a (temporarily) long-distance relationship. Will Sky find his way back to her? And, more pressingly, which ABBA hit will the two sing once he does?\n\nThe Mamma Mia! franchise has also influenced Cooper’s personal life. The 40-year-old actor—who can currently be seen in the third season of AMC’s Preacher as well—dated Seyfried in real life, after meeting her on the film, and the two were together for more than three years before splitting up. (Seyfried would tell Elle in 2011 that she “got her heart broken pretty hard.”) Seyfried is now married to actor Thomas Sadoski, and the two have a young child together—but Seyfried and Cooper still maintain a good relationship, even if she has said it was a bit awkward for Sadoski that she and her real-life ex-boyfriend were going to be reuniting on set.\n\nWe spoke to Cooper earlier this week to discuss the “high-school reunion” vibe of the sequel, how he felt about working with Seyfried, if he thinks there could potentially be a third Mamma Mia! film down the road, and Cher’s first impression of him.\n\nVanity Fair: At the screening I went to, the crowd was audibly cheering, clapping, and singing along for most of the film. What was it like for you seeing it for the first time?\n\nDominic Cooper: It was very exciting for me the other day. I saw it for the first time with the audience [at the premiere], and I kind of purposely made this decision—which was to wait until that audience on the premiere night, which was at the Hammersmith Apollo. So it’s a huge, huge amount of people. I’ve always had sort of slight amounts of anticipation as to whether people would respond so well to the slightly more emotional direction of this [sequel]. And they really did. It was a really sort of slow build. And it was clever putting together the story with flashbacks, the prequel into sequel. And I think [the audience] really went with it and took to it. It’s like this tiny ember that’s slightly getting brighter and brighter—and then by the end, when Cher steps on, it’s completely illuminating.\n\nWhat was it like to reconvene with everyone, 10 years later?\n\nI think it was unlike anything I could sort of quantify. Not that I’ve ever done this—I’ve always actually avoided this, and not been able to [go]—but it was like a school reunion. Your first thought is, Oh, what fun. Excellent. All these people! Then you think, Oh, my goodness, actually, 10 years. What have I done? What have I achieved? What have they done? What’s changed in their life? What’s changed in mine? Has anything changed, or has nothing changed? Will I be embarrassed? What do I look like now? You know? All this sudden paranoia that suddenly affect us, in the most ridiculous way. And what I then realized was actually how . . . what good friends we were and what good friends we’d become in that short space of time. And actually, we hadn’t had that great deal of contact [over the past decade], but we just sort of kicked off where we left off and it didn’t matter.", "images": ["https://media.vanityfair.com/photos/5d03acff76711f312e7fe6b3/1:1/w_350%2Ch_350%2Cc_limit/Jeffrey-Katzenberg%25E2%2580%2599s-Quibi.jpg", "https://media.vanityfair.com/photos/54d3a8f99f9fa5f230b14590/1:1/w_80%2Cc_limit/josh-duboff-square.jpg", "https://media.vanityfair.com/photos/5d03a3b276711f0f057fe6b1/1:1/w_350%2Ch_350%2Cc_limit/euphoria-review-hbo.jpg", "https://www.vanityfair.com/verso/static/hwd/assets/logo-reverse.6ef96ab8686439a35176e2ff8b2c4487e92fbaae.svg", "https://media.vanityfair.com/photos/5d07ab9bfaddf22be7a3f661/1:1/w_350%2Ch_350%2Cc_limit/downton-abby-posters-lede.jpg", "https://media.vanityfair.com/photos/5d090a5cb1f2b435810cf7d4/1:1/w_350%2Ch_350%2Cc_limit/Harvey-Weinstein-legal-team.jpg", "https://www.vanityfair.com/verso/static/hwd/assets/logo-header.7b6624f3aa336c67441a33a3e19289ee14eaf5c7.svg", "https://media.vanityfair.com/photos/5d0263d9ef4f5d344a3a40b2/1:1/w_350%2Ch_350%2Cc_limit/00-lead-jon-stewart.jpg", "https://media.vanityfair.com/photos/5b50ab2f7a97170b75493793/16:9/w_1280%2Cc_limit/Dominic-Cooper-Mamma-Mia-2.jpg", "https://media.vanityfair.com/photos/5b50ab2f7a97170b75493793/16:9/w_1280,c_limit/Dominic-Cooper-Mamma-Mia-2.jpg"], "top_img": "https://media.vanityfair.com/photos/5b50ab2f7a97170b75493793/16:9/w_1280,c_limit/Dominic-Cooper-Mamma-Mia-2.jpg", "keywords": [], "authors": ["Condé Nast", "Sonia Saraiya", "Laura Bradley", "Nicole Sperling", "Yohana Desta", "Josh Dubof"], "canonical_link": "https://www.vanityfair.com/hollywood/2018/07/dominic-cooper-mamma-mia-2-interview-cher-amanda-seyfried", "title": "Why Cher Took Some Time to Warm Up to Dominic Cooper", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Condé Nast", "copyright": "Copyright (c) Condé Nast 2019", "description": "The *Mamma Mia! Here We Go Again* actor on working with real-life ex-girlfriend Amanda Seyfried—and Cher—in the sequel, 10 years after the original film.", "keywords": "mamma mia 2,dominic cooper", "robots": "index, follow", "og": {"description": "The *Mamma Mia! Here We Go Again* actor on working with real-life ex-girlfriend Amanda Seyfried—and Cher—in the sequel, 10 years after the original film.", "image": "https://media.vanityfair.com/photos/5b50ab2f7a97170b75493793/16:9/w_1280,c_limit/Dominic-Cooper-Mamma-Mia-2.jpg", "site_name": "Vanity Fair", "title": "Why Cher Took Some Time to Warm Up to Dominic Cooper", "type": "article", "url": "https://www.vanityfair.com/hollywood/2018/07/dominic-cooper-mamma-mia-2-interview-cher-amanda-seyfried"}, "twitter": {"card": "summary_large_image", "description": "The *Mamma Mia! Here We Go Again* actor on working with real-life ex-girlfriend Amanda Seyfried—and Cher—in the sequel, 10 years after the original film.", "domain": "https://www.vanityfair.com", "image": {"src": "https://media.vanityfair.com/photos/5b50ab2f7a97170b75493793/16:9/w_1280,c_limit/Dominic-Cooper-Mamma-Mia-2.jpg?mbid=social_retweet"}, "site": "@VanityFair", "title": "Why Cher Took Some Time to Warm Up to Dominic Cooper"}, "fb": {"app_id": 305927716147259, "pages": 8810407571}}, "movies": [], "publish_date": null, "source": "https://www.vanityfair.com", "summary": ""}