{"url": "https://www.allure.com/story/top-global-hair-trends-pinterest-2018", "text": "Last year was all about the grown-out shag, \"Cher hair\" and of course, super-sleek platinum hair (thanks to the Kardashians). Hairstylists and colorist all around the world had their salons stocked up with ultra-long extensions and shelves piled high with purple toner to get that blonde shade just right.\n\nBut in 2018, the trends and hairstyles have changed quite a bit — just ask Pinterest, which has the tea on the top global beauty hair trends of the year. Some of these may come as a shock, while others are super obvious (just scroll through your Instagram to see the same tight-to-the-scalp Dutch braids or cornrows on all your favorite influencers). This week, Pinterest unveiled its 2018 Global Beauty Report, revealing what people all over the world are searching for (and pinning) in the realm of beauty.\n\nWithout further ado, here are the most pinned hairstyles from around the world.\n\nU.S.A.\n\nYou can thank the States' festival season and the fashion world's recent obsession with athleisure for their most coveted (and pinned) hairstyle — braids. The search for braids in the U.S. was up 445 percent, per Pinterest's data. Braids are extremely versatile, so it's no wonder they came in first place; they can be worn relaxed and wispy or tight and crisp; and they work with any hair length, style, or texture. Still, it is important to note, that for certain segments of the American population, particularly those of African descent, braids are a staple and a cultural tradition, whether or not it's Coachella time.\n\nGermany\n\nShort hair, don’t care. According to Pinterest, German women are keeping it cropped and ultra chic. Pixie cuts, up 266 percent, have truly taken off in Deutschland. This style works for any hair type — whether thick or fine, straight, or coiled. “It’s all in the cutting technique. The right cut will give structure and volume to fine hair and looseness and movement to thick hair, while the point-cutting technique offers enough space to see the texture [of curlier strands],” says hairstylist Nick Arrojo.\n\nFrance\n\nFrance is taking notes from the royals, more specifically Meghan Markle — the search for messy buns, up 137 percent, is on the rise. This data is sure to leave royal style purist shook.\n\nThe U.K.\n\nFrench women aren’t the only ones giving buns a try. In the U.K., it’s all about side buns (up 164 percent in searches). This look is relatively easy to do: Gather your hair on one side of your head and pull it into a ponytail. If you have fine or flat hair, back-comb your hair in one-inch sections to create subtle volume. Bunch up each piece and secure with a bobby pin. Lightly spray your bangs back (if you have them) and bobby-pin them into the side bun.\n\nArgentina\n\nBangs have certainly been in and out of the spotlight over the past decade. In Argentina, the trend is still going strong, but with an updated twist — or should I say \"part?\" Pinterest found that there was a rise in search for flequillo abierto — or open bangs (up 150 percent). Tapered edges gently fade into the longer strands, opening at the center, and framing the face, like on Camila Cabello, up top. If curtain bangs, as they're sometimes called, aren't for you, try another rising 2018 trend: baby bangs.\n\nCheck out what else is trending in hair around the world.", "images": ["https://media.allure.com/photos/5b817f46d99ebe7e700e14db/16:9/w_1280%2Cc_limit/most%252520popular%252520pinterest%252520hairstyles%2525202018.jpg", "https://media.allure.com/photos/5b805821934dc30def26a6d6/master/w_1600%2Cc_limit/2018-08-newsroom-global-beauty-02.jpg", "https://media.allure.com/photos/5d02a95583355016ad368a4a/1:1/w_350%2Ch_350%2Cc_limit/vitabrid-scalp-shampoo-lede.jpg", "https://media.allure.com/photos/5d1ceac8ec942e000863d090/1:1/w_350%2Ch_350%2Cc_limit/fourth-of-july-hair-lede.jpg", "https://media.allure.com/photos/5bf4a752225f972d712da833/1:1/w_350%2Ch_350%2Cc_limit/Mushroom%2520blonde%2520hair%2520color%2520actual%2520mushrooms.jpg", "https://media.allure.com/photos/5b817ed560b242358149da74/16:9/w_1280,c_limit/braided%2520styles.jpg", "https://www.allure.com/verso/static/allure/assets/logo-reverse.7c3ec9af78d5f39e36d039cb1f9fef504150550e.svg", "https://www.allure.com/verso/static/allure/assets/logo-header.95d6522119a7e0c0674f96017a219339528c048d.svg", "https://media.allure.com/photos/5d24982446b20700092f9b28/1:1/w_350%2Ch_350%2Cc_limit/Camila%2520Cabello.jpg"], "top_img": "https://media.allure.com/photos/5b817ed560b242358149da74/16:9/w_1280,c_limit/braided%2520styles.jpg", "keywords": [], "authors": ["Condé Nast", "Kaleigh Fasanella", "Leah Prinzivalli", "Madisen Theobal"], "canonical_link": "https://www.allure.com/story/top-global-hair-trends-pinterest-2018", "title": "The Top Global Hair Trends In 2018, According to Pinterest", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Condé Nast", "copyright": "Copyright (c) Condé Nast 2019", "description": "The top hairstyle search on Pinterest varies from country to country, but buns are undeniably popular around the world.", "keywords": "pinterest beauty,Pinterest,global beauty,hair trends,Hair,short hair,bangs,curtain bangs,pixie cut,bun,messy bun,braid", "robots": "index, follow", "og": {"description": "Throughout the rest of the world, not so much.", "image": "https://media.allure.com/photos/5b817ed560b242358149da74/16:9/w_1280,c_limit/braided%2520styles.jpg", "site_name": "Allure", "title": "Braids Are Top Pinned Hairstyle in the U.S., Says Pinterest", "type": "article", "url": "https://www.allure.com/story/top-global-hair-trends-pinterest-2018"}, "twitter": {"card": "summary_large_image", "description": "Throughout the rest of the world, not so much.", "domain": "https://www.allure.com", "image": {"src": "https://media.allure.com/photos/5b817ed560b242358149da74/16:9/w_1280,c_limit/braided%2520styles.jpg?mbid=social_retweet"}, "site": "@Allure_magazine", "title": "Braids Are Top Pinned Hairstyle in the U.S., Says Pinterest"}, "fb": {"app_id": 100614276777478, "pages": 24810773606, "admins": "648235154,789168297,688620285"}}, "movies": [], "publish_date": null, "source": "https://www.allure.com", "summary": ""}