{"url": "en.wikipedia.org/wiki/Bruce_Springsteen", "text": "\"Springsteen\" redirects here. For other uses, see Springsteen (disambiguation)\n\nAmerican singer and songwriter\n\nBruce Frederick Joseph Springsteen (born September 23, 1949), nicknamed \"The Boss\", is an American singer-songwriter who is a solo artist and is the leader of the E Street Band. Springsteen received critical acclaim for his early 1970s albums and attained worldwide fame upon the release of Born to Run in 1975. During a career that has spanned five decades,[1] Springsteen has become known for his poetic and socially conscious lyrics and for his lengthy, energetic stage performances. He has recorded both rock albums and folk-oriented works, and his lyrics often address the experiences and struggles of working-class Americans.\n\nSpringsteen has sold more than 135 million records worldwide and more than 64 million records in the United States, making him one of the world's best-selling music artists. His best-known songs include \"Born to Run\" (1975), \"Thunder Road\" (1975), \"Badlands\" (1978), \"Hungry Heart\" (1980), \"Dancing in the Dark\" (1984), \"Born in the U.S.A.\" (1984), \"Glory Days\" (1985), \"Brilliant Disguise\" (1987), \"Human Touch\" (1992), and \"Streets of Philadelphia\" (1994). He has earned numerous awards for his work, including 20 Grammy Awards, two Golden Globes, an Academy Award, and a Tony Award (for Springsteen on Broadway). Springsteen was inducted into both the Songwriters Hall of Fame and the Rock And Roll Hall Of Fame in 1999, received Kennedy Center Honors in 2009, was named MusiCares person of the year in 2013, and was awarded the Presidential Medal of Freedom in 2016.\n\nEarly life [ edit ]\n\nSpringsteen was born on September 23, 1949, at Monmouth Medical Center in Long Branch, New Jersey.[2] He was brought home from the hospital to Freehold Borough where he spent his childhood. He lived on South Street and attended Freehold Borough High School. His father, Douglas Frederick \"Dutch\"[3] Springsteen (1924–1998), was of Dutch and Irish ancestry, and worked as a bus driver, among other jobs, but was unemployed most of the time. Bruce's father suffered from mental health issues through his life which worsened in his later years.[4] Springsteen said his mother, Adele Ann (née Zerilli), a legal secretary of Italian ancestry, was the main breadwinner.[5]\n\nHis maternal grandfather was born in Vico Equense, a town near Naples.[6] He emigrated through Ellis Island, and when he arrived, he couldn't read or write. Eventually he became a lawyer, and impressed Springsteen when he was younger as being larger than life.[7] Springsteen has two younger sisters, Virginia and Pamela. Pamela had a brief film career, but left acting to pursue still photography full-time; she took photos for his Human Touch, Lucky Town and The Ghost of Tom Joad albums.\n\nSpringsteen's last name is topographic and of Dutch origin, literally translating to \"jumping stone\" but more generally meaning a kind of stone used as a stepping stone in unpaved streets or between two houses.[8] The Springsteens are among the early Dutch families who settled in the colony of New Netherland in the 1600s.\n\nRaised a Catholic, Springsteen attended the St. Rose of Lima Catholic school in Freehold Borough, where he was at odds with the nuns and rejected the strictures imposed upon him, even though some of his later music reflects a Catholic ethos and includes a few rock-influenced, traditional Irish-Catholic hymns.[9] In a 2012 interview, he explained that it was his Catholic upbringing rather than political ideology that most influenced his music. He noted in the interview that his faith had given him a \"very active spiritual life\", although he joked that this \"made it very difficult sexually.\" He added: \"Once a Catholic, always a Catholic.\"[10][4]\n\nSpringsteen grew up hearing fellow New Jersey singer Frank Sinatra on the radio. He became interested in being involved in music himself when, in 1956 and 1957, at the age of seven, he saw Elvis Presley on The Ed Sullivan Show. Soon after this, his mother rented him a guitar from Mike Diehl's Music in Freehold for $6 a week; it failed to provide him with the 'instant gratification' he desired.[11]\n\nIn ninth grade, Springsteen began attending the public Freehold High School, but did not fit in there either. Former teachers have said he was a \"loner, who wanted nothing more than to play his guitar.\" He graduated in 1967, but felt so uncomfortable that he skipped the ceremony.[12] He briefly attended Ocean County College, but dropped out.[9]\n\nCalled for conscription in the United States Army when he was 19, Springsteen failed the physical examination and did not serve in the Vietnam War. He had suffered a concussion in a motorcycle accident when he was 17, and this together with his \"crazy\" behavior at induction gave him a classification of 4F, which made him unacceptable for service.[13]\n\nCareer [ edit ]\n\n1964–1972: Early years [ edit ]\n\nThis was different, shifted the lay of the land. Four guys, playing and singing, writing their own material ... Rock 'n' roll came to my house where there seemed to be no way out ... and opened up a whole world of possibilities. —Bruce Springsteen, on the impact of The Beatles[14]\n\nIn 1964, Springsteen saw the Beatles appearances on The Ed Sullivan Show. Inspired, he bought his first guitar for $18.95 at the Western Auto Appliance Store.[15][14] Thereafter, he started playing for audiences with a band called the Rogues at local venues such as the Elks Lodge in Freehold.\n\nIn late 1964, Springsteen's mother took out a loan to buy him a $60 Kent guitar. Springsteen later memorialized this act in his song \"The Wish\". The following year, he went to the house of Tex and Marion Vinyard, who sponsored young bands in town. They helped him become the lead guitarist and subsequently one of the lead singers of the Castiles. The Castiles recorded two original songs at a public recording studio in Brick Township and played a variety of venues, including Cafe Wha? in Greenwich Village. Marion Vinyard said that she believed the young Springsteen when he promised he would make it big.[16][17]\n\nIn the late-1960s, Springsteen performed briefly in a power trio known as Earth, playing in clubs in New Jersey, with one major show at the Hotel Diplomat in New York City. Earth consisted of John Graham on bass, and Mike Burke on drums. Bob Alfano was later added on organ, then was replaced for two gigs by Frank 'Flash' Craig.[16]\n\nOrdinary life in New Jersey beach towns such as Asbury Park is the background to Springsteen's early lyrics\n\nFrom 1969 through early 1971, Springsteen performed with Steel Mill (originally called Child), which included Danny Federici, Vini Lopez, Vinnie Roslin and later Steve Van Zandt and Robbin Thompson. During this time he performed regularly at venues on the Jersey Shore, in Richmond, Virginia,[18] Nashville, Tennessee, and a set of gigs in California,[16] quickly gathering a cult following. San Francisco Examiner music critic Philip Elwood gave Springsteen credibility in his glowing assessment of Steel Mill: \"I have never been so overwhelmed by totally unknown talent.\" Elwood went on to praise their \"cohesive musicality\" and, in particular, singled out Springsteen as \"a most impressive composer\".\n\nOther acts followed over the next two years, as Springsteen sought to shape a unique and genuine musical and lyrical style: Dr. Zoom & the Sonic Boom (early- to mid-1971), the Sundance Blues Band (mid-1971), and the Bruce Springsteen Band (mid-1971 to mid-1972).[19] In October 1972, he formed a new band for the recording of his debut album Greetings from Asbury Park, N.J. The band eventually became known as The E Street Band, although the name was not used until September 1974.[20][21]\n\nSpringsteen acquired the nickname \"The Boss\" during this period, when his bands played club gigs and he took on the task of collecting the band's nightly pay and distributing it amongst his bandmates.[22] The nickname also reportedly sprang from games of Monopoly that Springsteen would play with other Jersey Shore musicians.[23] Springsteen is not fond of this nickname, due to his dislike of bosses,[22] but seems to have tacitly accepted it. Previously he had the nickname \"Doctor\".[24][25]\n\nHis prolific songwriting ability (with \"more words in some individual songs than other artists had in whole albums\", as his future record label would describe it in early publicity campaigns) brought his skills to the attention of several people who were about to change his life: New managers Mike Appel and Jim Cretecos, who in turn brought him to the attention of Columbia Records talent scout John Hammond. Hammond auditioned Springsteen in May 1972.\n\nEven after Springsteen gained international acclaim, his New Jersey roots showed through in his music, and he often praised \"the great state of New Jersey\" in his live shows. Drawing on his extensive local appeal, he has routinely sold out consecutive nights in major New Jersey, Philadelphia and New York venues. He has also made many surprise appearances at The Stone Pony and other shore nightclubs over the years.\n\n1972–1974: Initial struggle for success [ edit ]\n\nSpringsteen was signed to Columbia Records in 1972 by Clive Davis, after having initially piqued the interest of John Hammond, who had signed Bob Dylan to the same label a decade earlier. Despite the expectations of Columbia Records' executives that Springsteen would record an acoustic album, he brought many of his New Jersey-based colleagues into the studio with him, thus forming the E Street Band (although it would not be formally named for several months). His debut album Greetings from Asbury Park, N.J., released in January 1973, established him as a critical favorite[26] though sales were slow.\n\nBecause of Springsteen's lyrical poeticism and folk rock-rooted music exemplified on tracks like \"Blinded by the Light\"[note 1] and \"For You\", as well as the Columbia and Hammond connections, critics initially compared Springsteen to Bob Dylan. \"He sings with a freshness and urgency I haven't heard since I was rocked by 'Like a Rolling Stone'\" wrote Crawdaddy magazine editor Peter Knobler in Springsteen's first interview/profile in March 1973. Photographs for that original profile were taken by Ed Gallucci.[27][28] Crawdaddy discovered Springsteen in the rock press and was his earliest champion. Knobler profiled him in Crawdaddy three times, in 1973, 1975 and 1978.[29] (Springsteen and the E Street Band acknowledged the magazine's support by giving a private performance at the Crawdaddy 10th Anniversary Party in New York City in June 1976.)[30] Music critic Lester Bangs wrote in Creem in 1975 that when Springsteen's first album was released \"... many of us dismissed it: he wrote like Bob Dylan and Van Morrison, sang like Van Morrison and Robbie Robertson, and led a band that sounded like Van Morrison's\".[31] The track \"Spirit in the Night\" especially showed Morrison's influence, while \"Lost in the Flood\" was the first of many portraits of Vietnam veterans, and \"Growin' Up\", his first take on the recurring theme of adolescence.\n\nIn September 1973, Springsteen's second album The Wild, the Innocent & the E Street Shuffle was released, again to critical acclaim but no commercial success. Springsteen's songs became grander in form and scope, with the E Street Band providing a less folksy, more R&B vibe, and the lyrics often romanticized teenage street life. \"4th of July, Asbury Park (Sandy)\" and \"Incident on 57th Street\" would become fan favorites, and the long, rousing \"Rosalita (Come Out Tonight)\" continues to rank among Springsteen's most beloved concert numbers.\n\nIn the May 22, 1974 issue of Boston's The Real Paper music critic Jon Landau wrote, after seeing a performance at the Harvard Square Theater, \"I saw rock and roll future, and its name is Bruce Springsteen. And on a night when I needed to feel young, he made me feel like I was hearing music for the very first time.\"[32] Landau helped to finish the epic new album Born to Run and subsequently became Springsteen's manager and producer. Given an enormous budget in a last-ditch effort at a commercially viable record, Springsteen became bogged down in the recording process while striving for a \"Wall of Sound\" production. But when his manager, Mike Appel orchestrated the release of an early mix of \"Born to Run\" to nearly a dozen radio stations, anticipation built toward the album's release.[33]\n\nThe album took more than 14 months to record, with six months spent on the song \"Born to Run\". During this time, Springsteen battled with anger and frustration over the album, saying he heard \"sounds in [his] head\" that he could not explain to the others in the studio. It was during a recording session of \"Tenth Avenue Freeze-Out\", on July 13, 1975, that Steve Van Zandt was asked by Springsteen and Jon Landau to take charge and instruct the horn players. They both knew he was playing guitar and managing Southside Johnny and the Asbury Jukes, who had the sound they were looking for. Van Zandt \"sang each horn player his part, with the lines, the timing and the inflection all perfect. The musicians played their parts, and the horns were recorded. When they'd finished, Springsteen turned to Mike Appel. \"Okay,\" he said. \"It's time to put the boy on the payroll. I've been meaning to tell you — he’s the new guitar player.\"[34] Van Zandt joined the E Street Band a week later on July 20, the opening night of the Born To Run tour. He also helped Springsteen perfect \"Born to Run\" by adding its memorable guitar line. In the 2005 documentary Wings for Wheels,[35] Springsteen called his friend’s input on the track \"arguably Steve's greatest contribution to my music.\"\n\nThe album was completed on July 25, but at the end of the grueling recording sessions Springsteen was not satisfied, and upon first hearing the finished album, threw it into the alley; another master was so bad that Bruce flung it out of his hotel room window and into a river. He was going to scrap half of it, he told Appel, and substitute live recordings from upcoming dates at The Bottom Line in New York (a place he often played).[36]\n\n1975–1983: Breakthrough [ edit ]\n\nOn August 13, 1975, Springsteen and the E Street Band began a five-night, 10-show stand at New York's The Bottom Line club. This attracted major media attention and was broadcast live on WNEW-FM. (Decades later, Rolling Stone magazine would name the stand as one of the 50 Moments That Changed Rock and Roll.)[37] Oklahoma City rock radio station WKY, in association with Carson Attractions, staged an experimental promotional event that resulted in a sold out house at the (6,000 seat) Civic Center Music Hall.\n\nBorn to Run was released on August 25, 1975. It proved to be a breakthrough album[38][39][40] that catapulted Springsteen to worldwide fame.[41] The album peaked at No. 3 on the Billboard 200, and while reception at US top 40 radio outlets for the album's two singles was not overwhelming (\"Born to Run\" reached a modest No. 23 on the Billboard charts, and \"Tenth Avenue Freeze-Out\" peaked at No. 83), almost every track on the album received album-oriented rock airplay, especially \"Born to Run\", \"Thunder Road\", \"Tenth Avenue Freeze-Out,\" and \"Jungleland\", all of which remain perennial favorites on many classic rock stations.\n\nSpringsteen appeared on the covers of both Time and Newsweek in the same week, on October 27 of that year. So great did the wave of publicity become that he eventually rebelled against it during his first venture overseas, tearing down promotional posters before a concert appearance in London.\n\nSpringsteen and the E Street Band, 1977\n\nA legal battle with former manager Mike Appel kept Springsteen out of the studio for nearly a year, during which time he kept the E Street Band together through extensive touring across the U.S. Despite the optimistic fervor with which he often performed, Springsteen's new songs sounded more somber than much of his previous work. Reaching settlement with Appel in 1977, Springsteen returned to the studio, and the subsequent sessions produced Darkness on the Edge of Town (1978). Musically, this album was a turning point in Springsteen's career. Gone were the raw, rapid-fire lyrics, outsized characters, and long, multi-part musical compositions of the first three albums; the songs were leaner and more carefully drawn and began to reflect Springsteen's growing intellectual and political awareness. The cross-country 1978 tour to promote the album would become legendary for the intensity and length of its shows.[42]\n\nBy the late 1970s, Springsteen had earned a reputation in the pop world as a songwriter whose material could provide hits for other bands. Manfred Mann's Earth Band had achieved a US No. 1 pop hit with a heavily rearranged version of Greetings' \"Blinded by the Light\" in early 1977. Patti Smith reached No. 13 with her take on Springsteen's unreleased \"Because the Night\" (with revised lyrics by Smith) in 1978, while The Pointer Sisters hit No. 2 in 1979 with Springsteen's also unreleased \"Fire\". Although not a critical success, long time friend Southside Johnny recorded Springsteen's \"The Fever\" in early 1976 and \"Talk to Me\" in 1978. The two of them along with Steve Van Zandt collaborated to produce \"Trapped Again\" in 1978.\n\nIn September 1979, Springsteen and the E Street Band joined the Musicians United for Safe Energy anti-nuclear power collective at Madison Square Garden for two nights, playing an abbreviated set while premiering two songs from his upcoming album. The subsequent No Nukes live album, as well as the following summer's No Nukes documentary film, represented the first official recordings and footage of Springsteen's fabled live act, as well as Springsteen's first tentative dip into political involvement.\n\nSpringsteen continued to focus on working-class life with the 20-song double album The River in 1980, which included an intentionally paradoxical range of material from good-time party rockers to emotionally intense ballads, and finally yielded his first hit Top Ten single as a performer, \"Hungry Heart\". Like the previous two albums, musical styles on The River were derived largely from rock 'n' roll music of the 50s and 60s, but with a more explicit pop-rock sound than earlier albums. This is apparent in the adoption of Eighties pop-rock hallmarks like the reverberating-tenor drums, very basic percussion/guitar and repetitive lyrics apparent in many of the tracks. The title song pointed to Springsteen's intellectual direction, while a couple of the lesser-known tracks presaged his musical direction. The album sold well, becoming his first No. 1 on the Billboard Pop Albums chart, and a long tour in 1980 and 1981 followed, which included Springsteen's first extended tour of Europe and ending with a series of multi-night arena stands in major cities in the U.S.\n\nThe River was followed in 1982 by the stark solo acoustic Nebraska. Recording sessions had been held to expand on a demo tape Springsteen had made at his home on a simple, low-tech four-track tape deck. However, during the recording process Springsteen and producer Jon Landau realized the songs worked better as solo acoustic numbers than full band renditions and the original demo tape was released as the album. Although the recordings of the E Street Band were shelved, other songs from these sessions would later be released, including \"Born in the U.S.A\" and \"Glory Days\". According to the Marsh biographies, Springsteen was depressed when he wrote this material, and the result is a brutal depiction of American life. While Nebraska did not sell as well as Springsteen's three previous albums, it garnered widespread critical praise (including being named \"Album of the Year\" by Rolling Stone magazine's critics) and influenced later works by other major artists, including U2's album The Joshua Tree. Springsteen did not tour in conjunction with Nebraska's release.\n\n1984–1991: Commercial and popular phenomenon [ edit ]\n\nSpringsteen is probably best known for his album Born in the U.S.A. (1984), which sold 15 million copies in the U.S., 30 million worldwide, and became one of the best-selling albums of all time with seven singles hitting the Top 10. The title track was a bitter commentary on the treatment of Vietnam veterans, some of whom were Springsteen's friends. The lyrics in the verses were entirely unambiguous when listened to, but the anthemic music and the title of the song made it hard for many, from politicians to the common person, to get the lyrics—except those in the chorus, which could be read many ways.[43] The song made a huge political impact, as he was advocating for the rights of the common working-class man.[44]\n\nThe song was widely misinterpreted as jingoistic, and in connection with the 1984 presidential campaign became the subject of considerable folklore. In 1984, conservative columnist George Will attended a Springsteen concert and then wrote a column praising Springsteen's work ethic. Six days after the column was printed, in a campaign rally in Hammonton, New Jersey, Reagan said, \"America's future rests in a thousand dreams inside your hearts. It rests in the message of hope in the songs of a man so many young Americans admire—New Jersey's own, Bruce Springsteen.\" Two nights later, at a concert in Pittsburgh, Springsteen told the crowd, \"Well, the president was mentioning my name in his speech the other day and I kind of got to wondering what his favorite album of mine must've been, you know? I don't think it was the Nebraska album. I don't think he's been listening to this one.\" He then began playing \"Johnny 99\", with its allusions to closing factories and criminals.[45]\n\nSpringsteen also turned down several million dollars offered by the Chrysler Corporation to use \"Born in the U.S.A.\" in a car commercial. In later years, to eliminate the bombast and make the song's original meaning more explicitly clear, Springsteen performed the song accompanied only by acoustic guitar, thus returning to how the song was originally conceived. The original acoustic version of the song, recorded in 1982 during the Nebraska sessions, appeared on the 1998 archival release Tracks.\n\n\"Dancing in the Dark\" was the biggest of seven hit singles from Born in the U.S.A., peaking at No. 2 on the Billboard music charts. The video for the song showed a young Courteney Cox dancing on stage with Springsteen, which helped start the actress's career. The song \"Cover Me\" was written by Springsteen for Donna Summer, but his record company persuaded him to keep it for the new album. A big fan of Summer's work, Springsteen wrote another song for her, \"Protection\". Videos for the album were directed by Brian De Palma and John Sayles. Springsteen played on the \"We Are the World\" song and album in 1985. His live single \"Trapped\" from that album received moderate airplay on US Top 40 stations as well as reaching No. 1 on the Billboard Top Rock Tracks chart.[46]\n\nDuring the Born in the U.S.A. Tour, Springsteen met actress Julianne Phillips, whom he would marry in 1985. He also that year took part in the recording of the USA For Africa charity song \"We Are The World\"; however he declined to play at Live Aid. He later stated that he \"simply did not realise how big the whole thing was going to be\". He has since expressed regret at turning down Bob Geldof's invitation, stating that he could have played a couple of acoustic songs had there been no slot available for a full band performance.\n\nThe Born in the U.S.A. period represented the height of Springsteen's visibility in popular culture and the broadest audience he would ever reach (aided by the release of Arthur Baker's dance mixes of three of the singles). From June 15 to August 10, 1985, all seven of his albums appeared on the UK Albums Chart: the first time an artist had charted their entire back catalogue simultaneously.[47]\n\nLive/1975–85, a five-record box set (also on three cassettes or three CDs), was released near the end of 1986 and became the first box set to debut at No. 1 on the U.S. album charts. It is one of the most commercially successful live albums of all time, ultimately selling 13 million units in the U.S. Live/1975–85 summed up Springsteen's career to that point and displayed some of the elements that made his shows so powerful to his fans: the switching from mournful dirges to party rockers and back; the communal sense of purpose between artist and audience; the long, intense spoken passages before songs, including those describing Springsteen's difficult relationship with his father; and the instrumental prowess of the E Street Band, such as in the long coda to \"Racing in the Street\". Despite its popularity, some fans and critics felt the album's song selection could have been better. Springsteen concerts are the subjects of frequent bootleg recording and trading among fans.\n\nDuring the 1980s, several Springsteen fanzines were launched, including Backstreets magazine, which started in Seattle and continues today as a glossy publication, now in communication with Springsteen's management and official website.\n\nAfter this commercial peak, Springsteen released the much more sedate and contemplative Tunnel of Love album (1987), a mature reflection on the many faces of love found, lost and squandered, which only selectively used the E Street Band. It presaged the breakup of his marriage to Julianne Phillips and described some of his unhappiness in the relationship. Reflecting the challenges of love in \"Brilliant Disguise\", Springsteen sang:\n\nSo tell me who I see when I look in your eyes/Is that you, baby, or just a brilliant disguise?\n\nThe subsequent Tunnel of Love Express Tour shook up fans with changes to the stage layout, favorites dropped from the set list, and horn-based arrangements. During the European leg in 1988, Springsteen's relationship with backup singer Patti Scialfa became public. Phillips and Springsteen filed for divorce in 1988.[48]\n\nSpringsteen performing on the Tunnel of Love Express Tour at the Radrennbahn Weißensee in East Berlin on July 19, 1988\n\nOn July 19, 1988, Springsteen held a concert in East Germany that attracted 300,000 spectators. Journalist Erik Kirschbaum has called the concert \"the most important rock concert ever, anywhere\", in his 2013 book Rocking the Wall. Bruce Springsteen: The Berlin Concert That Changed the World. It had been conceived by the Socialist Unity Party's youth wing in an attempt to placate the youth of East Germany, who were hungry for more freedom and the popular music of the West. However, it is Kirschbaum's opinion that the success of the concert catalyzed opposition to the regime in the DDR, and helped contribute to the fall of the Berlin Wall the following year.[49]\n\nLater in 1988, Springsteen headlined the worldwide Human Rights Now! tour for Amnesty International. In late 1989 he dissolved the E Street Band, and he and Scialfa relocated to California, marrying in 1991.\n\n1992–1998: Ups, downs, and soundtracks [ edit ]\n\nIn 1992, after risking fan accusations of \"going Hollywood\" by moving to Los Angeles and working with session musicians, Springsteen released two albums at once. Human Touch and Lucky Town were even more introspective than any of his previous work and displayed a newly revealed confidence. As opposed to his first two albums, which dreamed of happiness, and his next four, which showed him growing to fear it, at points during the Lucky Town album, Springsteen actually claims happiness for himself.\n\nAn electric band appearance on the acoustic MTV Unplugged television program (later released as In Concert/MTV Plugged) was poorly received and further cemented fan dissatisfaction. Springsteen seemed to realize this a few years hence when he spoke humorously of his late father during his Rock and Roll Hall of Fame acceptance speech:\n\nI've gotta thank him because—what would I conceivably have written about without him? I mean, you can imagine that if everything had gone great between us, we would have had disaster. I would have written just happy songs—and I tried it in the early '90s and it didn't work; the public didn't like it.[50]\n\nA multiple Grammy Award winner, Springsteen also won an Academy Award in 1994 for his song \"Streets of Philadelphia\", which appeared on the soundtrack to the film Philadelphia. The video for the song shows Springsteen's actual vocal performance, recorded using a hidden microphone, to a prerecorded instrumental track. This technique was developed on the \"Brilliant Disguise\" video.\n\nIn 1995, after temporarily re-organizing the E Street Band for a few new songs recorded for his first Greatest Hits album (a recording session that was chronicled in the documentary Blood Brothers), and also one show at Tramps in New York City,[51] he released his second folk album, The Ghost of Tom Joad, inspired by John Steinbeck's The Grapes of Wrath and by Journey to Nowhere: The Saga of the New Underclass, a book by Pulitzer Prize-winning author Dale Maharidge and photographer Michael Williamson. This was generally less well-received than the similar Nebraska, due to the minimal melody, twangy vocals, and political nature of most of the songs, although some praised it for giving voice to immigrants and others who rarely have one in American culture. The lengthy, worldwide, small-venue solo acoustic Ghost of Tom Joad Tour that followed successfully presented many of his older songs in drastically reshaped acoustic form, although Springsteen had to explicitly remind his audiences to be quiet and not to clap during the performances.\n\nIn April 1996, Springsteen gave an interview to LGBT magazine The Advocate writer Judy Wieder, in which he spoke of the importance of fighting for gay marriage. \"You get your license, you do all the social rituals. It's part of your place in society, and in some way part of society's acceptance of you.\"[52]\n\nFollowing the tour, Springsteen moved back to New Jersey with his family.[53] In 1998, he released the sprawling, four-disc box set of outtakes, Tracks. Later, he would acknowledge that the 1990s were a \"lost period\" for him: \"I didn't do a lot of work. Some people would say I didn't do my best work.\"[54]\n\n1999–2007: Return to success [ edit ]\n\nSpringsteen was inducted into the Rock and Roll Hall of Fame in 1999 by Bono (the lead singer of U2), a favor he returned in 2005.[55]\n\nIn 1999, Springsteen and the E Street Band reunited and began their extensive Reunion Tour, lasting over a year. Highlights included a record sold-out, 15-show run at Continental Airlines Arena in East Rutherford, New Jersey and a ten-night, sold-out engagement at New York City's Madison Square Garden, which ended the tour. The final two shows were recorded for HBO, with corresponding DVD and album releases as Bruce Springsteen & The E Street Band: Live in New York City. A new song, \"American Skin (41 Shots)\", about the police shooting of Amadou Diallo, which was played at these shows proved controversial.\n\nIn 2002, Springsteen released his first studio effort with the full band in 18 years, The Rising, produced by Brendan O'Brien. The album, mostly a reflection on the September 11 attacks, was a critical and popular success. (Many of the songs were influenced by phone conversations Springsteen had with family members of victims of the attacks who in their obituaries had mentioned how his music touched their lives.) The title track gained airplay in several radio formats, and the record became Springsteen's best-selling album of new material in 15 years. Kicked off by an early-morning Asbury Park appearance on The Today Show, The Rising Tour commenced, barnstorming through a series of single-night arena stands in the U.S. and Europe to promote the album in 2002, then returning for large-scale, multiple-night stadium shows in 2003. Springsteen maintained a loyal hardcore fan base particularly in Europe and along the U.S. coasts. He played an unprecedented 10 nights in Giants Stadium in New Jersey, a ticket-selling feat to which no other musical act has come close.[56] During these shows Springsteen thanked those fans who were attending multiple shows and those who were coming from long distances or another country; the advent of robust Springsteen-oriented online communities had made such practices more common. The Rising Tour concluded with three nights in Shea Stadium, highlighted by renewed controversy over \"American Skin\" and a guest appearance by Bob Dylan.\n\nDuring the early 2000s, Springsteen became a visible advocate for the revitalization of Asbury Park, and played an annual series of winter holiday concerts there to benefit various local businesses, organizations, and causes. These shows were explicitly intended for the devoted fans, including numbers such as the E Street Shuffle outtake \"Thundercrack\", a rollicking group-participation song that would mystify casual Springsteen fans. He also frequently rehearses for tours in Asbury Park; some of his most devoted followers even stand outside the building to hear what fragments they can of the upcoming shows. The song \"My City of Ruins\" was originally written about Asbury Park, in honor of the attempts to revitalize the city. Looking for an appropriate song for the America: A Tribute to Heroes telethon broadcast, he selected \"My City of Ruins\", which was immediately recognized as an emotional highlight of the broadcast, with its gospel themes and its heartfelt exhortations to \"Rise up!\" The song became associated with post-9/11 New York, and he chose it to close The Rising album and as an encore on the subsequent tour.\n\nAt the Grammy Awards of 2003, Springsteen performed The Clash's \"London Calling\" along with Elvis Costello, Dave Grohl, and E Street Band member Steven Van Zandt and No Doubt's bassist, Tony Kanal, in tribute to Joe Strummer; Springsteen and the Clash had once been considered multiple-album-dueling rivals at the time of the double The River and the triple Sandinista!.\n\nIn 2004, Springsteen and the E Street Band participated in the Vote for Change tour, along with John Mellencamp, John Fogerty, the Dixie Chicks, Pearl Jam, R.E.M., Bright Eyes, the Dave Matthews Band, Jackson Browne, and other musicians. All concerts were to be held in swing states, to benefit the progressive political organization group America Coming Together and to encourage people to register and vote. A finale was held in Washington, D.C., bringing many of the artists together. Several days later, Springsteen held one more such concert in New Jersey, when polls showed that state surprisingly close. While in past years Springsteen had played benefits for causes in which he believed —against nuclear energy, for Vietnam veterans, Amnesty International, and the Christic Institute—he had always refrained from explicitly endorsing candidates for political office (indeed he had rejected the efforts of Walter Mondale to attract an endorsement during the 1984 Reagan \"Born in the U.S.A.\" flap). This new stance led to criticism and praise from the expected partisan sources. Springsteen's \"No Surrender\" became the main campaign theme song for John Kerry's unsuccessful presidential campaign; in the last days of the campaign, he performed acoustic versions of the song and some of his other old songs at Kerry rallies.\n\nDevils & Dust was released on April 26, 2005, and was recorded without the E Street Band. It is a low-key, mostly acoustic album, in the same vein as Nebraska and The Ghost of Tom Joad although with a little more instrumentation. Some of the material was written almost 10 years earlier during, or shortly after, the Ghost of Tom Joad Tour, with a few having been performed then but not released.[57] The title track concerns an ordinary soldier's feelings and fears during the Iraq War. Starbucks rejected a co-branding deal for the album, due in part to some sexually explicit content but also because of Springsteen's anti-corporate politics. The album entered the album charts at No. 1 in 10 countries (United States, Austria, Switzerland, Sweden, Denmark, Italy, Germany, the Netherlands, the United Kingdom, and Ireland). Springsteen began the solo Devils & Dust Tour at the same time as the album's release, playing both small and large venues. Attendance was disappointing in a few regions, and everywhere (other than in Europe) tickets were easier to get than in the past. Unlike his mid-1990s solo tour, he performed on piano, electric piano, pump organ, autoharp, ukulele, banjo, electric guitar, and stomping board, as well as acoustic guitar and harmonica, adding variety to the solo sound. (Offstage synthesizer, guitar, and percussion were also used for some songs.)\n\nIn November 2005, Sirius Satellite Radio started a 24-hour, seven-day-a-week radio station called E Street Radio. This channel played commercial-free Bruce Springsteen music, including rare tracks, interviews, and daily concerts of Bruce Springsteen & the E Street Band recorded throughout their career.\n\nIn April 2006, Springsteen released We Shall Overcome: The Seeger Sessions, an American roots music project focused around a big folk sound treatment of 15 songs popularized by the radical musical activism of Pete Seeger. It was recorded with a large ensemble of musicians including only Patti Scialfa, Soozie Tyrell, and The Miami Horns from past efforts. In contrast to previous albums, this was recorded in only three one-day sessions, and frequently one can hear Springsteen calling out key changes live as the band explores its way through the tracks. A tour began the same month, with the 18-strong ensemble of musicians dubbed The Seeger Sessions Band (and later shortened to The Sessions Band). Seeger Sessions material was emphasized, as well as a handful of (usually drastically rearranged) Springsteen numbers. The tour proved very popular in Europe, selling out everywhere and receiving some excellent reviews,[58] but newspapers reported that a number of U.S. shows suffered from sparse attendance.[59][60][61] By the end of 2006, the Seeger Sessions tour toured Europe twice and toured America for only a short span. Bruce Springsteen with The Sessions Band: Live in Dublin, containing selections from three nights of November 2006 shows at the Point Theatre in Dublin, Ireland, was released the following June.\n\nSpringsteen's next album, titled Magic, was released on October 2, 2007. Recorded with the E Street Band, it had 10 new Springsteen songs plus \"Long Walk Home\", performed once with the Sessions band, and a hidden track (the first included on a Springsteen studio release), \"Terry's Song\", a tribute to Springsteen's long-time assistant Terry Magovern, who died on July 30, 2007.[62] Magic debuted at No. 1 in Ireland and the UK. Greatest Hits reentered the Irish charts at No. 57, and Live in Dublin almost cracked the top 20 in Norway again. Sirius Satellite Radio also restarted E Street Radio on September 27, 2007, in anticipation of Magic.[63] Radio conglomerate Clear Channel Communications was alleged to have sent an edict to its classic rock stations to not play any songs from the new album, while continuing to play older Springsteen material. However, Clear Channel Adult Alternative (or \"AAA\") station KBCO did play tracks from the album, undermining the allegations of a corporate blackout.[64]\n\nThe Springsteen and E Street Band Magic Tour began at the Hartford Civic Center with the album's release and continued through North America and Europe.\n\nIt was announced on November 21, 2007, that Springsteen's longtime friend and founding E Street Band member, Danny Federici, would be taking a leave of absence from the Magic Tour to pursue treatment for melanoma. Charles Giordano filled in as Federici's replacement.\n\n2008–2011: Transitions [ edit ]\n\nFederici returned to the stage on March 20, 2008, when he appeared for portions of a Springsteen and E Street Band performance at Conseco Fieldhouse in Indianapolis. Less than one month later, on April 17, 2008, Federici died at the Memorial Sloan-Kettering Cancer Center in New York City, having suffered for three years from melanoma.[65][66]\n\nOn January 11, 2009, Springsteen won the Golden Globe Award for Best Song for \"The Wrestler\", from the Darren Aronofsky film by the same name.[67] After receiving a heartfelt letter from lead actor Mickey Rourke, Springsteen supplied the song for the film for free.[68]\n\nSpringsteen performed at the halftime show at Super Bowl XLIII on February 1, 2009,[69] agreeing to do it after many previous offers.[70] A few days before the game, Springsteen gave a rare press conference at which he promised a \"twelve-minute party.\"[71][72] It has been reported that this press conference was Springsteen's first press conference in more than 25 years.[73] His 12-minute 45-second set, with the E Street Band and the Miami Horns, included abbreviated renditions of \"Tenth Avenue Freeze-Out\", \"Born to Run\", \"Working on a Dream\", and \"Glory Days\", the latter complete with football references in place of the original baseball-themed lyrics. The set of appearances and promotional activities led Springsteen to say, \"This has probably been the busiest month of my life.\"[74]\n\nSpringsteen supported Barack Obama's 2008 presidential campaign.[75] He gave solo acoustic performances in support of Obama's campaign throughout 2008,[76] culminating with a November 2 rally at which he debuted the song \"Working on a Dream\" in a duet with Scialfa.[77]\n\nFollowing Obama's electoral victory on November 4, Springsteen's song \"The Rising\" was the first song played over the loudspeakers after Obama's victory speech in Chicago's Grant Park. Springsteen was the musical opener for the Obama Inaugural Celebration on January 18, 2009, which was attended by over 400,000 people.[78] He performed \"The Rising\" with an all-female choir. Later he performed Woody Guthrie's \"This Land Is Your Land\" with Pete Seeger.\n\nSpringsteen's Working on a Dream album, dedicated to the memory of Danny Federici, was released in late January 2009[71] and the supporting Working on a Dream Tour ran from April 2009 until November 2009. The tour presented few songs from the new album, with set lists dominated instead by classics and selections reflecting the ongoing late-2000s recession.[79] Springsteen also played songs requested by audience members holding up signs, a practice begun during the final stages of the Magic Tour.[79] Drummer Max Weinberg was replaced for some shows by his 18-year-old son Jay Weinberg, so that the former could serve his role as bandleader on The Tonight Show with Conan O'Brien.[79] During this tour, Springsteen and the band made their first real foray in the world of music festivals, headlining nights at the Pinkpop Festival in the Netherlands, Festival des Vieilles Charrues in France, the Bonnaroo Music Festival in the United States and the Glastonbury Festival[80] and Hard Rock Calling in the UK.[81] Several shows on the tour presented Born to Run, Darkness on the Edge of Town, or Born in the U.S.A. in its entirety.[82] The band performed five final shows at Giants Stadium, opening with a new song highlighting the historic stadium, and Springsteen's Jersey roots, named \"Wrecking Ball\".[83] A DVD from the Working on a Dream Tour entitled London Calling: Live in Hyde Park was released in 2010.\n\nFireworks go off at the conclusion of the \"E! Street! Band!\" exhortation during the final shows at Giants Stadium\n\nSpringsteen was among the recipients of the Kennedy Center Honors, an annual award to figures from the world of arts for their contribution to American culture, on December 6, 2009.[84] President Obama gave a speech in which he talked about how Springsteen had incorporated the life of regular Americans in his expansive palette of songs and how his concerts were beyond typical rock-and-roll concerts, how, apart from being high-energy concerts, they were \"communions\". He ended the remark \"while I am the president, he is the Boss\". Tributes were paid by several celebrities including Jon Stewart (who described Springsteen's \"unprecedented combination of lyrical eloquence, musical mastery and sheer unbridled, unadulterated joy\"). A musical tribute included John Mellencamp, Ben Harper, Jennifer Nettles, Melissa Etheridge, Eddie Vedder, and Sting.\n\nSpringsteen was among a host of musicians who voiced extensive criticism regarding the merging of Ticketmaster with Live Nation, saying \"the one thing that would make the current ticket situation even worse for the fan than it is now would be Ticketmaster and Live Nation coming up with a single system, thereby returning us to a near monopoly situation in music ticketing.\"[85]\n\nThe 2000s ended with Springsteen named one of eight Artists of the Decade by Rolling Stone magazine[86] and with Springsteen's tours ranking him fourth among artists in total concert grosses for the decade.[87] His 2010 tour included venues in the UK and Ireland.\n\nIn September 2010, a documentary about the making of Springsteen's 1978 album Darkness on the Edge of Town premiered at the Toronto International Film Festival. The film, The Promise: The Making of Darkness on the Edge of Town, was included in a box set reissue of the album, entitled The Promise: The Darkness on the Edge of Town Story, released in November 2010. Also airing on HBO, the documentary explored Springsteen's making of the album and his role in the production and development of the tracks.\n\nClarence Clemons, the E Street Band's saxophonist and founding member, died on June 18, 2011, of complications from a stroke. \"Clarence lived a wonderful life\", Springsteen said. \"He carried within him a love of people that made them love him. He created a wondrous and extended family. He loved the saxophone, loved our fans and gave everything he had every night he stepped on stage.\"[88]\n\n2012–present: Autobiography and Broadway show [ edit ]\n\nSpringsteen's 17th studio album, Wrecking Ball, was released on March 6, 2012. The album consists of eleven tracks plus two bonus tracks. Three songs previously only available as live versions—\"Wrecking Ball\", \"Land of Hope and Dreams\", and \"American Land\"—appear on the album.[89] Wrecking Ball became Springsteen's tenth No. 1 album in the United States, tying him with Elvis Presley for third most No. 1 albums of all-time. Only The Beatles (19) and Jay Z (12) have more No. 1 albums.[90]\n\nFollowing the release of the album, Springsteen and the E Street Band announced plans for the Wrecking Ball Tour, which began on March 18, 2012. As tickets for the first U.S. dates went on sale, many fans were unable to obtain tickets, much like for the 2009 Working on a Dream Tour, allegedly due to ticket scalpers. Shows sold out within minutes and many tickets appeared, at much higher prices, on resale websites such as StubHub less than an hour after the onsale time. Ticketmaster said web traffic was 2.5 times the highest level of the past year during the online sales and suggested that scalpers played a big role. On July 31, 2012, in Helsinki, Finland, Springsteen performed his longest concert ever at 4 hours and 6 minutes and 33 songs. Not included in this total time is a thirty-minute, five-song, solo acoustic set he did about two hours before the show.[91]\n\nSpringsteen was honored with the 2013 MusiCares Person of the Year award in recognition of his creative accomplishments as well as his charitable work and philanthropic activities. A ceremony was held on February 8, 2013, at the Staples Center in Los Angeles, two days before the Grammy Awards.[92]\n\nSpringsteen campaigned for President Barack Obama's re-election in Ohio, Iowa, Virginia, Pittsburgh, and Wisconsin. At the rallies, he briefly spoke to the audience and performed a short acoustic set that included a newly written song titled \"Forward\".[93][94][95] Obama also used \"We Take Care of Our Own\" as one of his top campaign songs. Use of the song helped boost sales of the song by 409%.[96]\n\nOn October 29, 2012, the New Jersey area was hit hard by Hurricane Sandy. Two days later, Springsteen dedicated his performance at the Blue Cross Arena in Rochester, New York, to those affected by the storm and those helping to recover. Springsteen and the E Street Band performed \"Land of Hope and Dreams\" at a one-hour televised telethon called Hurricane Sandy: Coming Together on November 2, 2012, which aired on NBC and at the same time on many other channels. Springsteen also joined Billy Joel, Steven Tyler, and Jimmy Fallon for a performance of \"Under the Boardwalk\". All money was donated to the American Red Cross.[97] Springsteen and the E Street Band, along with many top names in the music industry, performed at Madison Square Garden on December 12, 2012, for 12-12-12: The Concert for Sandy Relief.\n\nAt year's end, the Wrecking Ball Tour was named Top Draw for having the top attendance out of any tour by the Billboard Touring Awards. The tour finished second to Roger Waters, who had the top-grossing tour of 2012.[98] Springsteen finished second only to Madonna as the top money maker of 2012 with $33.44 million.[99] The Wrecking Ball album, along with the single \"We Take Care of Our Own\", was nominated for three Grammy Awards, including Best Rock Performance and Best Rock Song for \"We Take Care of Our Own\" and Best Rock Album.[100][101] Rolling Stone named Wrecking Ball the number one album of 2012 on their Top 50 albums of 2012 list.[102]\n\nIn March 2013, and for the first time since re-uniting with Springsteen in 1999, Steven Van Zandt was forced to miss the Australian leg of the band's tour due to acting commitments on his television show Lilyhammer. He was replaced by guitarist Tom Morello for the leg.[103]\n\nIn late July 2013, the documentary Springsteen & I, directed by Baillie Walsh and produced by Ridley Scott, was released simultaneously via a worldwide cinema broadcast in over 50 countries and in over 2000 movie theaters.[104]\n\nThe Wrecking Ball Tour, which came to an end in September 2013, was one of Springsteen's most successful. A week after it ended, Springsteen announced a 2014 tour that would include dates in Australia and New Zealand.[105]\n\nSpringsteen, along with friend and mentor Pete Seeger, as well as Herbie Hancock, Sally Field and Robert De Niro, was among a total of 198 class of 2013 inductees into the American Academy of Arts and Sciences. The induction ceremony was held at the Academy's headquarters in Cambridge, Massachusetts in October 2013.\n\nIn October 2013, Springsteen posted a letter on his website thanking fans of all ages for their support throughout the Wrecking Ball World Tour. A highlight video of the tour was also released showing a new studio recording of the Suicide song, \"Dream Baby Dream\".[106]\n\nSpringsteen released his eighteenth studio album, High Hopes, on January 14, 2014. The first single and video were of a newly recorded version of the song \"High Hopes\", which Springsteen had previously recorded in 1995. The album was the first by Springsteen in which all songs are either cover songs, newly recorded outtakes from previous records, or newly recorded versions of songs previously released. The 2014 E Street Band touring lineup, along with deceased E Street Band members Clarence Clemons and Danny Federici, appears on the album along with guitarist Tom Morello.[107]\n\nIt was announced on January 15, 2014 that Springsteen would start making professional recordings of all of his live shows available following each performance on his upcoming tour via download to a special USB wristband.[108] In addition to the wristbands, shows will also be offered through Springsteen's website until June 30, 2014.[109] Springsteen along with the E Street Band and guitarist Tom Morello, kicked off the High Hopes Tour on January 26, 2014. The tour was considered to be a continuation of the Wrecking Ball Tour.\n\nHigh Hopes became Springsteen's eleventh No. 1 album in the US.[110] It was his tenth No. 1 in the UK, tying him for fifth all-time The Rolling Stones and U2.[111] On April 4, 2014, HBO aired Bruce Springsteen's High Hopes a 30-minute documentary on the recording of High Hopes.[112] Rolling Stone named High Hopes the second best album of the year (behind only U2's Songs of Innocence) on their Top 50 Albums of 2014 list.[113]\n\nAnnounced as inductees in December 2013, Springsteen inducted past and present members of the E Street Band into the Rock and Roll Hall of Fame on April 10, 2014, with each member giving a speech and Springsteen and the band performing a three-song set of \"The E Street Shuffle\", \"The River\" and \"Kitty's Back\".[114]\n\nAmerican Beauty, a limited edition four-song EP on 12-inch vinyl released exclusively for Record Store Day on April 18, 2014 contains four unreleased songs from the High Hopes sessions.[115] A music video for the title track was also released. After 34 shows and 182 songs performed, the High Hopes Tour came to an end on May 18, 2014. Springsteen released a short film for the song \"Hunter of Invisible Game\" on July 9, 2014 through his website. It marked Springsteen's directorial debut.[116]\n\nOn November 17, 2014, Springsteen released The Album Collection Vol. 1 1973-1984, an 8-disc remastered version of his first seven studio albums, some of which had been remastered for the first time.[117]\n\nSpringsteen made his acting debut in the final episode of Season 3 of Van Zandt's show Lilyhammer, which was named \"Loose Ends\", after a Springsteen song on his album Tracks. He played Giuseppe Tagliano, the brother of Van Zandt's character, Frank Tagliano aka \"Giovanni \"Johnny\" Henrikssen\". Giuseppe is an undertaker and owner of a funeral parlor who occasionally works as a hitman for a mafia family with which Frank is associated.\n\nIn November 2014, Springsteen announced that he would release live concert recordings from throughout his career including many shows which were only previously available through bootlegs. Each show will be restored, remixed and remastered.[118]\n\nOn August 6, 2015, Springsteen performed \"Land of Hope and Dreams\" and \"Born to Run\" on the final episode of The Daily Show with Jon Stewart, as Stewart's final 'Moment of Zen'. On October 16, to celebrate the 35th anniversary of The River, Springsteen announced The Ties That Bind: The River Collection box set. Released on December 4, it contains four CDs (including many previously unreleased songs) and three DVDs (or Blu-ray) along with a 148-page coffee table book. In November 2015, \"American Skin (41 Shots)\" was performed with John Legend at Shining a Light: A Concert for Progress on Race in America.\n\nSpringsteen made his first appearance on Saturday Night Live since 2002 on December 19, 2015, performing \"Meet Me in the City\", \"The Ties That Bind\", and \"Santa Claus Is Coming to Town\".[119] On December 4, 2015, he announced details for the upcoming The River Tour 2016 which would begin the following year. Springsteen also discussed plans for a new solo album however plans were put on hold to tour with the E Street Band in support of The Ties That Bind: The River Collection. Springsteen said \"the project I've been working on is more of a solo project. It wasn't a project I was going to probably take the band out on. So I said, 'Gee, that's going to push the band playing again until a ways in the future. It'll be nice to get some playing in so you don't wind up being two or three years between E Street tours.\"[120]\n\nThe River Tour 2016 began in January 2016 in support of The Ties That Bind: The River Collection box set. All first-leg shows in North America included an in-sequence performance of the entire The River album along with other songs from Springsteen's catalog, and all dates were recorded and made available for purchase.[121] In April 2016, Springsteen was one of the first artists to boycott North Carolina's anti-transgender bathroom bill.[122] More dates were eventually announced expanding the original three-month tour into a seven-month tour with shows in Europe in May 2016 and another North American leg starting in August 2016 and ending the following month. As of July 2016 , The River 2016 Tour has been the highest grossing worldwide tour with 1.1 million tickets sold and over $135 million in box office revenue, according to Billboard Boxscore's mid-year report.\n\nIn July 2016, Springsteen's manager, Jon Landau, discussed Springsteen's upcoming solo album, which is expected for release in 2017, saying \"All I can say is that there is a solo record – and when I say solo record, I'm not talking about an acoustic record. It is, in fact, a very expansive record, a very rich record. It's one of Bruce's very creative efforts. Stay tuned, and we'll see exactly how that shapes up next year.\" Landau also said it was too early to know a release day or plans for a supporting tour.[123]\n\nOn September 23, 2016, Chapter and Verse, a compilation from throughout Springsteen's career dating back to 1966, was released. Five of the album's eighteen tracks had not been previously released; they include Springsteen's earliest recording from 1966, songs from his tenure in early 1970s bands such as the Castiles, Steel Mill and The Bruce Springsteen Band, along with a track from each studio album of his career.[124] On September 27, 2016, Simon & Schuster published his 500-page autobiography, Born to Run. The book rose quickly to the top of the NY Times Best Sellers List.[125] Springsteen announced he would promote his autobiography with a seventeen date book tour from September to December 2016.[126]\n\nSpringsteen receiving the Presidential Medal of Freedom at the White House from President Barack Obama\n\nSpringsteen began the final leg of The River 2016 Tour on August 23, 2016, at MetLife Stadium in New Jersey where he performed for 3 hours and 52 minutes making it at the time the longest show he had ever performed in the United States.[127] The record was broken two nights later at MetLife Stadium when Springsteen performed a 3-hour 59-minute show, later topped by his performance of August 30, 2016, at 4 hours and 1 minute which then stood as his longest show in the United States. That record again was topped on September 7, 2016, at Citizens Bank Park in Philadelphia, Pennsylvania, where Springsteen performed for 4 hours and 4 minutes, which now stands as his longest show in the United States and second-longest ever next to a 2012 show in Helsinki which lasted two minutes longer.[128][129] The tour ended in September 2016; however, dates from January 22, 2017 to February 25, 2017 were added using the same promotional image from The River Tour 2016 although the tour was now renamed the Summer '17 tour.[130] The River 2016 Tour was the top-grossing worldwide tour of 2016; it pulled in $268.3 million globally and was the highest-grossing tour since 2014 for any artist topping Taylor Swift's 2015 tour which grossed $250.1 million.[131]\n\nSpringsteen supported Hillary Clinton's 2016 presidential campaign by performing an acoustic set of \"Thunder Road\", \"Long Walk Home\" and \"Dancing in the Dark\" at a rally in Philadelphia on November 7, 2016. On November 22, 2016, Springsteen was presented—along with twenty other recipients—the Presidential Medal of Freedom award by Barack Obama.[132] The award is the highest honor for a civilian to receive and is \"presented to individuals who have made especially meritorious contributions to the security or national interests of the United States, to world peace, or to cultural or other significant public or private endeavors.\"[133] On January 12, 2017, Springsteen along with Patti Scialfa performed a special 15-song acoustic set for President Barack Obama and Michelle Obama at the White House's East Room two days before the president gave his farewell address to the nation.[134][135]\n\nSpringsteen on Broadway, an eight-week run at the Walter Kerr Theatre on Broadway in New York City in fall 2017, was announced in June 2017[136] and in addition to his music, includes Springsteen reading excerpts from his 2016 autobiography Born to Run and performing other spoken reminiscences written for the show.[137] Originally scheduled to run from October 12 through November 26, the show was extended three times, the last performance on December 15, 2018.[138][139][140]\n\nWith rumors swirling that Springsteen's solo shows on Broadway could continue well past their current June 2018 end date, on January 18, 2018, Nils Lofgren was asked on Twitter if the E Street Band will ever tour with Bruce again. Lofgren responded saying \"I sure hope so\" however Gary Tallent responded saying that it was \"looking unlikely though\" fueling rumors of the end of the E Street Band.[141][142] The following day, Tallent responded to his original comment saying \"just to be clear, I know as much as you. I like Nils' answer better\".[143] On February 2, 2018, Max Weinberg commented on the future of the E Street Band performing with Springsteen saying \"Don't worry, we ain't done yet. The E Street Band will be back out on the road.\" [144]\n\nFor Springsteen's production of Springsteen on Broadway, he was honored with a special award at 2018 Tony Awards.[145]\n\nIn November 2018, Springsteen released the digital download live compilation album, The Live Series: Songs of the Road.\n\nOn December 2, 2018, Springsteen announced that new music was on the way but the E Street Band would not be touring in 2019. He is taking a break after his Broadway run and various recording projects.[146]\n\nOn December 14, 2018, the live album, Springsteen on Broadway, was released and made it into the top 10 record charts in more than 10 countries. In the United States, it reached number 11 on the Billboard 200.[147] The following day on December 15, the performance from the live album was released as a Netflix special which received widespread critical acclaim.[147]\n\nIn January and March 2019 Springsteen released his second and third live series compilation albums The Live Series: Songs of Friendship and The Live Series: Songs of Hope.\n\nOn April 25, 2019 it was confirmed that Springsteen's nineteenth studio album, Western Stars, will be released on June 14, 2019. It will be Springsteen's first album of completely original material in seven years since 2012's Wrecking Ball, and his first solo album since 2005's Devils & Dust. Springsteen said of the album that it's \"a return to my solo recordings featuring character-driven songs and sweeping, cinematic orchestral arrangements\". The album's first single, \"Hello Sunshine\", was released on April 26, 2019. The album's second single, \"There Goes My Miracle\", was released on May 17, 2019. The album's third single, \"Tucson Train\", was released on May 30, 2019 and the fourth single, \"Western Stars\", was released on June 14, 2019. Both singles also had music videos directed by Thom Zimny.[148]\n\nIn a May 5, 2019 interview with Martin Scorsese, Springsteen revealed that he has written almost an album’s worth of material for a new album with the E Street Band, and that there will be a tour. Springsteen said that writer's block caused problems for him in coming up with new music for the E Street Band and even made him doubt if he could create new music. “I couldn’t write anything for the band. And I said, ‘Well, of course … you’ll never be able to do that again!’ And it’s a trick every time you do it, you know? And then about a month or so ago, I wrote almost an album’s worth of material for the band. And it came out of just… I mean, I know where it came from, but at the same time, it just came out of almost nowhere. You go, ‘Fuck, I’m not fucked, all right? There’ll be another tour!\"[149]\n\nOn May 25, 2019, Springsteen was in Rome to support his daughter's equestrian event and was quoted by Italian newspaper la Repubblica saying that an E Street Band album and tour will happen in 2020. \"We will go on tour next year. I will go into the studio to record with the E Street Band, starting in the fall, and when we finish we will go on tour” Springsteen said. He also said he plans to release a documentary on the making of his Western Stars album.[150][151]\n\nMusical style [ edit ]\n\nSpringsteen (second from right) was among the five recipients of the 2009 Kennedy Center Honors\n\nSpringsteen draws on many musical influences from the reservoir of traditional American popular music, folk, blues and country. From the beginning, rock and roll has been a dominant influence and Springsteen's musical and lyrical evocations, as well as public tributes, of artists such as Dylan, Presley, The Animals, Roy Orbison, Gary \"U.S.\" Bonds, and many others helped to rekindle interest in their music. Springsteen's other preferred musical style is American folk, evident on his debut album, Greetings from Asbury Park, New Jersey, and more strongly on Nebraska and The Ghost of Tom Joad. Springsteen songs such as \"This Hard Land\" demonstrate the lyrical and musical influence of Woody Guthrie.\n\nElements of Latin American music, jazz, soul, and funk influences can be heard on Springsteen's second album, The Wild, the Innocent & the E Street Shuffle; the song \"New York City Serenade\" is even reminiscent of the music of George Gershwin. Prominent in these two records is the pianist David Sancious, who left the band shortly into the recording of Springsteen's third album, Born To Run (which also emphasized the piano, played by Roy Bittan).\n\nSubsequently, Springsteen focused more on the rock elements of his music. He initially compressed the sound and developed Darkness on the Edge of Town just as straightforward as concise musical idiom, for the simple riffs, rock guitar solos and clearly recognizable song structures are dominant. His music has been categorized as heartland rock, a style typified by Springsteen, John Fogerty, Tom Petty, Bob Seger, and John Mellencamp. This music has a lyrical reference to the U.S. everyday and the music is kept rather simple and straightforward. This development culminated with Springsteen's hit album Born in the U.S.A., the title song of which has a constantly repeating, fanfare-like keyboard riff and a pounding drum beat. These sounds fit with Springsteen's voice: it cries to the listener the unsentimental story of a disenchanted angry figure. Even songs that can be argued to be album tracks proved to be singles that enjoyed some chart success, such as \"My Hometown\" and \"I'm on Fire\", in which the drum line is formed from subtle hi-hat and rim-clicks-shock (shock at the edge of the snare drum) accompanied by synthesizer and Springsteen's soft guitar line. The album, along with some previous records such as \"Cadillac Ranch\" showed clear rockabilly influences as is evident from his guitar solos, in-fills and vocal styles on these. Another clear influence of early rock n roll on Springsteen's music is evident on the song \"Light of Day\".[citation needed]\n\nIn recent years, Springsteen has changed his music further. There are more folk elements up to the gospel to be heard. His 2005 solo album, Devils and Dust, drew rave reviews not only for Springsteen's complex songwriting, but also for his expressive and sensitive singing.\n\nOn the album We Shall Overcome: The Seeger Sessions Springsteen performed folk classics with a folk band, rather than his usual E Street Band. On his ensuing tour he also interpreted some of his own rock songs in a folk style.\n\nOn his 2012 album, Wrecking Ball, Springsteen incorporated a variety of styles, including folk, gospel, and even hip-hop, with a rap in the song \"Rocky Ground\". His studio work with producer Ron Aniello, Wrecking Ball and High Hopes, has also become more experimental, featuring loops and computerized sounds.\n\nLyrical themes [ edit ]\n\nI spent most of my life as a musician measuring the distance between the American Dream and American reality. —Bruce Springsteen[152][note 2]\n\nSpringsteen has been called a \"rock 'n' roll poet\" who \"radiated working-class authenticity\".[153] Often described as cinematic in their scope, Springsteen's lyrics frequently explore highly personal themes such as individual commitment, dissatisfaction and dismay with life in a context of everyday situations.[154] Springsteen's themes include social and political commentary[155][156] and are rooted in the struggles faced by his own family of origin.[157]\n\nIt has been recognized[by whom?] that there was a shift in Springsteen's lyrical approach starting with the album Darkness on the Edge of Town, in which he focused on the emotional struggles of working class life.[158][159]\n\nPersonal life [ edit ]\n\nSpringsteen was out riding his motorcycle on November 11, 2016 when it broke down and he was stranded alongside the road. A group of men from the Freehold American Legion in New Jersey were returning from a Veterans Day event on their motorcycles when they spotted Springsteen and stopped to help. Springsteen hitched a ride on the back of one of the men's motorcycles to a nearby restaurant where the group grabbed a round of drinks, for which Springsteen picked up the tab, while waiting for his ride.[160]\n\nSpringsteen has spoken about struggles with depression.[161]\n\nWhile rejecting religion in his earlier years, Springsteen stated in his autobiography Born To Run that he has \"a personal relationship with Jesus. I believe in his power to save, love ... but not to damn\". In terms of Catholic faith, he has stated that he \"came to ruefully and bemusedly understand that once you're a Catholic you're always a Catholic\" and \"I don't participate in my religion but I know somewhere ... deep inside ... I'm still on the team.\"[162]\n\nIn an interview in 2017 with Tom Hanks, Springsteen admitted to having been a tax evader early in his career.[163]\n\nRelationships, marriages, and family [ edit ]\n\nSpringsteen dated actress Joyce Hyser for roughly four years in the early 1980s. Previously, he had dated photographer Lynn Goldsmith and model Karen Darvin.[164]\n\nIn the early 1980s, Springsteen met Patti Scialfa at The Stone Pony, a bar in New Jersey where local musicians regularly perform. On that particular evening she was performing alongside one of Springsteen's pals, Bobby Bandiera, with whom she had written \"At Least We Got Shoes\" for Southside Johnny. Springsteen liked her voice and after the performance, introduced himself to her. Soon after that, they started spending time together and became friends.[165]\n\nEarly in 1984, Springsteen asked Scialfa to join the E Street Band for the upcoming Born in the U.S.A. Tour. According to the book Bruce Springsteen on Tour 1969–2005 by Dave Marsh, it looked like Springsteen and Scialfa were on the brink of becoming a couple through the first leg of the tour. But before that could happen, Barry Bell introduced actress/model Julianne Phillips (b.1960) to Springsteen; they were married on May 13, 1985, held shortly after midnight at Our Lady of the Lake Catholic Church in Lake Oswego, a suburb south of Portland, Oregon.[166][167][168] Opposites in background, the two had an 11-year age difference, and his traveling took its toll on their relationship. His next album, Tunnel of Love, was released in the autumn of 1987 and many of its songs described his unhappiness in the relationship with Phillips.\n\nThe Tunnel of Love Express Tour began in late February 1988, and Springsteen convinced Scialfa to join the tour again. She expressed reluctance at first, since she wanted to start recording her first solo album, but after Springsteen told her that the tour would be short, she agreed to postpone her own solo record.[169] Phillips and Springsteen separated in the spring of 1988, but the separation was not made known to the press. Springsteen and Scialfa fell in love with each other during the Tunnel of Love Express Tour and started living together soon after his separation from Phillips. Citing irreconcilable differences, Julianne filed for divorce in Los Angeles on August 30, 1988;[170] a settlement was reached in December and it was finalized on March 1, 1989.[171][172]\n\nSpringsteen received press criticism for the hastiness in which he and Scialfa took up their relationship. In a 1995 interview with The Advocate, Springsteen told Judy Wieder about the negative publicity the couple subsequently received. \"It's a strange society that assumes it has the right to tell people whom they should love and whom they shouldn't. But the truth is, I basically ignored the entire thing as much as I could. I said, 'Well, all I know is, this feels real, and maybe I have got a mess going here in some fashion, but that's life.'\"[52]\n\nThe Springsteen family greets the Obama family on-stage at a rally in Cleveland , Ohio on November 2, 2008.\n\nSpringsteen and Scialfa lived in New Jersey before moving to Los Angeles, where they decided to start a family.[173] On July 25, 1990, Scialfa gave birth to the couple's first child, Evan James Springsteen.[173][174] On June 8, 1991, Springsteen and Scialfa married at their Los Angeles home in a very private ceremony, only attended by family and close friends.[173][174] Their second child, Jessica Rae Springsteen, was born on December 30, 1991;[173][174] and their third child, Samuel Ryan Springsteen, was born on January 5, 1994.[174][175] In a 1995 interview, Springsteen said, \"I went through a divorce, and it was really difficult and painful and I was very frightened about getting married again. So part of me said, 'Hey, what does it matter?' But it does matter. It's very different than just living together. First of all, stepping up publicly—which is what you do: You get your license, you do all the social rituals—is a part of your place in society and in some way part of society's acceptance of you ... Patti and I both found that it did mean something.\"[52]\n\nWhen their children reached school age in the 1990s, Springsteen and Scialfa moved back to New Jersey specifically to raise a family in a non-paparazzi environment. The grounds of his New Jersey home include a large swimming pool. The family owns and lives on a horse farm in Colts Neck and a home in Rumson; they also own homes in Los Angeles and Wellington, Florida.\n\nElder son Evan graduated from Boston College; he writes and performs his own songs and won the 2012 Singer/Songwriter Competition held during the Boston College's Arts Festival.[176] Their daughter Jessica is a nationally ranked champion equestrian,[177] and graduated from Duke University. She made her show-jumping debut with the Team USA in August 2014.[178] Their younger son, Sam, is a firefighter.[179]\n\nPolitical views [ edit ]\n\nSpringsteen supported Barack Obama's 2008 presidential campaign, announcing his endorsement in April 2008.[75] He appeared at several rallies in support of Obama's campaign throughout 2008.[76] At an Ohio rally, Springsteen discussed the importance of \"truth, transparency and integrity in government, the right of every American to have a job, a living wage, to be educated in a decent school, and a life filled with the dignity of work, the promise and the sanctity of home ...\"[180] Following Obama's electoral victory on November 4, Springsteen performed at the Obama Inaugural Celebration on January 18, 2009.[78]\n\nDespite saying he would sit out the 2012 presidential election, Springsteen campaigned for President Barack Obama's re-election in Ohio, Iowa, Virginia, Pittsburgh, and Wisconsin.[93][94][95]\n\nSpringsteen supported Hillary Clinton's 2016 presidential campaign by performing an acoustic set of \"Thunder Road\", \"Long Walk Home\" and \"Dancing in the Dark\" at a rally in Philadelphia on November 7, 2016.[citation needed]\n\nSpringsteen is an activist for LGBT rights and has spoken out many times as a strong supporter of gay marriage. In 2009, he posted the following statement on his website: \"I've long believed in and have always spoken out for the rights of same sex couples and fully agree with Governor Corzine when he writes that 'The marriage-equality issue should be recognized for what it truly is—a civil rights issue that must be approved to assure that every citizen is treated equally under the law.'\"[181] In 2012, he lent his support to an ad campaign for gay marriage called \"The Four 2012\". Springsteen noted in the ad, \"I couldn't agree more with that statement and urge those who support equal treatment for our gay and lesbian brothers and sisters to let their voices be heard now.\"[182] In April 2016, Springsteen cancelled a show in Greensboro, North Carolina days before it was to take place to protest the state's newly passed Public Facilities Privacy & Security Act, also referred to as the \"bathroom law\", which dictates which restrooms transgender people are permitted to use and prevents LGBT citizens from suing over human rights violations in the workplace. Springsteen released an official statement on his website. The Human Rights Campaign (HRC) celebrated Springsteen's statement and he has received much praise and gratitude from the LGBT community. [183]\n\nDuring a 2017 show in Perth, Australia, Springsteen made a statement celebrating the post-inauguration Women's March against the incoming Trump administration in cities worldwide:\n\nWe're a long way from home, and our hearts and spirits are with the hundreds of thousands of women and men that marched yesterday in every city in America, and in Melbourne ... \"[They] rallied against hate and division and in support of tolerance, inclusion, reproductive rights, civil rights, racial justice, LGBTQ rights, the environment, wage equality, gender equality, healthcare, and immigrant rights. We stand with you. We are the new American resistance.\"[184][185][186]\n\nDiscography [ edit ]\n\nConcert tours [ edit ]\n\nSpringsteen has developed a reputation for energetic and long-lasting live performances.[187][188]\n\nHeadlining tours\n\nCo-headlining tours\n\nAchievements, awards, and nominations [ edit ]\n\nSpringsteen has sold more than 135 million records worldwide and more than 64 million records in the United States, making him one of the world's best-selling artists.[189][190]\n\nAcademy Awards [ edit ]\n\nAmerican Music Awards [ edit ]\n\nAudie Awards [ edit ]\n\nYear Nominee / work Award Result 2018 Born to Run Best Autobiography/Memoir\n\nBrit Awards [ edit ]\n\nEmmy Awards [ edit ]\n\nGolden Globe Awards [ edit ]\n\nGrammy Awards [ edit ]\n\nSpringsteen has won 20 Grammy Awards out of 50 nominations.\n\nNote: \"We Are the World\" (which featured Bruce Springsteen as a vocalist) also won Song of the Year, Record of the Year, Best Music Video, Short Form, and Best Pop Performance by a Duo or Group with Vocal in 1986. Song of the Year is credited to the songwriters and not the performer, The song was written by Michael Jackson and Lionel Richie.[193] Record of the Year and Best Pop Performance by a Duo or Group were presented to the producer in 1986, the song was produced by Quincy Jones.[194][195] Best Music Video, Short Form is presented to the director and producer, Tom Trbovich directed the video while Quincy Jones served as producer.[196]\n\nJuno Awards [ edit ]\n\nYear Nominee / work Award Result 1985 Born in the USA International Album of the Year Won 1993 Himself International Entertainer of the Year Nominated\n\nGrammy Hall of Fame [ edit ]\n\nMTV Video Music Awards [ edit ]\n\nTony Awards [ edit ]\n\nYear Nominee / work Award Result 2018 Himself Special Tony Award Won\n\nOther recognition [ edit ]\n\nSee also [ edit ]\n\nNotes [ edit ]\n\n^ \"Blinded by the Light\" would later be a hit for Manfred Mann and reach No. 1, the only time Springsteen had a No. 1 single as a songwriter. ^ This quote is an excerpt from Springsteen's speech from the stage at a rally for presidential candidate Barack Obama on November 2, 2008\n\nReferences [ edit ]\n\nSources", "images": ["http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Kennedy_Center_honorees_2009_WhiteHouse_Photo.jpg/220px-Kennedy_Center_honorees_2009_WhiteHouse_Photo.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/30/Springsteen_playing_in_Sunderland%2C_June_2012.jpg/220px-Springsteen_playing_in_Sunderland%2C_June_2012.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Super_bowl_half_time_show_%283976043491%29_%28cropped1%29.jpg/220px-Super_bowl_half_time_show_%283976043491%29_%28cropped1%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/a8/Bruce_Springsteen_20080815.jpg/220px-Bruce_Springsteen_20080815.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/ae/Bruce_Springsteen_Presidential_Medal_of_Freedom.jpg/220px-Bruce_Springsteen_Presidential_Medal_of_Freedom.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Bundesarchiv_Bild_183-1988-0719-38%2C_Bruce_Springsteen%2C_Konzert_in_der_DDR.jpg/170px-Bundesarchiv_Bild_183-1988-0719-38%2C_Bruce_Springsteen%2C_Konzert_in_der_DDR.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/00/American_Land_ESB_Fireworks_Giants_100309.jpg/220px-American_Land_ESB_Fireworks_Giants_100309.jpg", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/Bruce_Springsteen_1988.jpg/220px-Bruce_Springsteen_1988.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/8a/Bruce_Springsteen_and_the_E_Street_Band_1977.jpg/220px-Bruce_Springsteen_and_the_E_Street_Band_1977.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/a8/Office-book.svg/30px-Office-book.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/20081102_Bruce_Springsteen_at_Barack_Obama_rally_in_Cleveland.JPG/150px-20081102_Bruce_Springsteen_at_Barack_Obama_rally_in_Cleveland.JPG", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/9b/20081102_Bruce_Springsteen_and_Barack_Obama_hug.JPG/150px-20081102_Bruce_Springsteen_and_Barack_Obama_hug.JPG", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/65/Beach_tickets.JPG/220px-Beach_tickets.JPG", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/91/20081102_Bruce_Springsteen_Michelle_and_Barack_Obama.JPG/150px-20081102_Bruce_Springsteen_Michelle_and_Barack_Obama.JPG", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/Bruce_Springsteen_2005.jpg/220px-Bruce_Springsteen_2005.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3b/Bruce_Springsteen_-_Roskilde_Festival_2012.jpg/1200px-Bruce_Springsteen_-_Roskilde_Festival_2012.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/c8/20081102Bruce_Springsteen_and_family_greet_Barack_Obama_and_family.JPG/220px-20081102Bruce_Springsteen_and_family_greet_Barack_Obama_and_family.JPG", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/3b/Bruce_Springsteen_-_Roskilde_Festival_2012.jpg/210px-Bruce_Springsteen_-_Roskilde_Festival_2012.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Bruce_Springsteen_Milan_2006_05_12.jpg/220px-Bruce_Springsteen_Milan_2006_05_12.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/21/RisingTourGiantsStadiumLot.jpg/220px-RisingTourGiantsStadiumLot.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3b/Bruce_Springsteen_-_Roskilde_Festival_2012.jpg/1200px-Bruce_Springsteen_-_Roskilde_Festival_2012.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Bruce_Springsteen", "title": "Bruce Springsteen", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.13", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3b/Bruce_Springsteen_-_Roskilde_Festival_2012.jpg/1200px-Bruce_Springsteen_-_Roskilde_Festival_2012.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}