{"url": "https://abc.go.com/shows/dancing-with-the-stars/cast/lindsay-arnold", "text": "Lindsay is partnered with star DeMarcus Ware.\n\nFollow Lindsay on Instagram\n\nLindsay Arnold won the Mirrorball Trophy in season 25. Prior to Dancing with the Stars, she was a Top 4 finalist and fan favorite on season nine of FOX's So You Think You Can Dance.\n\nBorn and raised in Provo, Utah, Arnold began dancing at the age of 4 when her mom began searching to find a hobby that she enjoyed. After her first ballet and jazz dance classes, she was hooked and has been dancing ever since. By the age of 8, she found herself a ballroom partner and began entering competitions.\n\nWith three younger sisters following in her footsteps and dance dominating the Arnold household, her mom decided to create an environment where all of her daughters could enjoy their passion and train together. She opened The Vibe dance studio in Lindon, Utah, where Arnold trained under head director Rick Robinson and with some of the best teachers in the nation in a variety of mediums, including ballet, jazz, hip-hop, contemporary, Latin and ballroom. Most of her training, however, was with her main ballroom coach and world-renowned ballroom dancer, Shirley Ballas, who is also the mother of Dancing with the Stars veteran Mark Ballas.\n\nArnold's dedication to her craft has earned her countless awards over the years, including first place in the United States Open Youth Latin Championships, first place in the United States Open Junior Latin Championships, top three finalist in the World Junior Latin Team Match, top five finalist at the World Cup Latin Junior Championships and top five finalist at the United States Junior National 10 Dance Championships.\n\nAt the age of 14, Arnold had her first taste of the Hollywood life when Mark Ballas visited her dance studio to put together a routine for her team to perform on Dancing with the Stars. After that, her studio was invited to compete on Paula Abdul's Let's Dance, and as a high school senior, she decided to audition for So You Think You Can Dance. To her surprise and excitement, she made it through the audition process and put her academic scholarship for Utah Valley University on hold to pursue her dream full time.\n\nWhen not dancing, Arnold enjoys all things outdoors and can be found hiking, fishing, boating or skiing. In 2015 and after five years of dating, she married her high school sweetheart, Sam Cusick. The pair currently live in Los Angeles with their Labradoodle, Moose.", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://cdn1.edgedatg.com/aws/assets/cp/web/abc/images/ABC-Default3-1x.png", "https://cdn1.edgedatg.com/aws/v2/abc/DancingWithTheStars/person/1073326/aa698131ad3f984d55b7307329ccb494/1600x640-Q90_aa698131ad3f984d55b7307329ccb494.jpg", "https://cdn1.edgedatg.com/aws/v2/abc/DancingWithTheStars/showimages/b7c8f49a63b0a68ee326180a7e9bcbc8/140x187-Q90_b7c8f49a63b0a68ee326180a7e9bcbc8.jpg"], "top_img": "https://cdn1.edgedatg.com/aws/v2/abc/DancingWithTheStars/person/1073326/aa698131ad3f984d55b7307329ccb494/1600x640-Q90_aa698131ad3f984d55b7307329ccb494.jpg", "keywords": [], "authors": [], "canonical_link": "https://abc.go.com/shows/dancing-with-the-stars/cast/lindsay-arnold", "title": "Dancing with the Stars", "meta_data": {"description": "Get to know Lindsay Arnold from Dancing with the Stars. Read the official ABC bio, show quotes and learn about the role at ABC TV", "keywords": "Dancing with the Stars Lindsay Arnold, Lindsay Arnold bio, Dancing with the Stars cast", "apple-itunes-app": "app-id=364191819, app-argument=http://abc.go.com/watch-live", "google-play-app": "app-id=com.disney.datg.videoplatforms.android.abc", "google-site-verification": "qxz3F4HP0AHtXucYo3rj4unQJ_Uz_-iy_EttfC-zRDU", "msApplication-ID": "App", "msApplication-PackageFamilyName": "ABC.ABCPlayer", "msapplication-TileColor": "#2D2D2D", "msapplication-TileImage": "//cdn1.edgedatg.com/aws/abc/brand/fall2018/favicon_ie10.png", "msvalidate.01": "0EABD001D404EA9DDE2025E9E4F14CAF", "viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0", "fb": {"app_id": 137585909851}, "og": {"app_id": 137585909851, "image": "https://cdn1.edgedatg.com/aws/v2/abc/DancingWithTheStars/person/1073326/aa698131ad3f984d55b7307329ccb494/1600x640-Q90_aa698131ad3f984d55b7307329ccb494.jpg", "description": "Get to know Lindsay Arnold from Dancing with the Stars. Read the official ABC bio, show quotes and learn about the role at ABC TV", "title": "Lindsay Arnold | Dancing with the Stars", "url": "https://abc.go.com/shows/dancing-with-the-stars/cast/lindsay-arnold", "site_name": "ABC"}, "twitter": {"site": "@dancingabc", "card": "summary_large_image", "image": "https://cdn1.edgedatg.com/aws/v2/abc/DancingWithTheStars/person/1073326/aa698131ad3f984d55b7307329ccb494/1600x640-Q90_aa698131ad3f984d55b7307329ccb494.jpg"}}, "movies": [], "publish_date": null, "source": "https://abc.go.com", "summary": ""}