{"url": "https://www.brides.com/story/britney-spears-may-have-gotten-engaged-to-sam-asghari-on-her-birthday", "text": "Britney Spears might be stronger than yesterday, but she certainly doesn't look a day older. The notorious pop singer celebrated her 36th birthday on December 2 while somehow successfully managing to not look a day over 20. (Tell us your secrets...) Spears's boyfriend of over a year, 23-year-old fitness model Sam Asghari, helped ring in her special day and took to Instagram to post a video of Spears stunning in a fitted open-back minidress and black stilettos while she blew out candles and twirled around. But it was her sparkly accessory that seemed to catch everyone's attention. Umm... Is that an engagement ring you're wearing there, Brit?\n\nE! News noticed that Spears had accessorized her all-black and sparkly look with a dazzling ring on her left hand...on THAT finger. Talk about a birthday present for the books. While no news has officially surfaced regarding an actual engagement, Asghari's loving and completely adorable birthday caption for his hotshot girlfriend leads us to think this could be a real possibility.\n\n\"HAPPY BIRTHDAY TO MY ONE AND ONLY,\" he wrote on Spears's birthday social-media post. \"Thank you for being you, thank you for showing me the true meaning of a beautiful woman and a strong mother, and most of all thank you for being mine. I consider myself the luckiest man on this planet.\" As if this weren't already the most jealousy-inducing birthday shoutout to date, he ended his heartfelt gush of emotions with #luckiestmanalive. Which, when you are dating the \"Lucky\" singer, does make you pretty, well, lucky.\n\nLoading View on Instagram\n\nThe power couple met in 2016 on the set of her steamy music video for \"Slumber Party,\" and the two have been hot and heavy ever since. They celebrated their first anniversary just a few weeks ago, but Brit-Brit assured fans this is the real deal in a Halloween Instagram post of the couple using the Snapchat dog filter, captioning it \"So in love with this puppy.\" Puppy love at its finest.\n\nIf we do end up hearing wedding bells, baby, one more time, Asghari would become Spears's third hubby . She first tied the knot in January 2004 to childhood friend Jason Alexander in Las Vegas , and the marriage lasted a whopping 55 hours (even shorter than Kim K. and Kris Humphries! ). She also famously wed former backup dancer Kevin Federline in September 2004. The couple had a slightly \"Toxic\" up-and-down relationship, which ended three years later. Spears shares two sons, Sean Preston, 12, and Jayden James, 11, with K-Fed.\n\nSee more: It's a Celebration! See All the Celebrity Couples Who Got Married in 2017\n\nWith more than a decade since her last marriage, Brit-Brit deserves to settle down with someone who drives her so crazy that she just can't sleep. Oops... We definitely hope she gets married to her hunky beau—and soon! Crossing our fingers that an actual engagement announcement is in the works.", "images": ["https://media.brides.com/photos/580e690d5e9ee8e13146ff1d/1:1/w_767/blogs-aisle-say-britney-spears-weddings-main.jpg", "https://media.brides.com/photos/5d179c696bc0270009e7347e/1:1/w_125/GettyImages-1141025208.jpg", "https://media.brides.com/photos/5d18b872af93af00090be3ec/1:1/w_125/GettyImages-1132380808.jpg", "https://media.brides.com/photos/5d1dfc70c226ce00085a25e4/1:1/w_125/Elle%2520King.jpg", "https://www.brides.com/images/brides-logo.svg", "https://media.brides.com/photos/580e690d5e9ee8e13146ff1d/master/pass/blogs-aisle-say-britney-spears-weddings-main.jpg"], "top_img": "https://media.brides.com/photos/580e690d5e9ee8e13146ff1d/master/pass/blogs-aisle-say-britney-spears-weddings-main.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.brides.com/story/britney-spears-may-have-gotten-engaged-to-sam-asghari-on-her-birthday", "title": "Britney Spears May Have Gotten Engaged on Her Birthday", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=no, width=device-width, initial-scale=1, maximum-scale=1", "description": "Is Britney Spears engaged to Sam Asghari?! The singer sported what appeared to be an engagement ring during her 36th birthday celebration.", "og": {"description": "Wedding bells, baby, one more time!?", "image": "https://media.brides.com/photos/580e690d5e9ee8e13146ff1d/master/pass/blogs-aisle-say-britney-spears-weddings-main.jpg", "title": "Britney Spears May Have Gotten Engaged on Her Birthday", "url": "https://www.brides.com/story/britney-spears-may-have-gotten-engaged-to-sam-asghari-on-her-birthday", "site_name": "brides", "type": "article"}, "twitter": {"description": "Wedding bells, baby, one more time!?", "image": "https://media.brides.com/photos/580e690d5e9ee8e13146ff1d/master/pass/blogs-aisle-say-britney-spears-weddings-main.jpg?mbid=social_retweet", "title": "Britney Spears May Have Gotten Engaged on Her Birthday", "url": "https://www.brides.com/story/britney-spears-may-have-gotten-engaged-to-sam-asghari-on-her-birthday", "card": "summary_large_image", "creator": "@brides", "site": "brides"}, "fb": {"page_id": 50416192591, "admins": "648235154,789168297,688620285"}, "keywords": "Britney Spears,News,Celebrity Weddings", "news_keywords": "News & Advice,News & Celebrity,Britney Spears,News,Celebrity Weddings"}, "movies": [], "publish_date": null, "source": "https://www.brides.com", "summary": ""}