{"url": "https://www.theplayerstribune.com/en-us/articles/lamar-odom-done-in-the-dark", "text": "W\n\nhen I woke up in the hospital room in Nevada, I couldn’t move. I couldn’t talk. I was trapped inside my own body. My throat hurt like hell. I looked down and I had all these tubes coming out of my mouth.\n\nSo I panicked.\n\nI started trying to pull them out, but I couldn’t because my hands were so weak. The nurses came running in to stop me. You ever had a really bad dream, where you’re trying to run away from a monster or some shit, and you just can’t run? Your legs don’t work like they should, and the monster is coming right behind you, and it’s like you’re in slow motion. That’s what it felt like.\n\nI was laying there, looking up at the ceiling, and the doctors kept coming in and standing over me and saying some stuff. Then they’d leave. Then they’d come back. Leave, come back. Leave again, come back again. Or maybe I was just going in and out of sleep.\n\nMy ex-wife was there in the room with me. After all the shit I had done, I was surprised to see her. Honestly, that’s when I knew that I was probably in bad shape.\n\nAt some point, the main doctor came in and told me what had happened. He said, “Mr. Odom, you’ve been in a coma for the last four days. Do you understand?”\n\nI couldn’t talk. So I just nodded.\n\nHe said, “It’s a miracle that you’re here. We didn’t think you were going to make it.”\n\nI was in total shock. Couldn’t say any clever shit back. Couldn’t ask questions. It was the first time in my life that I felt helpless. I felt like I was two inches tall. It was just … it was real.\n\nAt that point in my life, I was doing coke every day. Pretty much every second of free time that I had, I was doing coke. I couldn’t control it.\n\nI didn’t want to control it.\n\nI remember sitting there in bed, and for the first time in my life I couldn’t talk my way out of the situation. I was trapped all day in my own thoughts. And I kept thinking about something that my grandmother used to say to me when I was a kid.\n\nI could see her face, like she was right there in the room.\n\n“What’s done in the dark,” she would say, “will come out in the light.”\n\nI think of all the sneaky shit I tried to get away with. All the times I did wrong. All the stuff I tried to hide. If it’s not in the public light, it’s in God’s light.\n\nI was laying there in that bed, hooked up to all these machines, people all around me crying, and there was no running from it anymore. It was like God was telling me, “Whatever the fuck you think you’re doing, you need to slow down. Or it’s gonna be worse than this.”\n\nOnly one thing worse than this.\n\nNathaniel S. Butler/NBAE/Getty Images\n\nRick James said it best.\n\n“Cocaine is a hell of a drug.”\n\nIt’s a hell of a drug.\n\nIt will make you do things you never thought you’d do. It will turn you into a different person. It will put you in situations where you say to yourself, “How the fuck did I get here?”\n\nWhen I was in that hospital bed, I kept asking myself that question. And I kept thinking about all the people in my life who aren’t here anymore. Mostly, I thought about my mother. My dad wasn’t really around when I was a kid. He had his own problems with addiction. But my mother was my best friend in the world. She was just so caring. My first memory in life is hearing the sound of her voice. She had these really wide eyes and a real soft voice.\n\nIf we were at a family party everybody would ask me, “Lamar, where’s your mother? Where’s Cathy? Where’s Cathy?”\n\nShe was like the center of the universe in Jamaica, Queens.\n\nLinda Cataffo/NY Daily News/Getty Images\n\nI remember when I started playing peewee football, I was already big as hell. I could take care of myself. But I got hit on this one play, and I was just dinged up a little bit. I’m on the ground for six seconds or seven seconds max, and just as I’m about to get up, I hear my mom’s voice. She’s running from the sideline out onto the field. Sprinting, yelling, “Mookah! Mookah! Talk to me, baby!”\n\nThat was her nickname for me.\n\nShe gets to me and I’m like, “Mom, what are you doing? Are you crazy?”\n\nI mean, this is New York City. Everybody’s looking at me like, Yo. Come on, man.\n\nShe says, “Mookah, Mookah, are you O.K.? What hurts?”\n\nI said, “Mom, I’m fine. Get the hell off the field!”\n\nShe’s like, “O.K.! O.K.! I’m going! I just gotta make sure you’re alright.”\n\nThen she went back to the sidelines like it was nothing. That was my mother. She always had my back.\n\nWhen I was 12 years old, she got sick. I knew she had colon cancer, but I didn’t really know how bad it was. She kind of kept it from me to protect me. I just remember that she went into the hospital for a while, and when I went to visit her, it seemed like she was getting … smaller. Like she was disappearing, you know what I mean?\n\nOne day, when my grandmother was driving me home from the hospital, she said, “You know, your mother is probably going to pass away soon. I just want you to be ready.”\n\nThe day that she passed away, I remember going to see her, and I remember how the cancer had just ravaged her body. Like if I could go back to that time, and you could put me in that room, I probably wouldn’t even recognize who she was. Her face was so small and she was bleeding out of her mouth. And she kept saying “Mookah, Mookah….”\n\nI just sat right next to her bed, and one of the last things she said to me … I still think about it every day.\n\nShe said, “Be nice to everybody, Mook.”\n\nI don’t think anything can prepare you for losing your mother at 12 years old. It leaves a mark on you. I don’t care how strong you think you are.\n\nOtto Greule Jr./Getty Images\n\nThe only reason I was able to get through that time was because of my grandmother, and because of basketball. Those two things protected me. On the day my mother died, I went straight to the park to play ball. It was all I wanted to do. It was an escape for me.\n\nI remember the news had started to get around the neighborhood about my mom, and people started showing up at the court. Then more people. After a while, the whole block was out there with me.\n\nI had this feeling, like, It’s gonna be alright. Your grandmother has your back. Your neighborhood has your back. God has your back.\n\nSo go on. Get on with it. Keep going ’til you get your suit and you shake that old man’s hand.\n\nSee, I used to have this vision in my head, from the time I was 10 years old. I could already see David Stern up at the podium calling my name, saying what team I was going to, and me kissing my family. I could already see it.\n\nYou might think that being a kid from New York City, with drugs around all the time, that my problems started a long time ago. Or that they started when I got drafted by Los Angeles. But that wasn’t the case. I never wanted to touch anything stronger than marijuana. I definitely never touched cocaine. I actually looked down on it.\n\nI didn’t try it until I was 24 years old, when I was on summer vacation in Miami. And … I wish I could tell you there was a reason for it. There wasn’t. It was just an asinine decision I made. If I knew that it was going to affect my life the way it did, I would’ve never even thought about it. Never. But I did it. It turned out to be a life-altering decision.\n\nRight around that same time, my grandmother passed away. I lost a lot of family members in a short period of time. When I did coke, I felt good for a minute. I stopped having so much anxiety. I didn’t think about the pain. I didn’t think about death. So I kept doing it more and more, but I was still in control. It wasn’t like an everyday thing.\n\nJeff Gross/Getty Images\n\nThen, about two years later, I got a phone call that changed my life. It was the summer of 2006. I had been out partying all night, and I hadn’t gone home.\n\nMy son Jayden was six months old at the time. He was at home in his crib. I should’ve been at home with him. But I was out, doing whatever.\n\nEarly in the morning, I got a call from his mother. She was panicking. I was like, “Yo, calm down. What’s wrong?”\n\nAnd she said, “Jayden … he won’t wake up.”\n\nI said, “He won’t wake up?”\n\nShe said, “Yeah, the ambulance is here. They’re taking him now.”\n\nI was in Manhattan. I had to drive all the way to Long Island. When I got to the hospital, the doctors just told me that, you know, “He’s not responding.”\n\nThey said, “He’s gone.”\n\nI said, “Gone? What are you talking about? I just seen him. Gone?”\n\nMan, my son was vivacious. Real lively. Whenever I used to walk into a room, he would just like … look at me, and stare. Of course, he couldn’t talk, but he just used to stare. He used to use his eyes a lot — let me know that he kinda understood. Like, Yeah, that’s my dad. What’s up, Dad?\n\nI just seen him. Gone? How the fuck is that even possible? How can he be gone?\n\nI walked into the hospital room … and the hurt on his mother’s face, I’ll never forget that. How she couldn’t believe it.\n\nSix months old. Gone.\n\nHe’d be 11 now.\n\nIcon SMI\n\nI used to think about what he would look like if he was still here. Actually, I still think about it almost every day.\n\nThe doctors told us that the cause was sudden infant death syndrome. It almost sounded made-up. No explanation. No answers. Just … gone. Like that. And you’re supposed to just accept it. You’re supposed to live with that.\n\nI think everything probably picked up at that point, with the drugs. Even subconsciously. You don’t even know why you’re doing it at that point. I think subconsciously, you make yourself an addict because of the trauma that you’re going through.\n\nWith cocaine especially, there’s a high, and then an emotional low. So it’s like a roller coaster. You go high, and then you go low. High, low, high, low. After you do it, you feel shame. You think about all the reasons why you shouldn’t have done it. Then the cycle starts again.\n\nThat’s the thing people don’t understand. Anybody who’s lived a complicated, drug-infused life like I’ve lived knows the cycle — with women, cheating on my wife, shit like that. Nights when I should have been asleep. Nights when I stayed up sniffing coke. Lot of those nights. When your heart is beating fast. When you should know better. When you’re just riding that roller coaster, man.\n\nYou think I wasn’t feeling shame? You think I was blind to what I was doing?\n\nNah, I wasn’t blind to it. Shame … pain. It’s part of the whole cycle. My brain was broken. As the years went on, and I got into my 30s, my career was winding down, and things just got out of control.\n\nWhen I was like 32, 33 … I just wanted to get high all the time. That’s it, just get high. And things got dark as hell.\n\nNoah Graham/NBAE/Getty Images\n\nOne of the darkest places I’ve ever been was when I was in a motel room, getting high with this chick, and my wife (at the time) walked in. That probably was like rock bottom.\n\nFirst of all I was in a motel.\n\nA motel.\n\nI’m a millionaire. I’d made it out of Jamaica, Queens, and won two NBA titles. And I’m in a motel, with some random person, doing coke. But I just wanted to get high with this girl, and I had no other place to go. I couldn’t take her home. You know, I was being a scumbag. Nothing else I got for that. No excuses. No bullshit. That’s just the truth.\n\nMy dick and my habit took me down all the roads that you don’t ever wanna go down. A lot of great men are fools to that. Fools to that. There are probably a lot of young dudes out there who hear my story and think that it could never happen to them. That they’re untouchable.\n\nMan … Nobody is untouchable. Nobody in this life is immune to pain.\n\nYou know, it’s crazy, because my uncle Mike was a correction’s officer at Riker’s Island. He was a tough motherfucker. He was that uncle who used to lift his shirt up when I was in middle school and be like, “You think you’re tough? Go ahead. Give me your best shot. Hard as you can.”\n\nWham. I’d hit him full-force, and it wouldn’t even faze him.\n\nThey used to have a family night for all the guards and C.O.’s at Riker’s like once a month, and he used to take me along with him. I was always so intrigued by the inmates, because they were some geniuses, for real. Uncle Mike would take me to this room where they had all the confiscated weapons that these dudes would make. If you gave these guys a toothpick, they’d find a way to make it into a weapon. They’d take parts from the toilet or an alarm clock and sharpen it into a shank.\n\nI remember having this realization when I was looking at the stuff they used to make: These guys were smart as hell. Some of these dudes could have been engineers. How the hell did they get here?\n\nI told myself that I’d never go to prison. I’d never mess up like that.\n\nBut you know what? Life is a lot harder than you think it’s gonna be.\n\nWhen you’re an addict, nothing can get through to you. I never thought I was going to die. I never thought I’d be in a coma. I didn’t think I had a problem. But then I woke up in a bed with tubes coming out of my mouth — and it was real.\n\nThe doctors told me that right before I woke up from the coma, my kids had come by to see me. And that broke my heart, because I had seen my own mother on her deathbed, with tubes coming out of her mouth.\n\nMy kids are the only things that kept me going. I’ve been a big strong dude my whole life, so anytime my kids see me in a weak point like that is definitely hard for me — even to talk about now.\n\nSteve Granitz/WireImage\n\nMy son Lamar Jr. is 16. He’s shy and loves basketball. Like me reincarnated. Only a more handsome version.\n\nMy daughter, Destiny, is 18. She’s beautiful and smart. And she doesn’t take any shit. When I was able to talk again, she told me straight up, “Dad, you need to get yourself help or I’m not going to talk to you again.”\n\nSo I went to rehab, and in rehab you learn to submit to everything. I’ve always been a really anxious person. I’ve been a worrier my whole life. But I’m learning to release everything. Or at least I’m trying to learn.\n\nMy kids even came to a few therapy sessions with me. And that was especially important, because they got to kind of let loose, telling me how my addiction affected them, too.\n\nAfter one of the sessions, my daughter told me, “This was good, but I don’t ever want you to be in here again.”\n\nI’m sober now. But it’s an everyday struggle. I have an addiction. I’ll always have an addiction. It never goes away. I mean, I want to get high right now. But I know that I can’t if I want to be here for my children.\n\nYou know, it’s crazy … when I was in the hospital, and I couldn’t even walk, all these people came to see me that I hadn’t seen in a minute. All these old teammates came. Kobe came. I got texts from all these guys, like, “Damn dog, the news was saying you were dead. I’m happy you’re still here.”\n\nIt kind of reminded me of who I was, and what I’ve meant to some people.\n\nI shook hands with death. But you know what? Ain’t no coming back from that. Even though my funeral would probably be a good funeral, and there’d probably be a lot of people who hadn’t seen each other in a long time. But it ain’t time for that yet.\n\nWalter Iooss Jr./The Players' Tribune\n\nI still got my kids. I’m still here. And damn, I’m still pretty handsome.\n\nI’ve been through so much that now I just want that little piece in the world … that little piece … where I don’t have to worry.\n\nEvery morning when I wake up, I look at the same pictures.\n\nPictures of people who are gone. My mother. My grandmother. My son Jayden. My best friend Jamie.\n\nPeople who are still here. My two beautiful kids.\n\nI just look at their faces for a few minutes, and it’s like a reminder of what life is supposed to be about. I feel warm. I feel an energy. I feel love. That shit gets me through the day.\n\nIt’s like taking my vitamins.\n\n", "images": ["https://cdn.theplayerstribune.com/uploads/Odom-Drugs-Pull.jpg?width=1000", "https://cdn.theplayerstribune.com/uploads/GettyImages-652261860.jpg?width=1000", "https://storage.googleapis.com/www-theplayerstribune-com/uploads/Lamar-Odom-sig.png", "https://cdn.theplayerstribune.com/static/images/forward.png", "https://storage.googleapis.com/www-theplayerstribune-com/uploads/LAMAR-ODOM.jpg", "https://cdn.theplayerstribune.com/uploads/a95a2ae9-59211020113466_rockets_at_lakers.jpg?width=1440", "https://cdn.theplayerstribune.com/uploads/GettyImages-492662720a.jpg?width=1000", "https://cdn.theplayerstribune.com/static/images/flags/Global.png", "https://cdn.theplayerstribune.com/static/images/tpt-logo-thetribune.svg", "https://cdn.theplayerstribune.com/static/images/flags/US.png", "https://cdn.theplayerstribune.com/static/images/apostrophe_footer.png", "https://cdn.theplayerstribune.com/static/images/check.svg", "https://cdn.theplayerstribune.com/static/images/ic_search_white_24px.svg", "https://cdn.theplayerstribune.com/uploads/GettyImages-6310711.jpg?width=1000", "https://cdn.theplayerstribune.com/uploads/GettyImages-88190249.jpg?width=1000", "https://cdn.theplayerstribune.com/static/images/tpt-logo-players.svg", "https://cdn.theplayerstribune.com/uploads/GettyImages-392771.jpg?width=1000", "https://cdn.theplayerstribune.com/static/images/ic_menu_white_24px.svg", "https://cdn.theplayerstribune.com/uploads/01_PlayersTribune_02871.jpg?width=1000"], "top_img": "https://storage.googleapis.com/www-theplayerstribune-com/uploads/LAMAR-ODOM.jpg", "keywords": [], "authors": ["Lamar Odom"], "canonical_link": "https://www.theplayerstribune.com/en-us/articles/lamar-odom-done-in-the-dark", "title": "Done in the Dark", "meta_data": {"description": "When I woke up in the hospital room in Nevada, I couldn’t move. I couldn’t talk. I was trapped inside my own body.", "og": {"type": "website", "site_name": "The Players' Tribune", "url": "https://www.theplayerstribune.com/en-us/articles/lamar-odom-done-in-the-dark", "title": "Done in the Dark | By Lamar Odom", "description": "When I woke up in the hospital room in Nevada, I couldn’t move. I couldn’t talk. I was trapped inside my own body.", "image": "https://storage.googleapis.com/www-theplayerstribune-com/uploads/LAMAR-ODOM.jpg"}, "twitter": {"site": "@playerstribune", "title": "Done in the Dark | By Lamar Odom", "description": "When I woke up in the hospital room in Nevada, I couldn’t move. I couldn’t talk. I was trapped inside my own body.", "image": "https://storage.googleapis.com/www-theplayerstribune-com/uploads/b4d351c0-mentalhealth-lamar-odom-social-card.jpg", "card": "summary_large_image"}, "qc": {"title": "Done in the Dark"}, "viewport": "width=device-width, initial-scale=1", "theme-color": "#292929"}, "movies": [], "publish_date": null, "source": "https://www.theplayerstribune.com", "summary": ""}