{"url": "www.vanityfair.com/news/2010/12/william-and-kate-201012", "text": "It was the night of the annual Don’t Walk charity fashion show, March 27, 2002, during William’s second semester, when the moment of realization suddenly hit him. As Kate shimmied down the catwalk at the five-star St. Andrews Bay Hotel, William turned to Fergus and whispered, “Wow, Fergus, Kate’s hot!” He had paid £200 for his front-row ticket, and when Kate appeared in black underwear and a see-through dress William barely knew where to look. “Kate was great on the catwalk,” recalled one of the models. “She and everyone, including William, knew it.” At a party after the show William decided to make his move. As the music throbbed and beautiful young things sat sipping homemade cocktails on the winding staircase of the student house, William and Kate were huddled in a quiet corner, deep in conversation. As they clinked their glasses to toast Kate’s success, William leaned in to kiss her. It was Kate who pulled away, momentarily stunned that he had been so bold in a room full of strangers. At the time she was dating Rupert Finch, a fourth-year student, but William didn’t seem to care. “It was clear to us that William was smitten with Kate,” remembered one of their friends who was at the party and witnessed the moment. “He actually told her she was a knockout that night, which caused her to blush. There was definitely chemistry between them, and Kate had really made an impression on William. She played it very cool, and at one point when William seemed to lean in to kiss her, she pulled away. She didn’t want to give off the wrong impression or make it too easy for Will.”\n\nAfter her impressive debut on the catwalk, things would never be quite the same between William and Kate. William had insisted in an interview on his 21st birthday, June 21, 2003, that he was single, but the truth was that he had fallen for his pretty friend. One of William’s conditions for staying at St. Andrews was that he would be allowed to move out of the residence halls after his first year and share an apartment with his friends. So at the start of his second year, September 2002, William moved off campus to 13a Hope Street, in the center of town. It was a luxury no prince before him had enjoyed and exactly the normalcy he craved. There were the necessary security issues to consider: the property was fitted with bulletproof windows, a bombproof front door, and a state-of-the-art laser security system that came with a thick instruction manual. The floor-to-ceiling windows were also protected with reinforced, full-length pine shutters in keeping with the rest of the street. William’s room was the biggest and it looked onto an overgrown private garden and the back of the student-union building, on Market Street. He had decided to move in with Kate, Fergus, and Olivia Bleasdale. They each paid £100 a week in rent for the two-story, top-floor apartment and shared the cleaning. “They did throw dinner parties and took turns to go shopping for groceries,” one of their friends recalled. “William was part of the dinner-party brigade, and being seen in Tesco was all part of it. It was a bit of a meeting place for the great and the good. Fergus would get dressed to the nines and only ever wore different shades of white. William was always with him, so it was not uncommon for girls to stake out Tesco in the hope of seeing the pair of them.” William and Kate were determined to keep their fledgling romance quiet, and behind the closed doors of 13a Hope Street they could. Their bedrooms were on separate landings, but by this stage it was nothing more than pretense. William and Kate had fallen in love and were enjoying a conventional university romance, albeit one involving elaborate cover-ups and decoys. In a bid to keep their relationship below the radar for as long as possible, they would leave the house at different times and arrive at dinner parties separately, and made a pact never to hold hands in public. By the end of their second year the relationship was a close one. When William attended Kate’s belated 21st-birthday party, in June 2003, at her family home in Bucklebury, Berkshire, the glance she threw him across the room when he walked into the 1920s-themed party was more than platonic. But then, at William’s 21st-birthday party at Windsor Castle, later that month, it seemed as though Kate was barely registering with William; he seemed preoccupied with a very pretty girl named Jecca Craig. Out of Africa\n\nWilliam had first met Jecca, daughter of British conservationist Ian Craig and his wife, Jane, in 1998 in Kenya during a school holiday. He had fallen in love with Africa and returned during his gap year to spend several weeks learning about conservation at the Craigs’ 55,000-acre game preserve, situated in the beautiful Lewa Downs, in the foothills of Mount Kenya. William had adored every minute of it and years later would get involved with the Tusk Trust, a conservation charity which finances some of Lewa’s activities and of which William is now a patron. Ian Craig recalled, “William just loves Africa, that’s clear. He did everything from rhino spotting to anti-poaching patrols to checking fences. He’s a great boy.” It was not long before rumors were circulating among their friends that something was going on. William had apparently had a secret crush on Jecca since the first time he met her. She was beautiful, with long blond hair, deep-blue eyes, and legs like a gazelle’s. But when it was reported in British papers that the two had staged a mock engagement ceremony to pledge their love to each other before William returned to England, the prince instructed his aides to deny this had happened. It was a rare move—usually the Palace never comments on the princes’ private lives—but on this occasion William wanted the story refuted. “There’s been a lot of speculation about every single girl I’m with, and it actually does quite irritate me after a while, more so because it’s a complete pain for the girls,” he said. The tale had rattled him and embarrassed Jecca, who at the time was dating Edinburgh University undergraduate Henry Ropner, a former Etonian and a friend of William’s. The denial did little to quash the rumors of a romance, however, and as Kate raised her champagne flute to toast the birthday prince at the aptly themed Out of Africa celebration, it was Jecca who had pride of place next to William at the head table. By the end of the summer, however, the relationship with Kate seemed back on track. It soon became an open secret at St. Andrews, and William and Kate were desperate for some privacy. While Fergus decided to stay on at 13a Hope Street, they chose to move out to Balgove House, on Strathtyrum, a sprawling private estate a quarter of a mile outside the town center, the property of a wealthy landowner, Henry Cheape, a distant cousin of the prince’s and close friend of the royals’. The impressive four-bedroom cottage was far more private than Hope Street. Unmarked police cars patrolled the estate, and William’s protection officers lived in the assorted outbuildings. As with all his residences, the cottage had been made secure for the prince, complete with bombproof doors and windows. William and Kate intended to entertain frequently: he installed a champagne fridge as soon as they moved in, while Kate set about dressing the kitchen windows with pretty red-and-white gingham curtains. As well as the grounds, where they enjoyed long romantic walks, the couple had the privacy of two acres of wild grassland hidden behind a six-foot stone wall. When it was warm enough, they would pack a picnic hamper and spend pleasant afternoons stretched out on a blanket, sharing a bottle of chilled white wine. They were blissful days, made all the more romantic by the fact that the press was unaware of their relationship. But the secret would soon be out. “More than Just Friends …”\n\nAgainst a backdrop of snowcapped Alps, William put his arm around Kate. Wrapped up against the cold mountain air in their pants and ski jackets, they waited in line for a ski lift. As the T-bar arrived, William helped Kate on, and they glided up the steep mountain, ski poles in their hands. The shot of William gazing lovingly at Kate that was published in the Sun newspaper on April 1, 2004, was no April Fools’ joke. The rumors, which had been around for months, were confirmed: William and Kate were definitely more than just friends. “If I fancy a girl and she fancies me back, which is rare, I ask her out. But at the same time I don’t want to put them in an awkward situation, because a lot of people don’t understand what comes with knowing me, for one—and secondly, if they were my girlfriend, the excitement it would probably cause,” William had remarked in that 21st-birthday interview. He was right about the excitement. He had chosen to go to Klosters, Switzerland, where the royal family are photographed every year, and he had made no attempt to disguise his affection for Kate. They were with a group of friends that included former nanny Tiggy Legge-Bourke’s brother Harry, Guy Pelly, and William van Cutsem and his girlfriend, Katie James. The Palace was furious and accused The Sun of breaching the embargo that protected Prince William during his university years. But the paper had decided that this was a scoop just too good to turn down. FINALLY …WILLS GETS A GIRL was the headline. The truth was he had had her for many months. Suddenly the floodgates opened, and the world wanted to know everything about this shy, pretty, and unassuming girl. While some at the Palace have snootily pontificated that Kate was not blueblooded enough for the prince (her parents own Party Pieces, an online party-supply company), she had other qualities that were far more important to William. She was polite to the photographers who now pursued her, and she quickly adopted the royal rule of never speaking out. She also insisted that her family never discuss her relationship with William. As Princess Diana’s former private secretary Patrick Jephson noted, “We know very little about her and probably never will, providing they do their job right. Historically a degree of mystery about royalty has been an advantage; we project onto them what we want.” According to one of her friends at St. Andrews, she remained levelheaded and kept her feet on the ground during the early months of their courtship. “She never got above her station, and even though she had secured the most sought-after boy at St. Andrews, she never gloated. She was actually quite insecure about her looks and never considered herself pretty; she was very sweet and very shy.” Like Diana, Kate quickly had to adapt to being in the spotlight, but her transition into royal life was much smoother—unlike Diana, Kate enjoyed being at Highgrove, Balmoral, and Sandringham, where she would accompany William on shoots during the grouse and pheasant seasons. She had practiced with William on the Strathtyrum estate, where they were allowed to shoot birds for food as part of their rental agreement. Like Charles, who had been given the use of Wood Farm, at Sandringham, while he was at Cambridge, the Queen allowed William to use a cottage called Tam-na-Ghar, at Balmoral, as a getaway. Tucked away in the remote countryside, the 120-year-old cottage, which is surrounded by rolling hills and wild heather as far as the eye can see, underwent a £150,000 renovation, complete with a bathtub big enough for two, before William and Harry were each given a set of keys. After their last class on Friday, William and Kate would speed up to Balmoral from St. Andrews in William’s black Volkswagen Golf, followed by his protection officers. Like William, Kate loved walking across the moors and strolling by the river Dee. In the evenings they would cook a meal, share a bottle of red wine, and keep warm in front of a roaring log fire. Sometimes they were joined by friends from St. Andrews, and often her siblings Pippa and James, whose trophy stag heads line the walls of the Middleton-family house, would be invited for a weekend’s shoot, when they would compete as to who could bag the most birds. “WE KNOW VERY LITTLE ABOUT KATE MIDDLETON AND PROBABLY NEVER WILL, PROVIDING THEY DO THEIR JOB RIGHT. HISTORICALLY A DEGREE OF MYSTERY ABOUT ROYALTY HAS BEEN AN ADVANTAGE.” Trouble in Paradise\n\nIt was the summer of 2004 when William and Kate’s love affair underwent its first serious test. With one year to complete before they graduated, the 22-year-old prince needed some space—he told several of his friends at St. Andrews that he was feeling “claustrophobic.” Until now they had chosen not to discuss what would happen after St. Andrews, but with their finals looming, it was an issue that needed addressing. William decided that a holiday would provide him with some thinking time and planned a boys-only sailing trip to Greece with Guy Pelly and some other friends to take place as soon as they left school for the summer. Kate had had a turbulent relationship with Guy and considered him immature and potentially troublesome. It was Guy who used to buy William porn magazines when they were teenagers, and she had heard all about their drink-fueled weekends at Highgrove. There was also a rumor among their friends that William and Guy, after a night of heavy drinking at Club H, the basement rec room with a bar at Highgrove, had covered one of their girlfriends in chocolate ice cream, which they then licked off, and then there was the occasion when Guy challenged William to a midnight swim at their friend James Tollemache’s 21st-birthday party at Helmingham Hall, in Suffolk. They had both been drinking heavily, but that didn’t stop them from stripping down to their boxer shorts, diving in, and swimming a lap of the murky moat that surrounds the Tollemaches’ country estate, where the Queen is a regular guest. It seemed that wherever there was trouble Guy was not far away, and Kate was wary of him. She was annoyed, if not surprised, when she found out that Guy had arranged for an all-female crew for the yacht. So she packed her bags and headed home to Berkshire to spend the summer with her family.\n\nA number of things had caused her to question William’s commitment, although she had not raised them with him yet. One was William’s friendship with an American heiress named Anna Sloan, whom he had met through mutual friends at Edinburgh University, where Anna was studying. Anna had lost her father, businessman George Sloan, in a tragic shooting accident on the family’s 360-acre estate in Nashville, and she and William had bonded over the loss of their parents. When William accepted an invitation from Anna to accompany her and a group of friends to Tennessee for a holiday before he went to Greece, it hurt Kate deeply. She suspected William might have feelings for the 22-year-old heiress. However, according to her friends, Anna was not romantically interested in William, and the friendship was never anything more than just that. And then there was William’s budding relationship with another stunning heiress, Isabella Anstruther-Gough-Calthorpe. While Kate was girl-next-door pretty, Isabella had cover-girl looks, a title, and a stately pile to boot. That summer William visited the Anstruther-Gough-Calthorpe family home in Chelsea to see her. Isabella, daughter of banking heiress Lady Mary Gaye Curzon, was single at the time. Sadly for William, she had no aspirations to date him and despite his amorous advances declared that she was not interested. Meanwhile, Kate had accepted an invitation to spend a fortnight in France at Fergus Boyd’s family holiday home in the Dordogne with some friends from St. Andrews. Among the group were Kate’s friends Olivia Bleasdale and Ginny Fraser. She had not told them about the trial separation, but from her downcast mood her friends guessed, and one evening she confided to them that she and William were taking a break. “She got quite drunk on white wine and really let her guard down,” recalled one of the group. “She was debating whether or not she should text or call him. She said how sad she was and how much she was missing William, but she never mentioned it after that.” By November they were back at St. Andrews, although they had yet to reconcile their differences. I had reported the news of their separation that summer, and tellingly there was no denial from Clarence House. Privately, William again complained to friends that he was feeling claustrophobic and already thinking ahead to the summer after graduation, when he was planning to return to Kenya to see Jecca Craig, another fly in the ointment as far as Kate was concerned. “The last thing William wants is a high-profile split in the crucial months leading up to his finals,” I was told at the time by a source close to William. On the advice of her mother, Kate gave William some breathing space. It was made all the harder because they were living together, but instead of spending weekends in St. Andrews or traveling to Balmoral, Kate would return home to be with her parents. It was obviously the break that William needed, and by Christmas they were back together again, although Kate had a condition. Word had reached her of William’s visits to Isabella, and Kate insisted that William was not to contact her again. With their finals looming in May, they agreed to take things slowly. Kate had stayed away from Edward van Cutsem’s wedding to the Duke of Westminster’s daughter Lady Tamara Grosvenor that November, but she happily accepted an invitation to Prince Charles’s 56th-birthday party at Highgrove later that month. The following March, Prince Charles invited her to Klosters for his pre-wedding holiday. Charles and Camilla Parker Bowles were to be married on April 9, 2005, and the Prince wanted one last skiing holiday with his sons first. It had really been intended as a boys-only trip, but Kate was not left out. She was photographed taking a gondola up the slopes with Charles and enjoying lunch with the princes and their friends. William was a witness at the civil ceremony, together with Camilla’s son, Tom, and had the added responsibility of looking after the wedding rings. But since she and William were not yet engaged, Kate was not invited to the intimate family wedding itself. Pomp and Circumstance\n\nCamilla was now part of the family, and when William graduated on June 23, 2005, she was there along with Charles, the Duke of Edinburgh, and the Queen. William and Kate had dreaded and looked forward to the day in equal measure. They had enjoyed one last party before their finals and, in keeping with tradition, attended the annual May Ball. Uncharacteristically, Kate drank so much that Fergus Boyd had to carry her out before the night ended. Now, as William and Kate walked into Younger Hall, they exchanged a smile and took their seats. The Queen smiled broadly as William knelt before the chancellor’s wooden pulpit to collect his parchment. Minutes later Kate was called to the stage as Catherine Middleton. When it came to the end of the ceremony, the words of vice-chancellor Dr. Brian Lang must have seemed particularly poignant. “You will have made lifelong friends,” he told the graduates. “You may have met your husband or wife. Our title as the top matchmaking university in Britain signifies so much that is good about St. Andrews so we rely on you to go forth and multiply.” Following graduation, William traveled to New Zealand, where he represented the Queen at events commemorating the 60th anniversary of the end of the Second World War and spent time with the British & Irish Lions rugby team, who were there on tour. Then he visited Jecca in Kenya, but this time he took Kate with him. He wanted her to experience the wild beauty of the country and reassure her that she had no cause to worry about Jecca. William whisked Kate off for a romantic holiday where they stayed at the £1,500-a-night, Masai-owned Il Ngwesi Lodge, in the Mukogodo Hills of central Kenya. During the day William worked on the Craig family’s Lewa Wildlife Conservancy. In the evenings he and Kate would sip cocktails and dine alfresco. The post-graduation holiday had been a blissful fortnight. In the New Year, which William and Kate had seen in together at a cottage on the Sandringham estate, it was William’s turn to prove he could rise to the challenge of Sandhurst, the Royal Military Academy, where Harry was already in his seventh month. Knowing he would not see Kate for more than a month, William had taken Harry’s advice and whisked her off on yet another holiday to Klosters after the New Year celebrations. Just two years earlier the couple’s romance had been revealed on these slopes as William put his arm around Kate in an unthinking show of intimacy. This time, in spite of the cameras, there was no holding back. Standing together in the deep-powder snow, William pulled Kate toward him and kissed her. Apparently, a number of dates have been penciled in the royal calendar in anticipation of an engagement announcement. Such planning might seem a touch premature, but for the royal family this was quite normal. The Palace works months and sometimes years in advance: preparations for the Queen Mother’s funeral started in 1969. “It’s being talked about within the Palace very openly,” a well-placed source insisted to me. “The word is that there might be an announcement in the spring.” Clarence House was quick to deny that any concrete plans were in place. But there was definitely something to the story, which was picked up by royal commentators and newspapers around the world. William had yet to pop the question, but as far as insiders at the Palace and his inner circle were concerned, it was only a matter of time. There was no escaping the fact that in Kate Middleton Prince William had found a potential bride. Kate had arranged a farewell drinks party for William at Clarence House and had been dreading the moment they would have to say good-bye. William would miss her 24th birthday, and she wanted to make sure they could at least celebrate before he left for Sandhurst. The 23-year-old prince arrived in Camberley to begin his army officer training in driving rain on January 8, 2006, accompanied by his father and Jamie Lowther-Pinkerton, William’s private secretary. After being introduced to Major General Ritchie, William signed into Blenheim Company, bade farewell to his father, and was shown to his room overlooking Old College, which would be home for the next 44 weeks. Boot Camp\n\nSandhurst was unlike anything William had ever known. Echoing the message he expressed upon Harry’s arrival, Major General Ritchie told the waiting media that William would be treated exactly the same as every other cadet: “Everyone is judged on merit. There are no exceptions made.” Yet on certain occasions William was afforded special treatment. As the only cadet to be president of the Football Association, he was given leave during his second term to travel to Germany to support England during the World Cup, much to the envy of his fellow cadets. Such privileges were rare, however, and when it came to the training, neither prince was coddled. By spring, with William knee-deep in trench training, it was time for Harry to graduate. He had spent weeks preparing for the parade and, apart from the occasional blip, proved himself a model soldier. Just days before the graduation ceremony, however, Harry was back on the front pages. He and four other cadets had visited Spearmint Rhino, a lap-dancing club in the nearby town of Colnbrook, and while he had not technically broken any rules (cadets are allowed out as long as they do not socialize within three miles of the academy), the details of their drink-fueled night on the town made for rather unsavory reading in the next day’s tabloids. With his girlfriend of two years, Chelsy Davy, on her way from Cape Town, where she was studying at university, to celebrate his graduation, it was embarrassing and very poor timing. Fortunately, April 12 was gloriously sunny, and nothing was going to spoil Harry’s big day. Immaculate in his pressed ceremonial dress, he looked every inch a second lieutenant. The Queen, the Duke of Edinburgh, the Prince of Wales, and Camilla, Duchess of Cornwall, elegant in a dark-purple outfit, were also there to watch Harry graduate, along with William, who saluted his brother as he marched past in front of Old College. As the Queen inspected the 219 officer cadets, she paused in front of her grandson to check that every button was polished and every hair was in place. Of course they were, and Harry could not resist a grin at his grandmother. Harry and his platoon slow-marched into the building as the band, in bearskins and red tunics, trumpeted out “Auld Lang Syne.” Eating his lunch and toasting his friends, Harry could hardly wait until later that night, when he would be reunited with Chelsy. The couple had not seen each other since their New Year holiday. Chelsy did not disappoint Harry when she arrived at the ball. He had excitedly told his friends all about his “knockout” girlfriend, and his fellow officers had seen pictures of Chelsy in the newspapers, but in the flesh she was even prettier. They shared cigarettes and flutes of champagne under the night sky and wandered hand in hand around the gymnasium, which had been transformed into a labyrinth of different rooms and dance floors. Any worries Chelsy may have had about her boyfriend’s night out the week before were now a distant memory. She and Harry were happy, in love, and, most important, together again. But as William downed glass after glass of red wine, Kate Middleton was conspicuous by her absence. Harry had been allowed to bring eight guests to the ball, but this was Harry and Chelsy’s night, and the two girls had always had a slightly frosty relationship. Although Chelsy gets along well with Kate’s sister, Pippa, whom she occasionally goes out with, she and Kate are less friendly. They got off to an inauspicious start when Kate offered to take Chelsy shopping on the King’s Road the last time she was in London. When Chelsy, whose sense of style is very different from Kate’s, snubbed the invitation, Kate was said to be offended. Feeling slightly isolated, William proceeded to drink his fill before retiring to his room alone. At midnight, as tradition dictates, to the backdrop of an impressive fireworks display that spelled out CONGRATULATIONS, Harry finally ripped the velvet strip from the sleeve of his jacket to reveal his officer’s pips. He had proved his critics wrong. He was now a cornet in the Household Cavalry and within weeks would be training with his regiment and preparing for war. Despite hangovers, William and Harry continued celebrating the following night, and this time Kate joined the royal clique at Boujis, a nightclub in Kensington. Kate had ordered a round of the club’s signature Crackbaby cocktails (a potent combination of vodka and fresh passion-fruit juice topped with champagne and served in a test tube), and by three in the morning the group had run up a theoretical £2,500 bar bill—theoretical because, as always, the charge was waived since the manager at Boujis, Jake Parkinson-Smith, insisted on offering the princes what he called “the Royal Comp.” The D.J. played his final tune of the night and it was time to leave, but the fun was set to continue for both the boys. William had an Easter break on Mustique with Kate to look forward to, while Harry was heading off to Mozambique with Chelsy. After which he would begin troop-commander training, and William would return for another eight months at Sandhurst. I’m only 22 for God’s sake. I am too young to marry at my age. I don’t want to get married until I am at least 28 or maybe 30. —Prince William Wills and Kate plus Wait\n\nDespite William’s protestations, speculation that the pair were on the verge of announcing an engagement wouldn’t go away. When Kate had attended the May wedding of Camilla’s daughter Laura Parker Bowles to Harry Lopes, grandson of the late Lord Astor of Hever, in the Wiltshire village of Lacock, the question on everyone’s lips was when she and William would be walking down the aisle. Woolworths had already started manufacturing wedding memorabilia, including William-and-Kate china, ahead of an announcement; the press toyed with the will-they-or-won’t-they question; and the couple kept a chart of newspaper predictions on a royal wedding. While Kate was relatively relaxed about the constant conjectures, William was less comfortable. In November 2006, just before William graduated from Sandhurst, Kate was invited to Sandringham for the royal family’s traditional Christmas lunch, the first time a girlfriend had received such an invitation. (The story, published in The Mail on Sunday, was not denied by Clarence House, which simply said it would not discuss royal guests.) The year before, Kate had joined the royals for their traditional Boxing Day shoot, which had given her the perfect opportunity to use the binoculars that William had given her as a Christmas present. But Kate had previously insisted she would go to Sandringham for Christmas only when she had a ring on her finger. Besides, this Christmas she planned to be with her family at a rented manor house in Perthshire, Scotland. She was, however, happy to attend William’s graduation ceremony at Sandhurst. As she took her place in the front row on December 15, 2006, Kate Middleton looked every inch the princess-in-waiting. Accompanied by her parents, Michael and Carole, she had been given a V.I.P. seat at the graduation ceremony. When William found Kate in the crowd, he smiled. Over the past months, although they had seen little of each other, she had been a great support. The official inquest into his mother’s death had been published that week, concluding that the crash in Paris nine years before had been a tragic accident, and relief as well as pride seemed etched on William’s face. As the brass band broke into a cheerful rendition of Abba’s “Dancing Queen,” Kate smiled. The very fact that she and her parents, whom William had grown fond of, were at one of the most important occasions of his life spoke volumes. Bookies William Hill slashed their odds on a royal engagement from 5–1 to 2–1 and eventually stopped taking bets altogether. Kate’s position in “the Firm” seemed in no doubt.\n\nNow that it was clear that this was not just a university romance, aides at the Palace suddenly started paying attention to the middle-class girl who had so captured the prince’s imagination. Mindful of the mistakes that had been made with Diana, it was unanimously agreed that Kate should be introduced to royal life as quickly as possible. At William’s request, it was decided that Kate should be advised on how to cope with the intense media interest in her. He was determined that she should suffer none of the loneliness or isolation his mother had felt in the early days of her courtship with his father. Kate was given the support of the Prince of Wales’s press team and, when she was with William, her own protection officer. At a polo match she was spotted with a two-way radio in case she required backup. She received advice on how to handle the photographers who followed her about, which included watching footage of the late Princess of Wales to see how she had coped with the paparazzi. According to friends, Kate found it all fascinating if “a little creepy.” Even without a ring on her finger, Kate had become one of the world’s most photographed women, and she was surprisingly confident. Always impeccably dressed, she was advised never to talk to the press, but to politely smile at photographers, whom she handled with aplomb. She had recently taken a day job at the head office of the High Street store Jigsaw, where she was working as an accessories buyer, and she was looking forward to spending time with William over Christmas. William had promised Kate he would join the Middletons to celebrate Hogmanay, the Scottish New Year, at a country estate called Jordanstone House, and Kate was eagerly awaiting his arrival. The 18th-century property, on the outskirts of Alyth, was set in snowy countryside. A Christmas tree twinkled in the grand drawing room, and with fires burning in every room, the setting could not have been more romantic. But at the last minute William had a change of heart and decided to stay with his own family instead. According to a source close to the family, he informed a tearful Kate during a late-night conversation on Boxing Day. For William it was no big deal, but for Kate the cancellation was a sign of something more sinister to come. She had good reason to be concerned. William had been having second thoughts and sat down with his father and his grandmother to have a frank discussion about his future with Kate. Both advised him not to hurry into anything. Kate turned 25 on January 9, 2007. The day before, William had joined the Blues and Royals regiment of the Household Cavalry at Combermere Barracks, in Windsor, where he would be stationed until March. They had had a joint celebration at Highgrove before he reported for duty, but Kate was still reeling over the snub in Scotland. In the newspapers, however, the engagement rumor was gathering momentum once more. Kate’s birthday was preceded by an article written for The Spectator by Diana’s former private secretary Patrick Jephson in which he claimed that Kate was on her way to becoming a royal bride. Under the headline THE NEXT PEOPLE’S PRINCESS, the article was highly speculative, but there was no doubting the thrust—William was set to make Kate his wife, and her 25th birthday looked like a likely date for an announcement. The story snowballed, and by the morning of Kate’s birthday dozens of photographers were camped outside her house waiting for the “pre-engagement picture.” The rumors could not have been further from the truth—William had no plans to propose. Instead, he phoned Kate from the Combermere Barracks to apologize. William was furious that Kate’s birthday had been spoiled, and in an unprecedented statement he complained that she was being harassed and said he wanted “more than anything” for her to be left alone. For the first time Kate felt overwhelmed and desperately isolated. Usually she smiled brightly for the photographers, but now as she made her way to work in central London she looked as though she was about to crack under the pressure. Those close to the couple began to speak of doubts about their relationship. The Palace’s plans for a spring wedding were shredded as quickly as they had been drawn up, and the talk now, among their friends at least, was that an engagement was certainly not in the cards. William had started a two-and-a-half-month tank commander’s course at Bovington, and although the couple took a skiing trip to Zermatt with friends in March, he and Kate were spending less time together. He had warned her that his schedule was packed and he would have little time to visit her. She was upset when William came to London and went clubbing instead of seeing her. On one occasion he spent the night at Boujis flirting with another girl. William was with a group of friends when Tess Shepherd walked into the club. The petite blonde knew some of William’s circle, and before long she and William were on the dance floor, arms entwined. As March drew to a close, William and Kate’s relationship became increasingly strained. As if the embarrassing night at Boujis were not enough, William further humiliated Kate when he was photographed with his arm around Ana Ferreira, an 18-year-old Brazilian student, at a nightclub in Bourne-mouth, not far from Bovington. From the picture it looked as though William had his hand on her breast. He had spent much of the night dancing on a podium with a local named Lisa Agar, and this time there were pictures to prove it. It was the final straw for Kate, and she delivered an ultimatum: Either she had his full commitment or they were over. When they attended the Cheltenham races at the end of March, their body language spoke volumes. Walking several steps ahead of Kate, William, his head cast down and his hands dug in his pockets, was deep in thought. Kate’s ultimatum backfired, and William told her that they should have a break. Over the Easter weekend they agreed to separate for the second time. Separation Anxiety\n\nWhile Kate mourned the end of their relationship at home with her family, William celebrated his “freedom” in London at Mahiki, the faux-Polynesian beach bar in Mayfair. Many in Kate’s position might have moped, but she was in no mood to indulge in prolonged self-pity, nor was she going to get depressed about the spiteful comments from some that she was too middle-class to be dating a prince. Instead, she put on a brave face and a thigh-skimming minidress and partied. Her message to William was clear: “Look what you’re missing!” In the past, some of William’s friends had been lukewarm to Kate. They greeted her arrival at Boujis with stage whispers of “Doors to manual,” a reference to her mother’s career as a flight attendant and hitherto the source of much mirth, but now they rallied round. Guy Pelly, once viewed by Kate with suspicion but now a close friend, assured her that she was welcome at his club. Guy recognized that Kate was good for William. He knew the prince well and advised her to give him some space. From someone best known as the jester of the royal court, it was wise counsel. Once again Kate bided her time and immersed herself in a project. Her close friend Alicia Fox-Pitt had signed up for the Sisterhood, a group of 21 girls who planned to row from Dover to Cap Gris Nez, near Calais, in a dragon boat to raise money for charity. It proved to be exactly what Kate needed. “Kate was very down, and I think the training became her therapy,” Emma Sayle, who was in charge of the team and became close to Kate, recalled. “Kate had always put William first, and she said that this was her chance to do something for herself. We trained on the river in Chiswick, and Kate started off paddling with the others, but I decided to put her on the helm because she was an excellent boatman and really well coordinated.” Unknown to anyone outside their inner circle, William and Kate were already heading for a reconciliation, according to Emma. They were in regular phone contact and clearly missing one another. According to Emma: “She was in touch with William the whole time, and by the end of her training she was back together with him and said she had to pull out of the race. William wanted her to go through with it, however, and planned to meet her on the finish line, but the whole thing was becoming a media circus.” The problem was once again that Kate had become the story. The Daily Mail’s royal commentator Richard Kay noted, “Clarence House had watched on with growing unease as the Sisterhood’s practice sessions had become a magnet for the paparazzi.” Kate pulled out of the race in August, but by then she and William had been secretly dating again for a couple of months. William had invited Kate to a fancy-dress party at his barracks in Bovington, and it had been clear to everyone there that they were back together. William, in hot pants, a “wife beater” undershirt, and a policeman’s helmet, had followed Kate around “like a lost puppy” all night. Kate, who looked stunning and toned from her training, was dressed in a revealing naughty nurse’s outfit. The theme for the night was Freakin’ Naughty, and blow-up dolls were hanging from the ceilings, while provocatively dressed waitresses handed out potent cocktails. Outside, guests played on a bouncy castle and jumped into a kiddie pool full of slime, but William and Kate stuck to the dance floor. “They couldn’t keep their hands off each other,” recalled a guest. “William didn’t care that people were looking. At about midnight he started kissing her. His friends were joking that they should get a room, and it wasn’t long before William took Kate back to his quarters.” On June 24, 2007, I revealed on the front page of The Mail on Sunday that William and Kate were together again, having been given the nod by a senior Palace aide that the relationship was back on track. By coincidence I had spent that weekend with Guy Pelly and William’s close friend Tom Inskip at the Beaufort Polo Club. William and Kate had been due to attend but instead were holed up at Highgrove alone. They were back together, and this time it was for good. Flying So High\n\nThe news that William had decided that he wanted to join the R.A.F. and become a search-and-rescue-pilot was made official on September 15, 2008, and Clarence House’s announcement took everyone, including the Palace, by surprise. William had spent the summer with the Royal Navy. He had been barred from going to the Gulf because of security fears but had enjoyed his mission aboard H.M.S. Iron Duke and within days of his arrival had played a key role in seizing £40 million of cocaine in the Caribbean Sea northeast of Barbados. It had been widely assumed that when he returned he would quit the Household Cavalry and become a full-time working royal, but the young prince had other ideas, which he announced in a statement: “The time I spent with the RAF earlier this year made me realize how much I love flying. Joining search and rescue is a perfect opportunity for me to serve in the Forces operationally.” The British press drew its own conclusions and labeled William a “reluctant figurehead.” Joining the R.A.F. meant William could postpone official duties for at least five years. Clarence House was keen to stress that the prince would continue with his charity work, but his commitment would be to his military career. The decision would have serious repercussions for his relationship with Kate. According to her friends, she was as stunned as anyone when William announced that he planned to join the R.A.F. Being an army girlfriend had not been quite what Kate had expected, but then, with the future king, nothing ever was. For William it was the start of an exciting new career; for Kate it would mean a very long wait indeed. The last time William had decided to put his career first, the couple split up. William told her if they survived this they could survive anything.\n\nWith their careers literally taking off, there were concerns at the Palace that William and Harry should not be seen as just royal members of the military. The princes were already regularly appearing in the Court Circular, the official record of the royal family’s public activities, and in January 2009 the Queen allowed them to set up their own household in Colour Court, within the St. James’s Palace compound. With so many charitable commitments and so little time, the boys agreed that they would be more effective if they combined forces. In September 2009 they set up the Foundation of Prince William and Prince Harry. Charles had created the Prince’s Trust with his £7,500 severance pay from the Royal Navy, and William and Harry wanted to establish their own charitable forum. Between them they are presidents or patrons of more than 20 charities, and the foundation, which is the culmination of their charitable work so far, will become a grant-giving body in years to come. William said that he and Harry derived inspiration from both their parents, who had “instilled in us, from the word go, that with these great privileges goes an absolute responsibility to give back.”\n\nBy July 2009, William was well into his 18 months of training with the R.A.F., and there was simply no time to even think about a wedding. Besides, he had used up all his holiday that year skiing with Kate’s parents in the French Alps and seeing the New Year in with Kate at his father’s Scottish holiday home, Birkhall. It was the first time the pair had been invited to stay with Charles and Camilla in residence, and Kate had felt very much at home. According to one aide, she had laughed “until she had tears in her eyes” when Camilla told her how much she hated the heavy, moth-eaten tartan curtains that Charles refused to change because they were his grandmother’s favorite. She had joined William and Charles shooting, and at the end of the day the four of them enjoyed family dinners. William was based at R.A.F. Shawbury, and although they managed to see each other most weekends, their time together was fleeting. It was a difficult period for Kate, who was dividing her time between her apartment in London and her parents’ Berkshire home, where she still slept in her old bedroom.", "images": ["https://media.vanityfair.com/photos/5d0b97d8b1f2b4f2c00cf7fe/1:1/w_350%2Ch_350%2Cc_limit/prince-william-and-harry-separate-ways.jpg", "http://www.vanityfair.com/verso/static/vanity-fair/assets/logo-header.b6748104d0d362745b508aebea5a86c913809200.svg", "https://media.vanityfair.com/photos/5d28eddf2c2137000877b8af/1:1/w_350%2Ch_350%2Cc_limit/stranger-things-ratings.jpg", "https://media.vanityfair.com/photos/5d249d7f1c225a00086f4161/1:1/w_350%2Ch_350%2Cc_limit/Prince-William-and-Kate-Middleton-Calendar.jpg", "http://www.vanityfair.com/verso/static/vanity-fair/assets/logo-reverse.6ef96ab8686439a35176e2ff8b2c4487e92fbaae.svg", "https://media.vanityfair.com/photos/5d1b81948d44360009846577/1:1/w_350%2Ch_350%2Cc_limit/prince-william-princess-diana-vigil.jpg", "https://media.vanityfair.com/photos/5d28ee9b9d463f0008d45c5d/1:1/w_350%2Ch_350%2Cc_limit/dan-coats.jpg", "https://media.vanityfair.com/photos/54cbf68cba5e6f1344ad4d72/16:9/w_1280%2Cc_limit/image.jpg", "https://media.vanityfair.com/photos/5d28c8783fbe8300093569ac/1:1/w_350%2Ch_350%2Cc_limit/varsity-blues-quibi.jpg", "https://media.vanityfair.com/photos/54cbf68cba5e6f1344ad4d72/16:9/w_1280,c_limit/image.jpg", "https://media.vanityfair.com/photos/5d138f4c8077280008dc709e/1:1/w_350%2Ch_350%2Cc_limit/prince-william-kids-lgbt.jpg", "https://media.vanityfair.com/photos/5d28d952540eab0008caff77/1:1/w_350%2Ch_350%2Cc_limit/big-little-lies-andrea-arnold.jpg"], "top_img": "https://media.vanityfair.com/photos/54cbf68cba5e6f1344ad4d72/16:9/w_1280,c_limit/image.jpg", "keywords": [], "authors": ["Condé Nast", "Josh Duboff", "Erin Vanderhoof", "Katie Nichol", "Kevin Fitzpatrick", "Alison Durkee"], "canonical_link": "https://www.vanityfair.com/news/2010/12/william-and-kate-201012", "title": "Wills and the Real Girl", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Condé Nast", "copyright": "Copyright (c) Condé Nast 2019", "description": "Royal expert Katie Nicholl surveys the breakups, the other women, and the growing bond between a future King and a country girl.", "keywords": "Royals,magazine,archive,kate middleton,prince william,society,royal watch,royals", "robots": "index, follow", "og": {"description": "Royal expert Katie Nicholl surveys the breakups, the other women, and the growing bond between a future King and a country girl.", "image": "https://media.vanityfair.com/photos/54cbf68cba5e6f1344ad4d72/16:9/w_1280,c_limit/image.jpg", "site_name": "Vanity Fair", "title": "Wills and the Real Girl", "type": "article", "url": "https://www.vanityfair.com/news/2010/12/william-and-kate-201012"}, "twitter": {"card": "summary_large_image", "description": "Royal expert Katie Nicholl surveys the breakups, the other women, and the growing bond between a future King and a country girl.", "domain": "https://www.vanityfair.com", "image": {"src": "https://media.vanityfair.com/photos/54cbf68cba5e6f1344ad4d72/16:9/w_1280,c_limit/image.jpg?mbid=social_retweet"}, "site": "@VanityFair", "title": "Wills and the Real Girl"}, "fb": {"app_id": 305927716147259, "pages": 8810407571}}, "movies": [], "publish_date": null, "source": "http://www.vanityfair.com", "summary": ""}