{"url": "http://www.arabnews.com/node/1104606/art-culture", "text": "Ancient Pharaonic harp strums along to new tune\n\nPORT SAID: When Mohamed Ghaly’s workshop was reduced to rubble in February, he could never imagine that a new cultural center dedicated to an instrument with Pharaonic roots would thrive just months later.\n\nThe semsemia, similar to a harp and made of beechwood with steel strings, is believed to have ancient Egyptian roots. It appears on ornate engravings on tombs.\n\nGhaly, a carpenter by trade, is one of the last craftsmen in Egypt keeping the cultural heritage of the instrument alive.\n\n“It’s an enchanting instrument that summons you in a way, and I answered its call,” he told AFP.\n\nIn the last century, the triangular lyre-lookalike with a round bottom has become associated with the coastal towns dotted around the Suez Canal, especially Port Said.\n\nIt was brought over by Nubian workers who dug the Suez Canal through the Sinai Peninsula. This year marks 150 years since the canal was officially inaugurated.\n\nThe semsemia is normally played in a dhamma (gathering) with a tabla (an Arabic drum) and a riq (tambourine) accompanying as the musicians sing.\n\nGhaly, 52, convened a final dhamma flanked by bulldozers as his workshop in the city’s famous fish markets was demolished to make way for a new shopping mall.\n\nMostly men of all ages played and sang through the night dancing on the rubble.\n\nHe had implored the authorities to save his workshop, where musicians jammed and he had chipped away at making semsemias for over a decade, but to no avail.\n\nWeeks later, however, Ghaly secured a new venue for El Toratheyah — a folk arts association he founded in 2005 dedicated to the instrument.\n\nCanal 20, his new incarnation, is a cultural museum standing just a stone’s throw away from Port Said’s majestic harbor.\n\nIts mission is to teach the woodshop craft and pass on the semsemia’s musical heritage to a new generation.\n\nFirefighter Ibrahim Awad, 35, a semsemia fan from an early age, was there on the emotional night when Ghaly had to close up shop.\n\n“What I love is there isn’t a band with a leader but a palpable spirit you can feel...it’s really interactive,” he told AFP.\n\nWhen British, French and Israeli troops launched an attack in 1956 after then president Gamal Abdel Nasser had nationalized the canal, Egyptians wrote nationalistic songs inspired by their defense of the canal.\n\nThe semsemia became a musical weapon of national resistance.\n\nPort Said, a cosmopolitan trading hub on the Mediterranean that once boasted sizeable communities of French, Greeks, Jews and Italians, was destroyed during the Suez crisis.\n\nIn 1967 when Israel occupied the Sinai, Ghaly’s family was among thousands of residents displaced to other parts of Egypt.\n\nBut he never forgot his Port Saidi roots.\n\n“I used to hear it on the radio and that made me fall in love with it. Here I was a Port Saidi away from my home — so that left a mark on me,” he said.\n\nHe started tinkering around with making his own semsemias in the 1980s.\n\nAfter a musician asked Ghaly to make him one, he enjoyed the challenge of putting his carpentry skills to good use and has professionally been crafting them since 2003.\n\n“When I am crafting it, I’m either in a really good mood or a bad one. When I’m really upset, I actually make the best semsemias. I live through the craft,” he said.\n\nIman Haddo, 20, is part of the young crowd that gathers at Canal 20, where Ghaly displays old photographs of semsemia legends.\n\nShe instantly fell in love with the semsemia when she was a teenager after attending a local concert with her father.\n\n“I heard the semsemia for the first time about seven years ago. It was very strange for me, I’d never seen it before and you never see it around really,” she said.\n\n“I also questioned why it was only boys playing and asked where are the girls,” Haddo said.\n\nSemsemia players are mostly older men.\n\nStrumming the semsemia’s strings came naturally to her, and a year ago, Haddo started the Arab world’s first all-female semsemia choir called Amwag (waves).\n\n“In our local folk culture, girls would dance and perform to the tune of the semsemia but they weren’t ever expected to play so I thought why not start a girls’ band,” she said.\n\nThey practice three times a week at Canal 20 and have been invited to play at music festivals.\n\n“We want to show music lovers that the semsemia isn’t just for men, that women can play it well and be successful at it,” she said.\n\n“We also want to save our heritage.”", "images": ["http://www.arabnews.com/sites/default/files/styles/n_360_212/public/2017/05/08/907761-1804490872.jpg?itok=cPamaMj0", "http://www.arabnews.com/sites/default/files/styles/n_670_395/public/2017/05/25/917756-509347835.jpg?itok=yKBFACKo", "http://www.arabnews.com/sites/default/files/styles/n_100_59/public/main-image/2019/07/13/1664661-1537771065.jpg?itok=0v7MQsBL", "http://www.arabnews.com/sites/default/files/styles/n_100_59/public/main-image/2019/07/09/1659586-523597044.jpg?itok=rNZLrpBT", "http://www.arabnews.com/sites/default/files/styles/n_100_59/public/main-image/2019/07/13/1664701-702026794.jpg?itok=zWf0puij", "http://www.arabnews.com/sites/default/files/styles/n_100_59/public/main-image/2019/07/12/1662871-341826522.jpg?itok=7QpUCoz4", "http://www.arabnews.com/sites/default/files/styles/n_100_59/public/main-image/2019/07/11/1661031-1792860149.jpg?itok=sZra3D7K", "http://www.arabnews.com/sites/default/files/styles/n_360_212/public/main-image/2019/06/23/1635221-782185524.jpg?itok=RZpkYzb_", "https://collector.effectivemeasure.net/noscript", "http://www.arabnews.com/sites/default/files/styles/n_670_395/public/main-image/2019/07/12/1663356-41514537.jpg?itok=nLx-JS5T", "http://www.arabnews.com/sites/default/files/styles/n_360_212/public/main-image/2019/07/05/1652821-662158189.jpg?itok=jo8zi79m", "http://www.arabnews.com/sites/default/files/styles/n_100_59/public/main-image/2019/07/13/1664731-315417312.jpg?itok=YCa-P-tc", "http://mena-gmtdmp.mookie1.com/t/v2/learn?tagid=V2_605775&src.rand=[timestamp]", "http://www.arabnews.com/sites/all/themes/narabnews/assets/img/logo.png?xxx", "http://www.arabnews.com/sites/default/files/styles/n_100_59/public/main-image/2019/07/13/1664691-492786625.jpg?itok=MDPl4l44", "http://www.arabnews.com/sites/default/files/styles/n_100_59/public/main-image/2019/07/13/1664681-1485419596.jpg?itok=vvNDXtLW", "http://www.arabnews.com/sites/default/files/2017/05/25/917756-509347835.jpg"], "top_img": "http://www.arabnews.com/sites/default/files/2017/05/25/917756-509347835.jpg", "keywords": [], "authors": [], "canonical_link": "http://www.arabnews.com/node/1104606/art-culture", "title": "‘I’d never make it in Bollywood,’ Brad Pitt tells Shah Rukh Khan", "meta_data": {"description": "MUMBAI: Brad Pitt told Indian actor Shah Rukh Khan that he doesn’t have the moves to star in Bollywood films as he promoted his new movie “War Machine” in Mumbai on Wednesday. “I wouldn’t make it Bollywood because I can’t dance or sing,” said the American actor during an event with Khan in front of journalists in India’s financial capital. Bollywood Hindi language movies are", "abstract": "Get the latest breaking news and headlines from the largest Arab News website. Get world news, sport news, business news, entertainment, lifestyle, video and photos.", "keywords": "Jubail,Al-Ahsa,Al-Kharj,Taif,Qatif,oil,Dammam,Abha,Asir,Yanbu,islam,jobs,sports,Khalij times,gulf news,saudi gazette,Riyadh,Tabuk,Mecca,Medina,AlMadinah,Jeddah,Makkah,Hail,Mecca,Makkah,Eastern,King Abdullah, jobs in Saudi,work in saudi arabia, umrah,Hajj،عرب نيوز", "rights": "Arab News", "fb": {"app_id": 10250877124}, "og": {"site_name": "Arab News", "type": "article", "title": "‘I’d never make it in Bollywood,’ Brad Pitt tells Shah Rukh Khan", "url": "http://www.arabnews.com/node/1104606/art-culture", "description": "MUMBAI: Brad Pitt told Indian actor Shah Rukh Khan that he doesn’t have the moves to star in Bollywood films as he promoted his new movie “War Machine” in Mumbai on Wednesday. “I wouldn’t make it Bollywood because I can’t dance or sing,” said the American actor during an event with Khan in front of journalists in India’s financial capital. Bollywood Hindi language movies are renowned for elaborate dance sequences and high-energy songs and Khan responded by telling Pitt he could easily learn.", "updated_time": "2017-05-25T10:27:41+03:00", "image": {"identifier": "http://www.arabnews.com/sites/default/files/2017/05/25/917756-509347835.jpg", "url": "http://www.arabnews.com/sites/default/files/2017/05/25/917756-509347835.jpg"}}, "twitter": {"card": "summary_large_image", "site": {"identifier": "@Arab_News", "id": 69172612}, "creator": {"identifier": "@Arab_News", "id": 69172612}, "title": "‘I’d never make it in Bollywood,’ Brad Pitt tells Shah Rukh Khan", "url": "http://www.arabnews.com/node/1104606/art-culture", "description": "MUMBAI: Brad Pitt told Indian actor Shah Rukh Khan that he doesn’t have the moves to star in Bollywood films as he promoted his new movie “War Machine” in Mumbai on Wednesday. “I wouldn’t make it", "image": "http://www.arabnews.com/sites/default/files/2017/05/25/917756-509347835.jpg"}, "article": {"published_time": "2017-05-25T10:24:19+03:00", "modified_time": "2017-05-25T10:27:41+03:00"}, "viewport": "width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": 1495697059.0, "source": "http://www.arabnews.com", "summary": ""}