{"url": "https://en.wikipedia.org/wiki/Descendants_3", "text": "Descendants 3 is an upcoming American musical television film. It will be the third installment in the Descendants series, following Descendants and Descendants 2. The film is written by Sara Parriott and Josann McGibbon, and is directed by Kenny Ortega. The film is set to premiere on Disney Channel on August 2, 2019.[1]\n\nCast\n\nProduction\n\nDescendants 3 is written and produced by Sara Parriott and Josann McGibbon, and is directed and executive produced by Kenny Ortega.[2] Wendy Japhet is a producer on the film,[3] with Ortega, Sara Parriott, Josann McGibbon, and Japhet also serving as executive producers.[4] Mark Hofeling and Kara Saun return as production designer and costume designer on the sequel, respectively.[3] In addition to playing Dr. Facilier, Jamal Sims also serves as the film's choreographer,[6][8] along with Ortega who has served as choreographer for all three Descendants films.[2]\n\nRehearsals and pre-recording on the film began on April 23, 2018, in Vancouver, British Columbia, Canada.[3] Production began on May 25, 2018.[10] On July 18, 2018, it was reported on social media that production on the film had \"officially wrapped\".[11]\n\nIt has been reported that this will be the last film in the Descendants film series.[12]\n\nRelease\n\nSome promotional footage for the film was released on the Disney Descendants YouTube channel in February 2018 as a teaser or first look into the production.[13] In late May 2019, it was announced that the film will premiere on August 2, 2019.[1][2][14]\n\nA related short film, Under the Sea: A Descendants Short Story, which features Mal and Uma facing off in \"an epic underwater showdown\", was released on September 28, 2018.[15][16]\n\nOn July 11, 2019, Disney announced it was canceling a red carpet premiere originally planned for July 22, 2019, in the wake of Cameron Boyce's death. The film's television premiere will go on as scheduled, dedicated to Boyce's memory.[17]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/en/b/bd/Descendants_3%2C_poster.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1"], "top_img": "https://upload.wikimedia.org/wikipedia/en/b/bd/Descendants_3%2C_poster.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Descendants_3", "title": "Descendants 3", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.13", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/b/bd/Descendants_3%2C_poster.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}