{"url": "www.wattpad.com/92882628-nicki-minaj%27s-daughter-again", "text": "KAMIYAHS P.O.V Hello I'm Kamiyah Onika Maraj and I'm 12 years old. I know your wondering why I'm named after Nicki Minaj, but it's only because my parents love her and so do I. I've been in foster care all my life. this is all I know. my foster mother Livi is the best. we have a relationship that's unbreakable. My foster sister Sage is my best friend. Then there's my foster dad Jamal smh I hate him with a passion. He's the kind of guy with two personalities and I seen both of them everytime Sage and Livi aren't home. He fools every one else but not me. Anyways back to me I love the color gold and as I told you before Sage is my best friend. Nicki Minaj is my idol! I adore her so much. I've lost my virginity on my 10th birthday to Jamal. I live in New Jersey, I go to Private school for arts. I guess you can say my family is sorta rich.. we have everything we could possibly want. Livi works for a fashion Line and Jamal has business all over the world selling cars. I'm laying in bed when my alarm goes off, but I don't move. I hate my school sometimes. I get bullied because I'm a foster kid. the kids always tease me talking bout my mother was a crackhead and my dad died etc.. it hurts because I don't know who they really are. \" KAMIYAH GET UP AND GET IN THE SHOWER SO I CAN DROP YOU OFF!\" Livi yelled We go through this every morning because I just don't like school or the people in it. \"IM NOT GOING!!!\" as I turned over and closed my eyes. I heard footsteps and the Livi came in a snatched my blankets off. \"If you don't get up I'll tickle you until you pee yourself\" she said in her serious tone \"You wouldn't\" facing her now. Next thing I know she got on me and tickled me. \" MOM STOPPPPPPP LOLLLLLL OKAYYYY ILL GET UP LMBOOOOO\n\nLET ME GOOOOOO HAHAHAHAHAH\" Out of breathe she let me go and I raced to the bathroom starting my daily routine. NICKIS P.O.V Hey guys it's Nicki of course. y'all know me already so no need to go into detail.. there's only one thing you don't know about me. I have a daughter ad her name is Kamiyah.. I gave her up for adoption because my career just started and I didn't need her in the way. You can say I'm selfish yes at the time I was but know I really want her back but I can't find her. I made a mistake and wish I didn't make the decision I did. I'm on the plane with my crew on our way to New Jersey to surprise the school I went to as a little girl. it's going to be fun seeing all the children scream and ask for pictures. I love children I just wished I kept my child. Drake is Kamiyahs father, but he doesn't know because we got a divorce a couple months before because he thought I was cheating smh. I'm not a cheater.. I respect myself way to much to have a lil side Nigga. anyways we've landed and were on our way to the hotel. KAMIYAHS P.O.V School sucks fr. did I mention I have a boyfriend.. his name is Drew and he has been my best friend since 1st grade. I shouldn't have a boyfriend I'm only in the 8th grade. 12 years old and in the 8th grade. I'm really smart for my he so they let me skip a grade. \" Hey beautiful\" Drew said walking up to me. \"Hey how was 1st period?\" I said curious because there's this girl who hates me in his 1st period class and she loves her some drew \"You know same ole\" he said looking down. I instantly got suspicious like he usually tells me with out looking down. \"What did you do??\" I was getting angry \" She gave me a note and when I went to get my work she kissed me\" he said I slammed my locker and headed to the new gym because we're having a surprise guest. I looked for my friends Taniesha and Nyla and went to where they were sitting. \" Welcome everyone to our surprise assembly.. I hope everyone knows who this young lady is. She use to be a student year not many years ago. Let's give her a Panther welcome!! Welcome to the stage Nicki Minaj!!!\" My principal screamed into the microphone Wait a minute did he say Nicki Minaj?! My idol, the one I love so much?? I can't believe she's here. She walked on the stage and everyone got up and screamed some even cried. I just sat there like yeah Nicki Minaj great.. I was trying to play it cool. see the trick is when you meet someone famous you have to play cool that's the only way to get notice trust me. my mom Livi works for a couple famous people. She started talking and answering questions and she sung a verse of pills and potions!!!! My friends looking at me like I'm crazy because they know I'm in love with her. As she was picking someone so she could ask a question her eyes landed on me. I mean I am sitting down while everyone else is standing, but we made eye contact and it felt weird like I actually knew her or something. I shook it off and looked away. I looked back and she was telling my principal something and they looked at me. Searching for something to do I looked at my teacher and mouthed \"May I use the restroom?\" She said sure and I scurried out of the gym.", "images": ["https://d.wattpad.com/story_parts/92882628/images/13b5ffff209718fc.jpg", "https://a.wattpad.com/cover/29864675-288-k291731.jpg", "http://a.wattpad.com/favicon.ico", "https://a.wattpad.com/cover/29864675-64-k291731.jpg", "https://a.wattpad.com/useravatar/iamkyra_.256.698107.jpg", "https://a.wattpad.com/useravatar/iamkyra_.32.698107.jpg", "http://a.wattpad.com/img/icons/create-story.svg?v=ed1a145"], "top_img": "http://a.wattpad.com/favicon.ico", "keywords": [], "authors": [], "canonical_link": "https://www.wattpad.com/92882628-nicki-minaj%27s-daughter-again", "title": "Nicki Minaj's Daughter", "meta_data": {"description": "Read Again. from the story Nicki Minaj's Daughter by iamkyra_ (Author) with 148,551 reads. onika, adopted, maraj. KAMIYAHS P.O.V Hello I'm Kamiyah Onika Maraj...", "keywords": "adopted,barbs,beyonce,blue,daughter,fan,fiction,ivy,jayz,maraj,minaj,nicki,nickiminaj,onika,solange,wattys2017,Fanfiction,eBooks,reading,stories,fiction", "google-site-verification": "aPYlOI_DCGtIUPOJtNewq9TuUX_iJ5gGPTmYSETtVbY", "fb": {"pages": 127093020051}}, "movies": [], "publish_date": null, "source": "http://www.wattpad.com", "summary": ""}