{"url": "http://www.newslocker.com/en-us/profession/tvfilm_news/move-over-zac-efron-ansel-elgort-is-ready-to-be-hollywoods-next-heartthrob/", "text": "Your new reality TV addiction? A show about artisanal glass-blowing It’s niche, it’s pretentious and it’s full of cliches. But Netflix’s Blown Away is so hilariously absurd that simply everyone has to see itMasterChef is old hat. The Apprentice has been rendered unpalatable thanks to its tendency to validate genuine monsters. Quite frankly, you have room for a new knockout reality television show in your life. So let me introduce you to Blown Away, the Great British Bake Off of artisanal glass-blowing tournaments. Related: Jeremy Kyle and Read more\n\nFairytale rise: Disney climbs to new high of Hollywood dominance After a string of megabucks acquisitions, one in three tickets sold in the US are for Disney films. Can rival studios fight back?The US box office may be faltering so far this year – nearly 10% down on its record-setting results in 2018 – but one success story stands out: films released by the Walt Disney Studio, through its cinema release arm Buena Vista, have earned more than $2bn (£1.6bn) in 2019, a 35% market share. In effect, more than a third of all cinema tickets bought Read more\n\nWe've been expecting you: Christoph Waltz returning as Blofeld for Bond 25 007’s nemesis from Spectre has been spotted at Pinewood Studios in London, where the latest James Bond movie is being shotThe much-rumoured return of Christoph Waltz’s Blofeld to the James Bond series appears to have been confirmed after the actor was spotted at the studio where the latest film is being shot.A visitor to Pinewood Studios tipped off the Daily Mail’s entertainment reporter Baz Bamigboye to the sighting, reporting that Waltz urged them not to spread news of his in Read more\n\nWhat Seinfeld can teach us about science From micro pigs to the doping dangers of a poppy seed bagel, life may be imitating the US sitcomWhen Jerry Seinfeld starts his UK tour, listen out for a science joke. From early on in his TV career, the comedian poked fun at science. In his 1981 HBO debut, he said of weather forecasts: “And then my favourite part, the satellite photo. This is really helpful. A photograph of the Earth from 10,000 miles away. Can you tell if you should take a sweater or not from that shot?”His eponymou Read more\n\nTonight’s TV: camp and very silly goings-on in the Cotswolds Amateur detective Agatha Raisin is back, hot on the heels of a sinister hairdresser. Plus, a paean to the genius of rock’n’roller Buddy Holly. Here’s what to watch this eveningAshley Jensen reprises her role as a PR hotshot-turned-amateur detective for three two-part tales based on MC Beaton’s novels. This first concerns a devious hairdresser, the Wizard of Evesham, whose grip over the women of the Cotswolds may be more sinister than it first seems. Campy, kitsch, silly a Read more\n\nNewly found Stanley Kubrick script ideas focus on marital strife Exclusive: three 1950s works date from time film-maker was having troubles with then wifeHe is revered as a master film-maker and visual stylist, but made only 13 feature films. Now ideas for three previously unknown screenplays worked on by Stanley Kubrick have come to light – with marriage, jealousy and adultery the recurring themes.They date from between 1954 and 1956, when he was having marital problems with his second wife, Ruth Sobotka, an actor and dancer. Continue reading... Read more", "images": ["http://www.newslocker.com/images/flags/it.png", "http://www.newslocker.com/images/flags/mx.png", "http://www.newslocker.com/images/flags/ec.png", "http://www.newslocker.com/images/rss.png", "http://www.newslocker.com/images/flags/nl.png", "http://www.newslocker.com/images/flags/be.png", "http://static.addtoany.com/buttons/share_save_120_16.gif", "http://www.newslocker.com/images/flags/ng.png", "http://www.newslocker.com/images/share-linkedin.png", "http://www.newslocker.com/images/share-google-plus.png", "http://www.newslocker.com/images/flags/bo.png", "http://www.newslocker.com/images/flags/pe.png", "http://www.newslocker.com/images/flags/ve.png", "http://www.newslocker.com/images/flags/do.png", "http://www.newslocker.com/images/share-facebook.png", "http://www.newslocker.com/images/share-twitter.png", "http://www.newslocker.com/images/flags/fr.png", "http://www.newslocker.com/images/flags/pt.png", "http://www.newslocker.com/images/newslocker-cube.png", "http://akns-images.eonline.com/eol_images/Entire_Site/2017529/rs_600x600-170629141504-600-ansel-elgort-collage.jpg?downsize=450:*&crop=450:350;left,top", "http://www.newslocker.com/images/flags/co.png", "http://www.newslocker.com/images/flags/de.png", "http://www.newslocker.com/images/logo.jpg", "http://www.newslocker.com/images/flags/gb.png", "http://www.newslocker.com/images/flags/br.png", "http://www.newslocker.com/images/flags/ar.png", "http://www.newslocker.com/images/flags/cl.png", "http://www.newslocker.com/images/flags/es.png", "http://www.newslocker.com/images/flags/ca.png", "http://www.newslocker.com/images/flags/us.png", "http://www.newslocker.com/images/flags/au.png", "http://www.newslocker.com/images/flags/in.png", "http://www.newslocker.com/images/flags/cr.png"], "top_img": "http://akns-images.eonline.com/eol_images/Entire_Site/2017529/rs_600x600-170629141504-600-ansel-elgort-collage.jpg?downsize=450:*&crop=450:350;left,top", "keywords": [], "authors": [], "canonical_link": "http://www.newslocker.com/en-us/profession/tvfilm_news/move-over-zac-efron-ansel-elgort-is-ready-to-be-hollywoods-next-heartthrob/", "title": "Move Over, Zac Efron! Ansel Elgort Is Ready to Be Hollywood's Next Heartthrob", "meta_data": {"description": "Efron. Tatum. Hemsworth. Hemsworth. Pratt. Pine. Any other famous Chris' we might have missed. The list of actors in Young Hollywood who can truly be described as heartthrobs on-and-off-screen...", "og": {"title": "Move Over, Zac Efron! Ansel Elgort Is Ready to Be Hollywood's Next Heartthrob - Cinema, Theater & TV news - NewsLocker", "description": "Efron. Tatum. Hemsworth. Hemsworth. Pratt. Pine. Any other famous Chris' we might have missed. The list of actors in Young Hollywood who can truly be described as heartthrobs on-and-off-screen...", "type": "website", "url": "http://www.newslocker.com/en-us/profession/tvfilm_news/move-over-zac-efron-ansel-elgort-is-ready-to-be-hollywoods-next-heartthrob/", "image": "http://akns-images.eonline.com/eol_images/Entire_Site/2017529/rs_600x600-170629141504-600-ansel-elgort-collage.jpg?downsize=450:*&crop=450:350;left,top", "site_name": "Newslocker"}, "fb": {"admins": "1335791813,560345808"}, "tradetracker-site-verification": "5d3490426a1947bbfe3c56de4fa490c0ba416113", "google-site-verification": "wAInSoPxz3OEgOXCHtETx-x7ukmlX40FRoiPZpO7ww4", "msvalidate.01": "2F0DB39856FAA0E47C70E9E1FF8653AA"}, "movies": [], "publish_date": 1498831200.0, "source": "http://www.newslocker.com", "summary": ""}