{"url": "https://www.thestate.com/latest-news/article190676444.html", "text": "Shep Rose, who grew up on Hilton Head Island, stars in Bravo’s “RelationShep.” Bravo TV\n\nIt’s easy to forget that “RelationShep” is a Bravo reality show and not an entertaining parody of one.\n\nAnd maybe this has been the point all along.\n\nMaybe this show isn’t meant to be like the others, which is why the first episode came off as “boring” to some fans.\n\nThink about it.\n\nUnlimited Digital Access: Only $0.99 For Your First Month Get full access to The State content across all your devices. SAVE NOW\n\nYou take a seemingly derivative show premise (cough, “The Bachelor”) and customize it according to the idea that “this charming goof of a man-child (who needs a haircut) is popular, his star continues to rise at this network, we know there’s something even more Hollywood-y we could do with him and this, uhhh, is what we came up with.”\n\nThen you film the filming of that goof — a guy who is wholly unprepared for this and clearly trying with all his might to hold onto his integrity and own sense of authenticity — and you document his life as he navigates through pre-fabbed relationships and camera-driven interactions specifically designed to heighten whatever lust, tension and jealousy have been mustered.\n\nI might be overthinking it, but last night, after Shep Rose realized that “dating five women who live together” actually means “dating five women who live together,” he became Jim Halpert from “The Office,” Valerie Cherish from “The Comeback” and Chris Traeger from “Parks and Recreation” all at once.\n\nHe was awkward, proud, exhausted, wry, self-aware, committed, professional, clueless, open-minded, inept, sincere, shy, human, smarter than the rest of the room, emotionally dopey, ego-driven, self-deprecating, frightened, sexed up, gentlemanly and always appearing as though his actions were subconsciously timing themselves to the cadence of his inside voice whispering “What are you doing, Shep? What are you doing, Shep?”\n\nAt any given moment last night, it seemed like he was about bolt off-camera and start banging at the sky to find his way out of this alternate universe where he is surrounded by women telling him it’s time to get serious.\n\nI’m just saying this is how it seems. I have no insight into the situation. I’m merely reporting what I see on the screen, which is a man who really didn’t appear to understand that women who live together and who date the same guy at the very same time will absolutely kiss and tell and make things difficult for him.\n\nMeaning, if you send a freaking dumb meme to one of them, Shepard Rose, you better meme them all or be absolutely prepared to ask the question “What’s wrong?” all night in rounds of five.\n\nSpeaking of, now that we’re in the “competition” phase of the show, let’s look at the winners from last night’s episode.\n\nThis is easy because there are only three:\n\n— Sarah the Producer, because she cliff-hung us all at the end there (By the way, if Shep’s anti-dolphin rhetoric was foreshadowing that this sixth mystery-surprise woman is Landon ... deep breath ... let’s not think this way just yet. Positive vibes, everyone)\n\n— Roger the Trolley Driver for keeping it real about his alleged lack of history knowledge\n\n— Austen, because how cute was he last night? This guy went from “who and why?” on “Southern Charm” last season to “Thank God! It’s Austen. PLEASE DON’T GO ANYWHERE! These women are starting to catch on!” in “RelationShep.”\n\nLosers, in this order, are:\n\n— Arden: If she were an item of clothing, she would be the extra pair of Hanes Her Way your mom wants you to keep in your purse “just in case.”\n\n— Kylie: This is Bravo, not TLC. Also, you skipped college graduation for this, which fine, we all make compromises for our careers. KEEP THAT TO YOURSELF, THOUGH, KYLIE. There is no way to look at that fact about you and not be like “She skipped graduation to compete for the love of a reality star 15 years her senior? What is this girl up to?” Oh wait. Is this maybe some sort of pre-run audition for her own show in the future? Like a “Tex in the City” or a “Yee-Hawt”?\n\n— Peyton: Yes to that flamingo-float-standing contest. And a big no no no to showing Austen a brand of lady-craze best kept under the hood. There is a rule, Peyton: You can’t pretend to be the cool girl and then go into a verbal version of Carrie Mathison’s living room wall terrorist chart to explain Shep’s uneven distribution of DMs. YAHCANT. Or at least you shouldn’t ... not if you want to be on the winners list with Roger, anyway.\n\nHere are some other thoughts on the third episode of “RelationShep” on Monday night:\n\n▪ That beach house mansion on Kiawah Island is extra. I hope no one poops on the elevator.\n\n▪ Cameran! OK. Mixed feelings on this one. First, she was wearing the romper she bought at It’s Retail Therapy in Beaufort last spring so that was cool. Second, I always welcome scenes in which she orders the entire menu. But what the heck was that at the beach house mansion? People on Twitter were super excited that she asked Kylie about having vegetarian-related gas and that she told Peyton she looks like a Nordic alien. But Cameran was harsh and kind of ... I don’t know, racist? I don’t even know the word for it. Like calm down, Cam, Priscila is from Brazil, not the future. You don’t need to keep talking about her heritage like it’s the only fact to know about her. And you certainly don’t need to say things like “I asked about your butt” because “all Brazilians” have nice ones. When she asked Priscila if she wears a thong (as alllllllll Brazilians do in Cameran’s world, apparently), I wish Priscila had responded “Just for your dad.” Oh and Shep too! He totally called Priscila fiery again which ... she’s a person, you maniacs, and this is real life, not “International Night” in your boarding school cafeteria. I’m surprised Cameran and Shep weren’t like “Ah, yes. Brazil. I know it well. For instance, the capital is Brasilia, the girl ... she was from Ipanema ... and I’ve been to your steakhouse.”\n\n▪ I wonder if Kylie, Peyton, Bella, Arden and Priscila watched last night’s episode, saw Shep’s energetic response to the food he and Cameran ate at Hominy Grill, listened to him moan in abject pleasure at the mere sight of his gooey dessert, witnessed him talk kind of dirty to it, and thought to themselves, “If you love it so much, why don’t you marry it?”\n\n▪ Quote of the night: “I’m going to hopefully make them feel at ease.” — Shep about the weird situation awaiting him on Kiawah\n\n▪ Moment that “feeling at ease” became difficult: “I come bearing gifts.” — Shep yawn-holding a basket full of towels and flip-flops for the women\n\n▪ Moment that “feeling at ease” became not possible ever: “I don’t know the sizes.” — Shep yawn-referring to the group present in a way that indicated he neither bought these things himself nor cared enough to get specific with it\n\n▪ Peyton stress-ate in every shot she was in. Every shot. And, straight-up, her drunk-eating that cheeseburger needs to be its own show. I have a feeling she’s going to be the first girl out because of her “sassyness” (OK, Grandsheppy) but I don’t want her to go. Without her it’s just four girls who might be a paperdoll chain of the same person.\n\n▪ Kylie sucks for two reasons: One, I don’t like people who insult other people’s grapefruit. And, two, she plays dirty and it’s gross. She was like “Here’s my recipe for Shepard’s Pie: Take two aging eggs. Crack. Crack. Scramble. Bye, Priscila.”\n\n▪ Cameran Part Two: She said Shep’s number is terrifying. Now I need to know it. Also, I can’t believe he’s still keeping track. That’s kind of quaint. It’s got to be like 200, right? 700? 4? I can’t even guess ... 368?\n\n▪ Re: Arden’s Say Yes to Everything Plan ... she probably should have said no to a couple of things, though, right? Like “Can I pull off referring to myself in the third person?” and “Should I remain asleep on this date with Shep?” and “Do I leave the stick in?”\n\n▪ If you want to know what “Shut up, Kylie” sounds like in Silence, rewind to the part where Priscila asks who’s kissed Shep so far.\n\n▪ Shep: I never lie. Bella: Cool. I don’t want to kiss on camera. Shep: Not a problem. Let’s go outside. Bella: No cameras? Shep: Your virtue is safe. Kisses her on camera ...\n\n▪ Every time Shep puts Sarah the Producer in a headlock, “Hungry Eyes” starts autoplaying on my phone ... does anyone know how to fix this?\n\n▪ If you want to know what “Shut up, Bella” sounds like in Silence, rewind to the part where she comes home from her dinner date and spills tea on her makeout session.\n\n▪ Peyton acting like a skittish freak at the beach > Arden’s reaction to getting nicked by Craig’s broken beer bottle shards? Or Arden’s reaction to getting nicked by Craig’s broken beer bottle shards > Peyton acting like a skittish freak at the beach? I can’t decide. But I will say this ... they both produced the same amount of secondhand embarrassment for me.\n\n▪ Austen’s facial expression after Peyton gave him the rundown on how girls like to believe they’re the only ones getting sent a meme was A. The same one he got when he found out he’s not actually Clean Shep despite what his mirror has told him; B. The way he’d look if the question “Have you ever written a fan letter to Carrot Top?” came up during a game of Never Have I Ever; or C. Very effing appropriate.\n\n▪ When Shep “pulled an Arden” by saying “Yes!” to a Speedo appearance, part of me wondered whether he was doing it in the hopes that at least one of the women would tap out and thereby relieve him of the painful task of rejecting her later. Not that he looks terrible in a Speedo. He just looks like his body is saying “You have all the information now.”\n\n▪ Favorite moment of the evening: Peyton mocking Kylie.\n\n▪ Second favorite moment: Priscila mocking Peyton.\n\n▪ Least favorite moment: Sarah the Producer’s ominous news that an unchosen woman has invited herself to the beach house mansion. Please be Whitney in a wig. Please be Whitney in a wig. Please be Whitney in a wig.\n\nFor a recap of the first episode of “RelationShep,” click here. For the second episode, click here.\n\nNeed to catch up on the fourth season of “Southern Charm”? Click here for recaps.", "images": ["https://googleads.g.doubleclick.net/pagead/viewthroughconversion/968074018/?value=0&guid=ON&script=0", "https://www.thestate.com/news/business/2vte4w/picture232607892/alternates/LANDSCAPE_480/Out%20of%20business%20sign", "https://www.thestate.com/latest-news/fivz8m/picture229504334/alternates/LANDSCAPE_1140/usclib8.JPG", "https://ece-logger.nandomedia.com/analysis-logger/Logger?rt=1&ctxId=7051&contextPath=7049-7051&pubId=19&cat=&meta=read-story&objId=190676444&type=article&title=%E2%80%98RelationShep%E2%80%99+recap%3A+Shep+Rose+finds+out+what+happens+when+5+women+kiss+and+tell&url=https%3A%2F%2Fwww.thestate.com%2Flatest-news%2Farticle190676444.html", "https://www.thestate.com/wps/build/images/thestate/logo.svg", "https://www.thestate.com/latest-news/el4841/picture230039239/alternates/LANDSCAPE_480/BIDENSC_TG0802A", "https://www.thestate.com/wps/build/images/thestate/apple-touch-icon-57-precomposed.png", "https://www.charlotteobserver.com/living/health-family/moms/2xelce/picture100311142/alternates/LANDSCAPE_480/ThinkstockPhotos-488869109", "https://www.thestate.com/latest-news/9smuav/picture232610382/alternates/LANDSCAPE_480/IMG_6177.jpg", "https://www.islandpacket.com/opinion/opn-columns-blogs/liz-farrell/4ciak5/picture190676439/alternates/LANDSCAPE_1140/pensiveshep", "https://www.thestate.com/opinion/letters-to-the-editor/uld5c1/picture232596532/alternates/LANDSCAPE_480/Caslen", "https://www.thestate.com/news/business/rfwwcd/picture232609502/alternates/LANDSCAPE_480/Chicken%20sandwich"], "top_img": "https://www.islandpacket.com/opinion/opn-columns-blogs/liz-farrell/4ciak5/picture190676439/alternates/LANDSCAPE_1140/pensiveshep", "keywords": [], "authors": [], "canonical_link": "https://www.thestate.com/latest-news/article190676444.html", "title": "'RelationShep' recap: When Shep Rose kisses, the women tell", "meta_data": {"msapplication-TileColor": "#FFFFFF", "msapplication-TileImage": "/wps/build/images/thestate/windowsmetro-144.png", "twitter": {"card": "summary_large_image", "site": "thestate", "title": "‘RelationShep’ recap: Shep Rose finds out what happens when 5 women kiss and tell", "description": "On the third episode of Bravo’s “RelationShep,” which aired Monday, December 18, 2017, Shep Rose goes on his first dates with the five women he’s brought back to Charleston, South Carolina, from Los Angeles, California, New York City, New York, Austen and Dallas, Texas. Things get a little dicey for the Hilton Head Island, South Carolina, native and “Southern Charm” star when the women start to compare notes on the attention he’s given them individually.", "image": "https://www.islandpacket.com/opinion/opn-columns-blogs/liz-farrell/4ciak5/picture190676439/alternates/LANDSCAPE_1140/pensiveshep"}, "og": {"site_name": "thestate", "type": "article", "title": "‘RelationShep’ recap: Shep Rose finds out what happens when 5 women kiss and tell", "url": "https://www.thestate.com/latest-news/article190676444.html", "description": "On the third episode of Bravo’s “RelationShep,” which aired Monday, December 18, 2017, Shep Rose goes on his first dates with the five women he’s brought back to Charleston, South Carolina, from Los Angeles, California, New York City, New York, Austen and Dallas, Texas. Things get a little dicey for the Hilton Head Island, South Carolina, native and “Southern Charm” star when the women start to compare notes on the attention he’s given them individually.", "image": "https://www.islandpacket.com/opinion/opn-columns-blogs/liz-farrell/4ciak5/picture190676439/alternates/LANDSCAPE_1140/pensiveshep"}, "fb": {"app_id": 425312314246836, "pages": 151506891554685}, "title": "'RelationShep' recap: When Shep Rose kisses, the women tell  | The State", "allow-comments": "true", "description": "On the third episode of Bravo’s “RelationShep,” which aired Monday, December 18, 2017, Shep Rose goes on his first dates with the five women he’s brought back to Charleston, South Carolina, from Los Angeles, California, New York City, New York, Austen and Dallas, Texas. Things get a little dicey for the Hilton Head Island, South Carolina, native and “Southern Charm” star when the women start to compare notes on the attention he’s given them individually.", "keywords": "Shep Rose, RelationShep, Southern Charm, Bravo, date, reality, Landon, Clements, Shep, Charleston, South Carolina,", "news_keywords": "Shep Rose, RelationShep, Southern Charm, Bravo, date, reality, Landon, Clements, Shep, Charleston, South Carolina,", "googlebot": "noodp, noarchive", "viewport": "width=device-width, initial-scale=1.0", "google-site-verification": "wadoGJsQNB6yEbGrn29qjBNM26b3-5Ovn-twUmPaGnY", "parsely-metadata": "{\"article_id\": \"190676444\"}"}, "movies": [], "publish_date": null, "source": "https://www.thestate.com", "summary": ""}