{"url": "https://www.upi.com/Figure-skater-Adam-Rippon-wants-to-reinvent-pursue-acting/4051545064895/", "text": "Adam Rippon and Mirai Nagasu arrive on the red carpet for the Academy Awards on March 4 in Los Angeles. File Photo by John Angelillo/UPI | License Photo\n\nAdam Rippon of the United States competes during the Pyeongchang 2018 Winter Olympics at the Gangneung Ice Arena in Gangneung, South Korea. File Photo by Richard Ellis/UPI | License Photo\n\nAdam Rippon of the United States competes at the Pyeongchang 2018 Winter Olympics at the Gangneung Ice Arena in Gangneung, South Korea. File Photo by Richard Ellis/UPI | License Photo\n\nDec. 17 (UPI) -- A long friendship with the frozen floor has melted into something else for Adam Rippon.\n\nThe 2018 Pyeongchang Winter Olympics sensation has decided to step away from competition and step into the unknown of an acting career. He says it's a scary road but also exciting.\n\n\"My relationship with the ice is totally different now,\" Rippon told UPI. \"It used to be my job. It would be everything that my whole world was around. Now when I get on the ice it's a chance for me to kinda zone out and enjoy. It's my personal time now. It kinda brings me back to those moments when I first started skating and why I fell in love with skating in the first place.\"\n\nRippon's agent might be one of the busiest in the business. Booking the bronze medalist for Dancing with the Stars, scores of interviews and even a recent gig on Will & Grace.\n\nThe 29-year-old proved to be a trailblazer, becoming the first openly gay U.S. man to medal at a Winter Games. He was also the first openly gay U.S. male skater to compete at an Olympics.\n\nBut that past is written.\n\n\"I think I am really lucky because I have a lot of cool opportunities and I'm able to kind of take advantage of everything that is around me,\" said Rippon, who has also become a spokesman for DayQuil and NyQuil Severe with VapoCOOL.\n\n\"I feel like I'm trying to take every situation and see what I like because I have been so focused on one career for 20 years and had the blinders on and didn't think or focus on anything else and it's just a chance for me now to kind of take those experiences, see what I like and I do want to reinvent myself.\n\n\"I want to find something that I'm just as passionate at as I was with skating. That I can put 100 percent of myself in and just be my best everyday. Because I love that grind with skating but I think I felt that after the Olympics at 28 it felt like the perfect time for me to step away.\"\n\nIn the chaos of opportunities, Rippon has to remind himself to stay grateful and tell himself that feelings of being scared are \"totally normal.\" He uses a strong cast of friends and family to keep himself grounded.\n\nHe is working on a book that discusses those relationships and more. Rippon -- who became a household name to many at the Winter Games -- said there is still a lot that people don't know about him.\n\n\"I don't think I'm going to say anything that's going to shock the [expletive] out of people,\" he said. \"I think that it will be interesting because I come from a small town. My childhood isn't very typical.\"\n\nRippon moved away from home when he was 13 or 14 years old to pursue figure skating. He moved in with his teacher part time in order to take lessons daily.\n\n\"There are a lot of things that aren't very normal. But it was part of my normal and I think that it is a really interesting chance for me to share that and I kind of tell it though my voice. Because I think it's important for me to tell those serious stories but also keep it pretty funny.\"\n\nRippon said one of the biggest lessons he learned on his journey of personal growth regarded focusing on himself.\n\n\"If you focus more on yourself and less on whatever other people think, you are able to have a better experience,\" he said. \"That a lot of what you do -- especially in a judged sport -- is out of your control. When you let go of that and you focus on what you can do to better yourself, you will end up having a better result. When you try things that you want to try you will just have better experiences from that.\n\n\"... But it wasn't just an overnight thing. It was something that I worked at. I feel like if I'm able to share my story and explain the different situations that I've been in, then I can help someone so they don't have to make the same mistakes that I did.\"\n\nRippon -- who played a witty barista in the Will & Grace episode -- said he got the same rush he had when competing when he performed in front of the live audience.\n\nHe also said he feels very comfortable in the \"comedy space\" when it comes to his acting pursuit.\n\n\"Even though I was in theater, I was more of an entertainer at heart,\" Rippon said. \"I've never had any acting experience so I was very grateful that the team at Will & Grace even gave me the shot. I had a great time during the whole week of rehearsals and it's something I think I would really like to pursue.\"\n\nRippon -- who made waves at the Winter Games for a verbal jab at U.S. Vice President Mike Pence -- says he also plans to stay politically active. He partnered with MTV in October to break down the importance of the midterm elections and says you can \"definitely bet\" on him being involved in the 2020 presidential election.\n\nFor now, he is seizing each day and new opportunity.\n\n\"It's a little scary,\" Rippon said. \"It is exciting. I've been really fortunate, but at the same time there are those days where I try to search for the bigger purpose ... sometimes you feel like you are trying a million different things but it's just part of the process.\n\n\"I'll always look back and there will never be a time in life like this ... That I'll be coming off an Olympic Games trying to completely reinvent myself. I really need to take advantage and kinda sit back and enjoy these experiences. I think that moving forward I'll be able to find that next step. And I don't think they'll ever be a time in my life where I get to try so many different things all at once.\"", "images": ["https://www.upi.com/img/expand_gallery.svg", "http://b.scorecardresearch.com/p?c1=2&c2=15071286&cv=2.0&cj=1", "https://cdnph.upi.com/svc/sv/upi/4051545064895/2018/1/09b388c8d44713af0cb7d1cf03f96855/Figure-skater-Adam-Rippon-wants-to-reinvent-pursue-acting.jpg", "https://cdnph.upi.com/sv/para/ss/upi/4051545064895/2018/8/1/4d8c5968b734f2761cd588c712a9f70a/Figure-skater-Adam-Rippon-wants-to-reinvent-pursue-acting.jpg", "https://www.upi.com/img/clear.gif", "https://cdnph.upi.com/related/6741562947234/4/v1.2/7af8d3c17a8dfcf2e6370798db8541c5/upi/Royal-Danish-Ballet-rehearses-for-The-Bournonville-Legacy.jpg", "https://www.upi.com/img/photo_gallery_icon.svg", "https://pixel.quantserve.com/pixel/p-hqtKxhsRLFLuJ.gif", "https://cdnph.upi.com/ph/st/th/4631562935259/2019/i/15629364708062/v1.5/Danny-Green-says-former-teammate-Kawhi-Leonard-wanted-his-own-route.jpg", "https://cdnph.upi.com/sv/ph/og/upi/4051545064895/2018/1/09b388c8d44713af0cb7d1cf03f96855/v1.5/Figure-skater-Adam-Rippon-wants-to-reinvent-pursue-acting.jpg", "https://www.upi.com/upi/dw/img/clear.gif"], "top_img": "https://cdnph.upi.com/sv/ph/og/upi/4051545064895/2018/1/09b388c8d44713af0cb7d1cf03f96855/v1.5/Figure-skater-Adam-Rippon-wants-to-reinvent-pursue-acting.jpg", "keywords": [], "authors": ["Alex Butler"], "canonical_link": "https://www.upi.com/Sports_News/2018/12/18/Figure-skater-Adam-Rippon-wants-to-reinvent-pursue-acting/4051545064895/", "title": "Figure skater Adam Rippon wants to 'reinvent,' pursue acting", "meta_data": {"description": "Olympic figure skater Adam Rippon told UPI that he is trying to \"completely reinvent himself\" and pursue an acting career after retiring from the sport.", "keywords": "Sports, Adam Rippon, Mike Pence, Midterm Elections", "news_keywords": "Sports, Adam Rippon, Mike Pence, Midterm Elections", "viewport": "width=device-width, initial-scale=1", "google-site-verification": "vnkcuJA1Q89cLmy4OZpuQKOf5Jf6ny_RVh7BpxZ11a0", "apple-itunes-app": "app-id=1304339835", "og": {"site_name": "UPI", "description": "Olympic figure skater Adam Rippon told UPI that he is trying to \"completely reinvent himself\" and pursue an acting career after retiring from the sport.", "url": "https://www.upi.com/Sports_News/2018/12/18/Figure-skater-Adam-Rippon-wants-to-reinvent-pursue-acting/4051545064895/", "title": "Figure skater Adam Rippon wants to 'reinvent,' pursue acting", "type": "article", "image": {"identifier": "https://cdnph.upi.com/sv/ph/og/upi/4051545064895/2018/4/4876da828ed59512de667ecc20dc9301/v1.5/Figure-skater-Adam-Rippon-wants-to-reinvent-pursue-acting.jpg", "width": 600, "height": 399}}, "fb": {"app_id": 130795020312660, "pages": 101911273177707}, "twitter": {"card": "summary_large_image", "site": "@UPI", "title": "Figure skater Adam Rippon wants to 'reinvent,' pursue acting", "description": "Olympic figure skater Adam Rippon told UPI that he is trying to \"completely reinvent himself\" and pursue an acting career after retiring from the sport.", "image": "https://cdnph.upi.com/ph/st/th/4051545064895/2018/upi/09b388c8d44713af0cb7d1cf03f96855/v2.1/Figure-skater-Adam-Rippon-wants-to-reinvent-pursue-acting.jpg?lg=4"}}, "movies": [], "publish_date": null, "source": "https://www.upi.com", "summary": ""}