{"url": "https://www.dstv.com/en-za/news/meet-wags-miamis-faven-liuget-20170904", "text": "Being the new kid on the block isn't easy but Faven Liuget is taking it one stylish step at a time as the newest cast member on season 2 of E! Entertainment's (DStv Channel 124) WAGS Miami.\n\nMarried to San Diego Chargers defensive end Corey Liuget, Faven is one busy lady from wife and mother to businesswomen and style star to watch. Recently moving to Miami from San Diego we caught up with the newlywed to discuss transitioning to a new city, shooting a hit reality series and her \"spicy\" side.\n\nA dash of spice\n\nGlitz, glamour and drama is the name of the game on WAGS Miami. As a newcomer to the show we were keen to find out what Faven brings to the table, \"For me this season, I'm talking early on from episode one, you'll see [as my husband calls it] I'm very spicy, hot-headed and kind of don't know what to be nothing but myself\" she explained. One of the undeniable qualities of Faven is that she's true to who she is and she takes no nonsense, \"Early on you'll see how I'm a passionate person\" she added. Passionate is definitely a word we'd use to describe this Ethiopian-born beauty who often dispays her dedication to her family, friends and work online.\n\nFaven brings her spice to the show, but what about her cast mates? \"I tell people I'm so lucky to be chosen to be a part of this cast because I feel that a lot of our personalities are strong. For example Hencha (Voigt) is just as spicy as me\" she says. Faven goes on to add that from episodes one through to three is when you'll definitely be able to make up your mind about her, \"the audience will be able to say 'wow'; either you love me or you don't\" - we're leaning towards love of course.\n\nBehind the cameras\n\nFaven shares that scenes can take several hours to film for the show, \"I would shoot at 11:00, do three to four hours, eat something and then go to my next scene and do it again for another three hours,\" she explains \"With all that, there's so much happening but when people see it they cut it down to two minutes so of course me sitting at home watching it I'm like 'No! That's not all of it!' because there was more to it.\" Most of the audience don't know the work that goes on behind-the-scenes and that most of what happens gets reduced to several minutes - five if you're lucky - \"and that's what's hard\" she says.\n\nMoving to Miami\n\nMoving across a country is never easy but luckily for Faven she had friend and fellow WAGS star, Darnell Nicole waiting. We figured Darnell had some key advice for Faven and we weren't wrong: \"She gave me lots of tips. Early on you'll see Miami is not an easy place to move your family and your relationship. They're more open and expressive\". Corey is a Miami native and with his success moving to a city where he's easily recognisable is just another point to add to the list, how can it be handled? \"She said to do things on the other side of Miami - kid-friendly and family activities. Always keep it very honest and have open communication with one aother\" is more advice Darnell passed on.\n\nWhen Faven isn't busy being a mom and wife or shooting for the camera, her perfect down-time day in Miami includes spa days and doing her nails. Her ultimate activity to relax? Traveling! \"I'm really grateful for that. We go on vacations to see other cultures. I think it's important to experience other cultures and learn a lot from the people you go visit.\"\n\nEthiopian roots\n\nBorn in Ethiopia but movng to the USA when she was little, it was great to see Faven bring in her culture when she recently tied the knot in July \"It took one year and a few months of planning\" she starts \"I come from a huge family and our guest list was almost 700!\" Her initial two-day wedding turned into a three-day event with no detail spared. \"Corey adapted to my culture so quickly. It was really nice for me to show my kids that my culture is very, very, very important.\" she states. Adding that her kids are fluent in Amharic as well.\n\nHow did Faven stay true to her family's heriage? Her mother and grandmother worked hard in instiling her Ethipoian roots, \"I call my grandma the breadwinner. She was born in 1932 so it was hard for a woman to be educated; she put herself through nursing school and got her degree,\" she says proudly \"She worked as a nurse and opened up all kinds of doors for my entire family. We knew what it was to not have anything and we see what it's like when we go back home\". Faven continued to sing the praises of her grandparents who worked very hard to improve her family's life. \"You have to know, to come from a third-world country to understand the American opportunity and to really word hard and not have excuses so I never have excuses. Most of the time I'm harder on myself\" she states.\n\nThere's no denying Faven Liuget is going to bring some flavour to WAGS Miami this season! Make sure to tune in for the premiere of WAGS Miami season 2 on Monday 11 September at 20:00 on E! Entertainment (120) or stream live on DStv Now to meet the latest addition to the Miami scene.", "images": ["https://beta-selfservice.dstv.com/Content/img/images-site/icons/WhatsAppIcon3.png", "https://cdn.dstv.com/dstvcms/2017/08/31/DStv_howdoilooksouthafrica_kat_med.jpg", "https://cdn.dstv.com/dstvcms/2017/08/31/DStv_howDoILook_SouthAfrica_rOXYbURGER_med.jpg", "https://cdn.dstv.com/dstvcms/2017/09/20/Dr_Christian_Jessen_med.jpg", "https://za.effectivemeasure.net/em_image", "https://cdn.dstv.com/dstvcms/2015/08/21/MultiChoice-SA_16x9_Logo_001_thumb.jpg", "https://cdn.dstv.com/dstvcms/2017/07/27/E!logo_med.jpg", "https://d5nxst8fruw4z.cloudfront.net/atrk.gif?account=3z+mh1a0k700iP", "https://cdn.dstv.com/dstvcms/2017/09/05/DStv_FavenLiuget_WAGSMiami_lrg.jpg"], "top_img": "https://cdn.dstv.com/dstvcms/2017/09/05/DStv_FavenLiuget_WAGSMiami_lrg.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.dstv.com/en-za/news/meet-wags-miamis-faven-liuget-20170904", "title": "Meet WAGS Miami's Faven Liuget", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "google-site-verification": "poijGWSMXfKt1tmtx4siIaUH95WnrO1OGOJLgHG71U4", "description": "WAGs Miami star Faven Liuget talks being a mom, wife and true to her culture.", "og": {"title": "Meet WAGS Miami's Faven Liuget", "type": "News", "url": "http://www.dstv.com/en-za/news/meet-wags-miamis-faven-liuget-20170904", "image": "https://cdn.dstv.com/dstvcms/2017/09/05/DStv_FavenLiuget_WAGSMiami_lrg.jpg", "description": "Faven talks WAGs, work and being true to herself."}, "keywords": "Faven Liuget,Corey Liuget,WAGS miami,Darnell Nicole,interview,exclusive,WAGs miami season 2,E! Entertainment,reality series,behind the scenes"}, "movies": [], "publish_date": null, "source": "https://www.dstv.com", "summary": ""}