{"url": "http://gossipgirl.wikia.com/wiki/Serena_van_der_Woodsen", "text": "\n\nSerena Celia Humphrey (née van der Woodsen) is a main character in the Gossip Girl series of novels and its television adaption, in which she is portrayed by Blake Lively.\n\nThroughout the series, Serena has an on-again, off-again relationship with Dan Humphrey and the two have the longest running relationship on the show. Dan and Serena finally get married in the series finale.\n\nSerena is regarded as the \"it girl\" of the Upper East Side. She is best friends with Blair Waldorf and also has a close friendship with Nate Archibald and Chuck Bass.\n\nShe, Dan and Blair are the only characters that appear in every episode of the TV series.\n\nContents show]\n\nSummary\n\nSerena van der Woodsen is the daughter of William and Lily van der Woodsen. The story begins with her return to New York from boarding school. Shortly after her return, she realizes a lot has changed since she left. Her friends are not too happy about her return, including her best friend Blair Waldorf.\n\nShe then meets Dan Humphrey and the two begin a romantic relationship and soon fall in love. Serena's storylines often surround her disastrous relationship choices and her struggle to find where she fits in the world outside the Upper East Side. In the finale, Dan and Serena get married, surrounded by friends and family.\n\nShe appears to be 16 through 21 years old in the series.\n\nNovel Series\n\nIn the novel series, Serena was born into Manhattan's elite society. Her mother is Lily van der Woodsen, a very wealthy heiress, and her father William van der Woodsen, is a billionaire doctor. Serena also has an older brother named Erik, who attends Brown. Serena comes back from boarding school for seemingly unknown reasons that are later revealed in a prequel. Often times she waltzes her way easily through life, which makes her best friend Blair furious; especially when she has to work for the things Serena attains via her charm.\n\nSerena goes to Yale at the end of the series. Similar to the television adaptation, she dates a variety of different boys, including Nate, whom she lost her virginity to. Through the books, she realize that she truly loves Nate, but he is still Blair's boyfriend. In the thirteenth novel, she decides to stay in New York to be with Nate, but at the end, he leaves to not get in between her and Blair.\n\nTelevision Series\n\nThe series begins with Serena's return to the Upper East Side after spending a year in Cornwall, Connecticut, attending The Knightley School. Upon arriving home, she rejects romantic advances from both Chuck Bass and her best friend Blair Waldorf's boyfriend, Nate Archibald. She also reconnects with her mother, Lily van der Woodsen, and her recovering brother Eric van der Woodsen, who is in rehab after attempting suicide. After a chance meeting at the hotel where she is staying with Lily, Serena meets Dan Humphrey and the two begin a romantic relationship (Pilot). Soon after, Nate reveals to Blair that he slept with Serena before she left town and as a result, Blair begins to ice Serena out of her world (The Wild Brunch). During Ivy Week, Blair publicly outs Serena for having alcohol and drug problems in front of representatives from several Ivy League schools. Afterwards, Eric tells Blair he is the one in treatment; which leads to a reconciliation between Blair and Serena (Poison Ivy).\n\nIn Roman Holiday, Serena and Eric learn that Chuck's father, Bart Bass, is going to marry Lily. After spring break, they move in with the Bass' as they prepare to blend their households. The move ultimately shakes Serena more than she anticipated and it begins to cause problems in her relationship with Dan (The Blair Bitch Project). Things take a turn for the worse when Serena's old frenemy, Georgina Sparks, comes back to town. They begin to hang out again but Serena asks her to stay away when she misses the SATs after a night out with her. Angry, Georgina befriends Dan using an alias as a girl named Sarah (Desperately Seeking Serena).\n\nAdd an image\n\nScared of what will happen next, Serena goes to Blair and tells her the major secret Georgina has on her: that she killed someone. After her revelation, she leaves and Blair eventually finds her, drunk and messed up. She asks Nate and Chuck to help and after she's cleaned up, Dan comes by to see her. He asks her what is going on and she lies that she cheated on him. Hurt, he leaves the apartment leaving Serena with Blair, Nate, and Chuck. She then tells them the whole story: that after she slept with Nate at the Shepherd wedding, she went to meet up with Georgina and a mutual friend, Pete Fairman. However, unbeknownst to her, Georgina had set up a camera to film her having sex with Pete. When Serena arrived at the hotel, she began to make out with Pete but didn't do anything, suggesting he take a line of cocaine before they do anything else. He does so, but overdoses and begins seizing. She and Georgina leave the hotel room but not before she calls an ambulance. Afterwards, she waited across the street, wanting to see Pete being revived: but instead saw him being wheeled out in a body bag. Feeling guilty for his death, she left for Connecticut.Later that day, Serena attends Lily and Bart's rehearsal dinner, but after Lily learns the real story, she takes Serena to meet with Pete's parents and absolve her guilt. Once she does so, she goes looking for Dan but finds that Georgina is with him and planning to sleep with him as revenge for Serena outing their secret ( Woman on the Verge\n\nThe next day, Serena tells Dan the whole truth. He then teams up with Blair to take Georgina down and they succeed. At the wedding, he breaks up with Serena; blaming her lies and the fact that they just come from too different worlds. She then leaves to spend the summer in the Hamptons (Much 'I Do' About Nothing).\n\nThe first episode of the second season ( Summer Kind of Wonderful ) begins in the Hamptons, where Serena is rumored to be dating Nate. However, it is a lie concocted by them both so Nate is able to have an affair with an older, married woman and Serena can grieve her relationship with Dan ending. After a few mishaps during the White party, the two resume their relationship.\n\nThe couple's return to New York (Never Been Marcused) has them returning to old issues as Dan struggles with the differences in their lifestyles and eventually is unable to deal with those differences. The two end their relationship in an elevator during Blair's party, having succumbed to their relationship problems during a blackout (The Dark Night).\n\nGossip Girl cites the new school year, Serena's newly single status, and a possible return of Serena as the Queen Bee of Constance as senior year begins (The Ex-Files). Serena however, attempts to adjust to a purely platonic relationship with Dan, but she is hurt to find out that he has easily moved on from their relationship when he starts dating new student Amanda Lasher. Blair intervenes by torturing Amanda so she will distance herself from Dan. Serena apologizes to both Dan and Amanda for Blair's actions and the three have drinks, where Blair's clique continues to meddle in their problems by setting her up with a Dalton student. Dan gradually realizes Serena is hurt but assumes that she is purposefully sabotaging his date with Amanda. Serena lashes out at Dan by telling Dan to leave, hurt by Dan's assumption. Isabel and Penelope ruin the night by throwing a Nairtini at Amanda. A frustrated Amanda leaves and Dan lashes out at Serena, who is innocent of the incident but Dan angrily tells her that she should own up to her real self. Serena, angered at Dan's accusation, confronts Blair's clique and tells them that the next time that they mess with Dan, it has to go through her first. Her statement indicates her return as the Queen Bee. The next morning brings back Serena and Blair's old rivalry, as the girls fawn over Serena and ignore Blair in favor of her. Serena publicly ostracizes Dan at the courtyard connecting Constance and St. Jude's, followed by Blair's clique.\n\nSerena and Blair's rivalry escalates in The Serena Also Rises during Fashion Week as the girls at school continue to fawn over Serena after seening her with Poppy Lifton, her new high socialite friend. Serena earns public praise and media attention. Blair tries to win her friends back by inviting them to Eleanor's fashion show. Serena tries to reconcile with Blair but Blair turns her down. Blair is upset when she realizes that her mother has given Serena and Poppy Lifton, her new socialite friend, front row seats at her show. Blair again feels that her mother loves Serena more than she loves her own daughter, and is angry that Serena will not be backstage with her as usual. Blair tries to sabotage the fashion show but it ends up being a huge success and bumping Serena's popularity; which makes Blair even more jealous.\n\nIn New Haven Can Wait, Serena, angry at Blair after she tore into Serena verbally, decides to attend an interview at Yale University, where Blair always dreamed of attending. Serena was given a personal acceptance from the school's dean and is invited to his house for a private reception. Though uninivited, Blair bribes her way into the party. After a game goes wrong, Serena and Blair decide they can never be friends and part ways. However, both realize they need the other so they make up.\n\nSerena begins a romance with Aaron Rose, an artist and Blair's future step-brother in Pret-a-Poor-J. She accepts his offer to travel to Argentina with him but they break up soon into the flight (O Brother, Where Bart Thou?).\n\nOn the New Years, Serena decided that she wants Dan and wants to make sure that he feels the same (In the Realm of the Basses). They both feel the same way for each other but soon after, discovers about Scott being their half-brother by their parents (Gone with the Will), then Dan had a affair with Serena's old teacher, Ms. Carr. Their final issues lead them to breaking up for the last time (Carrnal Knowledge).\n\nToward the end of the season, Serena begins a relationship with Gabriel (Seder Anything), a man who seemingly left Poppy Lifton for Serena. After getting her parents and their Upper East Side friends to invest in Gabriel's business that brings the internet to third world countries (Southern Gentlemen Prefer Blondes), Serena realizes that both he and Poppy are conning them. She, along with Blair, Nate, and Chuck and the newly born-again Christian Georgina hatch a plan to catch them. However, the plan does not work out when Lily gets her daughter arrested. Gabriel and Poppy escape (The Wrath of Con).\n\nIn the final episode of the season, The Goodbye Gossip Girl, Gossip Girl sends a blast during their graduation commencement ceremony. Serena, angry that Gossip Girl has ruined the day and hurt at being called irrelevant, vows to find out who she is. They don't, uncover her and accept that they will never know her true identity. At the end of the episode, Carter Baizen, a friend of Serena's, tells her he has found the whereabouts of Serena's father William van der Woodsen. Serena decides to go with Carter to meet him before she leaves to attend Brown University in the fall.\n\nAt the beginning of the season during the summer, Serena had been searching for her father and is in a complicated relationship with Carter Baizen ( Reversals of Fortune ). She decides to defer her acceptance to Brown University for a year, and gets a job as an assistant to publicist KC ( Dan de Fleurette ). Blair and Serena get into a feud, which is patched up by Nate and Chuck. At the same time, Serena gets a job in the office of Tripp van der Bilt , who is Nate's cousin and a newly elected Democratic Congressman of New York ( They Shoot Humphreys, Don't They? ). Tripp and Serena later have a relationship, even though Tripp is married to Maureen . He tells Serena that he doesn't love Maureen and will leave her. Serena follows him out of town ( The Treasure of Serena Madre ). Maureen however finds them, and blackmails Serena with a letter from Serena's father, that contains gossip about Lily. She offers to let Serena be the mistress but she will stay married to Tripp no matter what it takes. Serena refuses and tells Maureen that Tripp will stay with her. However, when she finds out that Tripp wants to stay with Maureen for his political career, she asks Tripp to drive her back to New York. They have a car accident, and Serena is taken to hospital. Nate, who recently realized his feelings for Serena, shouts at Trip and stays with Serena in the hospital ( The Debarted ). Serena is staying at the Waldorf's and is in a new relationship with Nate ( The Hurt Locket ). Meanwhile, a scheming Jenny Humphrey attempted to steal Nate from Serena as she developed feelings for him. Eventually, Serena found about her scheming acts and it strained both her (Jenny) relationship with Serena and perhaps, Nate. In addition, Serena finally got to meet her long, lost father when the family finds out Lily is in remission from cancer. ( Dr. Estrangeloved ). Serena is desperate to make a good impression on her father in It's a Dad, Dad, Dad, Dad World and tells him several lies about making good choices. She eventually comes clean and he doesn't hold it against her.However, it is later revealed that she never had cancer and William was using this as a scheme to win Lily back ( Ex-Husbands and Wives ). Although Nate calls the police on William, Serena helps him escape. In the season finale Last Tango, Then Paris , Serena and Dan share a meaningless kiss which leads her to break up with Nate. She leaves for Paris with Blair, both dignifying themselves as beautiful, single, carefree women.In the premiere ( Belles de Jour ), Serena has a thing for waiters, bartenders, and anyone on a vespa in Paris. When Blair meets who she thinks is a prince from Monaco, Louis Grimaldi , Serena goes on a double date with them. During the date, Blair discovers Serena will also be starting Columbia University in the fall. Angry at having to share her spotlight, the girls fight but make up.Soon after, Serena finds Chuck after Lily thinks he was dead. Chuck and the woman who nursed him back to health, Eva, want to leave Paris after seeing Blair. Even though Blair is supposed to go on a date with her prince, Serena asks that Blair stops Chuck from leaving. Back home, Nate is dating a girl named Juliet that is trying to help Nate with his social life. Serena, knowing that returning to New York means she needs to make a choice between Dan and Nate, is surprised to find that both are in relationships when she returns. The episode finished with Juliet removing pictures from Gossip Girl from a cork-board, leaving only Serena's mugshot ( Double Identity ). In The Undergraduates , the Gossip Girl website seems to have gotten an update that allows it to stream video live. Serena and Blair both confidently talk about joining the Hamilton House sorority at Columbia University. It turns out that both Penelope from Constance and Juliet are both members and it is discovered that only Blair got accepted.Juliet seems to be playing the jealousy card by telling Serena that Blair called the Hamilton House to tell them about the situation with Pete Fairman. At a party, Serena and Blair stage a fight that is played on Gossip Girl to expose Juliet's manipulative ways. Lily, who is an alumni on the house, kicks Juliet out and brings Serena in. Also, Serena moves into Blair's penthouse.\n\nSerena spends some time with Dan and realizes he is who she has real feelings for. Before she can confess them, Vanessa and Dan grow closer and Nate tells Serena he wants to fight for her. In the end, Serena goes upstairs and decides not to talk to either until she makes her ultimate choice (Touch of Eva).\n\nAfter school starts, Serena is having some problems with her classes because she is always late. Every morning a mysterious man (Colin Forrester) takes her taxi for one of his many one night stands which is making her late. Despite many attempts to meet with her professor, something seems to always get in the way, which makes her professor quite angry with her. Meanwhile, more about Juliet's vendetta about Serena is revealed when her brother Ben Donovan tells her that they need to leave Serena with absolutely nothing (Goodbye, Columbia).\n\nIn Easy J, Serena admits to having spent the night with Colin when questioned by Blair. However, they spent the night talking in lieu of sleeping together. Serena says she refuses to be one of the women he hands off in a cab every morning. But when she arrives to her new class that day, she discovers Colin is her new professor. But the two decide to try and pursue a relationship anyway after Serena decides to drop the class. Juliet sets up cameras to catch Serena and Colin, who is revealed to be her cousin, together (War at the Roses). But in Juliet Doesn't Live Here Anymore, when she and Vanessa attempt to use them to get Serena expelled, they fail and Juliet is forced to leave the city. Serena and Colin subsequently break up.\n\nSerena ends up in a situation where she needs to choose between Nate and Dan ( The Witches of Bushwick) . At the same time, the press has heard about Colin and Serena's relationship and Dean Reuther encourages her to leave the university but both Lily and Serena decline the offer. Juliet and Jenny pretend to be Serena and kisses both Nate and Dan, causing both guys to lose interest in her. At the end of the episode, Juliet drugs Serena and emails Dean Reuther saying she indeed wants to take her up on the offer and leave. After being committed involuntarily to the Ostroff Center Gaslit ) after Lily discovers her overdose, caused by Juliet, Serena admits to Dan that he was the one she came to kiss the night she was drugged. While in counseling, Serena tells a counselor through a series of flashbacks that while she was at boarding school, she developed feelings for her professor, Ben, Juliet's brother, but that nothing ever happened between them. Afterwards, Julie confronts Serena and says her and Ben targeted her after she signed an affidavit stating they slept together and he was sentenced to five years in prison because of it. However, Serena never signed an affidavit and realized Lily did for her ( The Townie ).\n\nSerena and Ben finally meet after all this time has passed and begin dating (It-Girl Happened One Night). However, no one really approves of their relationship and Dan, Eric, and Damien Dalgaard plot to break them up (Panic Roommate) but ultimately fail. When Ben's mother comes to see him, she steals the affidavit and gives it to long time Bass enemy Russell Thorpe to blackmail Lily with (Empire of the Son). As a result, Lily turns herself in to be sentenced.\n\nSerena's long lost cousin Charlie Rhodes comes to Manhattan as Lily is sentenced to house arrest (The Kids Stay in the Picture). Meanwhile, Prince Louis has also come to New York to find Blair but Serena is suspicious she's hooking up with Dan (Petty in Pink). Still jealous, Serena tries to sabotage Blair's new relationship with Louis by sending his disapproving mother, Sophie Grimaldi, a book of Gossip Girl blasts about Blair's many mistakes (The Princesses and the Frog). Blair knows it was her, but decided to let it go because she figured she was still angry about her kiss with Dan. While celebrating Blair's engagement to Louis, Serena realizes Charlie is scheming to make Dan turn her back to her (Shattered Bass). Vanessa, who was also screwed over by Charlie's scheming, teams up with Serena to find what's really going on. In the finale The Wrong Goodbye, Serena finds out Charlie is off her meds but is able to talk her down from anything extreme and tells her that being Serena van der Woodsen isn't all it's cracked up to be. In the end, she decides to spend the summer in Montecito, California, with CeCe.\n\nAfter getting a job at the beginning of summer, Serena is working on a film set in Los Angeles. While there, she runs into her cousin Charlie (who was revealed to really be a con artist named Ivy Dickens set up by Carol Rhodes) (Yes, Then Zero). After being offered a more permanent position with her boss Jane, Serena plans to stay in LA until she finds out her job is moving back to New York so she plans to return home with Charlie (Beauty and the Feast). When Dan's book Inside is released, Serena is upset when she discovers her character was written to be flighty, irresponsible, and easy. She's also jealous that Blair was made the star of Dan's book over her. At the same time, her job is threatened by the book when she loses a major movie deal over her portrayal in the book (Memoirs of an Invisible Dan). After Serena loses another major deal, this time regarding Dan's book's movie rights, she confesses to him that she always saw him as the love of her life and he decides to give her the rights (The Fasting and the Furious).\n\nHowever, the deal falls through (I Am Number Nine) and Serena is offered a job by Nate's new boss Diana Payne to blog for their new social media empire The New York Spectator. She begins her own column titled S by S. Meanwhile, Ivy's ex boyfriend Max Harding arrives in town and runs into Serena, who he begins a relationship with (The Big Sleep No More). Before CeCe's big party, Serena discovers this and confronts both Ivy and Max in front of the whole family. Ivy concocts a huge lie and Max tries to prove her wrong but fails. This causes him and Serena to break up (Rhodes to Perdition).\n\nAfter Chuck and Blair's car accident (Riding in Town Cars With Boys), Serena tries to help Blair and Louis' struggling relationship by claiming to be in a relationship with Dan to alleviate any rumors of Dan and Blair (The End of the Affair?). The two enter into a fake relationship, although Serena begins to fall for Dan again despite the fact he's in love with Blair. However, Blair and Louis make real amends and she tells Serena her and Dan can stop their fake relationship, but Serena decides to tell Dan they need to keep it up until the wedding (Father and the Bride). At the wedding reception, Serena admits to Dan that she kept the relationship longer than she had to because she was still in love with him (G.G.).\n\nAfter Blair runs away from her wedding, Dan lies to Serena about where she is in order to save her alone. However, Chuck and Serena track them down, and Serena decides to take the blame for releasing the video that ruined Blair's wedding and marriage (The Backup Dan). Wanting to make Serena and Dan happy, Blair decides to play Cupid upon returning from her honeymoon and sets the two up. But her plan is ruined when she kisses Dan and Serena witnesses (Crazy Cupid Love). To prove her wrong, Blair and Dan try to hang out platonically and it fails. Meanwhile, a dying CeCe is being rushed to the hospital. At the hospital, it's revealed that Ivy is a fraud. After realizing their feelings are real for each other, Serena decides to accept Blair and Dan are going to be together (Cross Rhodes). After CeCe's wake, Serena receives a package from acting Gossip Girl Georgina, along with all the information to make her the new Gossip Girl (The Princess Dowry).\n\nAppearance and Style\n\nIn her first few days as the new Gossip Girl, Serena accidentally ruins Lily and William's plan to trick Ivy out of the inheritance CeCe left ( Con-Heir ). After being an It Girl for a long time, Serena decides she wants to make her new found cousin Lola Rhodes the next star. But after Lola betrays her, and Serena spends some time out of the spotlight, she realizes it's where she belongs and begins to tear Lola down to build herself back up ( It-Girl Happened One Night ). After a chain of events, Serena discovers Lola is her sister due to William and Carol having an affair while he was still married to Lily. In turn, Lily sets up Carol to reveal her scheme to the police. Wanting revenge, Lola asks Serena to help her take down Lily but Serena asks her to stay away. On her way out, she steals the card with Serena's Gossip Girl log in to prove she really is her ( Despicable B ). After Bart is revealed to be alive ( Raiders of the Lost Art ), Blair becomes involved in helping Chuck help Bart stay. She asks Serena to be her stand in at a meeting with Dan, to play her as they meet with a rep with the program Dan was invited to attend in Rome. At the end of the episode, Blair's diary is leaked as Serena kept it in Gossip Girl servers and it's revealed it was Serena's doing ( The Fugitives ). Subsequently, Blair kicks Serena out of her penthouse and Serena sleeps with Dan as retaliation and tapes it. Blair breaks up with Dan to get back with Chuck, and Serena sees that and the end of Rufus and Lily's marriage to get back with Dan. However, Dan tells her that after what she did he wants nothing to do with her anymore. She calls Damien and goes on a drug binge while leaving town ( The Return of the Ring ).Serena has spent the summer dating Steven Spence , the CEO of a vitamin company, while calling herself Sabrina (in reference to her character in) and claiming to be from Wisconsin. After being missing all summer, Nate, Chuck, Blair, Dan, and Georgina head off to find her. They find her with Steven and after they confront her, she decides to return to Manhattan ( Gone Maybe Gone ). Steven gets Serena into some adult societies and she's excited to host the Conservancy Gala until she discovers Steven and Nate's new girlfriend Sage Spence are hanging out. They both assume they're being cheated on until it's revealed they're actually father and daughter ( High Infidelity ). Desperate to build a relationship with Sage, Serena gets her into Blair's Waldorf Designs fashion show. However, desperate to separate Serena and her dad, Sage ruins the show on purpose but fails and Serena and Steven are still inseparable ( Dirty Rotten Scandals ). Serena and Steven eventually decide to reveal past lovers to one another but find that Steven slept with Lily long before he met Serena. Meanwhile, Serena finds out Dan wrote an expose chapter on her and begs him not to release it ( Portrait of a Lady Alexander ). While trying to figure out why Steven is acting distant, Serena discovers an engagement ring and realizes he's going to propose. However, Sage releases her sex tape with Dan during Cotillion and Steven ends things with her ( Monstrous Ball ).Serena and Dan sleep together in Where the Vile Things Are after he takes her on an outing eerily reminiscent of their first date. After realizing she needs to make amends with everyone, she finally makes up with Blair ( Save the Last Chance ) and talks with Dan. She asks if he's sure she's the one he wants to be with and her assures her that she was always the one. On Thanksgiving, Dan and Serena host their first dinner together but all ends when Dan releases the mean chapter he wrote on Serena. They break up and Dan is exiled from the UES ( It's Really Complicated ). In The Revengers , Serena decides to help Blair with her last scheme and then move to Los Angeles permanently. Before she leaves, Dan begs her to stay but she refuses and leaves anyway. But before her plane takes off, she discovers Dan slipped his final chapter into her bag. In the series finale New York, I Love You XOXO , Serena discovers Dan was Gossip Girl all along, but that it was really a blessing in disguise as it made her realize New York is where she belongs. In the time jump, she marries Dan.\n\nSerena is famous for her notable natural beauty. She is often admired for looking gorgeous effortlessly; including her voluminous blonde hair, flawless skin, and a tall, striking figure. She often wears sexy, slutty and tight clothes that flatter her body, sequins, and attention-grabbing accessories. Serena is considered, along with her on-again, off-again best friend Blair, one of the most beautiful girls on the Upper East Side. Her style is based off real life model Kate Moss and is meant to be more boho and casual as opposed to Blair's.\n\nPersonality\n\nUnlike Blair, who is considered to be the show's antiheroine, Serena is considered more to be a traditional heroine. Her motives are rarely selfish and her negative actions are often times generally motivated by a lack of foresight rather than real malice. She's often seen to be friendly and will befriend anyone, such as when she talked to an out of place Dan at the party where they first met. Unlike Blair, Serena is also trusting, which sometimes doesn't work in her favor. Due to watching her mother's many failed marriages, Serena has issues with truly committing to a man and understanding what real love is, but that seemed to disappear when she married Dan. Serena is often noted to be irresponsible, especially when it comes to being places on time or completing tasks as told. As opposed to Blair, who tends to date men with status, Serena doesn't seem to have a type (such as Aaron Rose in season two or Steven Spence in season six).\n\nRelationships (Novels)\n\nFamily\n\nRomances\n\nRelationships (TV Series)\n\nFamily\n\nRomances\n\nPhotos\n\nThis character has a Photo Gallery!\n\nMemorable Quotes\n\n\"You'd really go out with some guy you don't know? -Dan\n\n\"Well, you can't be worse than the guys I do know.\" -Serena, Pilot (1x1)\n\n________________________________\n\n\"You manipulative psycho bitch!\" -Much 'I Do' About Nothing (1x18)\n\n________________________________\n\n\"Hey, it's me, Serena. I still don't know if this is your number but I wanted you to know I'm not looking for you anymore. I thought maybe you wanted to know me... but now it's me that doesn't want to know you. I'm done.\" -The Lady Vanished (3x14)\n\n________________________________\n\n\"I even made a list of pro's and con's. Dan: good shoulder to cry on. Nate: good shoulders.\" -Double Identity (4x2)\n\n________________________________\n\n\"I'll stay away from Nate and Dan if you stay away from Chuck and Eva. No plotting, no meddling, no Blair Waldorfing.\" -Touch of Eva (4x4)\n\n________________________________\n\n\"College is just high school with more expensive books.\" -Goodbye, Columbia (4x5)\n\n________________________________\n\n\"Because I know this may sound crazy or selfish or like I'm living in the past or something. But you were the love of my life, Dan. And I don't know.. I guess I just always thought I was yours too.\" -The Fasting and the Furious (5x5)\n\n________________________________\n\n\"It's not the secrets that cause the problems, it's the assumptions people make about them.\" -The End of the Affair? (5x11)\n\n________________________________\n\n\"I love you, Dan Humphrey. Always have, always will.\" -G.G. (5x13)\n\n________________________________\n\n\"But what he did with that power was write a love letter. Not just to me, but all of us. He made me realize I don't want to run away, that you guys are my family and I belong here.\" -New York, I Love You XOXO (6x10)\n\n________________________________\n\nHobbies & Skills\n\nModeling - In Bad News Blair, Serena is invited to model Eleanor Waldorf's clothes. Later on, in Roman Holiday, it's mentioned that she did a print ad for Gap once. In The Serena Also Rises, Serena jumps at the chance to model in Eleanor's fashion show.\n\nTrivia\n\nShe spent a summer in Italy where her love of Vespas originated.\n\nShe wanted to take a year off school to teach English in South Asia.\n\nShe's been taking birth control pills since she was 15 years old.\n\nShe dated the captain of the swim team at the end of freshman year.\n\nShe was the first person to be on Gossip Girl.\n\nWhen she was a little girl, she loved the banana splits at Serendipity.\n\nShe hasn't eaten bread since she was in middle school.\n\nDuring her sophomore year of high school, she skipped more classes than she attended.\n\nWhen she was 12, she did a print ad for Gap.\n\nGallery", "images": ["https://vignette.wikia.nocookie.net/gossipgirl/images/b/ba/108GossipGirl0663.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20150705000035", "https://vignette.wikia.nocookie.net/gossipgirl/images/9/9b/104GossipGirl1296.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20150701045824", "https://vignette.wikia.nocookie.net/gossipgirl/images/4/4c/110GossipGirl0814.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20150712093155", "https://vignette.wikia.nocookie.net/gossipgirl/images/f/f7/104GossipGirl1285.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20150716035832", "https://vignette.wikia.nocookie.net/gossipgirl/images/f/f0/Ser1.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20150714075622", "https://vignette.wikia.nocookie.net/gossipgirl/images/3/33/104GossipGirl1298.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20150701045733", "https://vignette.wikia.nocookie.net/gossipgirl/images/9/9f/106GossipGirl0040.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20150716035916", "https://vignette.wikia.nocookie.net/gossipgirl/images/b/bd/104GossipGirl1305.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20150701045715", "https://vignette.wikia.nocookie.net/gossipgirl/images/4/45/Ser5.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20150713060014", "https://vignette.wikia.nocookie.net/gossipgirl/images/2/25/101GossipGirl0049.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20150607062042", "https://vignette4.wikia.nocookie.net/gossipgirl/images/8/89/Wiki-wordmark.png/revision/latest?cb=20160418224417", "https://vignette.wikia.nocookie.net/gossipgirl/images/0/0c/Tumblr_lyo495LY4k1qkkgp0o1_500.gif/revision/latest/scale-to-width-down/180?cb=20120212184643", "https://vignette.wikia.nocookie.net/gossipgirl/images/d/df/103GossipGirl0856.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20150630092313", "https://slot1-images.wikia.nocookie.net/__cb1562940152319/common/extensions/wikia/WikiaBar/images/wikiabarIcon.png", "https://vignette.wikia.nocookie.net/gossipgirl/images/d/dc/Ser.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20150713055338", "https://vignette.wikia.nocookie.net/gossipgirl/images/4/40/DS-dan-and-serena-13794043-637-356.jpg/revision/latest/scale-to-width-down/180?cb=20101206165848", "https://vignette.wikia.nocookie.net/gossipgirl/images/1/1b/105GossipGirl0202.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20150716035854", "https://vignette.wikia.nocookie.net/gossipgirl/images/7/7f/Serena_in_Vogue_UK.jpg/revision/latest/scale-to-width-down/333?cb=20160507192337", "https://vignette.wikia.nocookie.net/gossipgirl/images/f/f0/101GossipGirl0231.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20150607080616", "https://vignette.wikia.nocookie.net/gossipgirl/images/5/54/106GossipGirl0932.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20150716035948", "https://vignette.wikia.nocookie.net/gossipgirl/images/a/aa/Ser3.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20150714075713", "https://vignette.wikia.nocookie.net/gossipgirl/images/5/51/104GossipGirl1295.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20150716035846", "https://vignette.wikia.nocookie.net/gossipgirl/images/f/fe/105GossipGirl0277.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20150716035901", "https://vignette.wikia.nocookie.net/gossipgirl/images/0/0f/Blakeleighton_full2.jpg/revision/latest/scale-to-width-down/180?cb=20101205204251", "https://vignette.wikia.nocookie.net/gossipgirl/images/2/2d/Gossip-girl-serena-blair-grandfather-part-ii.jpg/revision/latest/scale-to-width-down/180?cb=20101210195031", "https://vignette.wikia.nocookie.net/gossipgirl/images/c/c2/110GossipGirl0724.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20150712093028", "https://vignette.wikia.nocookie.net/gossipgirl/images/a/a4/Derena-4x04-dan-and-serena-16146312-500-292.jpg/revision/latest/scale-to-width-down/180?cb=20101230105631", "https://vignette.wikia.nocookie.net/gossipgirl/images/8/8c/106GossipGirl0377.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20150716035930", "https://vignette.wikia.nocookie.net/gossipgirl/images/b/b3/104GossipGirl1297.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20150701045759", "https://vignette.wikia.nocookie.net/gossipgirl/images/4/47/108GossipGirl0813.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20150705000304", "https://vignette.wikia.nocookie.net/gossipgirl/images/6/65/110GossipGirl0935.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20150712093743", "https://vignette.wikia.nocookie.net/gossipgirl/images/3/30/29173118997276873718109.jpg/revision/latest/scale-to-width-down/180?cb=20101205203727", "https://vignette.wikia.nocookie.net/gossipgirl/images/7/7f/Serena_in_Vogue_UK.jpg/revision/latest?cb=20160507192337", "https://vignette.wikia.nocookie.net/spotlightsimagestemporary/images/4/4c/Glitchtale-en.jpg/revision/latest/zoom-crop/width/100/height/56?cb=20190618182700", "https://vignette.wikia.nocookie.net/gossipgirl/images/a/a4/106GossipGirl0653.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20150703060757", "https://vignette.wikia.nocookie.net/gossipgirl/images/f/f2/104GossipGirl0880.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20150716035825", "https://vignette.wikia.nocookie.net/gossipgirl/images/f/f1/106GossipGirl0933.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20150703060501", "https://vignette.wikia.nocookie.net/gossipgirl/images/f/f3/104GossipGirl0728.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20150701050222", "https://vignette.wikia.nocookie.net/gossipgirl/images/5/55/101GossipGirl0346.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20150607080724", "https://vignette.wikia.nocookie.net/gossipgirl/images/3/34/102GossipGirl1270.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20150614092825", "https://vignette.wikia.nocookie.net/gossipgirl/images/b/ba/Ser2.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20150714075656", "https://vignette.wikia.nocookie.net/gossipgirl/images/6/67/106GossipGirl0179.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20150716035923", "https://vignette.wikia.nocookie.net/gossipgirl/images/9/96/106GossipGirl0869.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20150716035942", "https://vignette.wikia.nocookie.net/gossipgirl/images/7/73/404-blake-lively-jean-blazer.jpg/revision/latest/scale-to-width-down/180?cb=20101210194741", "https://vignette.wikia.nocookie.net/spotlightsimagestemporary/images/1/14/EN_Stranger_Things_Contest2_2019.JPG/revision/latest/zoom-crop/width/100/height/56?cb=20190712071113", "https://vignette.wikia.nocookie.net/universeconquest/images/3/38/UC_Wiki_Image.png/revision/latest/zoom-crop/width/100/height/56?cb=20190712164346", "https://vignette.wikia.nocookie.net/gossipgirl/images/9/90/110GossipGirl1143.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20150712094147", "https://static.wikia.nocookie.net/2fbf5a55-63f5-4606-9189-32c6541d4b76/scale-to-width-down/50", "https://vignette.wikia.nocookie.net/gossipgirl/images/5/5c/104GossipGirl1263.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20150701045941", "https://vignette.wikia.nocookie.net/gossipgirl/images/1/10/109GossipGirl0064.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20150707074232", "https://vignette.wikia.nocookie.net/gossipgirl/images/c/ca/Ser8.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20150713055747", "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D", "https://vignette.wikia.nocookie.net/gossipgirl/images/8/87/105GossipGirl0343.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20150716035909", "https://vignette.wikia.nocookie.net/gossipgirl/images/b/b6/104GossipGirl1294.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20150716035839", "https://vignette.wikia.nocookie.net/gossipgirl/images/7/73/Tumblr_mf9u4qYCbI1ro32tbo4_250.png/revision/latest/scale-to-width-down/220?cb=20121220020924", "https://vignette.wikia.nocookie.net/gossipgirl/images/c/c9/Ser7.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20150713055916", "https://vignette.wikia.nocookie.net/gossipgirl/images/7/77/106GossipGirl0478.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20150716035936", "https://vignette.wikia.nocookie.net/gossipgirl/images/e/e6/Svw1.jpg/revision/latest/scale-to-width-down/228?cb=20110319225157"], "top_img": "https://vignette.wikia.nocookie.net/gossipgirl/images/7/7f/Serena_in_Vogue_UK.jpg/revision/latest?cb=20160507192337", "keywords": [], "authors": [], "canonical_link": "https://gossipgirl.fandom.com/wiki/Serena_van_der_Woodsen", "title": "Serena van der Woodsen", "meta_data": {"viewport": "width=device-width, user-scalable=yes", "generator": "MediaWiki 1.19.24", "keywords": "Gossip Girl Wiki,gossipgirl,Serena van der Woodsen,Dan Humphrey,William van der Woodsen,Lily van der Woodsen,Eric van der Woodsen,Jenny Humphrey,Milo Humphrey,Scott Rosson,Lola Rhodes,Chuck Bass,CeCe Rhodes", "description": "Serena Celia Humphrey (née van der Woodsen) is a main character in the Gossip Girl series of novels and its television adaption, in which she is portrayed by Blake Lively. Throughout the series, Serena has an on-again, off-again relationship with Dan Humphrey and the two have the longest running...", "twitter": {"card": "summary", "site": "@getfandom", "url": "https://gossipgirl.fandom.com/wiki/Serena_van_der_Woodsen", "title": "Serena van der Woodsen | Gossip Girl Wiki | FANDOM powered by Wikia", "description": "Serena Celia Humphrey (née van der Woodsen) is a main character in the Gossip Girl series of novels and its television adaption, in which she is portrayed by Blake Lively. Throughout the series..."}, "fb": {"app_id": 112328095453510}, "og": {"type": "article", "site_name": "Gossip Girl Wiki", "title": "Serena van der Woodsen", "description": "Serena Celia Humphrey (née van der Woodsen) is a main character in the Gossip Girl series of novels and its television adaption, in which she is portrayed by Blake Lively. Throughout the series, Serena has an on-again, off-again relationship with Dan Humphrey and the two have the longest running relationship on the show. Dan and Serena finally get married in the series finale.", "url": "https://gossipgirl.fandom.com/wiki/Serena_van_der_Woodsen", "image": "https://vignette.wikia.nocookie.net/gossipgirl/images/7/7f/Serena_in_Vogue_UK.jpg/revision/latest?cb=20160507192337"}, "apple-itunes-app": "app-id=422467074, app-arguments=https://gossipgirl.fandom.com/wiki/Serena_van_der_Woodsen"}, "movies": [], "publish_date": null, "source": "http://gossipgirl.wikia.com", "summary": ""}