{"url": "https://en.wikipedia.org/wiki/Cobra_Kai", "text": "American web television series\n\nCobra Kai is an American comedy-drama web television series, based on The Karate Kid film series created by Robert Mark Kamen. The series was created for YouTube Premium by Jon Hurwitz, Hayden Schlossberg, and Josh Heald and stars William Zabka and Ralph Macchio reprising their roles from the films, who also serve as co-executive producers. It takes place 34 years after the original film and follows the reopening of the Cobra Kai karate dojo by Johnny Lawrence and the rekindling of his old rivalry with Daniel LaRusso.\n\nAll ten episodes of the first season were released on May 2, 2018. It received a positive response, with critics praising the performances of the series leads. The second season was released on April 24, 2019.[1] On May 2, 2019, YouTube renewed the series for a third season,[2] which is scheduled for a 2020 release.[3]\n\nPremise [ edit ]\n\nThe story of Cobra Kai is set 34 years after the original film and follows Johnny Lawrence, who opens the Cobra Kai karate dojo once again, and thus once again begins the rivalry he had with Daniel LaRusso. Daniel is finding it difficult to maintain balance in his life without Mr. Miyagi guiding him through. The show deals with how the two old rivals cope with the struggles they each face.\n\nJohnny opens a new Cobra Kai dojo that attracts a group of bullied nerds and social outcasts who find a camaraderie and self-confidence under his tutelage, but who take his aggressive philosophy too far, in particular his star pupil, Miguel Diaz. In contrast, Johnny's estranged son, Robby Keene, is also taken in by Daniel, who hires him at his car dealership, without any knowledge that Johnny is his father. Daniel eventually proves a positive influence to the boy, teaching him Mr. Miyagi's philosophy of balance. Meanwhile, Daniel's daughter, Samantha, is caught in the middle of these conflicts as she learns who her true friends are and a better path to follow.\n\nCast and characters [ edit ]\n\nMain [ edit ]\n\nRecurring [ edit ]\n\nJoe Seo as Kyler (season 1)\n\nAnnalisa Cochrane as Yasmine (season 1)\n\nBo Mitchell as Brucks (season 1)\n\nBret Ernst as Louie LaRusso Jr. (season 1)\n\nEd Asner as Sid Weinberg (season 1)\n\nHannah Kepple as Moon\n\nDan Ahdoot as Anoush Norouzi\n\nJonathan Mercedes as A. J. (season 1)\n\nSusan Gallagher as Lynn\n\nKwajalyn Brown as Sheila (season 1)\n\nGriffin Santopietro as Anthony LaRusso\n\nNichole Brown as Aisha Robinson\n\nVanessa Rubio as Carmen Diaz\n\nRose Bianco as Rosa Diaz\n\nDiora Baird as Shannon Keene\n\nErin Bradley Dangar as Counselor Blatt (season 1)\n\nTerayle Hill as Trey\n\nKen Davitian as Armand Zarkarian\n\nRandee Heller as Lucille LaRusso\n\nOwen Morgan as Bert\n\nAedin Mincks as Mitch (season 2)\n\nKhalil Everage as Chris (season 2)\n\nPaul Walter Hauser as Raymond AKA \"Stingray\" (season 2)\n\nPeyton List as Tory (season 2)\n\nNathaniel Oh as Nathaniel (season 2)\n\nCameron Markeles as Frank\n\nConnor Murdock as Kev\n\nDenzel K Williams as Caleb\n\nGabe Bowles as Tim\n\nA.J. Hicks as Edwin\n\nGuest [ edit ]\n\nDavid Shatraw as Tom Cole (\"Cobra Kai Never Dies\", season 1)\n\nKim Fields as Sandra Robinson (\"The Moment of Truth\", season 2)\n\nRob Garrison as Tommy (\"Take a Right,\" season 2)\n\nRon Thomas as Bobby (\"Take a Right,\" season 2)\n\nTony O'Dell as Jimmy (\"Take a Right,\" season 2)\n\nPat Morita, Elisabeth Shue, and Thomas Ian Griffith appear via archive footage from the film series as Mr. Miyagi, Ali Mills, and Terry Silver, respectively.\n\nEpisodes [ edit ]\n\nSeason Episodes Originally released 1 10 May 2, 2018 ( ) 2 10 April 24, 2019 ( )\n\nProduction [ edit ]\n\nDevelopment [ edit ]\n\nIn 2013, Macchio and Zabka made a guest appearance as themselves in the television sitcom How I Met Your Mother (\"The Bro Mitzvah\"). In the episode, Macchio is invited to Barney Stinson's bachelor party, leading to Barney shouting that he hates Macchio and that Johnny was the real hero of The Karate Kid. Towards the end of the episode, a clown in the party wipes off his makeup and reveals himself as Zabka.[4]\n\nOn August 4, 2017, it was announced that YouTube had greenlit a new series called Cobra Kai, with ten half-hour episodes. The series is written and executive produced by Josh Heald, Jon Hurwitz, and Hayden Schlossberg. Hurwitz and Schlossberg directed multiple episodes of the first season. The trio was joined by executive producers James Lassiter and Caleeb Pinkett of Overbrook Entertainment in association with Sony Pictures Television.[5]\n\nOn May 10, 2018, it was announced that YouTube had renewed Cobra Kai for a second season consisting of ten episodes. Production began in late 2018, with the season premiering in April 2019.[6]\n\nOn May 2, 2019, it was announced that YouTube had renewed the series for a third season, scheduled to premiere in 2020.[3]\n\nCasting [ edit ]\n\nAlongside the initial series announcement, it was reported that William Zabka and Ralph Macchio were cast in the series' lead roles reprising their characters of Johnny Lawrence and Daniel LaRusso, respectively, from the original film.[5] On October 24, 2017, the rest of the main cast was announced and included Xolo Maridueña, Mary Mouser, Tanner Buchanan, and Courtney Henggeler. It was also reported that Ed Asner would be appearing in a guest role as Sid Weinberg described as \"Johnny’s reluctant stepfather, an old-school, hard-nosed, former studio mogul, who is tired of dealing with his stepson’s failures.\"[7][8] On December 19, 2017, it was reported that Vanessa Rubio had joined the series in a recurring capacity.[9]\n\nOn May 24, 2018, it was announced that Martin Kove would reprise his role of John Kreese as a series regular in season two after previously making a cameo appearance in the role in the season one finale. Additionally, it was confirmed that Ralph Macchio, William Zabka, Xolo Mariduena, Tanner Buchanan, Mary Mouser, and Courtney Henggeler would return for the second season.[10] In October 2018, it was reported that Paul Walter Hauser and Peyton List had been cast in recurring roles in season two.[11][12] Sean Kanan also expressed his enthusiasm to reprise his role as Mike Barnes in the series if asked. [13]\n\nElisabeth Shue, who portrays Ali Mills in the first Karate Kid film, stated in an April 2019 interview with Decider that she is not certain whether or not she will join Cobra Kai, but is \"thinking about it.\"[14] In another interview, Shue added: \"In Karate Kid 2, my character was kind of pushed aside in a way that didn’t feel so great. So it’s funny how the idea of Ali coming back [started] … At first, I thought, “Well, her character really left the world of The Karate Kid in a way that wasn’t so great…would people care about her coming back?” She later added: “So I was interested in why they wanted Ali to come back in some ways ... I’ll see you know, how it goes … It makes me happy that people care about Ali — with an ‘i’\"[15] When speaking with Entertainment Tonight Canada, Shue said that an offer has been made and that \"Ali — with an ‘i’ may live once again.\"[16]\n\nFilming [ edit ]\n\nPrincipal photography for the first season began in October 2017 in Atlanta, Georgia. Filming took place at various locations throughout that month at places including Union City, Marietta, and the Briarcliff Campus of Emory University.[17] In November 2017, shooting moved to locales such as the North Atlanta Soccer Association Tophat fields in East Cobb.[18] In December 2017, the production was working out of Marietta and Conyers.[19] Various exterior shots were also filmed in parts of Los Angeles such as Tarzana and Encino.[20] Exterior locations included Golf N' Stuff in Norwalk and the South Seas Apartments in Reseda, both of which were originally featured in The Karate Kid.[21]\n\nPrincipal photography for season two began in September 2018 in Atlanta, Georgia with filming taking place at Pinewood Atlanta Studios.[22] In October 2018, production continued at Pinewood Atlanta Studios with shooting also occurring in Marietta.[23] In November 2018, the series was filming in Union City.[24] In December 2018, shooting transpired at the closed Rio Bravo Cantina restaurant in Atlanta.[25]\n\nRelease [ edit ]\n\nMarketing [ edit ]\n\nIn January 2018, the series was promoted at the annual Television Critics Association's winter press tour where YouTube's global head of original content Susanne Daniels described the show saying, \"It is a half an hour format but I would call it a dramedy. I think it leans into the tone of the movies in that there are dramatic moments throughout. I think it’s very faithful really in some ways to what the movie set about doing, the lessons imparted in the movie if you will. It’s next generation Karate Kid.\"[26]\n\nOn February 15, 2018, YouTube released the first teaser trailer for the series.[27] On March 1, 2018, a second teaser trailer was released.[28] A week later, a third teaser trailer was released.[29] On March 21, 2018, the official trailer was released which included the announcement that the show would premiere on May 2, 2018.[30]\n\nOn April 17, 2019, YouTube released a video parodying ESPN's 30 for 30, featuring the main cast members and select ESPN personalities analyzing the 1984 match between Daniel and Johnny.[31]\n\nPremiere [ edit ]\n\nThe series held its world premiere on April 24, 2018, at the SVA Theatre in New York City, New York, during the annual Tribeca Film Festival. Following the screening, a discussion was held with writers, directors, and executive producers Hayden Schlossberg, Jon Hurwitz, and Josh Heald, in addition to series stars and co-executive producers William Zabka and Ralph Macchio.[32]\n\nOn April 25, 2018, YouTube partnered with Fathom Events for special screenings of the first two episodes of the series at around 700 movie theaters across the United States. The event also included a screening of the original film.[33][34]\n\nReception [ edit ]\n\nCritical response [ edit ]\n\nThe first season of the series had a positive response from critics upon its premiere. On the review aggregation website Rotten Tomatoes, the first season holds a 100% approval rating with an average rating of 7.44 out of 10 based on 41 reviews. The website's critical consensus reads, \"Cobra Kai continues the Karate Kid franchise with a blend of pleasantly corny nostalgia and teen angst, elevated by a cast of well-written characters.\"[35] Metacritic, which uses a weighted average, assigned the season a score of 72 out of 100 based on 11 critics, indicating \"generally favorable reviews.\"[36]\n\nThe second season has also had a positive response. On the review aggregation website Rotten Tomatoes, the second season holds an 88% approval rating with an average rating of 7.49 out of 10 based on 24 reviews. The website critical consensus reads: \"While Cobra Kai's subversive kick no longer carries the same gleeful impact of its inaugural season, its second round is still among the best around – no amount of mid-life crisis and teenage ennui's ever gonna keep it down.[37] Metacritic, which uses a weighted average, assigned the season a score of 67 out of 100 based on 7 critics, indicating \"generally favorable reviews.\"[38]\n\nViewership [ edit ]\n\nYouTube has reported that the first episode, which was posted for free along with episode two, had been viewed 5.4 million times within the first 24 hours.[39] While it was noted that the response had been, in part, a result of YouTube releasing the episode for free, it was noted by Cinema Blend's Britt Lawrence that, \"YouTube Red's new series debuted to numbers that should make rival streaming services take notice.\"[40] By October 30, 2018, ahead of the second season premiere, YouTube was promoting the report that the first episode had then been viewed over 50 million times.[41]\n\nAwards and nominations [ edit ]\n\nSoundtracks [ edit ]\n\nSeason 1 [ edit ]\n\nMadison Gate Records released the official soundtrack on May 4, 2018.[49] La La Land Records released the physical version of the soundtrack with additional tracks in June 2018.[50]\n\nTrack listing [ edit ]\n\nAll music composed by Leo Birenberg and Zach Robinson.\n\nNo. Title Length 1. \"Awake the Snake\" 2:06 2. \"Ace Degenerate\" 1:25 3. \"Miyagi Memories\" 1:34 4. \"Strike First\" 1:06 5. \"Father and Son\" 0:38 6. \"50th Anniversary\" 1:00 7. \"The All-Valley Tournament\" 3:34 8. \"A Badass Name for a Dojo\" 0:37 9. \"Miyagi-Do\" 1:52 10. \"Slither\" 1:53 11. \"Cobra Guy\" 0:49 12. \"Balance\" 1:03 13. \"Speak Up, Lip\" 0:57 14. \"Stone vs. Diaz\" 1:40 15. \"Johnny's Story\" 2:28 16. \"You Earned It\" 0:51 17. \"Quiver\" 1:08 18. \"Venomous\" 1:15 19. \"Bonsai Lessons\" 1:50 20. \"Ophidiophobia\" 2:16 21. \"The Wrong Path\" 1:58 22. \"Final Match\" 1:48 23. \"The Cobra and the Mongoose\" 1:19 24. \"Time Out\" 1:35 25. \"No Mercy\" 1:14 26. \"Miyagi's Tomb\" 2:42 27. \"The New Champion\" 1:37 28. \"King Cobra\" 1:37 Total length: 43:53\n\nSeason 2 [ edit ]\n\nMadison Gate Records also released a second official soundtrack soundtrack on April 24, 2019, to accompany the second season.[51]\n\nTrack listing [ edit ]\n\nAll music composed by Leo Birenberg and Zach Robinson.\n\nNo. Title Length 1. \"Miyagi-Do Fix-Up\" 2:33 2. \"Snake Fight\" 2:19 3. \"The Wheel Technique\" 1:54 4. \"Like a Dance\" 3:12 5. \"The Internet\" 1:25 6. \"I Got Old\" 2:53 7. \"An Old Friend\" 1:25 8. \"Shochu-Geiko\" 1:24 9. \"Tory with a Y\" 1:58 10. \"Furious Hawk\" 1:11 11. \"Medal of Honor\" 1:24 12. \"Into the Snake Pit\" 2:26 13. \"Military Exercise – Who's Gonna Break\" 2:13 14. \"New Students\" 0:59 15. \"Fatherly Advice\" 1:48 16. \"Mall Fight\" 1:39 17. \"You're the Champ\" 1:34 18. \"We Are All Miyagi-Do\" 2:48 19. \"Busted\" 0:49 20. \"Worthy Opponent\" 2:12 21. \"Kan-Geiko\" 1:04 22. \"Sam and Robby\" 1:24 23. \"Mercy and Honor\" 2:23 24. \"Apartment Skirmish\" 1:06 25. \"Black Paint on a White Wall\" 1:40 26. \"I'm Coming for You, Bitch\" 1:38 27. \"Hallway Hellscape\" 3:37 28. \"Scale the School\" 0:51 29. \"Hawk's Prey\" 1:29 30. \"Rematch\" 2:08 31. \"Fallen Soldier\" 2:39 32. \"Voicemail\" 1:00 33. \"In It No Matter What\" 1:39 34. \"It Belongs to Me\" 3:20 35. \"Cruel Summer\" (Kari Kimmel) 2:25 Total length: 66:11", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/d/d6/CobraKaiTitleScreen.png", "https://upload.wikimedia.org/wikipedia/en/thumb/d/d6/CobraKaiTitleScreen.png/250px-CobraKaiTitleScreen.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/3/37/Cobra_Kai_season_2_soundtrack_cover.jpg/220px-Cobra_Kai_season_2_soundtrack_cover.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/d/d6/CobraKaiTitleScreen.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Cobra_Kai", "title": "Cobra Kai", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.11", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/d/d6/CobraKaiTitleScreen.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}