{"url": "https://www.thebalancecareers.com/how-to-become-a-victoria-s-secret-model-2379407", "text": "For many models, slipping on a pair of Angel wings is the ultimate dream. Becoming a Victoria’s Secret Angel means you’ll be joining the ranks of superstars like Tyra Banks, Heidi Klum, Helena Christensen, Stephanie Seymour, Gisele Bundchen, and Adriana Lima. The fashion show, the travel, the lucrative contracts—who wouldn’t want to be part of such an elite club?\n\nBut beyond the heavenly bodies, glowing skin, and girl-next-door sexiness, what does it take to be a Victoria’s Secret Angel? And how do you become one? The answer isn’t one-size-fits-all (it never is in the modeling world), but there are a few things you can do to increase your chances.\n\nThe Balance/Ashley DeLeon\n\nMeet the Basic Requirements\n\nAs with all modeling gigs, there are no hard rules when it comes to basic physical requirements. But in general, aspiring Victoria’s Secret Angels must:\n\nBe between the ages of 18 and 30 (yes, it’s okay to be a little “older”)\n\nBe healthy and in great shape\n\nHave a slim build, yet be slightly more voluptuous than a typical runway model (34-24-34, give or take an inch, is the industry standard)\n\nBe between 5’8’’ and 6’0’’\n\nGet Signed by a Major Agency\n\nVictoria’s Secret only accepts submissions regarding modeling jobs through leading modeling agencies or through other established business relationships. In other words, if you aren’t signed to a major agency, your chances of becoming a Victoria’s Secret model are pretty much zero.\n\nYou’ll have the best chance of getting noticed if you’re signed with Ford or Elite Models in New York City. Victoria’s Secret has a long-standing arrangement with these agencies, and they’re the first place the lingerie brand looks for new models. But that doesn’t mean you absolutely have to be with these agencies.\n\nAs long as you’re with a well-known agency, preferably in New York City, you’ll still have a chance of being considered.\n\nIf you are signed to a big-name agency like Ford or Elite, the next step is to make sure they’re doing everything possible to fulfill your dream of becoming a Victoria’s Secret model. As Taylor Hill told Fashionista.com, “Since I signed with IMG, their goal for me has always been Victoria's Secret; they've been grooming me for it. When I turned 18 and the opportunity came around, they were like, 'You're obviously going to the casting!'”\n\nAttend a Victoria's Secret Casting\n\nBefore each fashion show, the lingerie mega-brand holds a casting session for runway superstars. Invited aspiring catwalkers and current Victoria’s Secret models (yes, even the contracted girls have to prove themselves each season!) show off their personalities and toned bodies in front of Victoria’s Secret’s executive producers, a casting director, and a creative director.\n\nAnd while being cast doesn’t automatically make you an Angel (nearly 50 models strut their stuff in the annual Victoria’s Secret Fashion Show, but only a few are classified as Angels), it is a major step in the right direction.\n\nJust look at Taylor Hill, Stella Maxwell, Sara Sampalo, Elsa Hosk, and Lily Aldridge. These lovely ladies all appeared in one or more Victoria’s Secret fashion shows before being made official Angels.\n\nOutperform Hundreds of Hopefuls\n\nThat’s right—perform. Victoria’s Secret Angels do much more than making lingerie look fantastic. They’re brand ambassadors for the company, which means they’re media-savvy celebrities who have to work their personalities just as much as their bodies. They have to be spunky, approachable, relatable (a lot of Angels are mothers), and responsible (their contracts are rumored to have a morality clause, which means there’s zero tolerance for all-night antics and showing up late). What’s more, they have to document their healthy and active lifestyles on social media.", "images": ["https://www.thebalancecareers.com/thmb/0Z_gJMkcp10CynOVZ6CMPw-ON7M=/1024x683/filters:fill(auto,1)/GettyImages-626284222-58bdc92c3df78c353caee598.jpg", "https://www.thebalancecareers.com/thmb/Nx8sM88OR-hqet04yRZJaJ2n228=/300x200/filters:saturation(0.2):brightness(10):contrast(5):no_upscale()/GettyImages-626284222-58bdc92c3df78c353caee598.jpg", "https://:0"], "top_img": "https://www.thebalancecareers.com/thmb/0Z_gJMkcp10CynOVZ6CMPw-ON7M=/1024x683/filters:fill(auto,1)/GettyImages-626284222-58bdc92c3df78c353caee598.jpg", "keywords": [], "authors": ["Vanessa Helmer"], "canonical_link": "https://www.thebalancecareers.com/how-to-become-a-victoria-s-secret-model-2379407", "title": "How to Become a Victoria's Secret Model", "meta_data": {"robots": "NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "Got sexy curves, a spunky personality and are social media savvy? Follow these tips and you could become the next Victoria's Secret Angel Model.", "sailthru.tags": "thebalancecareers,career-paths,entertainment-careers,modeling-careers", "article": {"section": "The Balance", "author": "https://www.facebook.com/thebalancecom"}, "fb": {"app_id": 157552701605251}, "og": {"type": "article", "site_name": "The Balance Careers", "url": "https://www.thebalancecareers.com/how-to-become-a-victoria-s-secret-model-2379407", "title": "Here Are Some Tips on How to Become a Victoria's Secret Model", "description": "Got sexy curves, a spunky personality and are social media savvy? Follow these tips and you could become the next Victoria's Secret Angel Model.", "image": "https://www.thebalancecareers.com/thmb/0Z_gJMkcp10CynOVZ6CMPw-ON7M=/1024x683/filters:fill(auto,1)/GettyImages-626284222-58bdc92c3df78c353caee598.jpg"}, "twitter": {"card": "summary", "site": "@thebalance", "title": "Here Are Some Tips on How to Become a Victoria's Secret Model", "description": "Got sexy curves, a spunky personality and are social media savvy? Follow these tips and you could become the next Victoria's Secret Angel Model.", "image": "https://www.thebalancecareers.com/thmb/0Z_gJMkcp10CynOVZ6CMPw-ON7M=/1024x683/filters:fill(auto,1)/GettyImages-626284222-58bdc92c3df78c353caee598.jpg"}, "lotame": {"tax3": "balcar_modeling-careers", "tax2": "balcar_entertainment-careers", "tax1": "balcar_career-paths", "tax0": "bal"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/3.52.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/3.52.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/3.52.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/3.52.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/3.52.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://www.thebalancecareers.com", "summary": ""}