{"url": "https://en.wikipedia.org/wiki/Donald_Glover", "text": "\"Don Glover\" redirects here. For the Arkansas politician, see Don Edward Glover\n\nAmerican actor, rapper, comedian and film, television and record producer\n\nDonald McKinley Glover Jr. (born September 25, 1983) is an American actor, comedian, writer, producer, director, musician, and DJ. He performs music under the stage name Childish Gambino and as a DJ under the name mcDJ.\n\nAfter coming to public attention for his work with Derrick Comedy while a student at New York University, he was hired at age 23 by Tina Fey as a writer for the NBC sitcom 30 Rock. He later portrayed community college student Troy Barnes on the NBC sitcom Community. He stars in the FX series Atlanta, which he created and occasionally directs.[1] For his work on Atlanta, Glover won various accolades, including Primetime Emmy Awards for Outstanding Lead Actor in a Comedy Series and Outstanding Directing for a Comedy Series,[2] and Golden Globe Awards for Best Television Series – Musical or Comedy and Best Actor – Television Series Musical or Comedy.[3] In film, Glover has appeared in Mystery Team (2009), The Lazarus Effect, Magic Mike XXL, The Martian (2015), Spider-Man: Homecoming (2017) and as the young Lando Calrissian in Solo: A Star Wars Story (2018).[4] Glover starred in and produced his own short film, Guava Island (2019). He will also provide the voice of the adult Simba in a remake of the Disney film The Lion King (2019).\n\nAfter several self-released albums and mixtapes, Glover signed to Glassnote Records in 2011.[5] He released his first studio album, Camp, on November 15, 2011, to generally positive reviews. His second studio album, Because the Internet, was released on December 10, 2013.[6] Glover's third album, \"Awaken, My Love!\", was released on December 2, 2016, spawning the single \"Redbone\", which peaked at number 12 on the Billboard Hot 100,[7] and eventually earned him a Grammy Award for Best Traditional R&B Performance. In 2017, Glover was included on the annual Time 100 list of the most influential people in the world.[8] In May 2018, Glover released the song and video for \"This Is America\", which debuted at number-one on the Hot 100. The song was nominated and won four Grammy Awards at the 61st Annual Grammy Awards: Record of the Year, Song of the Year, Best Rap/Sung Performance and Best Music Video.[9] In early July 2018, Glover's EP Summer Pack was released which included the Grammy nominated for Best R&B Song song \"Feels Like Summer\".[10]\n\nEarly life\n\nDonald McKinley Glover Jr.[11] was born on September 25, 1983 at Edwards Air Force Base, California.[12] He was raised in Stone Mountain, Georgia. His mother, Beverly (née Smith),[13] is a retired daycare provider, and his father, Donald Glover Sr.,[14] was a retired postal worker.[15] His parents also served as foster parents for 14 years. Glover was raised as a Jehovah's Witness.[12][16] His younger brother, Stephen, would later become a writer and producer who collaborates with him.[17] He also has a sister named Brianne.[18] Glover attended Lakeside High School and DeKalb School of the Arts, and was voted \"Most Likely to Write for The Simpsons\" in his high school yearbook.[19][20] In 2006, he graduated from the New York University Tisch School of the Arts with a degree in Dramatic Writing.[21] While at Tisch, he self-produced the independent mixtape The Younger I Get, which was not released and was later disowned by Glover for being the \"too-raw ramblings\" of what he calls a \"decrepit Drake\".[22] He also began DJing and producing electronic music under the moniker MC D—later as mcDJ[23]—remixing Sufjan Stevens' album Illinois (2005).[24]\n\nCareer\n\n2006–2010: Derrick Comedy, Community, and mixtapes\n\nIn 2006, Glover was contacted by producer David Miner, to whom he sent writing samples including a spec script that he had written for The Simpsons. Miner and Tina Fey were impressed by Glover's work and invited him to become a writer for 30 Rock, an NBC sitcom. Shortly after he was contacted by a close personal friend in the music industry. He was given the chance to sing and produce music by industry insider Jonny Music.[15][20] Glover was a writer for 30 Rock from 2006 to 2009, where he also had occasional cameo appearances. He was presented the Writers Guild of America Award for Best Comedy Series at the February 2009 ceremony for his work on the third season.[25] Glover's musical stage name, Childish Gambino, came from the Wu-Tang Clan's name generator.[26][27] In June 2008, he released the independent mixtape Sick Boi.[22] In 2008, Glover unsuccessfully auditioned to play President Barack Obama on the sketch comedy program Saturday Night Live;[28] the role went to cast member Fred Armisen.[29] Glover also became a member of the sketch comedy group Derrick Comedy, having appeared in their sketches on YouTube since 2006, along with Dominic Dierkes, Meggie McFadden, DC Pierson, and Dan Eckman. The group wrote and starred in a feature-length film, Mystery Team, released in theaters in 2009.[30] Bobby Moynihan and Aubrey Plaza also starred in the film alongside Glover.\n\nCommunity at Glover at a panel forat PaleyFest 2010\n\nGlover became known to a wider audience with Dan Harmon's NBC sitcom Community, which premiered in September 2009. Glover played Troy Barnes, a former high school star quarterback who quickly abandons his former jock mentality and embraces his nerdy, childish side as the result of his friendship with Abed Nadir (played by Danny Pudi).[31] Glover did not return as a full-time cast member for the show's fifth season, appearing in the first five of the season's 13 episodes.[32] Despite speculation that he was leaving to pursue his rap career as Childish Gambino, a series of hand-written notes that Glover posted to Instagram revealed that his reasons were more personal, citing a need for projects that offered him more independence as he worked through some personal issues.[33] Although Harmon approached Glover about returning to the show for its sixth season, Glover declined, stating both show and audience would be better served by the closure of his character omitted from the story.[34]\n\nIn September 2009, he released his second mixtape Poindexter.[22] A pair of mixtapes, titled I Am Just a Rapper and I Am Just A Rapper 2, were released in close succession in 2010 and followed that July by his fifth mixtape Culdesac.[35] In March 2010, Glover performed a 30-minute set on the stand-up showcase program Comedy Central Presents.[36]\n\nIn May 2010, a fan suggested Glover for the role of Peter Parker in the then-upcoming The Amazing Spider-Man film, encouraging his supporters to retweet the hashtag \"#donald4spiderman\".[37] The campaign, originally started to see how far social networking could carry a message, quickly gained a large following.[38] The call for Glover to be allowed to audition for the role was supported by Spider-Man creator Stan Lee.[39] Glover was not given an audition and the role instead went to Andrew Garfield. He later revealed that he was never contacted for the role by anyone from Sony Pictures. Comics writer Brian Michael Bendis, who announced Miles Morales, an African-American version of Spider-Man, a year later, said he had conceived of the character before Glover's campaign went viral.[40] Bendis gave credit to Glover for influencing the new hero's looks for Spider-Man; Bendis has said, \"I saw him in the costume [on Community] and thought, 'I would like to read that book.'\"[41] Glover later voiced this incarnation of Spider-Man on the Ultimate Spider-Man animated series.[42] Glover received the Rising Comedy Star award at the Just for Laughs festival in July 2010 and was featured in Gap's 2010 holiday advertising campaign.[43][44]\n\n2011–2014: Camp and Because the Internet\n\nHis first extended play, titled EP, was released as a free digital download in March 2011.[45] A music video for the song \"Freaks and Geeks\" was released in that month and Glover hosted the mtvU Woodie Awards, held live at South By Southwest.[46][47] Glover commenced his nationwide IAMDONALD Tour in April.[46] The tour was a one-man live show that consisted of rap, comedy, and video segments.[46][48] Glover appeared at the 2011 Bonnaroo Music Festival as both Childish Gambino and as a comedian, performing a set with Bill Bailey.[49] His one-hour stand-up special, Weirdo, aired on Comedy Central in November 2011.[50] Glover worked with friend and film composer Ludwig Göransson on his debut studio album throughout 2011.[51] Prior to its release, Glover signed to Glassnote Records and embarked on The Sign-Up Tour.[52] The album, Camp, was released on November 15, 2011, backed by his debut single \"Bonfire\" and \"Heartbeat\", which peaked at number 18 on the Bubbling Under Hot 100 Singles and number 54 on Hot R&B/Hip-Hop Songs.[53] Camp debuted at number eleven on the Billboard 200, selling 52,000 copies in the first week,[54] and was generally well received by critics,[55] with PopMatters writer Steve Lepore finding it to be \"undoubtedly one of the best records of any genre to come out in 2011\".[56] His Camp Gambino tour was scheduled to commence in March 2012,[57] but was postponed to April after fracturing his foot.[58]\n\nGlover released the songs \"Eat Your Vegetables\" and \"Fuck Your Blog\" through his website in April and May.[59] Throughout May and June, he premiered tracks from his sixth mixtape, Royalty, which was released as a free digital download in July. The album featured several artists, including his brother Stephen, under the alias Steve G. Lover III.[60] The single \"Trouble\" by British artist Leona Lewis from her album Glassheart (2012) featured Gambino with a guest rap performance. The song peaked at No. 7 on the UK Singles Chart, making it his first UK top 10 single.[61] In November 2012, Ludwig Göransson said he and Glover were in his studio coming up with new ideas for the next album which was to be \"bigger\" and \"with more people involved.\"[62] In 2013, Glover signed on to create a music-themed show for FX titled Atlanta which he would star in, write, and executive produce. Consequently, Glover decided to reduce his work for NBC, and only appeared in the first five episodes of Community's fifth season.[63] Although several networks were interested in picking up his half-hour comedy, he ultimately picked FX due to their willingness to work around his touring schedule.[63] Glover appeared in a supporting role in the romantic comedy The To Do List (2013) and also guest starred in two episodes of the comedy-drama television series Girls in early 2013, as a Republican who is the love interest to Lena Dunham's character.[64][65]\n\nRecording for his second studio album, Because the Internet, finished in October 2013 and it was released in December,[66][67] debuting at number seven on the Billboard 200 chart.[53] Because the Internet yielded the singles \"3005\", \"Crawl\" and \"Sweatpants\". \"3005\" peaked at number 8 on the UK R&B Chart and 64 on the Billboard Hot 100.[53] To promote the album, the short film Clapping for the Wrong Reasons, written by and starring Glover, was released prior to the album's release and serves as its prelude. Additionally, a 72-page screenplay designed to sync up with the album was also released.[68] Because The Internet has been certified gold by the Recording Industry Association of America for shipping over 500,000 copies.[69] From February to May 2014, he embarked on The Deep Web Tour.[70] The Recording Industry Association of America certified \"Heartbeat\" gold in June 2014–making it Glover's first gold certification.[71]\n\nGlover directed the music video for the song \"The Pressure\" by Jhené Aiko, whose previous single, \"Bed Peace\", had featured a guest appearance by Glover.[72] On October 2, he released a mixtape titled STN MTN and the following day an EP titled Kauai, which spawned the single \"Sober\". While STN MTN was a free download, the proceeds of Kauai went to changing the policies for body worn video policing equipment and to maintaining and preserving Kauai island.[73] Glover described them as a joint project and the \"first concept mixtape ever\" that continues the story told in Camp and Because the Internet.[74] At the 57th Annual Grammy Awards, Glover received his first Grammy nominations for Best Rap Album for Because the Internet and Best Rap Performance for \"3005\".[6]\n\n2015–17: Film roles, Atlanta, and \"Awaken, My Love!\"\n\nGlover appeared in three films in 2015. In the science fiction horror The Lazarus Effect, he played a scientist working with a team of researchers who brings a member of the team back to life with consequences.[75] Glover played a singer in the comedy-drama Magic Mike XXL and performed a cover of the Bruno Mars song \"Marry You\" in the film, which was included in the soundtrack.[76] His final release of the year, Ridley Scott's science fiction The Martian, featured Glover as a Jet Propulsion Laboratory astrodynamicist who formulates a maneuver to help rescue an astronaut (played by Matt Damon) stranded on Mars.[77] Glover contributed to the soundtrack of Creed (2015) – a film in the Rocky film series which was composed by Ludwig Göransson – providing vocals to the song \"Waiting For My Moment\" and co-wrote another titled \"Breathe\".[78]\n\nFX ordered the pilot of Glover's show Atlanta to a 10-episode season in October 2015 and it premiered on September 6, 2016 to widespread critical acclaim.[79][80][81] Glover writes, occasionally directs, executive produces, and stars in the series as Earnest \"Earn\" Marks, a Princeton dropout who manages his rapper cousin as they navigate their way in the Atlanta rap scene.[82] For his work on the show, Glover has been awarded various accolades, including Golden Globe Awards for Best Television Series – Musical or Comedy and Best Actor – Television Series Musical or Comedy and Primetime Emmy Awards for Outstanding Lead Actor in a Comedy Series and Outstanding Directing for a Comedy Series, making him the first black person to win an Emmy for the latter category.[3][83][84] Due to the success of the series, FX signed Glover to an exclusive deal to create and develop more shows for the network. The first of these shows, an animated series featuring the Marvel Comics character Deadpool, written and executive produced by Glover and his brother Stephen, was set to premiere in 2018,[85] but was later canceled due to creative differences.[86] Glover later posted an unofficial and unproduced script to his Twitter account, stating he wasn't \"too busy to work on Deadpool,\" shutting down media speculations.[87]\n\nIn September 2016, Glover held three performances – known as the \"Pharos Experience\" – in Joshua Tree, California, where he debuted songs from his third studio album \"Awaken, My Love!\".[88] The album was released in December, charting at number five on the Billboard 200 and it was later certified platinum accumulating 1,000,000 in album-equivalent units.[89][53][69] Considered a bold departure from his usual hip hop style as it primarily featured Glover singing rather than rapping, it saw him draw influences from psychedelic soul, funk and R&B music,[90][91] particularly of the funk band Funkadelic.[92] \"Awaken, My Love!\" produced the singles \"Me and Your Mama\", \"Redbone\" (which peaked at number 12 on the Billboard Hot 100), and \"Terrified\".[7] Its vinyl release featured a virtual reality headset and an accompanying app that allowed owners access to virtual reality live performances from the Pharos Experience.[93] The album was positively received by music critics and was nominated for both the 2018 Grammy Award for Album of the Year and Best Urban Contemporary Album, while \"Redbone\" won for Best Traditional R&B Performance and received nominations for Record of the Year and Best R&B Song.[94][95] Glover performed \"Terrified\" at the award show's 60th ceremony.[96]\n\nGlover played Aaron Davis in the superhero film Spider-Man: Homecoming (2017). Davis is the uncle of the Miles Morales version of Spider-Man, whom Glover had voiced in the Ultimate Spider-Man animated series. The casting was described as \"a surprise treat for fans\" by the film's director Jon Watts, aware of his 2010 campaign to play the superhero.[97] In April 2017, Time named Glover to its annual \"100 Most Influential People in the World.\" Tina Fey wrote the entry on Glover, who she said \"embodies his generation's belief that people can be whatever they want and change what it is they want, at any time.\"[8]\n\nGlover announced his intention to retire the Childish Gambino pseudonym in June 2017, telling the audience \"I'll see you for the last Gambino album\" before walking off stage at the Governors Ball Music Festival.[98] He further explained his decision in an interview, feeling his musical career was no longer \"necessary\" and added \"There's nothing worse than like a third sequel\" and \"I like it when something's good and when it comes back there's a reason to come back, there's a reason to do that.\"[99] He has yet to officially retire.\n\n2018: This Is America, continued musical and acting success\n\nGlover signed with RCA Records in January 2018, which Glover called \"a necessary change of pace\".[100][101] In May 2018, he released a single titled \"This Is America\" while performing dual hosting and musical duty on Saturday Night Live.[101] The song debuted at number one, becoming both Glover's first number one and top ten single in the United States.[102] It features him both singing and rapping, drawing influence from trap music.[103] Its lyrics addressed a variety of topics including gun violence in the United States and being black in the United States,[104] while its provocative video, directed by Japanese filmmaker and frequent collaborator Hiro Murai, featured Glover performing a series of shootings before breaking into dance.[105]\n\nGlover portrayed a young version of Lando Calrissian in Solo: A Star Wars Story (2018); Calrissian was previously played by Billy Dee Williams in two films in the original Star Wars trilogy.[106] Glover will star in the upcoming 2019 remake of the epic musical Disney film The Lion King (1994) as the voice of Simba, the titular protagonist and lion prince turned king.[107] Glover said that \"[The Lion King is] a timeless story, but [he thinks] the way Favreau has constructed it, it’s a very timely story as well\" and said that \"[he] just wanted to be a part of a global good\".[108] Glover said that the film will focus more on Simba's time growing-up than the original film did, stating that \"[Jon] was very keen in making sure we saw [Simba's] transition from boy to man and how hard that can be when there's been a deep trauma\".[108] JD McCrary, who plays young Simba in the film, said that \"Donald Glover is so talented that [he] actually did have to take it into consideration, because if Simba is going to grow up to be some sort of figure and you know of it, you have to keep that motive\".[108]\n\nOn July 11, 2018, Glover released the EP Summer Pack which contained the songs \"Summertime Magic\" and \"Feels Like Summer\", the former of which is the lead single from Glover's forthcoming fourth studio album.[109][110] “Summertime Magic” debuted at forty-four on the Billboard Hot 100.[111] The music video for \"Feels Like Summer\" was released on September 1, 2018, and features cartoon cameos from numerous prominent rappers and R&B vocalists. The video is meant to symbolize Glover's departure from the rap community[112] and depicts his animated rendition as he walks down a neighborhood street, passing by several big names like Will Smith, Nicki Minaj, Travis Scott, Kanye West, Beyoncé, Lil Wayne, and Michael Jackson.[113]\n\nIn August 2018, it had been reported that Glover had been filming a secret project in Cuba titled Guava Island throughout that summer alongside Rihanna. The exact details of the project were unknown.[114] A trailer for the project premiered on November 24, 2018 at the PHAROS festival in New Zealand.[115]\n\nIn September 2018, Glover made two previously unreleased songs, \"Algorhythm\" and \"All Night\", exclusively available to fans who bought tickets to his This Is America Tour.[116]\n\nIn December 2018, Glover was featured in 21 Savage's album I Am > I Was on the track 'Monster' but wasn't credited.[117] It was on this track that Glover talks about what is wrong with the music industry and why he wants to quit music. In the song, Glover raps 'Might pull out, the game so weak', 'If you're rapping for money you silly', and even 'Power, the money, and the fame make a monster'. It is here he talks about being sick of the music industry and what it does to the people in it.[117]\n\nIn February 2019, \"This is America\" won a Grammy for Song of the Year and Record of the Year. It was the first rap song to win Record of the Year.[118] It had also won Grammys for two other categories, Best Music Video and Best Rap/Sung Performance.[119]\n\n2019–present: Guava Island\n\nGuava Island was released on April 13, 2019, by Amazon Studios through Amazon Prime Video. It stars Glover and Rihanna in the lead roles. It premiered at Coachella and was streamed in its entirety on their YouTube page and Twitch.[120] It was available to view for free for 18 hours on the Amazon Prime Video app.[121] Glover was co-headlining at the event as Childish Gambino. On Rotten Tomatoes, the film has an approval rating of 77% based on reviews from 26 critics, with an average rating of 6.46/10.[11] On Metacritic, it has a weighted average score of 65 out of 100, based on 6 reviews, indicating \"generally favorable\" reviews.[12]\n\nOn April 18, 2019, Glover and Adidas Originals officially announced three new Adidas shoes along with the release of a series of advertisements/short films starring comedian Mo'Nique and a cameo of professional skateboarder Na-Kel Smith. It was directed by Ibra Ake and produced by Sylvia M. Zakhary, Wolf Taylor, Fam Rothstein, and Stephen Glover. The partnership is coined \"Donald Glover Presents\" and it began in September 2018. The shoes was available globally on April 26.[122][123][124]\n\nGlover premiered a new song, \"Algorythm\", in partnership with app PHAROS AR – a new augmented reality application released on April 24, to Android and iOS users.[125]\n\nInfluences\n\nIn an interview with The Guardian Glover stated, \"I'm influenced by LCD Soundsystem as much as Ghostface Killah. A lot of the rap shows I saw as a kid were boring, but if you went to a Rage Against the Machine show or a Justice show, the kids were losing their minds. Kids just want to go nuts, Odd Future know that. People want to experience something physical.\"[126] Glover also cites hip hop duo Outkast and trio Migos,[127][128] and funk band Funkadelic as being influences.[129]\n\nGlover has also influenced a number of younger musicians and actors alike. Rapper Vince Staples talks of Glover's ability to constantly reinvent himself while actor and writer Naren Weiss cites his versatility as a source of inspiration.[130][131][132]\n\nPersonal life\n\nGlover keeps his personal life very private and has not posted on social media often since 2014, only posting promotions. Glover expressed that he “felt like social media was making me less human, and I already didn’t feel that human.”[133]\n\nGlover announced in January 2017 that he and his partner, Michelle White,[134] had a son named Legend in early 2016.[135][136][137] In September, he announced that he and White were expecting a second son,[138] who was born in January 2018.[139]\n\nOn December 17, 2018, during the final stop for the This is America Tour, Glover announced that his father, Donald Glover Sr., had died. He said, \"I lost my father a couple weeks ago and I wanted to play him some of the new songs but he didn't want to hear them, because he was like, 'I know they're going to be great.'\"[140][141]\n\nAwards\n\nDiscography\n\nTours\n\nIAMDONALD Tour (2011)\n\nThe Sign-Up Tour (2011)\n\nCamp Gambino Tour (2012)\n\nDeep Web Tour (2014)\n\nThis Is America Tour (2018)\n\nFilmography\n\nFilm\n\nTelevision\n\nMusic videos\n\nWeb\n\nYear Title Role Notes 2006–2010 Derrick Comedy videos Various characters Also writer, composer and executive producer 2009 I Am Tiger Woods Tiger Woods Funny or Die short[147] 2012 Community: Abed's Master Key Troy Barnes (voice) Webisode", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Blue_pencil.svg/10px-Blue_pencil.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/92/Childish_Gambino_at_SXSW_2014_%28Cropped_Version%29.jpg/185px-Childish_Gambino_at_SXSW_2014_%28Cropped_Version%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2a/Donald_Glover_TIFF_2015.jpg/1200px-Donald_Glover_TIFF_2015.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2a/Donald_Glover_TIFF_2015.jpg/220px-Donald_Glover_TIFF_2015.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/27px-Wikidata-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/02/DonaldGloverMar10.jpg/170px-DonaldGloverMar10.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d8/Childish_Gambino-Bowery_Ballroom-1.jpg/220px-Childish_Gambino-Bowery_Ballroom-1.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2a/Donald_Glover_TIFF_2015.jpg/1200px-Donald_Glover_TIFF_2015.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Donald_Glover", "title": "Donald Glover", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.11", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2a/Donald_Glover_TIFF_2015.jpg/1200px-Donald_Glover_TIFF_2015.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}