{"url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/11/28/for-the-first-time-in-grammy-history-a-white-man-isnt-nominated-for-album-of-the-year/", "text": "Before the 2018 Grammy nominations were announced Tuesday, many prognosticators thought the race for album of the year would boil down to two artists: British pop star Ed Sheeran for “÷ (Divide)” and rapper Kendrick Lamar for “DAMN.”\n\nSure enough, Lamar’s record made the list, along with Childish Gambino (“Awaken, My Love!”); Jay-Z (“4:44″); Lorde (“Melodrama”); and Bruno Mars (“24K Magic”). But Sheeran was nowhere to be found, much to the devastation of his fans — although “÷ (Divide)” did land a nod for best pop vocal album.\n\nSoon, the absence of Sheeran’s expected nomination led to a Twitter “moment,” as the social media platform announced that the “Grammys album category has no white men for the first time in 19 years.”\n\nHowever, that depends on how you look at the alternative rock band Garbage: While Shirley Manson is the lead singer, the group also includes Butch Vig, Duke Erikson and Steve Marker. (In fact, Manson was the last member to join the band.) So if you count Garbage and search through every other album of the year category since the Grammys started in 1959, this actually marks the first time in history that no white men have been nominated for the night’s biggest prize.\n\nThis is especially notable for the Grammys, which saw lots of criticism last year when Adele’s “25” won over Beyoncé’s “Lemonade.” The year before that, Taylor Swift’s “1989” beat Lamar’s “To Pimp a Butterfly.” And the year before that, Beyoncé’s self-titled album lost to Beck’s “Morning Phase.”\n\n[Kanye wasn’t joking, tells E! that ‘Beck needs to respect artistry and he should have given his award to Beyoncé’]\n\n“For the past five years, black artists have been making era-defining pop music, some of which has been nominated for the heaviest Grammy in the land, album of the year,” Washington Post music critic Chris Richards wrote after last year’s show. “Then, when ‘music’s biggest night’ eventually rolls around, each and every one of these artists loses to a white act doing less-challenging, less-timely, less-imaginative work.”\n\nIn an interview Tuesday with Variety, Recording Academy president Neil Portnow acknowledged the diversity of this year’s nominees and credited it to the large pool of voting members; there are about 13,000 overall. Plus, the Grammys opened up online voting for the first time this year, which led to a wider range of ballots than usual.\n\n“The results are reflecting the music of the times — hip-hop and urban music is pervasive in our society worldwide — not just in America,” Portnow said. “So when that continues to be evident and evolve, this is a reflection of that.”\n\nHe also explained that Sheeran being relegated to the pop album category is not necessarily a snub but simply indicative of where the voters thought he belonged.\n\n“In terms of Ed and the recordings he made, certainly our voters thought highly of him and he is nominated [for two awards]. In terms of where he’s nominated, that’s our members’ call and I have to respect that,” Portnow added.\n\nThe Grammy Awards will air Jan. 28 on CBS.\n\nRead more:\n\n2018 Grammy nominees: Jay-Z leads with eight, followed by Bruno Mars and Kendrick Lamar\n\nPerspective | Jay-Z leads this year’s Grammy nominations. Hip-hop hooray?\n\nAnalysis | Adele bests Beyoncé and the Grammys reach peak irrelevance", "images": ["https://www.washingtonpost.com/resizer/b6jp8ifQFvU8IyzuBmSG0PPHiA8=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ZTMWQPC2FE3V7CXTXC2EGFL3HQ.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=3005617&cv=2.0&cj=1", "https://www.washingtonpost.com/resizer/yAFxThroW-CI5t-yu8Q6FsF7kHI=/1x1/www.washingtonpost.com/pb/resources/img/spacer.gif", "https://me.effectivemeasure.net/em_image", "https://www.washingtonpost.com/resizer/TXJKur-cQ3m4AF9lqk_kkjfemkk=/3x2/www.washingtonpost.com/pb/resources/img/spacer.gif"], "top_img": "https://www.washingtonpost.com/resizer/b6jp8ifQFvU8IyzuBmSG0PPHiA8=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ZTMWQPC2FE3V7CXTXC2EGFL3HQ.jpg", "keywords": [], "authors": ["Emily Yahr", "Style Reporter Covering Pop Culture", "November", "Emily Yahr Is An Entertainment Reporter For The Washington Post. She Joined The Post In", "Has Previously Written For The Boston Globe", "Usa Today", "The Lexington", "Ky.", "Herald-Leader", "The American Journalism Review."], "canonical_link": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/11/28/for-the-first-time-in-grammy-history-a-white-man-isnt-nominated-for-album-of-the-year/", "title": "For the first time in Grammy history, a white man isn’t nominated for album of the year", "meta_data": {"object-hash": 1519604773, "viewport": "width=device-width, initial-scale=1.0, user-scalable=yes, minimum-scale=0.5, maximum-scale=2.0", "referrer": "unsafe-url", "keywords": "grammy nominations, ed sheeran grammys, grammys album of the year, kendrick lamar grammys, jay z grammys, ed sheeran snubbed grammys, grammys 2018 nominations list", "news_keywords": "grammy nominations, ed sheeran grammys, grammys album of the year, kendrick lamar grammys, jay z grammys, ed sheeran snubbed grammys, grammys 2018 nominations list", "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "creator": "@emilyyahr"}, "og": {"type": "article", "site_name": "Washington Post", "url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/11/28/for-the-first-time-in-grammy-history-a-white-man-isnt-nominated-for-album-of-the-year/", "image": "https://www.washingtonpost.com/resizer/b6jp8ifQFvU8IyzuBmSG0PPHiA8=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ZTMWQPC2FE3V7CXTXC2EGFL3HQ.jpg", "title": "For the first time in Grammy history, a white man isn’t nominated for album of the year", "description": "Grammy prognosticators said Kendrick Lamar and Ed Sheeran would go head-to-head. Then Sheeran didn't make the list."}, "article": {"publisher": "https://www.facebook.com/washingtonpost", "content_tier": "metered", "author": "https://www.facebook.com/emily.yahr"}, "fb": {"app_id": 41245586762, "admins": 500835072}, "zeusAds": "true", "description": "Grammy prognosticators said Kendrick Lamar and Ed Sheeran would go head-to-head. Then Sheeran didn't make the list.", "robots": "index,follow", "theme": "normal", "author": "https://www.facebook.com/emily.yahr"}, "movies": [], "publish_date": 1511845200.0, "source": "https://www.washingtonpost.com", "summary": ""}