{"url": "www.washingtonpost.com/news/arts-and-entertainment/wp/2017/06/06/for-years-george-clooney-claimed-he-didnt-want-kids-now-he-has-twins/", "text": "\n\nGeorge Clooney and his wife, Amal, attend the 2016 Cannes Film Festival. (Alberto Pizzoli/AFP via Getty Images)\n\nOnce the ultimate bachelor — and two-time People’s Sexiest Man Alive cover model — George Clooney entered entirely new territory this week.\n\nThe Oscar-winning actor and his human-rights-lawyer wife of two years, Amal, announced Tuesday that they are the proud new parents of twins, Ella and Alexander.\n\nClooney has donned many hats in his life — actor, director, producer and activist, but fatherhood had always seemed far away. Was it the early-onset-salt-and-pepper hair? The coterie of models who found themselves on his arm for fleeting moments over the years? The insistence by tabloids and fellow co-stars that it was time for him to settle down? Maybe. Or perhaps it was the simple fact that Clooney himself said again and again that he would not reproduce. In several interviews. Many, many times. For many, many years.\n\nA first-time father at 56, Clooney was often asked throughout his career whether the single life was his ultimate future. But after proposing marriage to Amal in April 2014 and marrying her that September (as well as sharing wedding photos with People magazine in the United States and Hello magazine in Britain), it seemed as if anything was possible for the man who once said, “I don’t see myself ever having kids.”\n\nBut it was a long road to get there. “I don’t have that gene that people have to replicate,” he told People in 2006.\n\nWhen Esquire asked him why he wasn’t married with kids, he replied, “I haven’t had aspirations in that way, ever.” And as for people who thought it was weird that a man in his 50s was single and childless? “What do you do? Should I go, ‘I got to get me some kids right now!’ and rush out and impregnate someone?”\n\nClooney seemed to express frustration when asked how he could ever relate to the fathers he occasionally portrays onscreen. His answer: “Well, I’m also not running for president, but I played that role in ‘Ides of March.’ I wasn’t an actual lawyer when I did ‘Michael Clayton,’ and I don’t fire people for a living like I did in ‘Up in the Air.’ ”\n\n“I keep saying I’ll never get married again or have children but people just don’t want to believe me,” Clooney told Britain’s Daily Express just three months before popping the question to his now-wife.\n\nOf course, celebrities are people, too, and it shouldn’t surprise anyone that a man might change his mind around the midcentury mark. And Clooney is certainly not alone in choosing to wait till later in life to welcome a child into the family: Comedian Steve Martin became a father at age 67 in 2012; Elton John was 63 when he had a baby via a surrogate in 2010; and Chris Noth was 53 when he welcomed his only child in 2008.\n\nPerhaps it’s the fact that Clooney always seemed so delightfully and devilishly Clooney-ish that made his bachelordom seem like the only constant in our ever-changing popular culture. But we can rest easy knowing that despite some hesitation about having a family over the years, his sense of humor has remained steady throughout.\n\n“Ella, Alexander and Amal are all healthy, happy and doing fine,” the statement announcing the birth of the twins read. “George is sedated and should recover in a few days.”", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=3005617&cv=2.0&cj=1", "https://www.washingtonpost.com/resizer/yAFxThroW-CI5t-yu8Q6FsF7kHI=/1x1/www.washingtonpost.com/pb/resources/img/spacer.gif", "http://me.effectivemeasure.net/em_image", "https://www.washingtonpost.com/resizer/TWWLEZfMMW4FwBwDUYL6kyDEUwE=/960x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/YNI26LVV5E2UXAUE45PPSQUFIU.jpg", "https://www.washingtonpost.com/resizer/QFoT8TseUo3IV-8Yq5GPSfD1iF8=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/YXXAFQFY7U5WVJ4FRFI6KA5MCA.jpg"], "top_img": "https://www.washingtonpost.com/resizer/QFoT8TseUo3IV-8Yq5GPSfD1iF8=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/YXXAFQFY7U5WVJ4FRFI6KA5MCA.jpg", "keywords": [], "authors": ["Caitlin Moore", "Assignment Editor For Pop Culture", "June", "Caitlin Moore Is An Assignment Editor On The Pop Culture Team. She Started At The Post After Graduating College In", "Beginning As A Web Producer Working Nights", "Overnights", "Weekends On The Home Page. She Moved To The Style Section In", "Working As A Digital Editor For Pop Culture", "Before Becoming An Assignment Editor In"], "canonical_link": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/06/06/for-years-george-clooney-claimed-he-didnt-want-kids-now-he-has-twins/", "title": "For years, George Clooney claimed he didn’t want kids. Now he has twins.", "meta_data": {"object-hash": 1555882690, "viewport": "width=device-width, initial-scale=1.0, user-scalable=yes, minimum-scale=0.5, maximum-scale=2.0", "referrer": "unsafe-url", "keywords": "george clooney, amal alamuddin, amal clooney, george clooney twins,", "news_keywords": "george clooney, amal alamuddin, amal clooney, george clooney twins,", "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "creator": "thecaitlinshow"}, "og": {"type": "article", "site_name": "Washington Post", "url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/06/06/for-years-george-clooney-claimed-he-didnt-want-kids-now-he-has-twins/", "image": "https://www.washingtonpost.com/resizer/QFoT8TseUo3IV-8Yq5GPSfD1iF8=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/YXXAFQFY7U5WVJ4FRFI6KA5MCA.jpg", "title": "For years, George Clooney claimed he didn’t want kids. Now he has twins.", "description": "\"I don't have that gene that people have to replicate,” the ultimate bachelor once said. What a difference 11 years make."}, "article": {"publisher": "https://www.facebook.com/washingtonpost", "content_tier": "metered"}, "fb": {"app_id": 41245586762, "admins": 500835072}, "zeusAds": "true", "description": "\"I don't have that gene that people have to replicate,” the ultimate bachelor once said. What a difference 11 years make.", "robots": "index,follow", "theme": "normal"}, "movies": [], "publish_date": 1496721600.0, "source": "http://www.washingtonpost.com", "summary": ""}