{"url": "https://www.wanttoknow.info/newsstories-0-10000", "text": "News Stories Excerpts of Key News Stories in Major Media\n\nNote: This comprehensive list of news stories is usually updated once a week. Explore our full index to revealing excerpts of key major media news stories on several dozen engaging topics. And don't miss amazing excerpts from 20 of the most revealing news articles ever published.\n\nAt the Monroe Institute, a spiritual experience could just be a beat away\n\n2012-02-24, Washington Post\n\nPosted: 2019-06-28 01:56:32\n\nThe Monroe Institute [is] a cluster of buildings perched on more than 300 acres in the Virginia foothills of the Blue Ridge Mountains. The institute uses audio technology to help induce different states of consciousness. The technology is touted as creating optimal conditions for the brain, leading to “peak human performance.” A successful radio-broadcasting executive whose company produced 28 shows a month, [founder Robert] Monroe dedicated an arm of his firm to research and development. Monroe and his team ultimately developed Hemi-Sync, an audio technology based on the premise that certain tones can encourage the two hemispheres of the brain to synchronize and move into different states of consciousness. Monroe made numerous recordings that, when used with headphones, send slightly different tones through each ear, helping the brain to create a third “binaural” beat. The result: a collection of compact discs that purportedly can be used for everything from inducing sleep to increasing memory retention to, as the institute entices on its Web site, reaching “extraordinary” states. Over the years, Hemi-Sync has garnered three patents and been the subject of research both at the institute and by independent medical professionals, scientists and academics. University studies have discovered that the audio technology can improve the focus of children with developmental disabilities. By the institute’s estimates, 30,000 people from around the world have attended its programs, and millions have purchased Hemi-Sync compact discs. For many, the experience is “life changing.\"\n\nNote: Founder Robert Monroe wrote two fascinating, popular books, “Far Journeys” and “Ultimate Journey,” which describe his amazing journeys out of body. Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nFamily brought to tears after store employee aids young man with autism to stock shelves\n\n2018-07-31, WAFB/CBS Affiliate, Louisiana\n\nPosted: 2019-06-28 01:54:47\n\nA Louisiana woman was brought to tears after her father captured a heartwarming moment between a store employee and her little brother while shopping at a Rouse's grocery store. In a video post shared to Facebook, Delaney Alwosaibi says her father was at a Baton Rouge area Rouses with family when her little brother, Jack Ryan Edwards, 17, who she affectionately calls Ziggy, expressed an interest in stocking the shelves. Jack, who is on the autism spectrum, was aided by a store employee, who helped him stock shelves for over 30 minutes, encouraging him as he finished each task. Within hours, the Facebook post was shared over 1,500 times and had amassed nearly 4,000 likes. Alwosaibi says she's overwhelmed by the response. \"I've just been crying happy tears for hours and I'm in shock at the response the video has gotten. There's so much ugly in this world we live in, but today gave me a swift kick and reminder that there are still great people out there. Humble people, kind people, patient people, accepting people.\" In the video, the employee, Jordan Taylor, 20, can be heard discussing plans to re-enroll in school. An outpouring of support from Facebook users wishing to support Taylor both emotionally and financially continues to grow. After the incredible encounter, Alwosaibi started a GoFundMe to help send Jordan to school after he expressed interest in doing so. In the first nine hours, the community raised more than $6,000 [over $100,000 as of July 2019].\n\nNote: See the beautiful video of this encounter at the link above. Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nRenewable Energy Is Now The Cheapest Option - Even Without Subsidies\n\n2019-06-15, Forbes Magazine\n\nPosted: 2019-06-28 01:53:06\n\nAccording to a new report by the International Renewable Energy Agency (IRENA), unsubsidized renewable energy is now most frequently the cheapest source of energy generation. The report finds that the cost of installation and maintenance of renewables, which was an important stumbling block to mass adoption, continues on a downward trajectory. These new statistics demonstrate that using renewable energy is increasingly cost-effective compared to other sources, even when renewables must compete with the heavily-subsidized fossil fuel industry. These lower costs are expected to propel the mass adoption of renewables even further. Among other findings the IRENA report highlights that: Onshore wind and solar PV [photovoltaic] power are now, frequently, less expensive than any fossil-fuel option, without financial assistance. New solar and wind installations will increasingly undercut even the operating-only costs of existing coal-fired plants. Cost forecasts for solar PV and onshore wind continue to be revised as new data emerges, with renewables consistently beating earlier expectations. Further data from REN21's Renewable Global Status Report show that over one fifth of global electrical power production is now generated from renewables. Promising signs in the IRENA report show that ... an increasing number of corporates are entering the renewable energy industry ... meanwhile more than 10 million people are now employed in the global renewable energy industry.\n\nNote: Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nBrain Researcher José Delgado Asks - ‘What Kind of Humans Would We Like to Construct?’\n\n1970-11-15, New York Times\n\nPosted: 2019-06-28 01:50:36\n\nDr. José M. R. Delgado of [Yale University] is one of the leading pioneers in ... E.S.B.: electrical stimulation of the brain. He is also the impassioned prophet of a new “psychocivilized” society whose members would influence and alter their own mental functions to create a “happier, less destructive and better balanced man.” [Delgado said,] “We know that [E.S.B.] can delay a heartbeat, move a finger, bring a word to memory, evoke a sensation.” [His] animals performed like electrical toys. One monkey, Ludy, each time she was stimulated [would] stand up on two feet and circle to the right; climb a pole and then descend again. This “automatism” was repeated [by Ludy] through 20,000 stimulations! The tickling of a few electric volts can send a monkey into a deep sleep, or snap him awake. Similarly, human beings are unable to resist motor responses elicited by E.S.B. Large‐scale studies of rats with electrodes in [a] “pleasureful area” found that they preferred E.S.B. above all else—including water, sex and food. Sometimes ravenously hungry rats, ignoring nearby food, would stimulate themselves up to 5,000 times an hour—persisting with manic singleness of purpose for more than a day running, until they keeled over on the floor in a faint! “In humans also ... states of arousal and pleasure have been evoked\" ... Delgado added. One patient of ours was a rather reserved 30‐year‐old woman. E.S.B. at one cerebral point made her suddenly confess her passionate regard for the therapist—whom she'd never seen before.\" According to one psychoanalyst, “The danger of this being abused is ... tremendous.”\n\nNote: Though quite long, this entire intriguing article is well worth reading. If behavior manipulation was this advanced in 1970, what are they capable of now, and why is it being kept quiet? For more along these lines, see concise summaries of deeply revealing news articles on mind control from reliable major media sources. Then explore the excellent, reliable resources provided in our Mind Control Information Center.\n\nPsychedelics, long ignored by scientists, seeing resurgence in medical research\n\n2019-06-01, San Francisco Chronicle (San Francisco's leading newspaper)\n\nPosted: 2019-06-28 01:48:23\n\nUCSF psychiatrist Brian Anderson is studying an experimental therapy to help long-term AIDS survivors ... who are feeling sad and demoralized. In a clinic outfitted with a comfortable couch, soft lighting, throw pillows and blankets, the participants of his study are given psilocybin, the hallucinogenic compound found in magic mushrooms. The results were compelling enough that he’s planning a second study. Anderson’s work is part of a resurgence in psychedelic study that has been ... fueling grassroots efforts around the country to decriminalize use of certain psychedelic drugs. Statewide measures are being discussed in California and Oregon. The decriminalization efforts are focused on natural psychedelics — mushrooms, along with herbs, cacti and other plants from which hallucinogenic compounds can be extracted. Though several studies in the first half of the 20th century had shown promise in using psychedelics for treatment of mental health and neurological disorders, the drugs were broadly maligned in the 1960s and ’70s. More recently, microdosing — the practice taking small, carefully controlled amounts of a psychedelic — has taken off among Silicon Valley techies and university students who believe it boosts productivity and creativity. Almost all studies at the moment rely on private donations for funding. Studies are still limited, but they’re happening at universities around the country. At Johns Hopkins, Johnson and his colleagues reported about an 80% success rate in using psilocybin to help people quit smoking in one small study. Research out of UCLA has found that psilocybin may help cancer patients with depression and anxiety.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on studies of psychedelics from reliable major media sources.\n\nPressing for vaccine law changes in Arizona\n\n2019-03-22, azcentral.com/USA Today (website of Arizona's largest newspaper)\n\nPosted: 2019-06-28 01:46:23\n\nThe number of recommended vaccines was only 23 doses of seven vaccines in 1983. By 2017, the CDC’s recommended number skyrocketed to 69 doses of 16 vaccines – 50 doses given before age 6. Vaccination is not appropriate for every individual due to one’s genetic disposition, autoimmune deficiency, allergy or other circumstance. Medical professionals would never claim that because a certain drug or therapy was approved for most people, everyone should be subject to it – but with vaccine injury, the clinical evidence does not seem to apply. Despite ... specific warnings on each vaccine insert, there is an unwillingness to acknowledge the risk for some individuals. While some claim vaccine injuries are rare, the CDC-funded Harvard Pilgrim Project’s [found] that less than 1 percent are ever reported to VAERS, the Vaccine Adverse Events Reporting System. Taxpayers – not liability-free pharmaceutical companies – have paid patients $4 billion for their injuries or death through the Vaccine Injury Compensation Program since 1988. Most families that have experiences with vaccine reactions were never notified beforehand of [this] program. Certain ingredients in vaccinations, including chemicals, human, animal, and insect DNA and RNA, are abhorrent to some for religious or ethical reasons. Mandated vaccination should not force someone to compromise their beliefs. The American Medical Association’s code of ethics affirms the right to both religious and philosophical exceptions for physicians themselves to not be vaccinated. The same standard should apply to their patients.\n\nNote: See the highly revealing 6-page report on the US government's \"Health Information Technology\" website that states, \"Adverse events from drugs and vaccines are common, but underreported. ... Fewer than 1% of vaccine adverse events are reported.\" A concise summary of this report can be found here. More valuable information is available here. For even more along these lines, see concise summaries of deeply revealing news articles on vaccines from reliable major media sources. Explore also the best website calling for responsibility in vaccination.\n\nDisturbing Undercover Video Shows Animal Abuse at Fair Oaks Farms in Indiana\n\n2019-06-05, NBC News (Chicago Affiliate)\n\nPosted: 2019-06-28 01:43:02\n\nA northwest Indiana dairy farm has fired four employees seen in a graphic undercover video released Tuesday by an animal welfare organization showing animals being abused. Following an investigation into the abuse, at least three retailers announced Wednesday that they would remove all Fairlife products from their shelves. The Coca Cola Corporation, which distributes the brand, said it was in talks to have sourcing from the farm in question discontinued. The Animal Recovery Mission called it the “largest undercover dairy investigation in history” and said the video documents “systemic and illegal abuse” at Fair Oaks Farms in Indiana. ARM said an investigator spent three months undercover at the Prairies Edge North Barn after being hired as a calf care employee. The group noted that Fair Oaks Farms North Barn was not targeted, but rather the barn was the first farm to hire the investigator, who had applied to multiple dairy farms in Jasper and Newton Counties in Indiana. “Employees were observed slapping, kicking, punching, pushing, throwing and slamming calves,” ARM said in a statement. “Calves were stabbed and beaten with steel rebars, hit in the mouth and face with hard plastic milking bottles, kneed in the spine, burned in the face with hot branding irons, subjected to extreme temperatures, provided with improper nutrition, and denied medical attention.” The footage was released on social media (warning: footage is graphic) Tuesday, where it has since garnered more than 100,000 views on Facebook and more than 1 million views on Vimeo.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on corruption in the food industry from reliable major media sources.\n\nIn Los Angeles, only people of color are sentenced to death\n\n2019-06-18, The Guardian (One of the UK's leading newspapers)\n\nPosted: 2019-06-28 01:41:08\n\nLos Angeles has sentenced more people to death than any other county in the US, and only people of color have received the death penalty under the region’s current prosecutor, a new report shows. LA county’s district attorney, Jackie Lacey, has won death sentences for a total of 22 defendants, all people of color, and eight of them were represented by lawyers with serious misconduct charges prior or after their cases, according to a new analysis by the American Civil Liberties Union (ACLU). Lacey has also faced intense scrutiny for her refusal to prosecute police officers who kill civilians, even in the most egregious circumstances. Some key findings: In California, 222 people currently sentenced to death are from LA county. LA is one of only three counties in the country to have more than 10 death sentences from 2014 to 2018. Under Lacey’s tenure, which began in 2012, zero white defendants have been sentenced to death, and her capital punishment sentences disproportionately targeted cases involving white victims. Although 12% of homicide victims in LA county are white, 36% of Lacey’s death penalty wins involved white victims. 737 inmates [are] currently awaiting execution in California. Defense lawyers in five of the 22 cases under Lacey were suspended or disbarred, which is the most serious discipline for ethics violations, the ACLU said. The ACLU, which reviewed lawyer misconduct records, cited one particularly egregious case in which an attorney declined to make an opening statement – offering no defense at all – and then repeatedly fell asleep during the trial.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on corruption in the courts from reliable major media sources.\n\nJudges differ with Trump administration on conditions for immigrant minors\n\n2019-06-18, San Francisco Chronicle/ (San Francisco's leading newspaper)\n\nPosted: 2019-06-28 01:37:40\n\nThe Trump administration ... argues it is not legally required to provide [immigrant minors] with such items as soap, toothbrushes and sleeping accommodations. [This] drew an incredulous response from federal appeals court judges Tuesday at a hearing in San Francisco. The administration is appealing a federal judge’s June 2017 ruling that immigration officials were violating a 1997 court settlement requiring unaccompanied minors in federal custody to be kept in safe and sanitary conditions before being released. U.S. District Judge Dolly Gee of Los Angeles found that youths held in the Rio Grande Valley in Texas were being denied basic necessities and appointed a monitor to oversee compliance. Gee found evidence that minors were kept overnight in crowded, chilly rooms, sleeping on concrete floors with aluminum-foil blankets with the lights kept on all night. The administration denied violating the settlement and argued in court papers that nothing in the 1997 agreement required officials “to provide minors, in all situations, with sleeping accommodations, toothbrushes, toothpaste, showers, soap, towels and dry clothes,” as long as the facilities were safe and sanitary. A panel of the Ninth U.S. Circuit Court of Appeals was clearly unconvinced. “It’s within everybody’s common understanding that if you don’t have a toothbrush, you don’t have soap, you don’t have a blanket, those are not safe and sanitary,” Judge A. Wallace Tashima told Justice Department lawyer Sarah Fabian.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on government corruption from reliable major media sources.\n\nVeterans of Atomic Test Blasts: No Warning, and Late Amends\n\n2016-05-29, New York Times\n\nPosted: 2019-06-28 01:35:49\n\nSeveral hundred thousand [soldiers] took part in atmospheric nuclear tests conducted in the Pacific and in Nevada. They were posted within range of exploding bombs — in effect made to be guinea pigs in studies of how combat troops might stand up in a war fought with nuclear arms. Many among these “atomic veterans” suffered cancers and other diseases. Frank Farmer ... witnessed 18 atomic detonations in 1958. “It’s so bright you actually see your bones in your hands.” He and his shipmates were issued no protective gear. Despite government assurances that their exposure to radiation had been insufficient to inflict physical harm, veterans could see they were getting sick in disproportionate numbers. Some began to speak out, ignoring oaths they had signed never to discuss their experiences. “More and more I heard about guys that had prostate cancer and lung cancer and all kinds of cancers,” said Mr. Farmer, who suffered hearing loss and a body rash that did not go away. Decades passed before corrective measures were taken. Issues raised by [these] difficulties resound in modern wars. As with the atomic veterans, officialdom’s default position has generally been to wave off any suggestion of a link between a soldier’s illness and a command-level decision. That was the case with Agent Orange ... in Vietnam. Years passed before the government accepted a “presumptive” connection between herbicides and cancers afflicting Vietnam veterans. Soldiers who served in Afghanistan and Iraq and in the 1991 Persian Gulf war complain of breathing problems, neurological damage, gastrointestinal disorders and other illnesses. Many suspect that blame lies with practices off the battlefield.\n\nNote: Don't miss a profoundly moving 22-minute documentary in which several atomic veterans describe in detail what happened, how they suffered, and how the government denied responsibility for decades. For more along these lines, see concise summaries of deeply revealing news articles on war corruption from reliable major media sources. Then explore the excellent, reliable resources provided in our War Information Center.\n\nAtomic Soldiers\n\n2019-02-12, New York Times\n\nPosted: 2019-06-28 01:34:11\n\nI’ve always been fascinated by nuclear weapons and the self-destructive tendencies of mankind. So when I found declassified United States Civil Defense footage of soldiers maneuvering in the glare of a mushroom cloud, I wanted to learn more about their stories. I discovered that as many as 400,000 American soldiers and sailors observed nuclear explosions just a few miles from ground zero in more than 200 atmospheric tests conducted between 1946 and 1962. It was difficult to get a precise count of how many men were involved, because most information was classified — including reports on the illnesses the veterans suffered and the radioactive pollution that was released into the environment around the test sites. They served near dangerous nuclear tests — and it has haunted them ever since. With so little information available and the number of remaining veterans dwindling rapidly, I wanted to prevent these stories from disappearing. I decided to interview some of them as research for a fiction film on the topic and wound up making this documentary in the process. Because of secrecy agreements they had signed, some of them were hesitant to talk about their experiences. Getting to know these men was an experience I will never forget. I realized that my own generation seems to have become numb to what nuclear war could do to humanity. The accounts of the atomic soldiers can help us understand that horror.\n\nNote: The author of this article, Morgan Knibbe, is a Dutch documentary filmmaker. The 15-minute documentary he made, available at the link above, is so important. These men were used as guinea pigs in nuclear bomb tests and have suffered in silence for decades because of those who promote war on our planet. Please watch and spread the word far and wide. For lots more on humans being used mercilessly as guinea pigs, see this webpage.\n\nThese Men Say the Boy Scouts’ Sex Abuse Problem Is Worse Than Anyone Knew\n\n2019-06-01, Time\n\nPosted: 2019-06-23 00:21:50\n\nFifty-eight years ago, Edward Pittson says, the Scoutmaster who had taught him skills like how to use a compass and light a campfire said he was going to teach Pittson about sex. The Scoutmaster invited Pittson, who was 12, to his house and asked him to lie on the bed. “This is the normal way to learn about sex,” Pittson recalls the Scoutmaster telling him. “He said, ‘But don’t tell your parents what I’m doing.’” Now, Pittson is one of hundreds of men and boys hoping for a last chance at restitution if the Boy Scouts of America, in the face of a new wave of abuse allegations, files for bankruptcy. On Thursday, a group of attorneys said they’d collected information from at least 428 men and boys whose accounts of rape, molestation and abuse indicate the Boy Scouts’ pedophile problem is far more widespread than the organization has previously acknowledged. If the Boy Scouts file for bankruptcy, the accusers will have a limited window to file claims against the organization. Hundreds of individual sex abuse cases have been brought against the Scouts ... and in 2010, a judge ordered the organization to make public an internal list of men accused of preying on boys. Within Scout headquarters, the list was known as the “P Files” or “Perversion Files.” In January, a child abuse expert hired by the Boy Scouts to analyze the files testified that she found 12,254 boys had reported experiencing sexual abuse at the hands of at least 7,800 suspected assailants between 1944 and 2016.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on sexual abuse scandals from reliable major media sources.\n\nThe One Percent Have Gotten $21 Trillion Richer Since 1989. The Bottom 50% Have Gotten Poorer.\n\n2019-06-16, New York Magazine\n\nPosted: 2019-06-23 00:20:27\n\nSome Democratic presidential candidates say that America’s economic system is badly broken and in need of sweeping, structural change. In its new Distributive Financial Accounts data series, the central bank offers a granular picture of how American capitalism has been distributing the gains of economic growth over the past three decades. Matt Bruenig of the People’s Policy Project took the Fed’s data and calculated how much the respective net worth of America’s top one percent and its bottom 50 percent has changed since 1989. He found that America’s superrich have grown about $21 trillion richer ... while those in the bottom half of the wealth distribution have grown $900 billion poorer. Notably, this measure of wealth includes liabilities. And it does not include consumer goods. But if one did include the Fed’s data on the distribution of consumer goods, the wealth gap between the top one percent and bottom 50 would actually be even larger. In 2011, Michael Norton of Harvard Business School and Dan Ariely of Duke University published a study on Americans’ views of how wealth was distributed in their society, and how they felt it should be distributed. They found that, in the average American’s ideal world, the richest 20 percent would own 32 percent of national wealth. In reality, the top quintile owned 84 percent as of 2011. And that share has grown in the intervening years. Today, the one percent alone commands roughly 40 percent of all America’s wealth.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on income inequality from reliable major media sources.\n\nU.S. Escalates Online Attacks on Russia’s Power Grid\n\n2019-06-15, New York Times\n\nPosted: 2019-06-23 00:18:44\n\nThe United States is stepping up digital incursions into Russia’s electric power grid in a warning to President Vladimir V. Putin and a demonstration of how the Trump administration is using new authorities to deploy cybertools more aggressively, current and former government officials said. In interviews over the past three months, the officials described the previously unreported deployment of American computer code inside Russia’s grid and other targets as a classified companion to more publicly discussed action directed at Moscow’s disinformation and hacking units around the 2018 midterm elections. In August of 2018, President Trump signed [an] executive order ... called National Security Presidential Memorandum 13. Its contents are still classified, but essentially it allows the Cyber Command to go ahead and conduct all kinds of operations inside foreign networks without going back to the president for prior approval. The first thing it did was go after those units in Russia that were responsible for a lot of the election-hacking. They went after the G.R.U., the Russian military intelligence unit that had been responsible for breaking into the D.N.C.. A lot of that ... was made public. What wasn’t made public was a parallel effort to go inside the Russian power grid, to put some code in places where the Russians ... wouldn’t see it, in case the U.S. ever needed to act against Russia’s utilities as the Russians were putting malware in our systems.\n\nNote: A 2007 New York Times article describes the formation of the Air Force Cyberspace Command to arm the US military in anticipation of widespread computer-based warfare. A more recent Guardian article says, \"we might already be living through the first world cyberwar.\" For more along these lines, see concise summaries of deeply revealing news articles on intelligence agency corruption from reliable major media sources.\n\n'No way to stop it': millions of pigs culled across Asia as swine fever spreads\n\n2019-06-05, The Guardian (One of the UK's leading newspapers)\n\nPosted: 2019-06-23 00:16:51\n\nSouth-east Asia is battling to contain the spread of highly contagious African swine fever, known as “pig Ebola”, which has already led to the culling of millions of pigs in China and Vietnam. African swine fever, which is harmless to humans but fatal to pigs, was discovered in China in August, where it has caused havoc, leading to more than 1.2m pigs being culled. China is home to almost half of the world’s pigs. There is no vaccination for African swine fever, which causes pigs to internally haemorrhage until they die, so the only option to contain the disease is to kill any contaminated animals. Some estimates say that in China up to 200m animals may eventually be slaughtered. The virus can last for several weeks on anything from clothes to vehicles, allowing for it to easily travel long distances. “This is the biggest animal disease outbreak we’ve ever had on the planet,” said Dirk Pfeiffer, a veterinary epidemiologist. Currently the battle to contain the disease is being lost. “There are concerns that the disease will continue to spread across the countries in south-east Asia,” said Dr Wantanee Kalpravidh, regional manager for UNFAO, who said they believed the swine fever cases being reported by governments in the region were “underestimates”. Wantanee said problems included the lack of compensation for pig farmers in south-east Asia whose herds were culled, giving them little reason to report a disease outbreak, and fears that banning movement of pigs and pork across borders would only create a “black market”.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on food system corruption from reliable major media sources.\n\nUltraprocessed foods are easy, cheap and could be killing you\n\n2019-05-30, CNN News\n\nPosted: 2019-06-23 00:15:17\n\n\"Ultraprocessed\" describes many foods, including pre-prepared dishes found in grocery store freezers, packaged baked goods, dehydrated soups, ice cream, sugary cereals and fizzy beverages. Two separate studies published Wednesday in The BMJ link eating the popular factory-made fare with an increased risk of cardiovascular disease and an increased risk of early death. Previous studies have associated highly processed food consumption with higher risks of obesity, high blood pressure, high cholesterol and even some cancers. \"Ultraprocessed foods already make up more than half of the total dietary energy consumed in high-income countries such as USA, Canada and the UK,\" [said] Maira Bes-Rastrollo, senior author of one study. \"Products in this category are rich in poor quality fat, added sugar and salt, along with low vitamin density and fiber content, and they \"are economically profitable (low cost ingredients), very palatable and convenient,\" said Bes-Rastrollo. Worst of all, she explained, they are replacing unprocessed or minimally processed foods and freshly prepared meals in our diets. Bes-Rastrollo and her colleagues also collected information on lifestyle, demographic factors, physical activity, weight and health. Analyzing the data, the team found that a higher consumption of heavily processed foods - more than four servings each day - was associated with a 62% increased risk for early death due to any cause relative to those who ate these foods less frequently.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on health and food system corruption from reliable major media sources.\n\nU.S. Sees Largest Reduction of Protected Lands in History Under Trump\n\n2019-06-02, Rolling Stone\n\nPosted: 2019-06-23 00:13:48\n\nThe Trump Administration is responsible for causing the largest reduction of protected public lands in U.S. history, according to a comprehensive study published this week in the journal Science. In 2017, the study noted, President Trump enacted two of the largest reductions of federally protected lands, shrinking Bears Ears by 85 percent and Grand-Staircase Escalante National Monument in southern Utah by 51 percent. Also in 2017, Congress voted to open the Arctic National Wildlife Refuge to oil and natural gas development. By removing federal protections, the study said, Trump is opening up these lands to oil and natural gas companies. And while the 2017 reductions are now being argued in federal court, the study said, the government already has plans to downgrade or downsize nine more land and marine national monuments. The study was conducted by 21 international scientists analyzing 200 years of data about protected areas. The scientists found that vast reduction of federal lands is a relatively recent phenomenon; 90 percent of reductions in U.S. federal lands have occurred since the year 2000. This is part of a disturbing global trend, where 78 percent of global land reductions have taken place since 2000. “As human pressures on the biosphere accelerate, it is critical to strengthen—not roll back—conservation efforts,” the study authors concluded.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on government corruption from reliable major media sources.\n\nPeople are developing dementia earlier and dying of it more\n\n2015-08-06, Washington Post\n\nPosted: 2019-06-23 00:12:07\n\nPeople are developing dementia a decade before they were 20 years ago, perhaps because of environmental factors such as pollution and the stepped-up use of insecticides, a wide-ranging international study has found. The study, which compared 21 Western countries between the years 1989 and 2010, found that the disease is now being regularly diagnosed in people in their late 40s and that death rates are soaring. The study was published in the Surgical Neurology International journal. The problem was particularly acute in the United States, where neurological deaths in men aged over 75 have nearly tripled and in women risen more than fivefold, the leader of the study, Colin Pritchard from Bournemouth University, [said]. Scientists quoted in the study said a combination of environmental factors such as pollution from aircraft and cars as well as widespread use of pesticides could be the culprit. Early-onset dementia used to cover people developing the disease in their late 60s. Now, it’s meant to mean people much younger than that, the research showed. The study found that deaths caused by neurological disease had risen significantly in adults aged 55 to74, virtually doubling in the over-75s. The sharp increase in death rates from dementia-related diseases cannot simply be blamed on an aging population or stepped-up diagnosis, Pritchard said. “The rate of increase in such a short time suggested a silent or even a hidden epidemic, in which environmental factors must play a major part.”\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on health from reliable major media sources.\n\nC.I.A. Sought to Spray Drug on Partygoers\n\n1977-09-21, New York Times\n\nPosted: 2019-06-23 00:10:28\n\nA former Central Intelligence Agency employee told a Senate subcommittee today that he and another C.I.A. employee were sent to San Francisco in 1959 to lure unsuspecting people to a party at which the two agents were to spray the air with LSD 25 as part of the agency's secret drug testing program. The test [was] part of a much larger drug testing program known by the cryptonym MK ULTRA,” David Rhodes told the Senate Subcommittee on Health and Scientific Research. Mr. Rhodes, two former C.I.A. employees, two former Bureau of Narcotics agents and Dr. Charles Geschickter, head of a foundation that channeled C.I.A. medical research funds to universities for nine or 10 years, were questioned this morning in the first of two days of hearings into C.I.A. testing of drugs on human beings. Today's testimony by Mr. Rhodes provided the first look the public has had at an LSD test inside a C.I.A. safehouse. The agency carried out other drug tests in both California and New York City from 1953 to 1966 in such safehouses, mainly apartments and motel rooms. These were secretly rented for the agency by George H. White, an official of the old Federal Bureau of Narcotics, which has since been supplanted by the Drug Enforcement Administration. Mr. Rhodes, a psychologist employed by the C.I.A. from 1957 to 1961, said he went to California in 1959 with Walter P. Pasternak. Mr. Pasternak, a former employee of the agency, was also an official with the Society for the Investigation of Human Ecology.\n\nNote: Read more about the CIA's MK ULTRA program. Shortly before his death, George White summed up his CIA career by saying, 'It was fun, fun, fun. Where else could a red-blooded American boy lie, kill and cheat, steal, deceive, rape and pillage with the sanction and blessing of the all highest,\" as reported in this ABC documentary on MK ULTRA. For more along these lines, see concise summaries of deeply revealing news articles on mind control from reliable major media sources.\n\nHow 'Buddy Benches' are making playtime less lonely\n\n2018-12-04, BBC News\n\nPosted: 2019-06-23 00:08:52\n\nOne day, during her usual chat with her eight-year-old son about school, Tracey Cooney got an answer she didn't expect. \"There was nobody to play with. Everyone was playing in their own little groups,\" he confided. She was surprised because he was usually outgoing and confident. Cooney felt a little upset, but remembered something she had seen on social media and wondered if it could help children in his situation. It's called a Buddy Bench. The idea is simple - if a child feels lonely, they can go to the bench as a signal that they need someone to play with. Another child will see them, go and talk to them and include them in their games. So Cooney asked other parents and the head teacher at Castlemartyr National School in Cork, Ireland, whether they would be interested in getting one - their answer was, \"Yes.\" \"We use the bench as a reminder for children of things like communication, mutual support and opening up about feelings,\" says Judith Ashton, a psychotherapist and co-founder of ... Buddy Bench Ireland. Apart from reducing social isolation and improving mental wellbeing, the hope is that the benches can tackle another problem: bullying. But do children actually use the bench? \"They don't see it as stigmatised,\" says Sinead McGilloway ... who led a study of 117 pupils at three schools which have benches. Forty per cent of the children she questioned said they had used the bench, and 90% said if they saw someone else sitting on it they would talk to them.\n\nNote: Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\n‘Forest Bathing’ Is Great for Your Health. Here’s How to Do It\n\n2018-05-01, Time\n\nPosted: 2019-06-23 00:07:28\n\nWe all know how good being in nature can make us feel. In Japan, we practice something called forest bathing, or shinrin-yoku. Shinrin in Japanese means “forest,” and yoku means “bath.” So shinrin-yoku means bathing in the forest atmosphere, or taking in the forest through our senses. This is not exercise, or hiking, or jogging. It is simply being in nature, connecting with it through our senses of sight, hearing, taste, smell and touch. Shinrin-yoku is like a bridge. By opening our senses, it bridges the gap between us and the natural world. Numerous studies I’ve conducted have shown that shinrin-yoku has real health benefits. So how does one go about forest bathing? First, find a spot. Make sure you have left your phone and camera behind. You are going to be walking aimlessly and slowly. You don’t need any devices. Let your body be your guide. Listen to where it wants to take you. The key to unlocking the power of the forest is in the five senses. Let nature enter through your ears, eyes, nose, mouth, hands and feet. Listen to the birds singing and the breeze rustling in the leaves of the trees. Look at the different greens of the trees and the sunlight filtering through the branches. Smell the fragrance of the forest. Taste the freshness of the air as you take deep breaths. You can forest-bathe anywhere in the world – wherever there are trees ... in rain, sunshine or snow. You don’t even need a forest. Once you have learned how to do it, you can do shinrin-yoku anywhere – in a nearby park or in your garden.\n\nNote: The above is excerpted from the book \"Forest Bathing: How Trees Can Help You Find Health and Happiness\" by Dr. Qing Li. Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nWhere “Homework” Means Building Affordable Houses\n\n2018-11-01, Yes! Magazine\n\nPosted: 2019-06-23 00:06:02\n\nEach year, beginning in the fall, a group of third-year architecture students from Auburn University take up residence in a small rural Alabama town to begin building a house. In the winter, when a new semester begins, they are replaced at the Newbern, Alabama, project site by another cohort of 16 students who finish up the job and prepare the house for its new occupants. The 20K Home Project began 13 years ago as a challenge to architecture students at Auburn to build a $20,000 house, with $12,000 in material and $8,000 for labor. The idea was to create “the perfect house” for needy families in rural areas where dwellings are often substandard and where affordable building can be a logistical challenge. To date, the student-led project has designed and built homes for nearly 30 households as part of Auburn’s Rural Studio, an off-campus, hands-on architecture program that has also constructed community centers, a library and other projects around Hale County, where Newbern is located. Created in 1993, Rural Studio partners with local nonprofits and uses cash and in-kind donations to cover the cost of the homes. It then makes a gift of the finished houses to low-income Newbern residents. Over the years, Rural Studio has developed design criteria for the homes, which are typically one- or two-bedroom single-family dwellings. In Newbern, a community of just under 200 people in the west-central part of Alabama, the median price of a home is about $65,000.\n\nNote: Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nUFOs exist and everyone needs to adjust to that fact\n\n2019-05-28, Washington Post\n\nPosted: 2019-06-17 19:18:57\n\nUFOs have historically been associated with crackpot ideas. The obvious reason for this is that the term “UFO” is usually assumed to be a synonym for “extraterrestrial life.” Alexander Wendt and Raymond Duvall ... argued that the real reason UFOs have been dismissed is because of the existential challenge that they pose for a worldview in which human beings are the most technologically advanced life-forms: \"UFOs have never been systematically investigated by science or the state, because it is assumed to be known that none are extraterrestrial. Yet in fact this is not known, which makes the UFO taboo puzzling.\" In recent years ... discussion of actual UFOs has been the topic of some serious mainstream media coverage. There was the December 2017 New York Times story by Helene Cooper, Ralph Blumenthal and Leslie Kean about the Defense Department’s Advanced Aerospace Threat Identification Program, which was tasked with cataloguing UFOs recorded by military pilots. DoD officials confirmed its existence. This story ... represented the first time the U.S. government acknowledged the existence of such a program. Then, there were the reports last November about Oumuamua, “a mysterious, cigar-shaped interstellar object [that] fell through our solar system at an extraordinary speed,” according to New York’s Eric Levits. What appears to be happening is that official organs of the state are now acknowledging that UFOs exist. They are doing so because enough pilots are reporting UFOs and near-air collisions so as to warrant better record-keeping.\n\nNote: The fact that the media is no longer debunking UFOs suggests that a gradual acculturation process is being used. Those in the know have been aware of many intense UFO encounters reported by military officers and more for many decades. For more along these lines, see concise summaries of deeply revealing news articles on UFOs from reliable major media sources.\n\nPfizer had clues its blockbuster drug could prevent Alzheimer’s. Why didn’t it tell the world?\n\n2019-06-04, Washington Post\n\nPosted: 2019-06-17 19:16:33\n\nA team of researchers inside Pfizer made a startling find in 2015: The company’s blockbuster rheumatoid arthritis therapy Enbrel, a powerful anti-inflammatory drug, appeared to reduce the risk of Alzheimer’s disease by 64 percent. The results were from an analysis of hundreds of thousands of insurance claims. Verifying that the drug would actually have that effect in people would require a costly clinical trial - and after several years of internal discussion, Pfizer opted against further investigation and chose not to make the data public, the company confirmed. Researchers in the company’s division of inflammation and immunology urged Pfizer to conduct a clinical trial on thousands of patients, which they estimated would cost $80 million ... according to an internal company document obtained by The Washington Post. Pfizer’s deliberations, which previously have not been disclosed, offer a rare window into the frustrating search for Alzheimer’s treatments inside one of the world’s largest drug companies. Pfizer did share the data privately with at least one prominent scientist, but outside researchers contacted by The Post believe Pfizer also should at least have published its data, making the findings broadly available to researchers. “Of course they should. Why not?” said Rudolph E. Tanzi, a leading Alzheimer’s researcher and professor at Harvard Medical School. “It would benefit the scientific community to have that data out there,” said Keenan Walker, an assistant professor of medicine at Johns Hopkins.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on Big Pharma corruption from reliable major media sources.\n\nCrispr gene-editing will change the way Americans eat – here's what's coming\n\n2019-05-30, The Guardian (One of the UK's leading newspapers)\n\nPosted: 2019-06-17 19:14:30\n\nSoon, soybeans will be bred to yield stable oil without the addition of dangerous trans fats. Lettuce will be grown to handle warmer, drier fields. Wheat to contain less gluten. And pigs bred to resist deadly viruses. Ten years ago, such genetic changes would have been considered science fiction – or so far off into the future of breeding as to be almost unimaginable. But gene editing, particularly with a tool called Crispr-Cas9, has made it much easier and more efficient to tinker with the genomes of plants and animals. The first Crispr-edited products will begin reaching the market this year, and researchers believe it’s only a matter of time before US grocery shelves could be filled with gene-edited produce, grains and meat. The technology will be subject to stringent health and environment review, as well as labeling requirements in the EU, but not in the US. The US Department of Agriculture (USDA) issued a statement last March saying it would not regulate crops whose genetic changes could have been produced with conventional breeding. The European court of justice, by contrast, ruled last summer that gene-edited crops should be regulated as GMOs. The scientific challenges have been largely settled. But political and social ones remain. Jennifer Kuzma, co-director of the Genetic Engineering and Society Center at North Carolina State University, said US consumers are willing to pay 20% more to avoid GMO foods, and nearly half of the public reports actively avoiding genetically modified ingredients and food.\n\nNote: Read an excellent addendum to this important article by GMO expert Jeffrey Smith recommending caution in these little-tested new products. For more along these lines, see concise summaries of deeply revealing news articles on GMOs and food system corruption from reliable major media sources.\n\nHer Evangelical Megachurch Was Her World. Then Her Daughter Said She Was Molested by a Minister.\n\n2019-06-10, New York Times\n\nPosted: 2019-06-17 19:12:30\n\nChristi Bragg listened in disbelief. It was a Sunday in February, and her popular evangelical pastor, Matt Chandler, was preaching on the evil of leaders who sexually abuse those they are called to protect. But at the Village Church, he assured his listeners, victims of assault would be heard, and healed. Ms. Bragg nearly vomited. She stood up and walked out. Exactly one year before that day, on Feb. 17, 2018, Ms. Bragg and her husband, Matt, reported to the Village that their daughter, at about age 11, had been sexually abused at the church’s summer camp for children. Since then, Matthew Tonne, who was the church’s associate children’s minister, had been investigated by the police, indicted and arrested on charges of sexually molesting Ms. Bragg’s daughter. Ms. Bragg waited for church leaders to explain what had happened and to thoroughly inform other families in the congregation. But none of that ever came. Nearly 400 Southern Baptist leaders, from youth pastors to top ministers, have pleaded guilty or been convicted of sex crimes against more than 700 victims since 1998, according to a recent investigation by The Houston Chronicle and The San Antonio Express-News. At the Village, one of the most prominent Southern Baptist churches in the country ... Ms. Bragg said leaders had offered prayer. But as months passed, she came to believe their instinct to protect the institution outweighed their care for her daughter or their interest in investigating the truth.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on sexual abuse scandals from reliable major media sources.\n\nA trail of toxicity: the US military bases making people sick\n\n2019-05-23, The Guardian (One of the UK's leading newspapers)\n\nPosted: 2019-06-17 19:10:29\n\nOver the last 80 years, much of the land surrounding Venetucci Farm was sold to the US army to establish the base now known as Fort Carson. Farming activities have stopped. In 2016, irrigation water was found to be contaminated with elevated levels of perfluorinated compounds (PFCs). The foundation that runs the farm has joined forces with a local water district to sue the US Air Force, alleging that toxic chemicals used in firefighting foam at a nearby base have tainted the water. Similar concerns have been raised about dozens of other bases across the country. But the problem is not limited to areas close to military installations. PFCs and related human-made chemicals, more generally known as per- and polyfluoroalkyl substances (PFAS), have been virtually unregulated since at least the 1950s. As well as at industrial sites, airports and bases, PFAS have long been used in household products. They are everywhere. A 2007 study estimated that PFAS are in the blood of 98% of Americans, while last year an analysis by the not-for-profit Environmental Working Group found that more than 1,500 drinking water systems nationwide could be contaminated by PFAS. Studies suggest that certain PFAS may affect the growth, learning and behaviour of infants and older children; lower a woman’s chance of getting pregnant; interfere with the body’s natural hormones; increase cholesterol levels; affect the immune system; and increase the risk of kidney and testicular cancer and thyroid problems.\n\nNote: Read more about these chemicals contaminating the drinking water of 110 million Americans. For more along these lines, see concise summaries of deeply revealing news articles on health from reliable major media sources.\n\nFDA designates MDMA as 'breakthrough therapy' for PTSD\n\n2017-08-31, CBS News\n\nPosted: 2019-06-17 19:08:44\n\nAfter years of lobbying and experimental research, the FDA has granted \"breakthrough therapy\" status for the drug MDMA as a potential treatment for post-traumatic stress disorder. The designation does not mean the drug is FDA-approved, but it does ease the way for clinical trials to test its safety and effectiveness in patients with PTSD. The non-profit Multidisciplinary Association for Psychedelic Studies (MAPS), which has been advocating and fundraising for MDMA research for three decades, announced the FDA's designation. More commonly known as its street names ecstasy or Molly, MDMA (methylenedioxymethamphetamine) is a psychoactive drug that produces feelings of energy and euphoria, often followed by an emotional crash. In recent years, some in the scientific community have suggested it could have medical benefits, as well. In previous phases of clinical trials, the drug was shown to offer significant relief to sufferers of PTSD, a mental health disorder characterized by nightmares or flashbacks and heightened anxiety or depression after experiencing or witnessing a terrifying event. In phase 2 clinical trials sponsored by MAPS, 61 percent of the 107 participants with chronic, treatment-resistant PTSD no longer had the disorder after two months of MDMA-assisted psychotherapy treatment. At a 12-month follow up, 68 percent no longer had PTSD. The organization expects to begin phase 3 trials with a larger group of participants next year.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on mind-altering drugs from reliable major media sources.\n\nO'Hare UFO sighting in 2006 one of the most famous reported\n\n2013-03-20, Chicago Tribune\n\nPosted: 2019-06-17 19:06:52\n\nChicago isn’t known as a hotbed of UFO activity, but O’Hare Airport is the home of one of the most publicized sightings of the last decade. A “flying saucer-like object” was spotted over Concourse C of the United terminal in November 2006 by pilots, airline management and mechanics. The incident, reported by a Chicago Tribune columnist a few weeks later, noted the object was first seen by a United ramp worker around 4:30 p.m.. After that, a variety of witnesses said the object was dark gray and 6 to 24 feet in diameter. The object was silent and appeared just below the 1,900-foot cloud deck, until shooting off into the clouds and leaving a circular hole shape in the clouds. The Federal Aviation Administration ... dismissed the incident as a weather phenomena. But for Center for UFO Studies Scientific Director Mark Rodeghier, the possible alien craft that appeared in the center’s own proverbial backyard remains a mystery worth exploring. “It’s an unknown object over O’Hare, and it’s seen by official personnel, and does United or the FAA take it seriously? Of course not, they have zero interest because UFOs can’t exist. But how can you not worry about something hovering over an airport after 9/11? It doesn’t make sense,” Rodeghier said. Journalist Leslie Kean also wrote about it in her book “UFOs: Generals, Pilots and Government Officials Go On The Record” and talked about in on “The Colbert Report” with Stephen Colbert in 2010, saying the government should investigate the O’Hare incident.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on UFOs from reliable major media sources.\n\nWarning: Your Cell Phone May Be Hazardous to Your Health\n\n2010-01-26, GQ\n\nPosted: 2019-06-17 19:02:59\n\nIt's hard to talk about the dangers of cell-phone radiation without sounding like a conspiracy theorist. This is especially true in the United States, where non-industry-funded studies are rare, where legislation protecting the wireless industry from legal challenges has long been in place, and where our lives have been so thoroughly integrated with wireless technology that to suggest it might be a problem ... is like saying our shoes might be killing us. Except our shoes don't send microwaves directly into our brains. And cell phones do - a fact that has increasingly alarmed the rest of the world. There are multiple reports, mostly out of Europe's premier research institutions, of cell-phone and PDA use being linked to \"brain aging,\" brain damage, early-onset Alzheimer's, senility, DNA damage, and even sperm die-offs. In September 2007, the European Union's environmental watchdog, the European Environment Agency, warned that cell-phone technology \"could lead to a health crisis similar to those caused by asbestos, smoking, and lead in petrol.\" In the U.S., there's been very little resistance to the march of the cell towers. In fact, in Congress there's been almost nothing but support. The Telecommunications Act of 1996 ... was the result, in part, of nearly $50 million in political contributions and lobbying largesse from the telecom industry. A rider known as Section 704 ... specifically prohibits citizens and local governments from stopping placement of a cell tower due to health concerns.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on wireless technology risks from reliable major media sources.\n\n'Drag Syndrome': Performers with Down syndrome find outlet for their creativity\n\n2018-10-13, NBC News\n\nPosted: 2019-06-17 19:01:03\n\n[Otto] Baxter, 31, is part of an art collective called Culture Device — a group of approximately 12 performers that experiment with contemporary dance and theater, pushing the boundaries of the cultural arena by changing perceptions of what it means to be an artist today. This is because of the sheer talent radiating from the small troupe’s repertoire, one that has tackled the likes of haute couture photography and stage classics such as \"Waiting for Godot,\" but also on account that all the performers share the genetic condition Down syndrome. “The starting point is the art,” Daniel Vais, Culture Device’s creative director and choreographer, told NBC News. “Before Down’s syndrome, before extra chromosome, before disability, before anything.” Culture Device has slowly built up a reputation for its high-quality work in a sector not known for its inclusivity. A 2018 report by Arts Council England, for instance, found that most art forms and institutions generally had less than 5 percent of disabled persons working in them. “I didn’t plan to work with artists with Down’s syndrome,” said Vais. “It found me.” While considered a disability that has varying levels of severity, Vais dismisses what he calls a bias-ridden label, preferring to uphold the notion that individuals with Down syndrome have a mindset akin to what’s needed for outstanding artistic creation. “I use improvisation in all of my choreography,” he said, “and artists with Down syndrome are the masters of improvisation.”\n\nNote: Explore a treasure trove of concise summaries of incredibly inspiring disabled persons news articles which will inspire you to make a difference.\n\nAli Stroker Makes History as First Wheelchair User to Win a Tony\n\n2019-06-09, New York Times\n\nPosted: 2019-06-17 18:59:20\n\nOn Sunday night, Ali Stroker became the first person who uses a wheelchair to win a Tony Award. “This award is for every kid who is watching tonight who has a disability, who has a limitation or a challenge, who has been waiting to see themselves represented in this arena — you are,” Ms. Stroker said while accepting her statuette for her role as Ado Annie in the Broadway revival of the musical “Oklahoma!.” Ms. Stroker, a 31-year-old New Jersey native who lost the use of her legs in a car accident when she was 2 years old, also thanked her parents “for teaching me to use my gifts to help people.” Ms. Stroker accepted the award, for best featured actress, shortly after dazzling the audience with her saucy performance of the “Oklahoma!” song “I Cain’t Say No.” “I find it to be fascinating that often people don’t think I can dance,” she said. “Who says that dance isn’t turning on wheels? Who says dancing isn’t throwing your arms up in the air and grabbing someone else’s arms to be propelled across the stage?” She also spoke about what it is like to aspire to succeed in an industry where people with disabilities are not represented. “I’m very aware that when I was a little girl I wasn’t seeing anybody like me, and on days when I’m exhausted or discouraged about something, that lights a fire,” she said. “I hope that for young people in chairs who feel that this is too hard, that they see that being in a chair is like getting a secret key to an unknown door — that they ... are reassured that anything is possible.”\n\nNote: Explore a treasure trove of concise summaries of incredibly inspiring disabled persons news articles which will inspire you to make a difference.\n\nTiny Costa Rica Has a Green New Deal, Too. It Matters for the Whole Planet.\n\n2019-03-12, New York Times\n\nPosted: 2019-06-17 18:57:38\n\nCosta Rica, population 5 million, wants to wean itself from fossil fuels by 2050, and the chief evangelist of the idea is a 38-year-old urban planner named Claudia Dobles who also happens to be the first lady. Every country will have to aspire to something similar, scientists say, if the world is to avert the most dire consequences of global warming. And while Costa Rica’s carbon footprint is tiny compared to other countries, Ms. Dobles has a higher goal in mind: Getting rid of fossil fuels would show the world that a small country can be a leader on an awesome problem and improve the health and well-being of its citizens in the bargain. Costa Rica’s green bid, though fraught with challenges, has a head start. Electricity comes largely from renewable sources already — chiefly hydropower, but also wind, solar and geothermal energy. The country has doubled its forest cover in the last 30 years, after decades of deforestation. Now, if its decarbonization strategy succeeds, it could provide a road map to others, especially developing countries. For Ms. Dobles, the top priority is fixing transportation. It is the largest single source of Costa Rica’s greenhouse gas emissions. The National Decarbonization Plan, as it’s called, envisions electric passenger and freight trains in service by 2022. Under the plan, nearly a third of all buses would be electric by 2035, dozens of charging stations would be built, and nearly all cars and buses on the roads would be electric by 2050.\n\nNote: Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nWhistleblowers go undercover to expose criminal drug operation within the Chicago PD\n\n2019-05-24, CBS News\n\nPosted: 2019-06-17 15:43:08\n\nAs a Chicago police officer, Shannon Spalding worked undercover in some of the toughest parts of the city -- only to discover some of the most dangerous criminals were fellow police officers. She risked her life to stop them. Soon after joining the Chicago Police Department in 1996, Spalding drew an assignment in one of the most violent neighborhoods in the city. To survive, Spalding leaned on veteran cops like Ronald Watts. In 2006, a decade after Spalding was trained by Watts, she had a new assignment in the narcotics division. \"I was the undercover. I would go out, I would make the controlled narcotics purchases,\" Spalding explained. Her partner, Danny Echeverria, would swoop in and make arrests. But during police interviews, something strange started happening. \"People would say … 'I can't believe you're going to arrest me when one of your own is actually running the narcotics trade,'\" said Spalding. [She] learned Watts and his crew would plant drugs on residents of the Ida B. Wells projects and extort cash. Spalding and her partner would eventually learn Watts' bad deeds had been going on for years. [They] would spend years undercover investigating Ronald Watts and his team. In February 2012, Sgt. Ronald Watts and one of his officers, Kallat Mohammed, were arrested after being caught robbing a drug courier of $5,200. That courier was Spalding's informant and was wearing an FBI wire. Both Watts and Mohammed were convicted. Watts was sentenced to 22 months and Mohammed received an 18-month sentence. Aided by that investigation, more than 60 people wrongfully arrested by Watts and his team have now been exonerated.\n\nNote: The article fails to mention how the police went after Spalding. Watch a riveting CBS video showing this and more on the depths of corruption in the Chicago police department. And if you think it's only Chicago, think again. As Spalding stated when asked about the police code of silence, \"You never, ever go after a fellow officer.\" Though 60 innocent victims were freed from jail, many of the officers who committed these crimes are still on the police force. For more, see concise summaries of deeply revealing news articles on police corruption from reliable major media sources.\n\n‘Wow, What Is That?’ Navy Pilots Report Unexplained Flying Objects\n\n2019-05-26, New York Times\n\nPosted: 2019-06-09 19:01:59\n\nThe strange objects, one of them like a spinning top moving against the wind, appeared almost daily from the summer of 2014 to March 2015, high in the skies over the East Coast. Navy pilots reported to their superiors that the objects had no visible engine or infrared exhaust plumes, but that they could reach 30,000 feet and hypersonic speeds. “These things would be out there all day,” said Lt. Ryan Graves, an F/A-18 Super Hornet pilot who has been with the Navy for 10 years, and who reported his sightings to the Pentagon and Congress. “With the speeds we observed, 12 hours in the air is 11 hours longer than we’d expect.” No one in the Defense Department is saying that the objects were extraterrestrial. Lieutenant Graves and four other Navy pilots, who said ... that they saw the objects in 2014 and 2015 in training maneuvers from Virginia to Florida off the aircraft carrier Theodore Roosevelt, make no assertions of their provenance. But the objects have gotten the attention of the Navy, which earlier this year sent out new classified guidance for how to report what the military calls unexplained aerial phenomena, or unidentified flying objects. The sightings were reported to the Pentagon’s ... Advanced Aerospace Threat Identification Program, which analyzed the radar data, video footage and accounts provided by senior officers from the Roosevelt. Luis Elizondo, a military intelligence official who ran the program until he resigned in 2017, called the sightings “a striking series of incidents.”\n\nNote: The fact that the media is no longer debunking UFOs suggests that a gradual acculturation process is being used. Those in the know have been aware of many intense UFO encounters reported by military officers and more for many decades. For more along these lines, see concise summaries of deeply revealing news articles on UFOs from reliable major media sources.\n\nDeaths of indigenous women 'a Canadian genocide', leaked report says\n\n2019-06-01, BBC News\n\nPosted: 2019-06-09 19:00:13\n\nA national public inquiry into possibly thousands of missing and murdered indigenous women in Canada has called the deaths a \"Canadian genocide\". The report was leaked to Canada's national broadcaster CBC which published details. The 1,200-page document reportedly blames the disproportionate violence faced by indigenous women on deep-rooted colonialism and state inaction. The findings of the National Inquiry into Murdered and Missing Indigenous Women and Girls are long-awaited in Canada, where there are about 1.6m indigenous people. \"It took 40 years to get to this present moment and only because indigenous women have been on the ground making noise about this,\" Robyn Bourgeois, a campaigner on the issue, told the BBC. The inquiry concluded that about 1,200 aboriginal women had been murdered or gone missing in Canada since 1980, but some activists say the number is likely to have been far higher. The report acknowledged disagreements over what constituted genocide, but concluded: \"The national inquiry's findings support characterizing these acts, including violence against Indigenous women, girls, and 2SLGBTQQIA [two-spirit, lesbian, gay, bisexual, transgendered, queer, questioning, intersex and asexual] people, as genocide.\" The inquiry, which cost C$92m ($67m; Ł53m), focused on the systemic causes of violence against indigenous women as well as on prevention. It has heard from more than 2,000 witnesses since 2017.\n\nNote: Kevin Annett is a great Canadian hero who has worked tirelessly and courageously in the face of death threats to expose the systematic abuse and murders of native children in Canada. He was recently kidnapped while crossing the border. Don't miss his amazing story of all the happened.\n\nThousands of cancer diagnoses tied to a poor diet, study finds\n\n2019-05-23, CNN News\n\nPosted: 2019-06-09 18:58:15\n\nYour diet may have more impact on your cancer risk than you might think, a new study has found. An estimated 80,110 new cancer cases among adults 20 and older in the United States in 2015 were attributable simply to eating a poor diet, according to the study, published in the JNCI Cancer Spectrum. \"This is equivalent to about 5.2% of all invasive cancer cases newly diagnosed among US adults in 2015,\" said Dr. Fang Zhang ... who was first author of the study. \"This proportion is comparable to the proportion of cancer burden attributable to alcohol,\" she said. The researchers evaluated seven dietary factors: a low intake of vegetables, fruits, whole grains and dairy products and a high intake of processed meats, red meats and sugary beverages, such as soda. \"Low whole-grain consumption was associated with the largest cancer burden in the US, followed by low dairy intake, high processed-meat intake, low vegetable and fruit intake, high red-meat intake and high intake of sugar-sweetened beverages,\" Zhang said. You may protect yourself from cancer by avoiding ultraprocessed foods and instead choosing organic foods, research has shown. People who frequently eat organic foods lowered their overall risk of developing cancer, according to a study published last year in the medical journal JAMA Internal Medicine. Specifically, those who primarily ate organic foods were more likely to ward off non-Hodgkin lymphoma and postmenopausal breast cancer than those who rarely or never ate organic foods.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on food system corruption from reliable major media sources.\n\nFrom chicken to tomatoes, here's why American food is hurting you\n\n2019-05-28, The Guardian (One of the UK's leading newspapers)\n\nPosted: 2019-06-09 18:56:11\n\nOur food and our health are deeply connected. American healthcare spending has ballooned to $3.5tn a year, and yet we are sicker than most other developed countries. Meanwhile, our food system contains thousands of chemicals that have not been proven safe and many that are banned in other countries. Instead of potentially hazardous substances being banned from our food, as they are in, say, Europe, chemicals of concern are typically considered innocent until proven guilty. As a result, we are the guinea pigs in our own experiment. For decades we’ve operated on the principle that if we can selectively kill off the unwanted parts of the natural world, we can control our futures. Farmers operate that way, but also homeowners, highway crews and landscapers. We spread herbicides, fungicides, pesticides, insecticides, fertilizers, antibiotics, hormones and various other toxins which kill everything around. Even good things. We’re becoming aware of the loss of what we can see: bees, butterflies, the diverse plant life of our ecosystems. We also need to worry about the invisible microbiome and fungi in the soil that nurture life above, store carbon and absorb water. By trying to control crops with herbicides, antibiotics and pesticides, we’ve actually bred bugs, weeds and diseases that are resistant to our control. And our chemical onslaught will have long-term effects. Our fertilizers and pesticides leach into groundwater and streams, head out to sea and create dead zones. They also leach into our drinking water.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on food system corruption from reliable major media sources.\n\nBanned bread: why does the US allow additives that Europe says are unsafe?\n\n2019-05-28, The Guardian (One of the UK's leading newspapers)\n\nPosted: 2019-06-09 18:54:25\n\nIt may sound odd, but in America, your loaf of bread can contain ingredients with industrial applications – additives that also appear in things like yoga mats, pesticides, hair straighteners, explosives and petroleum products. Some of these chemicals, used as optional whiteners, dough conditioners and rising agents, may be harmful to human health. Potassium bromate, a potent oxidizer that helps bread rise, has been linked to kidney and thyroid cancers in rodents. Azodicarbonamide (ACA), a chemical that forms bubbles in foams and plastics like vinyl, is used to bleach and leaven dough – but when baked, it, too, has been linked to cancer in lab animals. Other countries, including China, Brazil and members of the European Union, have weighed the potential risks and decided to outlaw potassium bromate in food. India banned it in 2016, and the UK has forbidden it since 1990. Azodicarbonamide has been banned for consumption by the European Union for over a decade. But despite petitions from several advocacy groups – some dating back decades – the US Food and Drug Administration (FDA) still considers these to be Gras or “generally recognized as safe” to eat, though plenty of experts disagree. The FDA does not review every additive that makes its way into food. Instead, companies can rely on their own experts to determine what’s safe and what isn’t. And once something was determined as Gras, [medical toxicologist Ryan] Marino said, “there is not often any financial incentive for additional testing”.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on food system corruption from reliable major media sources.\n\nArms Manufacturers Tell Investors that Iran Tension Fuels Business\n\n2019-05-28, The Intercept\n\nPosted: 2019-06-09 18:52:14\n\nDefense executives from around the country crowded into Goldman Sachs’ glimmering tower in downtown Manhattan in mid-May, eager to present before a conference of bankers and financial analysts. While much of the world was on edge over simmering tension in the Middle East, as the U.S. and its allies have stoked tensions with Iran, the businessmen at the conference talked of opportunity. Eric DeMarco, the president of Kratos Defense & Security Solutions, addressed the conference, arguing that his company is “very well-aligned” for the shift in the military budget away from asymmetrical fighting toward nation-state warfare. The rising threat of war with Iran, Russia, and China, DeMarco continued, could threaten U.S. naval power, which could require ballistic missile threat upgrades, the type of systems Kratos Defense specializes in. Large arms manufacturers from across the industry have similarly told investors that escalating conflict with Iran could be good for business. The statements to investors come as the U.S. has openly threatened to launch a new war. In recent weeks, the Trump administration discussed sending 120,000 soldiers to the Middle East in preparation for war with Iran, a move that comes after two years of increasing sanctions and militant rhetoric about the threat posed by the government in Tehran. The escalating tensions, while raising the potential for catastrophic conflict and loss of human life, could also be good for companies in the business of war.\n\nNote: Read an essay by one of the most highly decorated U.S. generals titled \"War is a Racket.\" For more along these lines, see concise summaries of deeply revealing news articles on military corruption from reliable major media sources.\n\nWhy are so many people dying in US prisons and jails?\n\n2019-05-26, The Guardian (One of the UK's leading newspapers)\n\nPosted: 2019-06-09 18:50:05\n\nOn 10 July 2015, 28-year-old Sandra Bland was pulled over in Prairie View, Texas, for what she was told by Texas state trooper Brian Encinia was failing to use her turn signal. Three days after Bland’s arrest, she was found dead in her jail cell. The death was ruled a suicide but remains shrouded in mystery over how a wrongful arrest stemming from a minor traffic violation resulted in death. Surges in the number of Americans dying while incarcerated have occurred against a backdrop of an increase in the US prison population by 500% over the last 40 years. Based on the latest national figures available from the Bureau of Justice Statistics, 4,980 prisoners in US correctional facilities died in 2014, a nearly 3% increase from 2013. In state prisons, the mortality rate was 275 for every 100,000 people, the highest since data collection began in 2001. Since 2014, a Guardian investigation has found several states, including Texas and Florida, with the first and third highest prison populations in the US, respectively, have reported either record mortality rates in prisons or jails or significant surges. A 2017 report published by the Rand Corporation on identifying the needs to reduce prison mortality rates suggested several high-priority needs. “A national medical examiner system should be implemented because of the additional rigor these professionals have and more consistency with how they do investigations and classify cause of death,” said Joe Russo, the lead author of the report.\n\nNote: Read an excellent article titled \"How The For-Profit Prison Industry Keeps 460,000 Innocent People in Jail Every Day.\" For more along these lines, see concise summaries of deeply revealing news articles on prison system corruption from reliable major media sources.\n\nThis Russia whistle-blower is serving 5 years in prison for leaking one document. Her mother says she's being silenced\n\n2019-05-29, CNN News\n\nPosted: 2019-06-09 18:48:03\n\nThe mother of the first whistle-blower arrested in the Trump era says her daughter is being held under an unjust media blackout to stop the American public learning who she really is. Billie Winner-Davis' daughter Reality Winner, a US Air Force veteran, was sentenced to prison for more than five years in August 2018 as part of a deal in which she pleaded guilty to leaking a classified NSA document providing details of a 2016 Russian cyberattack on a supplier of US voting software. Winner, 27, who worked in the US Air Force's drone program, is serving the longest sentence ever given to a journalistic source by a federal court, according to the Department of Justice. CNN has repeatedly sought permission to interview Winner in federal prison, and recently accompanied Winner-Davis on the seven-hour road trip from her home to visit her daughter at FMC Carswell in Fort Worth, where she is incarcerated, but our team was not permitted to go inside. FMC Carswell's warden has denied CNN's requests. Our attempts to speak with the warden over the phone ... were unsuccessful. CNN also sought to interview Winner by telephone but was told by her mother that the former drone operator has been told by prison staff not to add media outlets to her phone list. \"She has been warned and she has been frightened as far as the restrictions on her communications,\" Winner-Davis said. \"They're telling her she cannot even have any contact with any kind of journalists or media, in any way, shape, or form.\"\n\nNote: Read more about Winner's unjust prosecution for blowing the whistle on election interference. For more along these lines, see concise summaries of deeply revealing news articles on government corruption from reliable major media sources.\n\nA sense of purpose could prolong your life\n\n2019-05-25, Quartz\n\nPosted: 2019-06-09 18:45:40\n\nIncreasingly, scientists are finding that having a sense of purpose, whatever yours may be, is key to well-being. Now, a study published on May 24 in JAMA Current Open adds to the growing body of knowledge on the link between health and a driving force, finding that purposefulness is tied to longer lives. Researchers ... analyzed data from nearly 7,000 individuals over 50 years old and concluded that “stronger purpose in life was associated with decreased mortality.” They believe that “purposeful living may have health benefits.” The new analysis found that those whose psychological questionnaires reflected a lack of purpose were more likely to die than those who had “a self-organizing life aim that stimulates goals.” In fact, people without a purpose were more than twice as likely to die than those with an aim and goals. Purpose proved to be more indicative of longevity than gender, race, or education levels, and more important for decreasing risk of death than drinking, smoking, or exercising regularly. Notably, the research indicates that any purpose is better than none, as the reason people felt purposeful didn’t figure into the analysis. So it doesn’t seem to matter what it is that drives an individual, whether it’s a passion for growing peonies, say, or wanting to see their children develop, or loving the work they do. The important thing is simply having something that makes them excited about life and drives them. But those who feel no sense of purpose now shouldn’t despair because that drive can be cultivated.\n\nNote: Read an excellent, short essay on how to find and develop your life purpose. Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nThe transformational power of how you talk about your life\n\n2019-05-07, BBC News\n\nPosted: 2019-06-09 18:44:07\n\nImagine that, when you were 12 years old, your family moved to the other side of the country. In your new school, you were bullied for the first time. When you reflect upon this period of your life today, do you see this as just one of many episodes in which things were going great, and then turned sour? Or do you see it as another example of a tough experience that had a happy ending? It may not seem as if the way you tell this story, even just to yourself, would shape who you are. But it turns out that how you interpret your life, and tell its story, has profound effects on what kind of person you become. If you’re the kind of person who would remember the positives that came out of that (hypothetical) bullying episode at your new school, it’s also more likely that you enjoy a greater sense of wellbeing and satisfaction in life. Moreover, this raises the tantalising possibility that changing your self-authoring style and focus could be beneficial – indeed, helping people to re-interpret their personal stories in a more constructive light is the basis of what’s known as “narrative therapy”. Modify your story as you tell it, and perhaps you can change the kind of person you are. As philosophers have long argued, there is a sense in which we construct our own realities. Usually this liberating perspective is applied by psychotherapists to help people deal with specific fears and anxieties. Life story research suggests a similar principle may be applicable at a grander level, in the very way that we author our own lives, therefore shaping who we are.\n\nNote: Check out a highly inspiring online lesson which beautifully shows that what happens to you is not nearly as important as how you interpret what happens.\n\nPope asks forgiveness for historical mistreatment of Roma people\n\n2019-06-02, Reuters\n\nPosted: 2019-06-09 18:42:18\n\nPope Francis on Sunday asked forgiveness in the name of the Catholic Church for the mistreatment of the Roma people. Francis made the comment during a meeting with Roma people at the last event of his three day trip to Romania, saying his heart was made “heavy” by the meeting. “It is weighed down by the many experiences of discrimination, segregation and mistreatment experienced by your communities. History tells us that Christians too, including Catholics, are not strangers to such evil,” he said. With an estimated population of 10-12 million, approximately six million of whom live in the European Union, Roma people are the biggest ethnic minority in Europe and rights groups say they are often the victims of prejudice and social exclusion. A Roma youth, Razaila Vasile Dorin, told reporters: “It’s an honor that a person like the pope comes to our community. We are proud. It’s important that the pope is asking forgiveness. There is racism in every country. When we go out everyone looks at us and we don’t like that. I am proud to be a gypsy.” Earlier on Sunday, the pope said a Mass for some 100,000 people during which he beatified seven Communist-era bishops of the Eastern Rite Catholic Church who died in prison or as a result of their harsh treatment during Romania’s communist era. “(The bishops) endured suffering and gave their lives to oppose an illiberal ideological system that oppressed the fundamental rights of the human person,” Francis said.\n\nNote: Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\n19th Amendment guaranteeing women the right to vote was passed 100 years ago today\n\n2019-06-04, CBS News\n\nPosted: 2019-06-09 13:34:46\n\nThe 19th Amendment to the United States Constitution, guaranteeing American women the right to vote, celebrates a big birthday on Tuesday, as it was passed by both chambers of Congress 100 years ago on June 4, 1919. According to the National Archives, the House of Representatives first passed the amendment on May 21, 1919, and two weeks later, on June 4, the Senate followed with a vote of 56 to 25. The next year, following approval by three-fourths of state legislatures, the amendment was ratified into the Constitution. The opening of the Amendment's text reads, \"The right of citizens of the United States to vote shall not be denied or abridged by the United States or by any state on account of sex.\" Since the 19th Amendment's passage, women have helped inaugurate a new era of American politics. In fact, many historians can point a clear line from the passage of the 19th amendment to the passage of Civil Rights legislation in the 1960s and the current movements seeking to offer greater federal protections for gay and transgender Americans. The 19th Amendment emerged out of the Progressive Era in American politics, a period of increased social activism and economic reform during the first two decades of the 20th century. Suffragists like Jeannette Rankin, the first female member of the House of Representatives, brought greater attention to the rights of women. Certain states like California, Washington and Arizona passed their own legislation granting women either full or partial suffrage in the early 1910s. Wyoming was the first to do so in 1869, when it was still a territory.\n\nNote: Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nTrump bypasses Congress to push through arms sales to Saudis, UAE\n\n2019-05-24, NBC News\n\nPosted: 2019-06-02 13:04:58\n\nThe Trump administration on Friday cited a national security \"emergency\" allegedly caused by Iran to bypass Congress and rush through arms sales worth billions of dollars to Saudi Arabia and other Middle East allies, in a move that drew condemnation from lawmakers on both sides of the aisle. Citing a rarely used provision of arms control law, the administration informed lawmakers it was declaring a national security emergency, allowing it to go ahead with the sale of weapons to Saudi Arabia, the United Arab Emirates and Jordan without congressional approval, according to administration letters sent to senators. The decision affected various arms packages worth roughly $8 billion. The move came despite growing bipartisan opposition to any arms sales to Saudi Arabia amid outrage over the killing of Saudi writer Jamal Khashoggi at the Saudi consulate in Istanbul last year, as well as over Riyadh's air war in Yemen that has caused high numbers of civilian casualties. A bipartisan majority in Congress has voted to halt U.S. support for the Saudi-led war in Yemen but President Donald Trump vetoed the legislation. Democrats in Congress said the Trump administration expedited the arms packages because it could not secure a majority of lawmakers to support any proposed sales to the Saudis.\n\nNote: The military-industrial complex clearly has Donald Trump on their side. Saudi Arabia's war in Yemen is a humanitarian disaster. For more along these lines, see concise summaries of deeply revealing news articles on government corruption from reliable major media sources.\n\nHas the Government Legalized Secret Defense Spending?\n\n2019-01-16, Rolling Stone\n\nPosted: 2019-06-02 13:02:33\n\nOctober 4th, 2018, was a busy news day. The only thing that did not make the news was an announcement by a little-known government body called the Federal Accounting Standards Advisory Board - FASAB - that essentially legalized secret national security spending. The new guidance, “SFFAS 56 – CLASSIFIED ACTIVITIES” permits government agencies to “modify” public financial statements. It also expressly allows federal agencies to refrain from telling taxpayers if and when public financial statements have been altered. To Michigan State professor Mark Skidmore, who’s been studying discrepancies in defense expenditures for years, the new ruling - and the lack of public response to it - was a shock. “From this point forward,” he says, “the federal government will keep two sets of books, one modified book for the public and one true book that is hidden.” Catherine Austin Fitts was Assistant Secretary for Housing and Urban Development during the George H.W. Bush administration. She’s been working with Skidmore on defense accounting issues for two years. She was so alarmed about the new FASAB ruling she commissioned an in-depth study of “Standard 56” for her site, the Solari Report. The report writes bluntly that SFFAS 56 is: “... taking government accounting practices from laxly enforced reporting standards to a new benchmark entirely–expressly approved obfuscation of reporting and, in some cases, outright concealing financials.”\n\nNote: Read summaries of several major media articles showing the Pentagon's blatant lies and disregard for accounting. For more along these lines, see concise summaries of deeply revealing news articles on corruption in government and in the military.\n\nJohnson & Johnson opioids helped create 'worst man-made public health crisis in history,' Oklahoma says in court\n\n2019-05-28, NBC News\n\nPosted: 2019-06-02 13:00:37\n\nThe first trial against a pharmaceutical opioid manufacturer started Tuesday in Oklahoma in what could be a precedent-setting case for hundreds of other claims around the country. The state's attorney general, Mike Hunter, began the day by accusing Johnson & Johnson of putting profits over responsibility and argued that the company was responsible for the \"worst man-made public health crisis in the history of our state and country.\" In the multibillion-dollar lawsuit against the drugmaker, lawyers for the state argued that Johnson & Johnson knew about the addictive nature of opioids, but misled doctors by downplaying the risks of the drugs while touting its benefits. Brad Beckworth, a lawyer for Oklahoma, argued that Johnson & Johnson was motivated to increase sales on multiple fronts as both the manufacturer of the drugs Duragesic and Nucynta and as a supplier of the raw materials for other opioid manufacturers. He argued that a marketing push by Johnson & Johnson lead doctors to overprescribe opioids in Oklahoma. “If you oversupply, people will die,” Beckworth repeatedly said in his opening statement while showing email communications from Johnson & Johnson sales representatives. Oklahoma settled with two other drug manufacturers before Tuesday’s opening statements. In March, Purdue Pharma settled for $270 million, and on Sunday, Teva Pharmaceuticals settled for $85 million, leaving Johnson & Johnson as the sole defendants in what could a monthslong bench trial.\n\nNote: Many doctors also profited from excessive prescribing of dangerous opioids. And according to a former DEA agent, Congress helped drug companies fuel the opioid epidemic. For more along these lines, see concise summaries of deeply revealing news articles on Big Pharma corruption from reliable major media sources.\n\nPurdue Pharma accused of 'corrupting' WHO to boost global opioid sales\n\n2019-05-22, The Guardian (One of the UK's leading newspapers)\n\nPosted: 2019-06-02 12:57:42\n\nPurdue Pharma, the drug manufacturer that kickstarted the US opioid epidemic, corruptly influenced the World Health Organization in order to boost painkiller sales across the globe, according to a report by members of Congress. An investigation by Katherine Clark and Hal Rogers, who represent districts in Massachusetts and Kentucky hard hit by the US opioid epidemic, accuses Purdue of replicating its false marketing claims about the safety and effectiveness of opioids to change WHO prescribing guidelines in an attempt to expand foreign markets for its drugs. “The web of influence we uncovered paints a picture of a public health organization that has been corrupted by the opioid industry,” said Clark. “The WHO appears to be lending the opioid industry its voice and credibility, and as a result, a trusted public health organization is trafficking dangerous misinformation that could lead to a global opioid epidemic.” The report ... accuses Purdue of using pharma-funded organizations and specialists to influence the writing of WHO policy to encourage much wider prescribing of addictive high-strength opioids across the globe. It said that, as a result, “WHO guidelines are serving as marketing materials for Purdue”. [The] report alleges two WHO guidelines ... “contain dangerously misleading and, in some instances, outright false claims about the safety and efficacy of prescription opioids”. “Alarmingly, these guidelines mirror Purdue’s marketing strategies to increase prescriptions and expand sales,” the report found.\n\nNote: Many doctors also profited from excessive prescribing of dangerous opioids. And according to a former DEA agent, Congress helped drug companies fuel the opioid epidemic. For more along these lines, see concise summaries of deeply revealing news articles on Big Pharma corruption from reliable major media sources.\n\nAtomic Veterans Were Silenced for 50 Years. Now, They’re Talking.\n\n2019-05-27, The Atlantic\n\nPosted: 2019-06-02 12:54:59\n\nNearly everyone who’s seen it and lived to tell the tale describes it the same way: a horrifying, otherworldly thing of ghastly beauty that has haunted their life ever since. “The colors were beautiful,” remembers a man in Morgan Knibbe’s short documentary The Atomic Soldiers. “I hate to say that.” Many tales of the atomic bomb, however, weren’t told at all. In addition to the hundreds of thousands of Japanese civilians who died in Hiroshima and Nagasaki, an estimated 400,000 American soldiers and sailors also observed nuclear explosions - many just a mile or two from ground zero. From 1946 to 1992, the U.S. government conducted more than 1,000 nuclear tests, during which unwitting troops were exposed to vast amounts of ionizing radiation. After the tests, the soldiers, many of whom were traumatized, were sworn to an oath of secrecy. Breaking it even to talk among themselves was considered treason, punishable by a $10,000 fine and 10 or more years in prison. In Knibbe’s film, some of these atomic veterans break the forced silence to tell their story for the very first time. They describe how the blast knocked them to the ground; how they could see the bones and blood vessels in their hands, like viewing an X-ray. What appalled Knibbe the most was how the U.S. government failed the veterans. “Until this day, a lot of what has happened - and the radiation-related diseases the veterans have contracted and passed on to the generations after them - is still being covered up,” Knibbe said.\n\nNote: Don't miss the most profound, 22-minute video at the link above. And for lots more on the huge cover-up of the terrifying effects of the bomb, see this most informative webpage. Explore lots more astonishing, verifiable information on humans used as guinea pigs in the last 100 years.\n\nThe Hiroshima cover-up\n\n2005-08-05, Baltimore Sun\n\nPosted: 2019-06-02 12:52:24\n\nThe discovery of reporter George Weller's firsthand account of conditions in post-nuclear Nagasaki sheds light on one of the great journalistic betrayals of the last century: the cover-up of the effects of the atomic bombing on Japan. On Aug. 6, 1945, the U.S. dropped an atomic bomb on Hiroshima; three days later, Nagasaki was hit. Gen. Douglas MacArthur promptly declared southern Japan off-limits, barring the news media. More than 200,000 people died in the atomic bombings of the cities, but no Western journalist witnessed the aftermath and told the story. A month after the bombings, two reporters defied General MacArthur and struck out on their own. Mr. Weller, of the Chicago Daily News, took row boats and trains to reach devastated Nagasaki. Independent journalist Wilfred Burchett rode a train for 30 hours and walked into the charred remains of Hiroshima. Both men encountered nightmare worlds. Mr. Burchett's article, headlined \"The Atomic Plague,\" was published Sept. 5, 1945, in the London Daily Express. The story caused a worldwide sensation and was a public relations fiasco for the U.S. military. So when Pulitzer Prize-winning reporter George Weller's 25,000-word story on the horror that he encountered in Nagasaki was submitted to military censors, General MacArthur ordered the story killed, and the manuscript was never returned. Recently, Mr. Weller's son, Anthony, discovered a carbon copy of the suppressed dispatches among his father's papers (George Weller died in 2002).\n\nNote: George Weller's account of post-war Japan can be read in the book First Into Nagasaki. For more along these lines, see concise summaries of deeply revealing news articles on military corruption from reliable major media sources.\n\nPesticides could wipe out frogs by turning them female, study finds\n\n2018-06-04, The Independent (One of the UK's leading newspapers)\n\nPosted: 2019-06-02 12:48:57\n\nA widely used pesticide could be placing frog populations in danger by diminishing their ability to reproduce properly. Not only does exposure to the chemical linuron – a potato herbicide – reduce male frog fertility, it skews the sex ratios of growing tadpoles significantly towards females. The devastation pesticides have caused to insect populations has been well documented, with German scientists warning of an “ecological Armageddon” when they found numbers had plummeted by 75 per cent in the country’s nature reserves. Knock-on effects further up the food chain are thought to be behind the disappearance of many bird species from the European countryside. But pesticides can have toxic effects on other animals too, and there has been a distinct lack of research into their effects on amphibians. To improve this situation, ecotoxicologist Dr Cecilia Berg of the University of Uppsala and a team of ... researchers set out to investigate the effects of linuron in the West African clawed frog. They found that the tadpoles grew ovaries substantially more than they grew testicles, an effect the team attributed to the endocrine disrupting – or hormone disrupting – properties of linuron, which could hinder production of testosterone. The male frogs exposed to the chemicals as tadpoles were less fertile and had certain feminine characteristics. While linuron is not licensed for use in the ", "images": ["https://www.wanttoknow.info/m/images/header-logo.png", "https://www.paypalobjects.com/en_US/i/btn/btn_donate_LG.gif", "https://www.wanttoknow.info/m/images/header-mission.png", "https://www.WantToKnow.info/images/news-magnify.jpg", "https://www.wanttoknow.info/images/rss.gif"], "top_img": "https://www.WantToKnow.info/images/news-magnify.jpg", "keywords": [], "authors": [], "canonical_link": "", "title": "News Stories", "meta_data": {"description": "News stories: Excerpts from highly revealing major media news stories suggest major cover-ups of health, energy, media, 9/11, war, elections, and more. Links to original stories provided for easy verification.", "keywords": "news,articles,9/11,911,elections,energy,inventions,financial,global,warming,government,health,mass,media,,information,polls,able,danger,avian,flu,corporate,corruption,dolphins,whales,hurricane,katrina,income,inequality,inspirational,microchips,mind,control,nature,reality,non-lethal,nonlethal,privacy,secrecy,secret,societies,terrorism,ufos,vaccines,war", "viewport": "width=device-width, initial-scale=1", "ROBOTS": "INDEX,FOLLOW", "Revisit-after": "21 days", "rating": "general", "google-site-verification": "93poa4ULbuO4k4m5pcOzlCUyZF-QR_CMpiv-eFUo8sw"}, "movies": [], "publish_date": null, "source": "https://www.wanttoknow.info", "summary": ""}