{"url": "https://www.vibe.com/2018/04/eminem-framed-music-video", "text": "The much-awaited Revenge of the Dreamers III compilation album was released this past Friday (July 5), and it exceeded all expectations, and then some.\n\nThe first two records of the trilogy predominantly featured Dreamville acts, and their in-house producers. However, this time J. Cole’s label shed their reputation of sectioning themselves off from the rest of the industry and embraced artists and producers from outside of their circle.\n\nThe melodic, often raspy, only occasionally recognizable voices of the 32 rappers and singers featured on the 18-track album, echo throughout the project. As was expected, J. Cole spit lots of great verses, but the the other emcees certainly weren't masked by his shadow. In fact, Cole gave ample room for the young bloods on ROTD3 to showcase their clever lines, their vocal range, and their artistry as a whole.\n\nWhile it was hard to narrow down which artists on ROTD3 were the best, there are several on the project who stood out and earbed than a couple of rounds of applause. The five have yet to achieve chart-topping status, but after their performance on ROTD3, that achievement isn’t far away.\n\n1. Buddy\n\nBuddy proclaimed himself the “Rap Camp MVP,” and his praise was validated by the Dreamville documentary and the record itself. The 25-year-old’s valley voice can be heard on three songs off the project and he was unlike anyone else, bringing an eccentric vibe to the songs he was featured on. In fact, Buddy’s one of the best parts on the album’s standout song, “1993” and he didn’t even rap on it. Hearing Buddy playfully cut off and hound Smino, Cozz, Doctur Dot (EarthGang), J.I.D and Cole himself, so they could focus on more important things such as smoking weed, brought a carefree element to ROTD3. Some may not expect such jovial vibes from the usually thoughtful Dreamville camp. Like Cole said, Buddy is “a real life legend.”\n\n2. J.I.D\n\nJ.I.D. is quickly becoming one of Dreamville’s most recognizable acts, and it’s easy to see why he was featured on five different songs on the album, more than any other artist on ROTD3 aside from Cole. He represented his hometown of Atlanta effortlessly, especially on the lead-up single “Down Bad,” where his voice— unique as ever—uplifts the chorus. He’s hard to keep up with and he’s always quick with his rhymes, but there's no reason why J.I.D should have to slow down. With a style similar to Kendrick Lamar’s, J.I.D’s destination to the top is inevitable, and the quicker he gets there, the better. After all, who else could have came up with the bars: “I was just f***ed up, I was just down, down bad/I had to tighten the f**k up, but I’m here for the crown/Board of Education vs. Brown/I was bored of education, left the town/F**k a résumé and f**k a cap and gown/F**k a background check back’round when I get the check/N***a, that’s now.”\n\n3. J. Cole\n\nDreamville founder J. Cole always carries high expectations with him, and he showed out with his seven appearances - more than any other artist - on ROTD3. The project saw Cole working differently from usual, but he displayed adaptability and flourished outside of his comfort zone. On “1993,” fans hear a version of Cole that he often keeps hidden – a fun, wild side that keeps up with the the carefree energy of the younger rappers on the track. For those other listeners who were itching to hear old school Cole from his Born Sinner days, he brought that out on the song “Sacrifices.” Sure, the North Carolina native can be the butt of Twitter memes — but who else can go platinum with no features — but every time he shows up, he shows out and shows the rap industry why Dreamville is such a force.\n\n4. EarthGang\n\nDoctur Dot and Johnny Venus are two most versatile rappers on ROTD3, and together they form one of the most formidable groups in hip hop. While their verses are crafty, it’s not so much their rhymes that command a song, but rather the way they play with and control their voices. Both Doctur Dot and Johnny Venus have a talent for manipulating the tone and range of their vocal chords, and that is especially evident in “Swivel,” their song on the album. They bring a unique sense of quirkiness to each appearance, and when they link up with the equally unconventional Buddy or Smino, magic happens.\n\n5. Guapdad4000\n\nGuapdad4000 is largely known for his hilarious viral social media videos or for his songs about scamming, but he took Revenge of the Dreamers III as an opportunity to show off his musical talents at a high level. He told VIBE, \"I felt that I wasn’t going to go down there and outrap the super rap rap ni**as, even though talent-wise, I am a super rap rap ni**a. ... My plan was to just be true to myself, let my tone carry.\" The Oakland artist does exactly that, turning in two of the best choruses on the album with \"Don't Hit Me Right Now\" and \"Costa Rica.\" His airy vocals and catchy, earworm hooks hold together the songs he appears on. And he also briefly bars up on \"Wells Fargo.\" Guapdad4000 is hilarious, but his skills are nothing to joke about.\n\n6. Cozz\n\nCozz is Dreamville’s youngest member at 25 years old, joining the label in 2014 and reintroducing himself to the world on ROTD3. Although he has two projects already released under Dreamville, this is without a doubt the biggest “stage” he’s ever been on and he took advantage of it. The Los Angeles native was bold on this album with his record featuring Top Dawg Entertainment artist, Reason, called “LamboTruck” and speaks to his artistry. He’s a risk taker, a big one at that given the fact that the Kal Banx-produced song is him expressing a few frustrations he has with his label. Every bar Cozz let off on the track was crafty and clever, which is definitely a strength of his, and as a listener it was entertaining figuring out the underlying meaning. Cozz is not one to be slept on, and it’s about time is welcomed into the new class of young rappers.\n\n6. Ari Lennox\n\nLately touted as the “First Lady of Dreamville,” Ari Lennox can always be counted on to bring heart and soul to any project she touches. Her syrupy, raspy voice was the perfect touch to ROTD3 to make it whole and her heartfelt lyrics were the cherry on top. On “Got Me,” which was a single released prior to the album’s drop date, fans can hear the DMV songstress harmonize effortlessly with features king, Ty Dolla $ign. “Self Love” is a relatable ballad that strikes a chord with people every time Lennox croons, “self love is the best drug/but your love is the worst drug.” With her own debut album Shea Butter Baby already making big waves this year, plus her features on ROTD3, Lennox is taking the R&B world by storm, and she’ll let it rain on anyone who lets her.", "images": ["https://static.vibe.com/files/2019/07/spinderella-suing-salt-n-pepa-1562856595-240x135.jpg", "https://static.vibe.com/files/2019/07/lil-kim-blasts-media-1562792338-240x135.jpg", "https://static.vibe.com/files/2019/07/Dreamville-by-Jonathan-Manion-1562449324-e1562602999664-650x366.png", "https://static.vibe.com/files/2018/04/eminem-framed-vid-2018-billboard-1548-1522785474-compressed.jpg", "https://static.vibe.com/files/2019/07/cardi-b-jermaine-dupri-getty-1562899715-650x366.jpg", "https://static.vibe.com/files/2019/07/cardib-jennifer-lopez-hustlers-film-1553025230-768x768-1562858258-240x135.jpg", "https://www.vibe.com/assets/images/logo/white.svg?edb4fa5dcea44378cb64", "https://static.vibe.com/files/2019/07/GettyImages-1160402526-2-1562776630-300x169.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1"], "top_img": "https://static.vibe.com/files/2018/04/eminem-framed-vid-2018-billboard-1548-1522785474-compressed.jpg", "keywords": [], "authors": ["Nerisha Penrose"], "canonical_link": "https://www.vibe.com/2018/04/eminem-framed-music-video", "title": "Eminem Escapes From An Asylum In Twisted “Framed” Video", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=no", "article": {"modified_time": "2018-04-03T16:33:05-04:00", "published_time": "2018-04-03T12:52:31-04:00"}, "og": {"image": {"identifier": "https://static.vibe.com/files/2018/04/eminem-framed-vid-2018-billboard-1548-1522785474-compressed.jpg", "height": 421, "width": 636}, "title": "Eminem Escapes From An Asylum In Twisted “Framed” Video", "type": "article", "url": "https://www.vibe.com/2018/04/eminem-framed-music-video", "site_name": "Vibe"}, "twitter": {"card": "summary", "image": "https://static.vibe.com/files/2018/04/eminem-framed-vid-2018-billboard-1548-1522785474-compressed.jpg", "title": "Eminem Escapes From An Asylum In Twisted Visual For \"Framed\"", "site": "@vibemagazine"}}, "movies": [], "publish_date": 1522774351.0, "source": "https://www.vibe.com", "summary": ""}