{"url": "https://www.cinemablend.com/news/2394442/chrissy-metz-almost-got-lube-on-hugh-jackmans-suit-at-the-mtv-movie-awards", "text": "Chrissy Metz Almost Got Lube On Hugh Jackman's Suit At The MTV Movie Awards Random Article Blend By Conner Schwerdtfeger Facebook\n\n\n\n\n\ncinemablend\n\n\n\nEmail Awards shows have proven that they can generate some truly bizarre moments. From the infamous mix-up involving La La Land and Moonlight at The Oscars to The Disaster Artist's James Franco preventing Tommy Wiseau from speaking at The Golden Globes, there's never a shortage of stories coming out of events. In fact, This Is Us' Chrissy Metz recently opened up about presenting an award to Hugh Jackman at the MTV Movie Awards, and she admitted that she almost got lube on his suit during the ceremony. The actress addressed the weird story in a recent interview on Today and said: We were presenting Hugh Jackman an award for Logan and I said 'Wait.' I whispered in his ear because we were on camera. I was like 'My dress is lubed up.' And he's like 'What?' And I said, 'It's latex and it's lubed up and I don't want to get it on your suit.' And he's like, 'Right. Right.' I don't ever want to say that again because it was awkward, and it was hard to handle. According to the story, Chrissy Metz needed to lube up her latex dress when she attended the MTV Movie Awards last year. The NBC star was presenting an award to Hugh Jackman for his work on Logan. However, as she laid out in her remarks, the lube became a bit of a problem when they were on-camera, and she had to lean over and tell him that there was a risk of some of the lube actually getting onto his suit. Hugh Jackman was obviously taken aback by the whole ordeal (as many of us likely would be), but it generally sounds like his suit was not ruined by the lube. Of course, considering Hugh Jackman's knack for stagecraft and live performance (he did star in The Greatest Showman, after all), it seems likely that the X-Men veteran was able to handle the lube situation gracefully enough. Chrissy Metz laughed about the incident during her Today appearance, so something tells us that Jackman was relatively forgiving about the whole ordeal. That latex dress worn by Chrissy Metz at the MTV Movie Awards has turned into a fairly talked about topic in recent days. The This Is Us actress has become a major focal point in the conversation about body positivity (her weight is something that factors into the This Is Us story), and this tale about the lube and Hugh Jackman helps shine a light onto the funnier side of dressing for events. Make sure to watch out for Chrissy Metz on This Is Us when the hit NBC series returns this fall, and stay tuned for more of the latest, greatest, and generally weirdest movie news as it becomes available to us. Moreover, head over to our comprehensive movie premiere guide if you're looking for more up-to-date information on all of the most prominent 2018 movie release dates! Blended From Around The Web\n\nBack to top", "images": ["data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR4nGNaOxMAAfwBSW8IE8UAAAAASUVORK5CYII=", "https://ct.pinterest.com/v3/?tid=YourTagID&noscript=1", "https://img.cinemablend.com/quill/6/a/1/c/6/d/6a1c6d30e14d0ed247a52d57f9fb0d56f327a932.jpg", "https://i.imgur.com/EmLcl1s.gif", "https://sp.analytics.yahoo.com/spp.pl?a=1000772689113&.yp=431002", "https://sb.scorecardresearch.com/p?c1=2&c2=21229662&cv=2.0&cj=1"], "top_img": "https://img.cinemablend.com/quill/6/a/1/c/6/d/6a1c6d30e14d0ed247a52d57f9fb0d56f327a932.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.cinemablend.com/news/2394442/chrissy-metz-almost-got-lube-on-hugh-jackmans-suit-at-the-mtv-movie-awards", "title": "Chrissy Metz Almost Got Lube On Hugh Jackman's Suit At The MTV Movie Awards", "meta_data": {"msapplication-TileColor": "#f5aa06", "msapplication-config": "/static/browserconfig.xml", "theme-color": "#ffffff", "article": {"tag": "Chrissy Metz", "publisher": "https://www.cinemablend.com/", "published_time": "2018-03-28T16:31:57+00:00", "modified_time": "2018-10-08T21:19:17+00:00", "section": "news"}, "CinemaBlend": 10043, "page": "story", "description": "This Is Us star Chrissy Metz has opened up to talk about a wardrobe malfunction involving Hugh Jackman, some lube, and the MTV Movie Awards.", "robots": "all", "msvalidate.01": "9AA1A3C35B6D716AE80C1B615C6E8FE8", "fb": {"pages": 90893081682, "app_id": 956050344476201, "admins": 585420252}, "og": {"title": "Chrissy Metz Almost Got Lube On Hugh Jackman's Suit At The MTV Movie Awards", "url": "https://www.cinemablend.com/news/2394442/chrissy-metz-almost-got-lube-on-hugh-jackmans-suit-at-the-mtv-movie-awards", "image": {"identifier": "https://img.cinemablend.com/quill/6/a/1/c/6/d/6a1c6d30e14d0ed247a52d57f9fb0d56f327a932.jpg", "width": 600, "height": 300}, "description": "This Is Us star Chrissy Metz has opened up to talk about a wardrobe malfunction involving Hugh Jackman, some lube, and the MTV Movie Awards.", "type": "article", "site_name": "CINEMABLEND"}, "twitter": {"title": "Chrissy Metz Almost Got Lube On Hugh Jackman's Suit At The MTV Movie Awards", "description": "This Is Us star Chrissy Metz has opened up to talk about a wardrobe malfunction involving Hugh Jackman, some lube, and the MTV Movie Awards.", "image": "https://img.cinemablend.com/quill/6/a/1/c/6/d/6a1c6d30e14d0ed247a52d57f9fb0d56f327a932.jpg", "card": "summary_large_image", "site": "@cinemablend", "url": "https://www.cinemablend.com/news/2394442/chrissy-metz-almost-got-lube-on-hugh-jackmans-suit-at-the-mtv-movie-awards"}}, "movies": [], "publish_date": 1522254717.0, "source": "https://www.cinemablend.com", "summary": ""}