{"url": "https://www.marieclaire.com/beauty/how-to/a7053/how-to-wash-your-face/", "text": "Most of us assume that cleansing is a task so basic it can be accomplished even when you're completely exhausted or slightly tipsy—which, of course, it can. But it turns out that there's a lot more to it than soap and water, says Dr. Doris Day, NYC dermatologist and author of Forget the Facelift. \"With so many sophisticated, gentle cleansers that won't strip the skin, using the right one allows moisturizing and antiaging products to absorb more effectively.\" Clearly, an old-school splash and scrub won't do. Here, the new rules for getting your freshest face.\n\nMyth 1: Wash and Go\n\nIt's more of a two-step process. \"Remove your makeup before you wash your face,\" says Montclair, New Jersey, derm Dr. Jeanine Downie. \"Many cleansers can't take off concealer or foundation completely, especially around the eyes and nose.\" Use an oil-based cream, an emollient wipe, or a cleansing oil to dissolve stubborn sunscreen and makeup. Follow with lukewarm water and a dime-size amount of cleanser (look for the ingredients cocamidopropyl betaine or caprylic triglyceride, which are sulfate-free surfactants) on your fingers or a clean, damp washcloth.\n\nMyth 2: Wash Twice a Day\n\nWhile the jury is still out on how often to cleanse (every a.m. and p.m. or just once at night), all derms agree that over-washing can lead to irritation and a lack of moisture. The rule is to use common sense: Always wash your face after a workout to prevent breakouts, and wash excessively oily skin morning and night. For very dry or sensitive skin, stick to cleansing once daily in the evening.\n\nMyth 3: Close Your Pores\n\nSorry, folks, but you can skip rituals like massaging your face to increase circulation or splashing with cold water to \"close\" your pores. \"Pores don't open and close,\" says Downie. In fact, extreme hot or cold can exacerbate problems like rosacea and redness. That said, mild steam can help soften hardened oil in pores, so it's never a bad idea to cleanse in the shower. And \"while it feels nice, massage doesn't do much,\" adds Downie. \"Exercise is what boosts your circulation.\"\n\nMyth 4: Buy Cleanser According to Skin Type\n\nNo matter what kind of skin you have, make sure the ingredients list doesn't contain fragrance, which can be irritating; parabens (potentially toxic preservatives); or harsh soap (it's drying). \"If a cleanser fits that bill, the formula itself [cream, lotion, foaming, etc.] is more a matter of personal preference,\" says NYC dermatologist Dr. Brad Katchen. Of course, people with dry skin may prefer formulas with added moisturizers, like glycerin or shea butter. And \"if you have oily skin, you might want a foaming wash that leaves skin feeling super clean,\" says Day. The American Academy of Dermatology also recommends avoiding alcohol in cleansers that can be abrasive to skn.\n\nMyth 5: Scrub to Exfoliate and Smooth\n\nA salicylic- or glycolic-acid cleanser is gentler and more effective than grainy scrubs, and both offer anti-aging benefits and help prevent breakouts. Alternate with your regular wash (start with three times a week), and adjust depending on how your skin is looking and feeling.\n\nMyth 6: Use Toner\n\n\"An alcohol-based toner strips off natural oils,\" explains Day. Not good. \"Gentle toners calm the skin and balance pH levels, but with the right cleanser, you don't really need this step.\" Love the feeling anyway? Choose gentle, alcohol-free versions.\n\nMyth 7: Brush Your Skin to a Healthy Glow\n\n\"A brush removes oil, dirt, and dead skin better than your hands can, and it's less aggressive than most exfoliating cleansers or scrubs,\" says Day. \"But it's not something you have to use every night, especially if you're also applying ingredients like retinoids or acids. Too much exfoliation can cause inflammation.\" Basically: Use, but use sparingly. (Right now we're obsessed with Clarisonic's new acne-cleansing brush head, below.) To keep your brush bacteria-free, rinse and air-dry after use. Oh, and hey, clean freak, like you do with your Brita, replace the brush head every three months.\n\nMyth 8: Spend a Fortune\n\nSave your pricier ingredients, like retinol or antioxidants, for leave-on products instead of washing them down the drain. \"They're most effective when they stay concentrated on the skin,\" says Katchen.\n\nBetsy Farrell\n\nFollow Marie Claire on Facebook for the latest celeb news, beauty tips, fascinating reads, livestream video, and more.", "images": ["https://hips.hearstapps.com/mac.h-cdn.co/assets/17/06/640x320/landscape-1486500483-steamingface2.gif?resize=300:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/mac.h-cdn.co/assets/16/01/4000x2000/landscape-1452119660-how-to-wash-face.jpg?resize=1200:*", "https://hips.hearstapps.com/mac.h-cdn.co/assets/17/06/1600x800/landscape-1486410127-facebrushindex.jpg?resize=300:*", "https://hips.hearstapps.com/mac.h-cdn.co/assets/17/11/1600x800/landscape-1489605665-makeupremoversindex.gif?resize=300:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/face-wash-1510080535.jpg?crop=1.00xw:0.334xh;0,0.144xh&resize=300:*"], "top_img": "https://hips.hearstapps.com/mac.h-cdn.co/assets/16/01/4000x2000/landscape-1452119660-how-to-wash-face.jpg?resize=1200:*", "keywords": [], "authors": ["Gina Way"], "canonical_link": "https://www.marieclaire.com/beauty/how-to/a7053/how-to-wash-your-face/", "title": "This Is How You Should *Really* Be Washing Your Face", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Marie Claire", "title": "This Is How You Should *Really* Be Washing Your Face", "description": "All your misconceptions about cleansing, debunked.", "url": "https://www.marieclaire.com/hair-beauty/how-to/how-to-wash-your-face", "image": {"identifier": "https://hips.hearstapps.com/mac.h-cdn.co/assets/16/01/4000x2000/landscape-1452119660-how-to-wash-face.jpg?resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 128598260542816, "pages": 10799255126}, "article": {"publisher": "https://www.facebook.com/MarieClaire", "modified_time": "2017-10-11 08:37:06", "published_time": "2017-09-12 09:00:00", "section": "Beauty"}, "twitter": {"site": "@marieclaire", "card": "summary_large_image", "image": "https://hips.hearstapps.com/mac.h-cdn.co/assets/16/01/4000x2000/landscape-1452119660-how-to-wash-face.jpg?resize=640:*"}, "google-site-verification": "21t3kl6tV4kpBdF4RZeyQAZd2D32Yzv-g9TAHaxCVvE", "title": "How To Wash Your Face - Tips for Facial Cleansing", "description": "When it comes to facial cleansing, there are two schools of thought: old-fashioned soap-and-water or every-bell-and-whistle-at-the-beauty-counter. Turns out, neither is right.", "keywords": "acne prevention,skincare,clean face,face washing tips,skin tips,how to wash your face", "auto-publish": "evergreen", "thumbnail": "https://hips.hearstapps.com/mac.h-cdn.co/assets/16/01/3200x3200/square-1452119660-how-to-wash-face.jpg?resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Beauty,beauty,skin tips and advice,skin care", "sailthru.date": "2017-09-12T21:00:00Z", "sailthru.image.full": "https://hips.hearstapps.com/mac.h-cdn.co/assets/16/01/4000x2000/landscape-1452119660-how-to-wash-face.jpg", "sailthru.image.thumb": "https://hips.hearstapps.com/mac.h-cdn.co/assets/16/01/3200x3200/square-1452119660-how-to-wash-face.jpg", "sailthru.socialtitle": "This Is How You Should *Really* Be Washing Your Face", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1505221200.0, "source": "https://www.marieclaire.com", "summary": ""}