{"url": "https://www.wmagazine.com/story/chloe-grace-moretz-brooklyn-beckham-split-instagram-shade", "text": "Every breakup has its stages, but, for Chloë Grace Moretz and Brooklyn Beckham —the now former celebrity couple whose on-again, off-again love saga is a film waiting to be written—it's easy to get stuck in the subtweet phase. Proving that romance, or the dissolution of it, is really no different for celebrities than it is for anyone else, the couple are currently in the throes of shading each other on social media. Or, at least, some people think that's the case. Let's take a look at the facts.\n\nA few days after photos surfaced of Beckham kissing model Lexi Wood, when the rest of the world had presumed he was still dating Moretz, the pair made some interesting moves on Instagram. Moretz posted a screenshot to let the world know that she's listening to Cardi B 's \"Be Careful,\" perhaps the most revealing song on the rapper's recently released debut album Invasion of Privacy . In the song, which has become an anti-cheaters anthem of sorts, Cardi B addresses her fiancé Offset's infidelity and gives him an ultimatum. \"Poured out my whole heart to a piece of s**t,\" she raps, \"Man, I thought you would've learned your lesson..../ Said that you was workin', but you out here chasin' culo/ And putas, chillin' poolside, livin' two lives..../ Be careful with me/ Yeah, it's not a threat, it's a warnin'.\" Moretz captioned the screenshot with two words: \"The queen.\"\n\nWhat's more, Moretz liked a meme posted by a fan account of her giving the middle finger with the caption \"Greetings to Brooklyn Beckham from me motherf***er,\" as Perez Hilton later pointed out.\n\nMeanwhile, Beckham weighed in on the situation not with his own post, but instead by liking another meme that depicted him crying as a young boy next to his mother, Victoria Beckham with the caption \"Chloe's fans are attacking Brooklyn Beckham.\"\n\nLoading View on Instagram\n\nBut how did we get here? To recap, Moretz and Beckham first linked up in 2014 at Paris Fashion Week. They didn't officially enter into a public-facing relationship, though, until April 2016. Not long after, they called off their relationship once again, this time citing the long distance between them. (Beckham was living in London, while Moretz was Stateside.) She later talked about that breakup , saying that she just wanted to hide. “They were like, 'That’s all great that you want to go away—but you can’t. You are your own person,'\" she said. \"'You’re going to have to deal with this sort of thing.’ I felt like things were falling apart, like my head and heart weren’t in the same place. Things started to change when I realized I have the power within to change them.” With that knowledge, hopefully this ending will be easier on the couple.", "images": ["https://www.wmagazine.com/images/w_logo.svg", "https://media.wmagazine.com/photos/5ace49ba5089dc47f49724b4/4:3/w_1536/Grace%2520Moretz%2520and%2520Brooklyn%2520Beckham%2520breakup.jpg", "https://media.wmagazine.com/photos/5ace4c5cba61d2511122f652/master/w_320,c_limit/chloe-grace-moretz-cardi-b-1523305591-AGIRLh.jpg", "https://media.wmagazine.com/photos/5ace49ba5089dc47f49724b4/2:1/w_790,c_limit/Grace%20Moretz%20and%20Brooklyn%20Beckham%20breakup.jpg", "https://vulcan.condenastdigital.com/wmag-services/photos/592f186c802c577242df3efc/1:1/w_128,c_limit/Emma%20Stone.jpg", "https://vulcan.condenastdigital.com/wmag-services/photos/592f1897cc1eac746f6e754f/1:1/w_128,c_limit/Brad%20Pitt.jpg", "https://vulcan.condenastdigital.com/wmag-services/photos/592f0706802c577242df3ef1/1:1/w_128,c_limit/Michelle_Obama_Face.png"], "top_img": "https://media.wmagazine.com/photos/5ace49ba5089dc47f49724b4/2:1/w_790,c_limit/Grace%20Moretz%20and%20Brooklyn%20Beckham%20breakup.jpg", "keywords": [], "authors": ["Marissa G. Muller", "Mediapunch Bauer-Griffin Gc Images"], "canonical_link": "https://www.wmagazine.com/story/chloe-grace-moretz-brooklyn-beckham-split-instagram-shade", "title": "Chloë Grace Moretz and Brooklyn Beckham Make Split Official with Instagram Shade", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=no, width=device-width, initial-scale=1, maximum-scale=1", "msapplication-TileColor": "#ffffff", "msapplication-TileImage": "/images/favicon/ms-icon-144x144.png", "theme-color": "#ffffff", "author": "Marissa G. Muller", "copyright": "Copyright (c) Condé Nast 2019", "description": "A few days after photos surfaced of Chloë Grace Moretz's boyfriend Brooklyn Beckham kissing model Lexi Wood, the pair made some questionable moves on Instagram.", "publishDate": "2018-04-11T18:22:54Z", "keywords": "chloë grace moretz,Brooklyn Beckham,instagram,cardi b,Breakups,news", "fb": {"app_id": 230068530489385, "admins": 108943, "pages": 40621875003}, "og": {"site_name": "W Magazine", "title": "Chloë Grace Moretz and Brooklyn Are in the Subtweet Stage of Their Breakup", "url": "https://www.wmagazine.com/story/chloe-grace-moretz-brooklyn-beckham-split-instagram-shade", "description": "They're now throwing shade on social media.", "type": "article", "image": "https://media.wmagazine.com/photos/5ace49ba5089dc47f49724b4/2:1/w_790,c_limit/Grace%20Moretz%20and%20Brooklyn%20Beckham%20breakup.jpg"}, "twitter": {"card": "summary_large_image", "site": "wmag", "title": "Chloë Grace Moretz and Brooklyn Are in the Subtweet Stage of Their Breakup", "description": "They're now throwing shade on social media.", "image": "https://media.wmagazine.com/photos/5ace49ba5089dc47f49724b4/2:1/w_790,c_limit/Grace%20Moretz%20and%20Brooklyn%20Beckham%20breakup.jpg?mbid=social_retweet", "domain": "wmagazine.com"}, "version": "2.0.0"}, "movies": [], "publish_date": 1523470974.0, "source": "https://www.wmagazine.com", "summary": ""}