{"url": "https://en.wikipedia.org/wiki/The_Real_Housewives_of_New_Jersey", "text": "New Jersey-based reality television series in the United States\n\nThe Real Housewives of New Jersey (abbreviated RHONJ) is an American reality television series that premiered on May 12, 2009, on Bravo. Developed as the fourth installment of The Real Housewives franchise, it has aired nine seasons and focuses on the personal and professional lives of several women residing in New Jersey.\n\nThe current cast consists of Teresa Giudice (since season 1), Melissa Gorga (since season 3), Dolores Catania (since season 7), Margaret Josephs (since season 8), Jennifer Aydin, and Jackie Goldschneider (both since season 9). Previously-featured cast members include original housewives Jacqueline Laurita, Caroline Manzo, Dina Manzo, and Danielle Staub; and later-added housewives Kathy Wakile, Teresa Aprea, Amber Marchese, Nicole Napolitano, and Siggy Flicker.\n\nThe success of the show has resulted in the spin-offs Manzo'd with Children and Teresa Checks In.\n\nOverview and casting\n\nSeasons 1–5\n\nThe Real Housewives of New Jersey was announced when Bravo released its 2008–09 programming on April 15, 2008.[1] The first season premiered on May 12, 2009, and starred Caroline Manzo, Jacqueline Laurita, Teresa Giudice, Dina Manzo and Danielle Staub. For the first time in the franchise, the series followed housewives who are related to one another: sisters Caroline and Dina are married to brothers Albert and Tommy Manzo, and Jacqueline Laurita is married to Caroline and Dina's brother, Chris Laurita.[2] Dina and Tommy Manzo would later end up separated.[3][4] The second season premiered on May 3, 2010, with Dina Manzo departing the series after the seventh episode.[5] Staub left the show after the second season.[6]\n\nThe third season premiered on May 16, 2011, with new housewives Melissa Gorga and Kathy Wakile.[7] It delivered the highest rated season premiere in the network's history and the highest rated season premiere in The Real Housewives franchise at the time.[8] The fourth season premiered on April 22, 2012, with Kim DePaola upgraded to a \"friend of the Housewives\" recurring capacity.[9][10][11] The fifth season premiered on June 2, 2013, with Jennifer Dalton being added in a recurring role.[12] Caroline Manzo and Laurita left the show after the fifth season, and DePaola and Dalton were dropped from their \"friend of\" roles.[13][14]\n\nSeasons 6–present\n\nThe sixth season premiered on July 13, 2014.[15] It featured the return of Dina Manzo as a full-time cast member and new cast members Amber Marchese, Teresa Aprea and Nicole Napolitano.[15][16] Wakile was demoted to a \"friend of the housewives\" role, while Laurita appeared as a guest.[17][18] Marchese, Aprea, Napolitano and Dina Manzo left the show after the sixth season.[19][20]\n\nLaurita returned as a full-time housewife in the seventh season, which premiered on July 10, 2016.[21] The season also featured Dolores Catania and Siggy Flicker as new cast members, while Wakile and her sister Rosie Pierri appeared as \"friends of the housewives\".[22] DePaola, Aprea and Napolitano also appeared as guests.[23][24] After the seventh season, Laurita, Wakile and Pierri departed the show.[25][26]\n\nStaub returned in the show as friend of the housewives for the eighth season, which premiered on October 4, 2017. It also featured Margaret Josephs as the new cast member. While DePaola appeared as a guest.[27] The season marked as Flicker's final season on the show.[28] The ninth season premiered on November 7, 2018, featuring Jennifer Aydin and Jackie Goldschneider as full-time cast members. While Staub returned as a friend once again.[29]\n\nTimeline of housewives\n\nHousewives Seasons 1 2 3 4 5 6 7 8 9 Teresa Giudice Main Jacqueline Laurita Main Friend Main Caroline Manzo Main Dina Manzo Main Guest Main Danielle Staub Main Friend Melissa Gorga Guest Main Kathy Wakile Guest Main Friend Teresa Aprea Main Guest Amber Marchese Main Nicole Napolitano Main Guest Dolores Catania Guest Guest Main Siggy Flicker Main Margaret Josephs Main Jennifer Aydin Main Jackie Goldschneider Main Friends of the housewives Kim Granatell Friend Guest Kim DePaola Guest Friend Guest Rosie Pierri Guest Friend\n\nEpisodes\n\nSeason Episodes Originally aired First aired Last aired 1 10 May 12, 2009 ( ) July 9, 2009 ( 2009-07-09 ) 2 18 May 3, 2010 ( ) September 6, 2010 ( 2010-09-06 ) 3 21 May 16, 2011 ( ) October 23, 2011 ( 2011-10-23 ) 4 24 April 22, 2012 ( ) October 21, 2012 ( 2012-10-21 ) 5 22 June 2, 2013 ( ) October 20, 2013 ( 2013-10-20 ) 6 19 July 13, 2014 ( ) November 20, 2014 ( 2014-11-20 ) 7 18 July 10, 2016 ( ) November 13, 2016 ( 2016-11-13 ) 8 16 October 4, 2017 ( ) January 31, 2018 ( 2018-01-31 ) 9 18 November 7, 2018 ( ) March 6, 2019 ( 2019-03-06 )\n\nSpin-offs\n\nThe series' success has resulted in a development of multiple spin-off series. Caroline Manzo's children Albie and Chris had a web series spin-off alongside their roommate and friend Greg Bennett, Boys to Manzo which premiered on May 30, 2011.[30][31] Caroline Manzo, who was part of the original cast of the show, quit the series before its sixth season. Manzo later disclosed that she was involved in the production of a new show, Manzo'd with Children;[32][33] the show was eventually picked up and premiered on October 5, 2014.[34] The reality series follows the daily life of Manzo and her family: husband Albert, sons Albie and Chris, daughter Lauren, and sister Fran.[35] It aired for three seasons.[36][37]\n\nThe second spin-off, entitled Teresa Checks In, aired in October 2015. The three-episode television series chronicled the life of the Giudice family and how its members dealt with the aftermath of Teresa Giudice's being sentenced to prison. The series featured some of the cast members of The Real Housewives of New Jersey, including Melissa Gorga, Joe Gorga, and Rosie Pierri.[38][39][40]\n\nIn December 2014, it was announced Giudice's daughter, Gia, was in production on a pilot revolving around her attempting to launch a singing career, with her group 3KT.[41][42]\n\nIn December 2018, it was announced an after show featuring Giudice, Gorga, Josephs, Goldschneider, Aydin and Staub would be released weekly following the airing of the episode. It featured their reactions to the events to the episode and thoughts on the season.[43] Episodes were released through Bravo.com and YouTube.[44]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4c/Real-housewives-of-new-jersey-logo.png/250px-Real-housewives-of-new-jersey-logo.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Blank_television_set.svg/32px-Blank_television_set.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ad/Melissa_Gorga_at_New_York_Fashion_Week_2016.jpg/204px-Melissa_Gorga_at_New_York_Fashion_Week_2016.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e2/Siggy_Flicker.jpg/129px-Siggy_Flicker.jpg", "https://upload.wikimedia.org/wikipedia/en/4/4c/Real-housewives-of-new-jersey-logo.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Teresa_Giudice_at_New_York_Fashion_Week_2016.jpg/145px-Teresa_Giudice_at_New_York_Fashion_Week_2016.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Danielle_Staub.jpg/197px-Danielle_Staub.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/4/4c/Real-housewives-of-new-jersey-logo.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/The_Real_Housewives_of_New_Jersey", "title": "The Real Housewives of New Jersey", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.11", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/4/4c/Real-housewives-of-new-jersey-logo.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}