{"url": "https://radaronline.com/exclusives/2018/03/cardi-b-nude-video-leak/", "text": "Cardi B has many naked pics circulating on the Internet—both confirmed and rumored—due to her stripper past. But leaking a “sex tape” with her fiancé Offset right after leaking a nude video? This might be a little too much for the Internet to handle.\n\nWhen it comes to setting social media alight, Cardi B seems to always know what she is doing. Working on a new single and want it to come out with a spark? Leak a nude video as an appetizer, and then watch your single climb up the Billboard charts! Want to shut down the cheating rumors circulating around your beau? Leak a celeb sex tape with the guy!\n\nMore: Rapper Cardi B In Sex Tape Storm – Radar Online\n\nYep, releasing NFSW content always seems to be the perfect solution—at least for Cardi B. Given that Cardi used to be a stripper before she became part of rap’s ruling class, exposing boobs and other private areas isn’t a big deal for the raptress. However, the Internet still debates about whether Cardi B became the latest victim of hackers or if it was the rap sensation herself who leaked her nude videos to stir up some controversy and give her single “Bartier Cardi” an adrenaline boost (in other words, pull the Kim Kardashian card).\n\nWhatever the case, it doesn’t matter as long as naughty Internet users have plenty of X-rated clips featuring the stripper-turned-recording star. As they say, give a man a fish and you feed him for a day. Give him nude pics or a sex tape, and the dude won’t even have time to eat, let alone to speculate about who leaked it (someone has said that, right?).\n\nEvery sex tape leak happens for a reason or for no reason at all, which is why Radar has investigated the infamous Cardi B nude video leak that is making rounds on the Internet. So what’s so special about these super NSFW videos that are floating around? Let’s find out!\n\nWho is Cardi B?\n\nIf you’re here to watch Cardi B’s sex tape online, but you have no clue who this girl is, ‘memba the lyrics “You can’t f*ck with me if you wanted to” from a hit 2017 song? If it still doesn’t ring a bell, here’s a hint: “Bodak Yellow.” What? Still nothing? It’s the iconic debut single by Cardi B that won Single of the Year at the 2017 BET Hip Hop Awards and earned two Grammy awards in 2018.\n\nIn case you’re wondering how huge of a hit “Bodak Yellow” was, it went triple platinum and even landed on the No. 1 spot of the Billboard Hot 100 chart, knocking Taylor Swift’s “Look What You Made Me Do” from the top. Although Cardi B rose to international fame in 2017, she had been an influential social media personality years prior to her musical debut. Before pursuing a musical career, Cardi, whose real name is Belcalis Almanzar, was a stripper for five years. The stripper-turned-rapper retired at 23 when her popularity on social media soared to dizzying heights.\n\nCardi B is also known for her “no filter attitude” in both lyrics and social media posts, which helps her throw her name into the spotlight every once in a while. But when she truly wants to make a splash in the music industry, it’s pretty obvious that leaking a sex tape attracts media coverage at a much stronger magnitude than dissing a fellow rapper does.\n\nWho is Cardi B engaged to?\n\nCardi B is engaged to Offset, born as Kiari Kendrell Cephus, who is best known as a member of the chart-topping hip-hop trio Migos. After nearly a year of their infamous on-again, off-again relationship, Cardi and Offset got engaged in October 2017.\n\nPhoto Credit:Getty Images\n\nThe duo, who collaborated on a music video together, even had a quickie breakup shortly before their engagement. The rapper popped the question during a Power 99 Powerhouse concert in Philadelphia. Cardi said yes and couldn’t stop showing off the impressive $550k engagement ring for several weeks after the public proposal.\n\nHow did Cardi’s XXX-mas happen?\n\nCardi B dropped her second single, “Bartier Cardi” featuring 21 Savage, in late December 2018—just in time for Christmas. But this wasn’t the reason why search engines had a massive influx of Cardi B queries that day. The thing is, on the same day, a sexy video displaying Cardi B dancing nude leaked online.\n\nWhether or not it was part of Cardi’s elaborate PR strategy, she exposed more than her fans asked for. Hot on the heels of the nude video leak, Cardi B took to Instagram to share an explicit sex tape allegedly showing her and fiancé Offset getting intimate.\n\nThe sex tape and Cardi B’s nude video leak was branded “XXX-mas tape.”\n\nWas Cardi B nude and did she leak the video?\n\nThe rap sensation’s name truly dominated headlines in late December 2018, and some fans were convinced that the so-called “leaks” were a PR stunt to help catapult “Bartier Cardi” to the top of the charts. And believe it or not, it worked.\n\nThe X-rated video showing Cardi B bending over and twerking in the nude was practically released as a side dish to her single, and many argued that the leak was the raptress’s attempt to derail buzz from the cheating rumors. Shortly before “Bartier Cardi”—and the sex tape, for that matter—dropped, reports surfaced claiming that Cardi’s fiancé, Offset, cheated on the singer.\n\nCardi wasn’t about to let the rumors sabotage the success of her latest single, which is why she recorded herself and Offset having sex live on Instagram…sort of.\n\nWhat’s so sexy about the XXX-mas leak?\n\nIn the nude video, a naked woman resembling Cardi was seen smiling, laughing, twerking and bending over for the camera. The X-rated clip, which immediately made its way on PornHub, was allegedly captured in a hotel room, and many think it was recorded with Offset’s phone (and his iCloud account was reportedly hacked that month).\n\nIn the X-rated footage, the woman flaunts a similar tattoo to Cardi’s upper thigh ink. Cardi even equivocally confirmed that it was her on the video when laughing off the leak on social media.\n\nClearly, Cardi B was unfazed by the nude vid leak (and why wouldn’t she, considering that many believe she was the one who leaked the clip?). In the tweet, the “Bodak Yellow” hitmaker reminded followers that she used to be a stripper and pointed out that there are a plethora of videos of her stripping with her “titties and a** out” on YouTube. In true Cardi fashion, she also used the opportunity to pat herself on the back.\n\nPeople keep posting the nude videos of me like if i wasn’t a stripper before 😩😩😂🤷🏽‍♀️You know there’s videos of me stripping with my titties & ass out on YouTube already right 😂?anyways i know i know i got a nice body right 😎 — iamcardib (@iamcardib) December 25, 2017\n\nCardi B & Offset sex tape: real or fake?\n\nIn an apparent attempt to shut down the cheating rumors circulating around her beau, Cardi B shared a racy video of herself and Offset simulating sex. At first, fans thought the duo were actually having sex in the live video, but she later confirmed that the whole thing was a joke…or was it?\n\nIn the live video, which was actively peddled by the media as a “sex tape,” Cardi B and Offset are seen rocking their bodies back and forth. The Migos rapper was standing behind his hunched-over fiancée, and it did look like they were really putting a lot of effort into it. The video stirred up some controversy and helped Cardi end the year with a spark. Above all, it did steal the media’s attention away from the cheating rumors.\n\nAddressing the racy video a few hours after it “leaked” online, Cardi set the record straight by saying that she blatantly trolled her followers. But there were still quite a few of those who refused to believe that the viral video, in which Cardi B and Offset are seen dry-humping each other, was not an actual video of the lovebirds getting intimate. Frustrated, the “Bartier Cardi” hitmaker took to Instagram stories and Twitter to respond to the doubters.\n\n“I was fully clothes on live, I was not f*king on live! Yaaa can’t be that slow!” Cardi wrote in an Instagram Story. Then on Twitter, the rap sensation reiterated that the “sex tape” was fake.\n\nIf anybody watch the live from last night they can see from beginning to end that i was talking then this guy came behind me and started fake dry humping me “Jesus Christ we Both had pants on !!🙄 — iamcardib (@iamcardib) December 27, 2017\n\nCardi’s fans were divided about the leak. Some rushed to her defense, while others slammed her for being too desperate for attention. Despite the wild reaction in the media, those weren’t the first NSFW videos with Cardi B. If you take matters into your own hands (no pun intended), and search for other racy videos of Cardi B, you will see quite a few of them online. However, Cardi’s identity has not been verified in many of these nude clips, so let’s not jump to conclusions.\n\nWe pay for juicy info! Do you have a story for RadarOnline.com? Email us at tips@radaronline.com, or call us at (866) ON-RADAR (667-2327) any time, day or night.", "images": ["https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2019/03/scandal-bg.jpg?fit=1440%2C210&ssl=1", "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2018/02/Cardi-B-nude-video.jpg?fit=1280%2C840&ssl=1", "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2019/07/Duggars-Display-Massive-Guns-In-1.5-Million-Mansion-Listing-pp.jpg?w=384&crop=0%2C20px%2C384px%2C215px&resize=384%2C215&ssl=1", "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2019/03/logo-omg-1.png?ssl=1", "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2019/03/reality-tv-bg.jpg?fit=1440%2C210&ssl=1", "https://radaronline.com/wp-content/themes/vip/am-radaronline/assets/build/images/icons/logo-tag-registered-green.svg", "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2019/03/omg-bg.jpg?fit=1440%2C210&ssl=1", "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2019/03/logo-omg.png?fit=188%2C70&ssl=1", "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2019/03/fashion-police-bg.jpg?fit=1440%2C210&ssl=1", "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2019/03/logo-scandal.png?fit=307%2C70&ssl=1", "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2019/07/Jessica-Simpson-Shows-Boobs-39th-Birthday-Party-pp.jpg?w=384&crop=0%2C20px%2C384px%2C215px&resize=384%2C215&ssl=1", "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2019/03/logo-fashion-police.png?fit=489%2C70&ssl=1", "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2019/03/logo-celebrity-news-b.png?fit=495%2C70&ssl=1", "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2019/07/allbirds1.jpg?w=384&crop=0%2C20px%2C384px%2C215px&resize=384%2C215&ssl=1", "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2019/03/true-crime-bg.jpg?fit=1440%2C210&ssl=1", "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2019/03/logo-reality-tv.png?fit=370%2C70&ssl=1", "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2019/07/90-Day-Fiance-Larissa-Dos-Santos-Plastic-Surgery-Butt-Lift-pp.jpg?w=384&crop=0%2C20px%2C384px%2C215px&resize=384%2C215&ssl=1", "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2018/02/Cardi-B-nude-video.jpg?resize=792%2C446&ssl=1", "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2019/03/logo-true-crime-b.png?fit=357%2C70&ssl=1", "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2018/03/Offset-and-Cardi-B.jpg?resize=640%2C650&ssl=1", "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2019/03/celebrity-news-bg.jpg?fit=1440%2C210&ssl=1", "https://radaronline.com/wp-content/themes/vip/am-radaronline/assets/build/images/icons/logo-tag-registered.svg"], "top_img": "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2018/02/Cardi-B-nude-video.jpg?fit=1280%2C840&ssl=1", "keywords": [], "authors": ["Radar Staff", "March"], "canonical_link": "https://radaronline.com/exclusives/2018/03/cardi-b-nude-video-leak/", "title": "Cardi B Nude Video: Was The XXX-Mas Leak Real Or Fake?", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "fb": {"admins": 593583017, "app_id": 1008772232528225, "pages": 376279216711}, "google-site-verification": "kONM_PqGX8Za53dFcExSTIIPZxxN_S4QtvDlONzzdA0", "description": "Everything you need to know about Cardi B’s XXX-mas leak. How did this happen and did she really have sex live? Watch Radar unravel the mystery!", "og": {"locale": "en_US", "type": "article", "title": "Cardi B Nude Video: Was The XXX-Mas Leak Real Or Fake?", "description": "Everything you need to know about Cardi B’s XXX-mas leak. How did this happen and did she really have sex live? Watch Radar unravel the mystery!", "url": "https://radaronline.com/exclusives/2018/03/cardi-b-nude-video-leak/", "site_name": "RadarOnline", "updated_time": "2019-04-20T23:46:47+00:00", "image": {"identifier": "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2018/02/Cardi-B-nude-video.jpg?fit=1280%2C840&ssl=1", "secure_url": "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2018/02/Cardi-B-nude-video.jpg?fit=1280%2C840&ssl=1", "width": 1280, "height": 840, "alt": "Cardi B nude in videos and photos that leaked baring breasts and butt"}}, "article": {"tag": "Sex Tape", "section": "OMG!", "published_time": "2018-03-27T19:35:46+00:00", "modified_time": "2019-04-20T23:46:47+00:00"}, "twitter": {"card": "summary_large_image", "description": "Everything you need to know about Cardi B’s XXX-mas leak. How did this happen and did she really have sex live? Watch Radar unravel the mystery!", "title": "Cardi B Nude Video: Was The XXX-Mas Leak Real Or Fake?", "image": "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2018/02/Cardi-B-nude-video.jpg?fit=1280%2C840&ssl=1", "creator": "@AndriiDaniels"}, "news_keywords": "Cardi B nude video", "generator": "WordPress 5.2.2"}, "movies": [], "publish_date": 1522179346.0, "source": "https://radaronline.com", "summary": ""}