{"url": "https://www.elitedaily.com/p/15-thanksgiving-friends-quotes-for-instagram-captions-this-turkey-day-3344824", "text": "Pretty much every TV show offers up some love for the holidays with fun Christmas or Halloween episodes each year, but Thanksgiving always seems to be looked over. At least, in every show but Friends. The iconic NBC sitcom made a point of giving us some of the most memorable Turkey Day moments ever, and it's still the best show to binge-watch with friends or family while you're full of turkey and mashed potatoes. To get ready for all your Turkey Day Instagram captions, let's revisit the best Friends Thanksgiving quotes. These memorable quotes from Monica, Phoebe, Chandler, Ross, Rachel, and Joey are sure to be a hit among all the Friends fans in your life this Thanksgiving... and if you've surrounded yourself with people with good taste, then chances are they're all Friends fans.\n\n1. \"I know this isn't the kind of Thanksgiving that all of you all planned, but for me, this has been really great, you know, I think because it didn't involve divorce or projectile vomiting.\"\n\nHolidays with the family aren't always a piece of pumpkin pie, and this Chandler quote from the very first Thanksgiving episode of Friends is perfect for reminding everyone to enjoy a holiday get-together that doesn't wind up going terribly wrong.\n\n2. \"I'm very thankful that all of your Thanksgivings sucked.\"\n\n\"And hey, here's to a lousy Christmas.\"\n\n\"And a crappy New Year.\"\n\nBut if you're Thanksgiving does end up being terrible, making jokes about it always helps! That's how the six Friends dealt with their disastrous Thanksgivings.\n\n3. \"Set another place for Thanksgiving. My entire family thinks I have VD.\"\n\nThanksgiving can also be a good time to clear the air with your family. Let's just hope you're family talks aren't as awkward as Joey's.\n\n4. \"Oh, sweet Lord! This is what evil must taste like!\"\n\nIf your Turkey Day feast isn't up to snuff, then you can always fall back on what Phoebe exclaimed when she took a bite of Monica's \"mockolate\" chip cookies.\n\n5. \"Okay guys, I have exactly 28 minutes before I have to baste again.\"\n\nOr maybe you're the one in charge of cooking up the Thanksgiving meal this year. If so, why not pull a Monica and let everyone know you're not slacking on your crucial basting duties.\n\n6. \"The game is over? We eat now?\"\n\nThis line may have come from a one-episode character who was really only in the show to make Joey and Chandler fight over her and say some jokes about the Netherlands, but I relate to it more than any other Thanksgiving quote on this list.\n\n7. \"It wouldn't be Thanksgiving without a little emotional scarring.\"\n\nCan you pass the cranberry sauce and the passive-aggressive comments from my grandparents, please?\n\n8. \"Oh. And I'm also thankful for thongs.\"\n\nNeed something to add when you're family goes around to say what they're thankful for? Joey's got you covered.\n\n9. \"Well, Judy, you did it. She's finally full.\"\n\nPerfect for when you're feeling that post-dinner coma coming on and you can't imagine eating another bite, like when flashback-Monica turned down a pie.\n\n10. \"What is with everyone today? It's Thanksgiving, not truth day!\"\n\nFor when the Thanksgiving discussions start getting a bit too real.\n\n11. \"Turkeys are beautiful, intelligent animals.\"\n\n\"No, they're not. They're ugly and stupid and delicious.\"\n\nIf anyone tries to make you feel guilty for enjoying your fair share of turkey this year, just remember Joey's response.\n\n12. \"Look at her holding those yams. Those are our two worst enemies, Ross: Rachel Green and complex carbohydrates.\"\n\nOne of the most memorable Thanksgiving episodes ever was when Brad Pitt guest starred and put the smackdown on yams.\n\n13. \"You can't have Thanksgiving without turkey. That's like Fourth of July without apple pie or Friday with no two pizzas.\"\n\nJoey's immortal words about Thanksgiving will live on forever.\n\n14. \"Everyone, we're using our fancy china, and it's very expensive, so please be careful. Just to be clear, comedy with the plates will not be well-received.\"\n\nIt's always nice to lay down some ground rules about what jokes won't be tolerated at the dinner table.\n\n15. \"Don't you put words in people's mouths. You put turkey in people's mouths.\"\n\nAnd finally, of course, it's Joey that gave us the perfect Thanksgiving clapback for when people try to stir up drama instead of focusing on what's really important: eating turkey.", "images": ["https://imgix.bustle.com/uploads/image/2017/11/10/2a9a3f06-895b-4d6e-8dee-7a559192a791-friends-thanksgiving-episodes.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/image/2017/11/10/2a9a3f06-895b-4d6e-8dee-7a559192a791-friends-thanksgiving-episodes.jpg?w=1020&h=574&fit=crop&crop=faces&auto=format&q=70", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif"], "top_img": "https://imgix.bustle.com/uploads/image/2017/11/10/2a9a3f06-895b-4d6e-8dee-7a559192a791-friends-thanksgiving-episodes.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/p/15-thanksgiving-friends-quotes-for-instagram-captions-this-turkey-day-3344824", "title": "15 Thanksgiving 'Friends' Quotes For Instagram Captions This Turkey Day", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/p/15-thanksgiving-friends-quotes-for-instagram-captions-this-turkey-day-3344824", "type": "article", "title": "15 ‘Friends’ Quotes That Are Perfect For Your Thanksgiving Instagram Captions", "description": "Pretty much every TV show offers up some love for the holidays with fun Christmas or Halloween episodes each year, but Thanksgiving always seems to be looked over. At least, in every show but Friends. The iconic NBC sitcom made a point of giving us…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2017/11/10/2a9a3f06-895b-4d6e-8dee-7a559192a791-friends-thanksgiving-episodes.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "Pretty much every TV show offers up some love for the holidays with fun Christmas or Halloween episodes each year, but Thanksgiving always seems to be looked over. At least, in every show but Friends. The iconic NBC sitcom made a point of giving us…"}, "movies": [], "publish_date": null, "source": "https://www.elitedaily.com", "summary": ""}