{"url": "https://www.washingtonpost.com/news/worldviews/wp/2018/05/21/meghan-markle-declares-herself-a-feminist-on-british-monarchys-website/", "text": "\n\nMeghan, Duchess of Sussex, leaves Windsor Castle after getting married on May 19. (Chris Jackson/Pool/Reuters)\n\nLONDON — Meghan Markle does not appear to be reining in her feminist views since her traditional-yet-modern nuptials to Prince Harry.\n\nOn her new page on the British monarchy’s official website — in pulled out quotes — the woman now known as the Duchess of Sussex says, “I am proud to be a woman and a feminist,” referencing a line from a 2015 speech she gave at a United Nations event.\n\nHer biography on the site emphasizes her early activism, including how, at age 11, she took on Procter & Gamble for a commercial claiming that “women all over America are fighting greasy pots and pans.” After Meghan's intervention, the company changed the ad to “people all over America.”\n\n“These early experiences helped to shape her lifelong commitment to causes such as social justice and women’s empowerment,” the website says.\n\nThe website also notes her volunteer work at soup kitchens in Los Angeles, her home town, and Toronto, where she filmed “Suits,” as well as her work as a women’s advocate for the United Nations and a global ambassador for World Vision Canada.\n\nMany campaigners here are looking to see whether Meghan dials back her activism upon joining the royal family. On the one hand, she now has a new, global platform. On the other, she will be expected to stay clear of party politics. She once called President Trump a “misogynist” and posted an anti-Brexit picture on her (now-deleted) Instagram feed. These kinds of political interventions are now a no-no, but many are curious to see whether she will continue to speak out on feminism and racial issues.\n\nAs seen at the wedding ceremony, which included a passionate sermon by the Most Rev. Michael Curry (who seemed to blindside some royals with enthusiastic talk of love and emotion), a gospel choir, a black cellist and a black Church of England priest, Meghan is not downplaying her biracial heritage.\n\nAnd at the wedding reception, held at Frogmore House, Meghan reportedly bucked tradition by giving her own speech. She is said to have thanked Harry and the royals for their kindness and generosity. According to the Daily Mail, Harry responded with a speech of his own, saying “we make such a great team” and “I can’t wait to spend the rest of my life with you.” (In what is probably another royal first, they reportedly handed out slippers to guests who wanted to swap out their high heels.)\n\nOther royals have actively supported women’s issues. Prince Charles’s wife, Camilla, for instance, is president of the Women of the World Festival and has advocated against domestic violence and female genital mutilation.\n\nBut this is the first time a senior royal has loudly declared herself a feminist on the monarchy’s official Web page.\n\nSome feminists said they hope this is just the beginning.\n\n“I hope as a member of Royal family she still believes in feminism, and will work for women’s equal rights,” tweeted author and feminist Taslima Nasreen.\n\nCarole Easton, chief executive of the Young Women’s Trust, said that it was “fantastic” that Meghan is “so committed to championing women’s rights. Now really is the time for action on this issue.”\n\nRead more:\n\nAt the royal wedding, some things very old and some things new\n\nThe surprise star of the royal wedding: U.S. Bishop Michael Curry", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=3005617&cv=2.0&cj=1", "https://www.washingtonpost.com/resizer/OqXAgVJee2XG4OfOFn1E7GI8n9w=/960x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/5GQEYJ24H423NNKM25JWWND67A.jpg", "https://www.washingtonpost.com/resizer/yAFxThroW-CI5t-yu8Q6FsF7kHI=/1x1/www.washingtonpost.com/pb/resources/img/spacer.gif", "https://me.effectivemeasure.net/em_image", "https://www.washingtonpost.com/resizer/yvaJhYolfsjMIi-gjGYA-9azzL0=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/KFEEIPIJWAZCRBXSEKGOHN3NYA.jpg"], "top_img": "https://www.washingtonpost.com/resizer/yvaJhYolfsjMIi-gjGYA-9azzL0=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/KFEEIPIJWAZCRBXSEKGOHN3NYA.jpg", "keywords": [], "authors": ["Karla Adam", "London Correspondent Covering The United Kingdom", "May"], "canonical_link": "https://www.washingtonpost.com/news/worldviews/wp/2018/05/21/meghan-markle-declares-herself-a-feminist-on-british-monarchys-website/", "title": "Meghan Markle declares herself a feminist on the British monarchy’s website", "meta_data": {"object-hash": 1554545434, "viewport": "width=device-width, initial-scale=1.0, user-scalable=yes, minimum-scale=0.5, maximum-scale=2.0", "referrer": "unsafe-url", "keywords": "Meghan Markle, feminist, royal wedding, royal family, british monarchy", "news_keywords": "Meghan Markle, feminist, royal wedding, royal family, british monarchy", "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "creator": "@karlaadam"}, "og": {"type": "article", "site_name": "Washington Post", "url": "https://www.washingtonpost.com/news/worldviews/wp/2018/05/21/meghan-markle-declares-herself-a-feminist-on-british-monarchys-website/", "image": "https://www.washingtonpost.com/resizer/yvaJhYolfsjMIi-gjGYA-9azzL0=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/KFEEIPIJWAZCRBXSEKGOHN3NYA.jpg", "title": "Meghan Markle declares herself a feminist on the British monarchy’s website", "description": "It’s the first time a senior royal has declared herself a feminist on the monarchy's official Web page."}, "article": {"publisher": "https://www.facebook.com/washingtonpost", "content_tier": "metered"}, "fb": {"app_id": 41245586762, "admins": 500835072}, "description": "It’s the first time a senior royal has declared herself a feminist on the monarchy's official Web page.", "robots": "index,follow", "theme": "normal"}, "movies": ["https://www.youtube.com/embed/Zkb-zg4JCLk?feature=oembed"], "publish_date": 1526875200.0, "source": "https://www.washingtonpost.com", "summary": ""}