{"url": "https://www.townandcountrymag.com/the-scene/weddings/a9207132/pippa-middleton-wedding-updates/", "text": "Pippa's wedding day is finally here! The younger Middleton daughter walked down the aisle to marry her longtime boyfriend, financier James Matthews this morning. Here's what we know so far about the happy couple’s big day.\n\nThe dress\n\nPippa captured the world's attention when she wore a white Alexander McQueen dress as her sister's bridesmaid. When it was her turn to walk down the aisle, she opted for a custom Giles Deacon gown.\n\nThe classic cream-colored lace dress, which is drawing comparisons to her sister's famous wedding look, features an a-line shape, high neck, and cap sleeves. Pippa paired the gown with a sparkly headpiece and a simple veil.\n\nGetty Images\n\nThe venue\n\nThe couple tied the knot at St Mark’s church in Englefield, Berkshire, which is located a few miles away from the Middleton family home. For the occasion, the historic parish was filled with romantic flower arrangements. Displays of pale pink and white roses paired with verdant stems spilled over windowsills and topped pillars, while larger tree-like structures of bark, greenery, and white blooms decorated the aisle.\n\nSplash News\n\nFollowing the church service, the congregation headed to the reception on the grounds of Carole and Michael Middleton’s Georgian property in nearby village of Bucklebury.\n\nSt Getty Images\n\nThe reception\n\nThere was a break of several hours between the church service and the evening party, and according to People, some guests were seen around town wearing black tie—men in tuxedos and women in evening gowns. Guests had to check in with security at a separate location and were then ferried to the Middleton home in Range Rovers.\n\n\n\nMarrying in her hometown was important to Pippa. \"Pippa is a traditional girl and wanted to marry close to home,\" a source told Hello! earlier this year.\n\n\n\nIn honor of the celebrations, a glass marquee from Belgium was installed on the Middleton family grounds.\n\n\n\nSplash\n\nAnother unique element of Pippa's big day the reception's theme. The party will reportedly celebrate the couple's ties to Scotland with haggis bites and a bagpiper. While there's no word whether James will don a kilt for the occasion, rumor has it the groom will incorporate tartan into his ensemble.\n\nIn addition to the Scottish-inspired eats, the menu also reportedly included Ruinart Blanc de Blanc Champagne, a spread of canapes including a Parmesan cheese wheel, fresh lobster, asparagus spears with Hollandaise sauce, Serrano ham, and carpaccio.\n\nAccording to The Mirror, guests also dined on £40,000 worth of caviar that was donated anonymously.\n\n\n\nEven the servers and waitresses at the event were noteworthy; the Middletons reportedly hired models for the occasion.\n\nThe bridal party\n\nWhile many hoped the Duchess of Cambridge might be bridesmaid or the maid of honor at her sister's wedding, that was not the case.\n\n\"Kate would upstage her sister,\" says People’s royals editor Judy Wade predicted earlier this year. \"It's a tricky situation for Pippa. She would want her sister by her side, as who else would she trust to make things go well? But if your sister is a future queen, she is going to draw attention.\"\n\nGetty Images\n\nIt's thought that the Duchess did a reading at the church service. She was also in full mom-mode this morning, tending to all the young wedding attendants, including her daughter Princess Charlotte, who was a bridesmaid and Prince George who served as a page boy.\n\nGetty Images\n\nAdditional page boys included Casimir Tatos, Edward Sebire, and William Ward. And the other bridesmaids were Countess Philippa Hoyos, Lily French, and Avia Horner.\n\nGetty Images\n\nThe guest list\n\nOnlookers also saw Prince Harry arrive with his brother William this morning. His girlfriend and past wedding date, Meghan Markle, was not present at the marriage ceremony, but she did attend the reception as his guest.\n\nGetty Images\n\nIt was previously reported that Pippa implemented a \"no ring, no bring\" policy, meaning that guests could only bring their partners to the church if they were either married or engaged. However, even at the reception, Markle and Prince Harry weren't seated together thanks to Pippa's strict table arrangements that separated significant others during the dinner.\n\n\n\nGetty Images\n\nOther key members of the guest list included tennis player Roger Federer and Princess Eugenie.\n\nGetty Images\n\nA new name\n\nFollowing her wedding, Pippa will be given a title. According to the Daily Mail, Pippa's future father-in-law, David Matthews, is currently the Laird of Glen Affric and when he passes away, his son James will take on the title, which will make Pippa the Lady of Glen Affric. Until they inherit their new titles, Pippa can take on the title of Mrs. Matthews of Glen Affric the younger, which she can use anywhere in the Commonwealth, according to The Express. Lady Pippa? It's definitely got a ring to it.\n\nThe engagement\n\nThe Duchess of Cambridge's younger sister and the 40-year-old millionaire announced the good news last year on July 19, after just a year of dating. James is thought to have proposed during a trip to the Lake District, England, and according to The Daily Mail, the groom-to-be asked Pippa's father Michael for his daughter's hand in marriage before the proposal. \"James is a traditionalist and very much wanted to do things properly,\" a friend of the couple's revealed. \"That meant getting the consent of his future father-in-law.\" Kensington Palace said that the Duke and Duchess of Cambridge were “absolutely delighted” by the news, and Pippa’s parents, Carole and Michael, told the press they were “thrilled.”\n\n\n\nPippa's Asscher cut ring Getty Images\n\nWhen news of the engagement broke, all eyes were on Pippa's finger. A day after the announcement was made, she was spotted wearing her art deco-style ring, which features an Asscher cut diamond at the center. It is rumored to be worth over $200,000.\n\n\n\nThe bachelorette party\n\nWhile Prince William was pictured partying with friends in the Alps, Pippa and her sister Kate were reportedly on their own ski trip, which also served as a low-key \"hen\" party, the British equivalent of a bachelorette party.\n\nVerbier in Switzerland, while Pippa and her friends flew 100 miles away to enjoy a \"small, private party\" in Meribel, France. And as you might expect, it was a fairly glamorous affair. \"They stayed in a really exclusive catered chalet with maids and chef, who ensured that they were totally spoiled,\" a source told the newspaper.\n\n\n\n", "images": ["https://hips.hearstapps.com/toc.h-cdn.co/assets/17/04/1600x800/1485554986-1485264988-1485253427-1485247224-landscape-1485217006-elle-kate-middelton-90s-bridesmaid.jpg?resize=300:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-685748264-1495287142.jpg?crop=1.00xw:0.405xh;0,0.0402xh&resize=300:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-686058740-1495466997.jpg?crop=1.00xw:0.814xh;0,0.106xh&resize=300:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-685746046-1495281944.jpg?crop=0.693xw:0.236xh;0.191xw,0.138xh&resize=1200:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/ap-17140418261636.jpg?crop=1.00xw:0.665xh;0,0.0216xh&resize=300:*", "https://hips.hearstapps.com/harpersbazaaruk.cdnds.net/17/14/2560x1280/landscape-1491209100-pippa-kate.jpg?resize=300:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/spl5047004-003-1543962830.jpg?crop=1.00xw:0.330xh;0,0.0306xh&resize=300:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-685746046-1495281944.jpg?crop=0.693xw:0.236xh;0.191xw,0.138xh&resize=1200:*", "keywords": [], "authors": ["Katie Frost", "Senior Editor", "Katie Frost Is Deputy News Editor In The Newsroom", "Covering Lifestyle", "Travel", "Food", "Celebrity", "Royals-Related Content."], "canonical_link": "https://www.townandcountrymag.com/the-scene/weddings/a9207132/pippa-middleton-wedding-updates/", "title": "All the Details on Pippa Middleton's Wedding!", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#BE3E19", "og": {"type": "article", "site_name": "Town & Country", "title": "All the Details on Pippa Middleton's Wedding!", "description": "From the dress and the flowers to the royal bridesmaid and page boy, here's everything we know about Pippa and James's celebration.", "url": "https://www.townandcountrymag.com/the-scene/weddings/a9207132/pippa-middleton-wedding-updates/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-685746046-1495281944.jpg?crop=0.693xw:0.236xh;0.191xw,0.138xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 526594570689062, "pages": 344794953432}, "article": {"publisher": "https://www.facebook.com/TownandCountryMagazine", "modified_time": "2018-06-06 03:36:21", "published_time": "2017-05-20 10:15:00", "section": "Weddings"}, "twitter": {"site": "@TandCmag", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-685746046-1495281944.jpg?crop=0.693xw:0.236xh;0.191xw,0.138xh&resize=640:*"}, "google-site-verification": "musQPiBADe3f4WpT4JNcg9uUChC3qnOhhPLSR4n1urM", "title": "Pippa Middleton Wedding News - Details on the Dress, Reception, Guests & More", "description": "Pippa Middleton and James Matthews' wedding is today! Since it’s not being televised, here’s everything to know, from the reception and her Giles Deacon dress to Meghan Markle's appearance.", "keywords": "Pippa Middleton wedding, James Matthews, Pippa Middleton wedding dress, pippa middleton and james matthews wedding, meghan markle attending, meghan markle, who is pippa middleton marrying, when is pippa middleton's wedding, pippa middleton wedding hair, pippa middleton wedding ring, when is pippa getting married, where is pippa getting married, pippa wedding televised, pippa wedding on tv", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-685746046-1495281944.jpg?crop=1.00xw:0.681xh;0,0&resize=320:*", "sailthru.contenttype": "long-form-article", "sailthru.tags": "The Scene,the-scene,weddings,James Matthews,Princess Charlotte", "sailthru.date": "2017-05-20T22:15:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-685746046-1495281944.jpg?crop=0.693xw:0.236xh;0.191xw,0.138xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-685746046-1495281944.jpg?crop=1.00xw:0.681xh;0,0", "sailthru.socialtitle": "All the Details on Pippa Middleton's Wedding!", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1495289700.0, "source": "https://www.townandcountrymag.com", "summary": ""}