{"url": "https://www.vogue.com/article/mette-towley-rihanna-head-shaved-nerd-lemon-music-video", "text": "If Rihanna wanted to shave your head, would you let her? If your answer is a resounding yes, you have at least one thing in common with dancer Mette Towley. Last week, N.E.R.D, the funk hip-hop band fronted by Pharrell, dropped their music video for their comeback single \"Lemon,\" featuring none other than Bad Gal RiRi. The video opens with the singer—wearing a sleek fringed bob, silver chain necklace and Raf Simons' \"Nebraska\" sweatshirt—wielding clippers in a hotel, giving pause with a laser-like stare into the camera before shaving off Towley's cloud of natural curls. The there's-no-turning-back-now transformation plays into the video's \"no one ever really dies\" theme (a play on the N.E.R.D acronym) by suggesting: If you want a new lease on life, radically shearing off your lengths is a fruitful first step.\n\n\"It was a once in a lifetime experience,” says Towley, a member of Pharrell's dance squad since 2014. \"There weren't multiple takes. I only had one head to shave.\" Believe it or not, it wasn't the 26-year-old Minnesota native's first beauty transformation. At 15, she transitioned her hair from straightened back to its natural kinky texture. “I was done spending hours trying to maintain a look that wasn’t me,\" she recalls. \"It was the first time I really took ownership of my body.\" She'd go on to spend the next decade diligently nurturing her curl pattern, flexing its versatility by wearing a halo of glossy ringlets or a picked out afro. “With all the love and care I'd given my curls, I surprised myself with how ready I was for the cut,” she says. “Afterwards, I put my hair in a bag and took it [home] with me from set--I couldn't just throw it away!” Still, the dramatic hair shift has been liberating for Towley as a performer: “I’ve never felt a stronger sense of femininity,” she explains. “I have a very womanly physique and I love the juxtaposition with the buzz cut. My body [has a] whole new silhouette.”\n\nAfter receiving her crop, Towley spends the rest of the \"Lemon\" video performing a solo routine choreographed by JaQuel Knight (the mastermind behind Beyoncé's \"Single Ladies\" dance), covered in glitter as she shimmies, gyrates, and pops to mesmerizing effect. \"I had a woman DM me on Instagram saying how much she appreciates that the video isn't exploitative and is about [subverting] the male gaze with full-on feminine strength and fury,\" she says. Male or female, one cannot help but marvel at Towley's rock-solid abs and sculpted limbs, the handiwork of not just being a professional dancer, but also attending hot yoga and off-duty-friendly classes at The Sweat Spot in L.A., where she currently resides. \"I need to be drenched in sweat five days a week in order to feel strong,\" she says. And it's because she's breaking a sweat day in and day out that she reserves a makeup look for performances only. On most days, she simply cleanses, moisturizes, pats on her go-to Origins GinZing Eye Cream, swipes ChapStick over her lips, and brushes through her pre-naturally thick brows. Because for the muse, sporting a bare face, blemishes et al, is the ultimate show of confidence. Of course, it doesn't hurt that she is blessed with a chiseled bone structure, pillowy lips, and a lit-from-within glow.\n\nWith her powerful new buzz cut, and a career-defining moment afoot, it's a new beginning for Towley in more ways than one. What's next? \"If Pharrell's taught me anything, it's that there's no limit to what you can achieve as long as you don't pigeonhole yourself,\" she explains. \"And now I have a new sense of fearlessness. As a dancer. As a woman. As Mette.\"", "images": ["https://collector-PX0lizzs6W.perimeterx.net/api/v1/collector/noScript.gif?appId=PX0lizzs6W", "https://www.vogue.com/wp-content/themes/vogue/images/logo_vogue.svg", "https://assets.vogue.com/photos/5a04e0c8e3243c28ba479e26/16:9/pass/00-social-image-mette-towley.jpg"], "top_img": "https://assets.vogue.com/photos/5a04e0c8e3243c28ba479e26/16:9/pass/00-social-image-mette-towley.jpg", "keywords": [], "authors": ["Lauren Valenti"], "canonical_link": "https://www.vogue.com/article/mette-towley-rihanna-head-shaved-nerd-lemon-music-video", "title": "Meet Pharrell’s Muse Mette Towley, the Dancer Who Let Rihanna Shave Her Head", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=no, width=device-width, initial-scale=1, maximum-scale=1", "copyright": "Copyright (c) Condé Nast 2019", "og": {"site_name": "Vogue", "url": "https://www.vogue.com/article/mette-towley-rihanna-head-shaved-nerd-lemon-music-video", "title": "Meet Pharrell’s Muse Mette Towley, the Dancer Who Let Rihanna Shave Her Head", "description": "Pharrell’s muse Mette Towley dishes on the drastic makeover she received from Rihanna in N.E.R.D’s “Lemon” video.", "image": "https://assets.vogue.com/photos/5a04e0c8e3243c28ba479e26/16:9/pass/00-social-image-mette-towley.jpg", "type": "article"}, "twitter": {"site": "@voguemagazine", "card": "summary_large_image", "domain": "www.vogue.com", "title": "Meet Pharrell’s Muse Mette Towley, the Dancer Who Let Rihanna Shave Her Head - Vogue", "image": {"src": "https://assets.vogue.com/photos/5a04e0c8e3243c28ba479e26/16:9/pass/00-social-image-mette-towley.jpg"}, "creator": "@voguemagazine", "description": "Pharrell’s muse Mette Towley dishes on the drastic makeover she received from Rihanna in N.E.R.D’s “Lemon” video."}, "apple-itunes-app": "app-id=1087973225, app-argument=https://www.vogue.com/article/mette-towley-rihanna-head-shaved-nerd-lemon-music-video, affiliate-data=ct=smart-banner&pt=45076", "description": "Pharrell’s muse Mette Towley dishes on the drastic makeover she received from Rihanna in N.E.R.D’s “Lemon” video.", "keywords": "Celebrity Beauty,Hair,Rihanna,Beauty,mobileAppReadyTrue", "news_keywords": "Celebrity Beauty,Hair,Rihanna,Beauty,mobileAppReadyTrue", "articleSection": "Beauty", "article": {"publisher": "http://www.facebook.com/vogue"}}, "movies": [], "publish_date": 1510272780.0, "source": "https://www.vogue.com", "summary": ""}