{"url": "https://www.washingtonpost.com/news/early-lead/wp/2017/09/23/president-trump-says-stephen-currys-white-house-invitation-has-been-withdrawn/", "text": "On Thursday, Golden State Warriors Coach Steve Kerr told ESPN’s Ramona Shelburne that his players would sit down as a team to talk about whether they would visit the White House to celebrate their NBA title, even though his two most prominent players — Stephen Curry and Kevin Durant — had already said they would not be going.\n\nOn Friday, however, Curry doubled down on his stance that he wants nothing to do with President Trump while speaking to reporters at the Warriors’ media day.\n\n“That we don’t stand for basically what our president … the things that he said and the things that he hasn’t said in the right terms that we won’t stand for it. And by acting and not going, hopefully that will inspire some change when it comes to what we tolerate in this country and what is accepted and what we turn a blind eye to. “It’s not just the act of not going. There are things you have to do on the back end to actually push that message into motion. You can talk about all the different personalities that have said things and done things, from [Colin] Kaepernick to what happened to [Michael] Bennett to all sorts of examples of what has gone on in our country that we need to kind of change. And we all are trying to do what we can, using our platforms, using our opportunities to shed light on that. “ … I don’t think us not going to White House is going to miraculously make everything better … [but] this is my opportunity to voice that.”\n\n[Perspective: Stephen Curry has long been reluctant to speak out. Then along came Donald Trump.]\n\nIt never was truly clear whether Trump had formally invited the Warriors to the White House (Shelburne reported Thursday and repeated Saturday that the team had not received an invitation), but Saturday morning, the president said the team — or at least Curry — is not welcome because of the comments Friday.\n\nGoing to the White House is considered a great honor for a championship team.Stephen Curry is hesitating,therefore invitation is withdrawn! — Donald J. Trump (@realDonaldTrump) September 23, 2017\n\nOn Saturday afternoon, the Warriors released a statement expressing disappointment in Trump’s statement. The team visits Washington to play the Wizards in February and will use that time “to celebrate equality, diversity and inclusion.”\n\nWarriors respond to being \"uninvited\" to White House. pic.twitter.com/A14HlrcsCs — Darren Rovell (@darrenrovell) September 23, 2017\n\nIt was the second time in about 12 hours that Trump had stuck to sports. In a speech Friday night in Alabama, he brought up the national anthem protests being staged by NFL players, without mentioning anyone by name.\n\n“Wouldn’t you love to see one of these NFL owners, when somebody disrespects our flag, to say: ‘Get that son of a b—- off the field right now, out. He’s fired. He’s fired!’ ” Trump told the crowd.\n\n[Trump turns sports into a political battleground with comments on NFL and Steph Curry]\n\nTrump doubled down on his comments later Saturday with a pair of tweets that conveyed the same message as before.\n\nIf a player wants the privilege of making millions of dollars in the NFL,or other leagues, he or she should not be allowed to disrespect.... — Donald J. Trump (@realDonaldTrump) September 23, 2017\n\n...our Great American Flag (or Country) and should stand for the National Anthem. If not, YOU'RE FIRED. Find something else to do! — Donald J. Trump (@realDonaldTrump) September 23, 2017\n\nSince Trump took office in January, members of the championship-winning New England Patriots, Chicago Cubs and Clemson Tigers have visited him at the White House. Patriots owner Robert Kraft has been a longtime Trump supporter and donated $1 million toward his inauguration. He also arranged for Trump to receive a Super Bowl ring.\n\nHowever, North Carolina men’s basketball coach Roy Williams was noncommittal when asked whether the Tar Heels would visit Trump at the White House after his team beat Gonzaga for the NCAA championship in April, and on Saturday the team announced that it would not make the trip. Dawn Staley, coach of the NCAA champion South Carolina women’s basketball team, said she would go to the White House if an invitation was extended, though she would give her players the option of not going.\n\nLeBron James commented on the matter later Saturday with a few pointed shots at President Trump.\n\nU bum @StephenCurry30 already said he ain't going! So therefore ain't no invite. Going to White House was a great honor until you showed up! — LeBron James (@KingJames) September 23, 2017\n\nAnd Ayesha Curry, Stephen Curry’s wife, responded to Trump’s tweet with one of her own.\n\n🙄Okay… Donate to earthquake relief here!!! https://t.co/HL5cvwbGtQ — Ayesha Curry (@ayeshacurry) September 23, 2017\n\nWe’ve reached out to the NBA for reaction to Trump’s tweet, and will update this post when we hear back.", "images": ["https://www.washingtonpost.com/resizer/yAFxThroW-CI5t-yu8Q6FsF7kHI=/1x1/www.washingtonpost.com/pb/resources/img/spacer.gif", "https://www.washingtonpost.com/resizer/5dZBdGLHJdC5Uzz1hwDGOk_iwTw=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/DOKWSQG2ZQ35NJIFYDKXJTIEVU.jpg", "https://me.effectivemeasure.net/em_image", "https://sb.scorecardresearch.com/p?c1=2&c2=3005617&cv=2.0&cj=1"], "top_img": "https://www.washingtonpost.com/resizer/5dZBdGLHJdC5Uzz1hwDGOk_iwTw=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/DOKWSQG2ZQ35NJIFYDKXJTIEVU.jpg", "keywords": [], "authors": ["Matt Bonesteel", "Reporter For The Early Lead", "September", "Matt Bonesteel Spent The First Years Of His Washington Post Career Writing", "Editing. In", "Bonesteel Pivoted The Newspaper To Online", "Now He Blogs For The Early Lead", "Other Web-Based Products Owned The Post."], "canonical_link": "https://www.washingtonpost.com/news/early-lead/wp/2017/09/23/president-trump-says-stephen-currys-white-house-invitation-has-been-withdrawn/", "title": "President Trump says Stephen Curry’s White House invitation has been ‘withdrawn’", "meta_data": {"object-hash": 1556529107, "viewport": "width=device-width, initial-scale=1.0, user-scalable=yes, minimum-scale=0.5, maximum-scale=2.0", "referrer": "unsafe-url", "keywords": "donald trump, nba, basketball, stephen curry, warriors white house, warriors, golden state warriors, trump warriors, trump, president trump, steph curry", "news_keywords": "donald trump, nba, basketball, stephen curry, warriors white house, warriors, golden state warriors, trump warriors, trump, president trump, steph curry", "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "creator": "@MattBonesteel"}, "og": {"type": "article", "site_name": "Washington Post", "url": "https://www.washingtonpost.com/news/early-lead/wp/2017/09/23/president-trump-says-stephen-currys-white-house-invitation-has-been-withdrawn/", "image": "https://www.washingtonpost.com/resizer/5dZBdGLHJdC5Uzz1hwDGOk_iwTw=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/DOKWSQG2ZQ35NJIFYDKXJTIEVU.jpg", "title": "President Trump says Stephen Curry’s White House invitation has been ‘withdrawn’", "description": "It's unclear whether the invitation actually had been extended to the Golden State Warriors, but the president said the NBA champions will not be welcome."}, "article": {"publisher": "https://www.facebook.com/washingtonpost", "content_tier": "metered"}, "fb": {"app_id": 41245586762, "admins": 500835072}, "zeusAds": "true", "description": "It's unclear whether the invitation actually had been extended to the Golden State Warriors, but the president said the NBA champions will not be welcome.", "robots": "index,follow", "theme": "normal"}, "movies": [], "publish_date": 1506139200.0, "source": "https://www.washingtonpost.com", "summary": ""}