{"url": "https://the-line-up.com/disappearance-of-maura-murray-case", "text": "One February day in 2004, Maura Murray climbed into her car and drove away from her dorm room at the University of Massachusetts Amherst. She headed north, her destination unknown. As night descended, a local in New Hampshire caught one last glimpse of Maura and her wrecked vehicle along a desolate stretch of Route 112.\n\nBy the time police responded to the crash, Maura was gone, seemingly vanished into thin air. Maura Murray’s disappearance shocked her family and friends. Nearly 14 years later, the cold case continues to baffle authorities, armchair detectives, and internet sleuths around the world. It has inspired everything from books and podcasts, to an increasingly bizarre web of conspiracy theories and true crime message board threads. Yet the mystery remains: What do we truly know about the disappearance of 21-year-old Maura Murray? Last weekend, Oxygen launched its own investigation into the Maura Murray case with a six-part series called The Disappearance of Maura Murray. Investigative journalist Maggie Freleng helms the search, enlisting the help of former U.S. Marshal Art Roderick as they trace the details of the baffling case. You can catch up on the first episode HERE. We plan to follow Oxygen’s investigation very closely. In the spirit of the pursuit, here’s what we know about Maura Murray’s life and her mysterious disappearance.\n\nA Bright Life\n\nPhoto Credit: Oxygen\n\nOn the surface, Maura Murray’s life seemed ideal. She was a promising student at the University of Massachusetts Amherst in pursuit of a nursing degree; she came from a loving family, and shared a strong relationship with her boyfriend of a few years. Yet all was not as it seemed. In November 2003, around three months before her disappearance, Maura was caught fraudulently using a credit card number that was not her own. The young woman had to have been desperate—she used the card only to order pizza, charging less than $80.\n\nWant more disappearance cases? Sign up for The Lineup's newsletter and receive our eeriest cases delivered straight to your inbox. Subscribe I would like to receive newsletters and special offers from Murder & Mayhem (fictional mysteries and thrillers).\n\nThen, on February 7, 2004, two days before her disappearance, Maura’s father Fred arrived in Amherst, Massachusetts for a visit. Maura borrowed her father’s car to go to a party. Around 3:30 A.M., while driving back to Fred’s room at the Quality Inn, Maura hit a guardrail on Route 9. The police responded to the scene, but they didn’t perform a sobriety test. Maura may have believed that these encounters with the law would tarnish her professional record, thus threatening her dreams of becoming a nurse. Some sleuths point to this as a motive for Maura to disappear of her own volition. The theory seems extreme—Fred Murray does not buy it. Since there was no ticket cited at the scene of the crash, there would be no reason for Maura to believe this was the end of the line. Nevertheless, something changed in Maura after the crash that night.\n\nPreparing for Departure\n\nPhoto Credit: Oxygen\n\nIn the early hours of February 9, Maura researched and printed out MapQuest directions to two different locations: one set that led to the Berkshires, the other to Burlington, Vermont. Throughout the day, she also phoned vacation rentals in the northeast, inquiring about availabilities. Nothing was booked. Then Maura’s messages took a dark turn. She wrote to her professors and work supervisors stating that she would be away from campus for a week. The reason? There was an unexpected death in the Murray family. No such death had occurred. At approximately 3:30 P.M., Maura Murray got in her car and left the UMass Amherst campus. Inside her vehicle were clothes, toiletries, some textbooks, and her birth control pills. Soon after her departure, Maura was recorded withdrawing $280 from a nearby ATM. She then entered a liquor store, where she purchased wine, coffee liqueur, and vodka. Security cameras captured Maura at the ATM, providing some of the last confirmed sightings of her before the disappearance. In the footage, she was alone. Whether Maura meant to temporarily escape the pressures of her life or disappear for good may never be clear. Upon leaving the liquor store, Maura drove north and then left Massachusetts.\n\nMaura Disappears\n\nPhoto Credit: Oxygen\n\nSometime after 7:00 P.M., 145 miles north of Amherst in Haverhill, New Hampshire, a resident heard a heavy thump outside her home. She peered out her window to see a car crashed against a snow bank on Route 112. The witness phoned the police. Meanwhile, an area bus driver who lived down the road came upon the scene of the accident. He noticed a young woman—whom he later identified as Maura Murray. The bus driver offered to help. The young woman convinced him not to call the police, claiming she had already spoken to AAA. The man agreed to the woman’s request and left. Yet he found her claim about a phone call odd. He knew the area lacked cell phone service. Upon arriving home, he decided to phone the police. At 7:46 P.M. police arrived at the scene. The car was locked, its windshield cracked, and the airbags deployed. The police later reported that they found an empty soda bottle that smelled as though it had once been filled with alcohol. But Maura Murray was nowhere to be found. The bus driver who stopped and spoke with Maura didn’t think she seemed intoxicated. Nevertheless, many theorists believe that Maura had been drinking that night. A shaken and inebriated Maura may have left the scene of her own accord. She may have stumbled into the dark woods and lost her way. Or—as Maura’s father maintains—she may have encountered a dangerous individual, who wished to do her harm. The following day, at 12:21 P.M., police issued a BOLO (“Be On the Look Out”) for the young woman. Twenty-four hours after the discovery of the abandoned car, police officially declared Maura Murray missing. Related: Where is Shelly Miscavige?\n\nTheories Emerge\n\nPhoto Credit: Oxygen\n\nMaura’s family, especially Fred, view the police’s investigation as substandard. They point to their slow response and failure to thoroughly investigate every lead as the reason why Maura’s fate remains a mystery. The police, meanwhile, have criticized Fred’s involvement in the investigation. A 2014 article in Boston Magazine cites Jeff Strelzin, chief of the homicide unit at the New Hampshire Attorney General’s Office and the lead prosecutor in the Murray investigation, who said, “Fred [Murray] has been a difficult person to deal with from the beginning.” Strelzin went on to describe Fred’s anger at the police as understandable but misplaced. As relations between Maura’s family and the police soured, rumors of infidelity and secret lives surfaced among armchair detectives and internet sleuths intent on cracking the case. James Renner, author of True Crime Addict: How I Lost Myself in the Mysterious Disappearance of Maura Murray, claimed to have evidence that Maura and her boyfriend were cheating on one another. Others believe that Maura may have been pregnant, bulimic, or both, and fled to escape judgment from her loved ones. Theories then split over whether she simply got lost and perished somewhere in the woods, purposefully disappeared to begin a new life, or if someone snatched her along Route 112. Despite legions of obsessives searching for the truth, there have been no definitive breaks in the case. That’s why we’re eager to dive back in to Oxygen’s The Disappearance of Maura Murray. Their search will examine the many unanswered questions that still haunt the investigation—and may change the case forever. The Disappearance of Maura Murray airs Saturdays at 7:00 P.M. EST/6:00 P.M. Central, and again at 9:00 P.M. EST/8:00 P.M. Central. For those who missed it, watch the first episode now on Oxygen.com.\n\nWant more disappearance cases? Sign up for The Lineup's newsletter and receive our eeriest cases delivered straight to your inbox. Subscribe I would like to receive newsletters and special offers from Murder & Mayhem (fictional mysteries and thrillers).", "images": ["https://orion-uploads.openroadmedia.com/thelineuplogo.png", "https://the-line-up.com/assets/images/singlePage/portalist-up-arrow.png", "https://orion-uploads.openroadmedia.com/md_45a773166f04-mm-featured-test.jpg"], "top_img": "https://orion-uploads.openroadmedia.com/md_45a773166f04-mm-featured-test.jpg", "keywords": [], "authors": [], "canonical_link": "https://the-line-up.com/disappearance-of-maura-murray-case", "title": "The Chilling, Unexplained Disappearance of Maura Murray", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=3.0", "fb": {"pages": 505089942950233}, "description": "Maura Murray’s disappearance shocked her family, and continues to baffle authorities and internet sleuths around the world.", "og": {"locale": "en_US", "type": "article", "title": "The Chilling, Unexplained Disappearance of Maura Murray", "description": "Maura Murray’s disappearance shocked her family, and continues to baffle authorities and internet sleuths around the world.", "url": "https://the-line-up.com/disappearance-of-maura-murray-case", "site_name": "The Lineup", "image": {"identifier": "https://orion-uploads.openroadmedia.com/md_45a773166f04-mm-featured-test.jpg", "width": 740}, "update_time": "Fri Jan 18 2019 16:00:50 GMT+0000 (UTC)"}, "article": {"publisher": "facebook.com/lineupweekly", "section": "True-Crime", "published_time": "Mon Sep 25 2017 14:21:00 GMT+0000 (UTC)", "modified_time": "Fri Jan 18 2019 16:00:50 GMT+0000 (UTC)"}, "twitter": {"card": "summary_large_image", "description": "Maura Murray’s disappearance shocked her family, and continues to baffle authorities and internet sleuths around the world.", "title": "The Chilling, Unexplained Disappearance of Maura Murray", "image": "https://orion-uploads.openroadmedia.com/md_45a773166f04-mm-featured-test.jpg"}, "sailthru.title": "The Chilling, Unexplained Disappearance of Maura Murray", "sailthru.image.thumb": "https://orion-uploads.openroadmedia.com/md_45a773166f04-mm-featured-test.jpg", "sailthru.image.full": "https://orion-uploads.openroadmedia.com/md_45a773166f04-mm-featured-test.jpg", "sailthru.description": "Maura Murray’s disappearance shocked her family, and continues to baffle authorities and internet sleuths around the world.", "sailthru.tags": "unsolved disappearance,Maura Murray", "sailthru.label": "True-Crime", "sailthru.date": "Mon Sep 25 2017 14:21:00 GMT+0000 (UTC)", "sailthru.expire_date": "null", "robots": "index"}, "movies": [], "publish_date": 1506349260.0, "source": "https://the-line-up.com", "summary": ""}