{"url": "https://www.brides.com/story/2017-wedding-trend-predictions", "text": "With the new year comes new engagements, new brides-to-be (welcome, ladies!), and new wedding trends. And while we're still excited about the trends and creative ideas we saw in 2018—think games for guests , statement bridal hats , and basically anything Harry and Meghan did —we, like you, are also ready to dive into the world of weddings for 2019.\n\nWhich is why we called on some of the industry's top wedding planners to see exactly what they're predicting for the new year. You'll have to keep scrolling to see exactly what they said below, but one thing is certain: The rules are all out. Think mismatched bridesmaids dresses, coeds on each side of the aisle, and more. Also out? Wedding welcome bags and expensive favors (don't worry, we'll get to that later). In terms of what's in , the experts say we're all still obsessed with the world's hottest power couple (hi, Harry and Meghan!) so feel free to continue copying the royal wedding's statement church entrance, meaningful ceremony touches, and unexpected reception details . They're also excited to see couples experiment with fresh color palettes and put unexpected twists on the traditional wedding in the year come to.\n\nKeep reading for all the exciting, modern, and on-trend ideas, broken down by the pros who came up with them. Oh, and we also asked the experts to share which trends to avoid and their best pieces of tried-and-true advice for the newly engaged ladies like you... So, basically, read on because we've got you covered as you dive into wedding planning in the new year!\n\nJesse Tombs of Alison Events\n\nPinterest Photo by Tec Petaja; Design and Planning by Jesse Tombs; Floral Design by Ariella Chezar\n\nThe year’s biggest trend: \"2019 is all about embracing color and new color combinations that have never been done before,\" Jesse says. \"We see the trend veering away from soft classic colors and heading in a more fun, pumped up direction.\" Case in point: \"Living Coral,\" the Pantone Color of the Year . \"We see 2019 clients leaning more towards younger, fresher palettes with pops of bright and bold color that is fun, youthful and often somewhat daring,\" he adds.\n\nTrend to do away with: \"Welcome bags! Time and time again, we see many of the expensive, well thought-out items get left behind in hotel rooms,\" he says. \"Instead, consider giving a nice bottle of wine and a handwritten note, or making a donation to your favorite local charity in the guests names honor.\"\n\nExcited for in the new year: \"We have a couple who is focused on supporting underserved communities and working with female owned and operated local businesses for their wedding day,\" he says. \"This is an exciting prospect for us and a first for Alison Events to have a client that is so locally, globally and environmentally minded when planning their special day. We can't wait to see how it all comes together!\"\n\nCan't wait to see a couple do: \"A food and wine-focused wedding,\" he says. \"We love when clients embrace food and beverage as an integral part of the wedding celebration!\"\n\nBest planning advice: \"Get personal! Hire vendors you connect with on a personal level, not just ones that suit your aesthetic or budget,\" he says. \"Get to know a vendor over coffee or a glass of wine to make sure they are a good personality fit for your project and are someone you would want to spend a year of your life with planning such a big and important day in your life.\"\n\nSunna Yassin of Bash Please\n\nPinterest Photo by Lauren Ross\n\nThe year’s biggest trend: \"Non traditional bridesmaid dresses in an eclectic mix in a color palette,\" she says.\n\nTrend to do away with: The ladies at Bash Please had two words on this subject: \"Photo booths!\"\n\nCan't wait to see a couple do: \"We love the idea of a bride and groom walking down the aisle together or having your guests stand during the ceremony to make it feel inclusive,\" Sunna says. \"These moments can truly set the tone for the rest of the wedding.\"\n\nBest planning advice: \"Before jumping on Instagram or Pinterest, talk to a few friends or relatives who recently got married, \" she recommends. \"It's always helpful to hear from people you trust about what they ended up enjoying the most about their own celebration!\"\n\nMichelle Rago of Michelle Rago Destinations\n\nPinterest Photo by Abby Ross; Planning by Michelle Rago Destinations\n\nThe year’s biggest trend: \"For 2019, we are seeing both Portugal and Spain to be on the rise in terms of wedding destination inquiries,\" Michelle says. Also, vegan menus: \"We're seeing a surge in requests for not just vegan dishes as an option but the entire wedding meal from start to finish,\" she adds.\n\nTrend to do away with: \"The doughnut wall—and right behind that, the 'naked' wedding cake,\" she says. And wedding favors! \"We encourage more meaningful communications such as handwritten notes to each guest upon arrival or spending a bit more with your photographer and videographer to send photo and video keepsakes when the wedding is over,\" she says.\n\nExcited for in the new year: \"I am hoping for less of a synthetic approach to luxury and a more meaningful and authentic approach to the overall guest experience,\" she says. \"Instead of having 15 entertainers in costume, perhaps bring your guests in a day earlier or stay one day longer and have a long lazy lunch to truly connect?!\"\n\nCan't wait to see a couple do: \"I am dying for a couple to do a fabulous party on the Orient Express because I think train travel is so chic,\" she says. \"My second hope is for a blow-out wedding that is a complete surprise for all the guests!\"\n\nBest planning advice: \"Don’t limit yourself in choosing a location,\" Michelle suggests. \"There are so many amazing places in the world. We think spending a bit more time finding the perfect spot will make for the most memorable wedding.\"\n\nVirginia Edelson of Bluebird Productions\n\nPinterest Photo by James & Schulze; Planning by Bluebird Productions\n\nThe year’s biggest trend: \"2019 will be the year of mixed and untraditional wedding parties—gone are the days of six bridesmaids and six groomsmen,\" she says. \"Instead, we'll see see a mix of genders standing on both sides of the aisle. Or even no one at all!\"\n\nTrend to do away with: \"We're ready to see the days of showing off for the sake of showing off go away,\" Virginia says. \"Let's make weddings return to something that feels a bit more personal and heartfelt. They should be authentic expressions of love and a gift to your guests to celebrate this new commitment.\"\n\nDecor trend of the year: \"Our 2019 clients are very interested in creating 'installations' and incorporating art into their weddings in 2019,\" she says.\" Personally, as an art history major and lover of art, this is very very exciting for me!\"\n\nExcited for in the new year: \"We want to see couples experiment more in their fashion choices with different colors, textures, silhouettes, and eye catching accessories,\" she says.\n\nBest planning advice: \"Be organized. Know your budget. Have honest communication with yourselves and your vendors,\" she says. And finally: \"Get rid of Pinterest!\"\n\nTara Guérard of Tara Guérard Soirée\n\nPinterest Photo by Liz Banfield\n\nThe year’s biggest trend: \"Bars with more specialty and special cocktails custom made with fresh ingredients,\" she says.\n\nTrend to do away with: \"After parties,\" she says.\n\nExcited for in the new year: \"Brides wanting to be a little different, creating a day that is memorable for everybody ,\" she says.\n\nCan't wait to see a couple do: \"Have a day wedding!,\" Tara says. \"I imagine lunch in the garden, with the bride in a tea length dress and an orchestra playing.\"\n\nBest planning advice: \"Wait to go on your honeymoon a week after the wedding so you can go home, rest, and repack,\" she advises. \"That way, no days are wasted just sleeping and being exhausted on your most romantic trip!\"\n\nJacin Fitzgerald or Jacin Fitzgerald Events\n\nPinterest Photo by Tec Petaja\n\nThe year's biggest trend: \"I think the Royal Wedding will continue to have an impact on weddings moving forward, with dainty bouquets resurfacing and large floral and greenery installations creating this 'moment' as you enter the venue,\" she says.\n\nExcited for in the new year: \"I am really excited about some new destinations we are working with, and bringing in some fun unexpected elements into the paper goods,\" she says.\n\nCan't wait to see a couple do: \"I would love to see a couple shake things up a bit when it comes to the order of events for the wedding weekend—maybe a welcome brunch followed by cocktails and a walk or a team event of sorts...Something to break the ice but also get people to mix and mingle,\" Jacin says.\n\nBest planning advice: \"Take some time to think about your top two to three priorities, whether it's your venue or band, photographer or florist, and break up the planning backwards from there,\" she advises. \"Many couples feel pressure to hit the ground running in order to get their date, and start out stressed versus taking a moment to think it all through.\"\n\nNeillie Butler of Mariée Ami\n\nPinterest Photo by Davy Whitener\n\nThe year's biggest trend: \"Design plans will be more focused on deep colors with a modern flair,\" she says. \"Darker colors will accent the traditional pale hues to add more interest, and the rich tones can be pulled in through furniture and linens, while leaving the blooms light and airy.\" In terms of colors, Neillie says she imagines working with emerald greens, smoky greys, and blues paired with blush, mauve, and, of course, Pantone’s color of the year, coral, in the year to come.\n\nExcited for in the new year: \"We are most excited about incorporating pattern and textures in the overall design plan,\" she says. \"We have more and more clients who are open to marrying interior design with wedding planning; basically designing receptions to feel like a bold dining room or a swanky hotel lobby is definitely the direction we are going.\"\n\nCan't wait to see a couple do: \"I would love to see a couple truly focus on the guest experience,\" Neillie says. \"There are many ways a bride and groom can make their wedding interactive and more memorable and entertaining for their guests. This could be anything from how the guests are served hors d’oeuvres and drinks to unique forms of live entertainment to grab the attention during cocktail hour.\"\n\nBest planning advice: \"For all of the newly engaged, my best piece of advice is to remember this is the beginning of a relationship that will last a lifetime,\" she says. \"This is supposed to be a fun time for all and we strongly encourage kindness, love and patience to all involved in the planning processes. At the end of it all, you want to look back on this time and only feel happiness!\"", "images": ["https://media.brides.com/photos/5c14331c70e68b036fa6dbc5/1:1/w_767/tec%2520petaja%2520photo-74.jpg", "https://media.brides.com/photos/5c01565934add44448881314/1:1/w_125/AH-BRIDES.jpg", "https://www.brides.com/images/brides-logo.svg", "https://media.brides.com/photos/59b6bd8cae291a647bf40f23/1:1/w_125/elyseandlyndon20170817_14.JPG", "https://media.brides.com/photos/5c14331c70e68b036fa6dbc5/master/pass/tec%20petaja%20photo-74.jpg", "https://media.brides.com/photos/596f83cda456da0a8db283a9/1:1/w_125/17.jpg"], "top_img": "https://media.brides.com/photos/5c14331c70e68b036fa6dbc5/master/pass/tec%20petaja%20photo-74.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.brides.com/story/2017-wedding-trend-predictions", "title": "2019 Wedding Trends, According to Top Wedding Planners", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=no, width=device-width, initial-scale=1, maximum-scale=1", "description": "2019 brides, listen up! We asked some of the country's top planners to tell us all the wedding trends we'll see in 2019, along with what should be left in 2018.", "og": {"description": "2019 brides, listen up!", "image": "https://media.brides.com/photos/5c14331c70e68b036fa6dbc5/master/pass/tec%20petaja%20photo-74.jpg", "title": "2019 Wedding Trends, According to Top Wedding Planners", "url": "https://www.brides.com/story/2017-wedding-trend-predictions", "site_name": "brides", "type": "article"}, "twitter": {"description": "2019 brides, listen up!", "image": "https://media.brides.com/photos/5c14331c70e68b036fa6dbc5/master/pass/tec%20petaja%20photo-74.jpg?mbid=social_retweet", "title": "2019 Wedding Trends, According to Top Wedding Planners", "url": "https://www.brides.com/story/2017-wedding-trend-predictions", "card": "summary_large_image", "creator": "@brides", "site": "brides"}, "fb": {"page_id": 50416192591, "admins": "648235154,789168297,688620285"}, "keywords": "Wedding Ideas", "news_keywords": "Ceremony & Reception,Reception,Wedding Ideas"}, "movies": [], "publish_date": null, "source": "https://www.brides.com", "summary": ""}