{"url": "https://www.elle.com/culture/celebrities/a22651522/beyonce-twin-sir-rumi-emergency-birth-post-baby-body/", "text": "Beyoncé, the woman who famously didn't give Vogue an interview the last time she did its cover, just gave the publication one of her most intimate yet. The singer, in an as-told to with Jezebel's culture editor Clover Hope for the publication's September issue, spoke about her journey, how she wants to raise her kids, and very poignantly, her view of her body after giving birth to both Blue Ivy Carter and her twins years later.\n\nBeyoncé revealed she was on bed rest for a full month before giving birth to Sir and Rumi Carter and had an emergency C-section because her and their lives were in danger. As she put it:\n\nAfter the birth of my first child, I believed in the things society said about how my body should look. I put pressure on myself to lose all the baby weight in three months, and scheduled a small tour to assure I would do it. Looking back, that was crazy. I was still breastfeeding when I performed the Revel shows in Atlantic City in 2012. After the twins, I approached things very differently.\n\nI was 218 pounds the day I gave birth to Rumi and Sir. I was swollen from toxemia and had been on bed rest for over a month. My health and my babies’ health were in danger, so I had an emergency C-section. We spent many weeks in the NICU. My husband was a soldier and such a strong support system for me. I am proud to have been a witness to his strength and evolution as a man, a best friend, and a father. I was in survival mode and did not grasp it all until months later. Today I have a connection to any parent who has been through such an experience. After the C-section, my core felt different. It had been major surgery. Some of your organs are shifted temporarily, and in rare cases, removed temporarily during delivery. I am not sure everyone understands that. I needed time to heal, to recover. During my recovery, I gave myself self-love and self-care, and I embraced being curvier. I accepted what my body wanted to be. After six months, I started preparing for Coachella. I became vegan temporarily, gave up coffee, alcohol, and all fruit drinks. But I was patient with myself and enjoyed my fuller curves. My kids and husband did, too.\n\nBeyoncé added that she still doesn't have her pre-baby body:\n\n\n\nTo this day my arms, shoulders, breasts, and thighs are fuller. I have a little mommy pouch, and I’m in no rush to get rid of it. I think it’s real. Whenever I’m ready to get a six-pack, I will go into beast zone and work my ass off until I have it. But right now, my little FUPA and I feel like we are meant to be.\n\nThe singer also spoke about how she wants her children to be: \"It’s important to me that they [my daughters] see themselves as CEOs, as bosses, and that they know they can write the script for their own lives—that they can speak their minds and they have no ceiling,\" she said. \"They don’t have to be a certain type or fit into a specific category. They don’t have to be politically correct, as long as they’re authentic, respectful, compassionate, and empathetic. They can explore any religion, fall in love with any race, and love who they want to love. I want the same things for my son. I want him to know that he can be strong and brave but that he can also be sensitive and kind. I want my son to have a high emotional IQ where he is free to be caring, truthful, and honest. It’s everything a woman wants in a man, and yet we don’t teach it to our boys.\"\n\n\"I hope to teach my son not to fall victim to what the internet says he should be or how he should love,\" she continued. \"I want to create better representations for him so he is allowed to reach his full potential as a man, and to teach him that the real magic he possesses in the world is the power to affirm his own existence.\"\n\nRead her full as-told-to here.\n\n", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/capture-d-e-cran-2018-08-06-a-9-26-37-am-1533562004.png?crop=1.00xw:0.401xh;0,0.0922xh&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/capture-d-e-cran-2018-08-06-a-9-26-37-am-1533562004.png?crop=1.00xw:0.401xh;0,0.0922xh&resize=1200:*", "keywords": [], "authors": ["Alyssa Bailey", "News", "Strategy Editor", "Alyssa Bailey Is The News", "Strategy Editor At Elle.Com", "Where She Oversees Coverage Of Celebrities", "Royals", "Particularly Meghan Markle", "Kate Middleton ."], "canonical_link": "https://www.elle.com/culture/celebrities/a22651522/beyonce-twin-sir-rumi-emergency-birth-post-baby-body/", "title": "Beyoncé Opens Up About Her Twins' Emergency Birth and Her Body After Pregnancy", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "ELLE", "title": "Beyoncé Opens Up About Her Twins' Emergency Birth and Her Body After Pregnancy", "description": "\"After the birth of my first child, I believed in the things society said about how my body should look. Looking back, that was crazy.\"", "url": "https://www.elle.com/culture/celebrities/a22651522/beyonce-twin-sir-rumi-emergency-birth-post-baby-body/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/capture-d-e-cran-2018-08-06-a-9-26-37-am-1533562004.png?crop=1.00xw:0.401xh;0,0.0922xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 364664413547847, "pages": 31911516300}, "article": {"publisher": "https://www.facebook.com/ellemagazine", "modified_time": "2018-08-06 02:52:36", "published_time": "2018-08-06 01:29:00", "section": "Celebrity News 2019"}, "twitter": {"site": "@ELLEmagazine", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/capture-d-e-cran-2018-08-06-a-9-26-37-am-1533562004.png?crop=1.00xw:0.401xh;0,0.0922xh&resize=640:*"}, "google-site-verification": "W6SOBCzCmb2sA5l3z9YK1yO7I7bPYArVQCP09_e2zck", "title": "Beyoncé on Twins Sir and Rumi's Emergency Birth and Body After Pregnancy - How Bey Wants to Raise Kids", "description": "Beyoncé, the woman who famously didn't give ​Vogue ​an interview the last time she did its cover, just gave the publication one of her most intimate yet. The singer, in an as-told to​ with Jezebel's culture editor Clover Hope for the publication's September issue, spoke about her journey, how she wants to raise her kids, and very poignantly, her view of her body after giving birth to both Blue Ivy Carter and her twins years later", "keywords": "Beyoncé, Beyoncé jay-z, Beyoncé kids, Beyoncé post-baby body, Beyoncé twins, Beyoncé vogue, blue ivy carter, rumi carter, sir carter", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/capture-d-e-cran-2018-08-06-a-9-26-37-am-1533562004.png?crop=1.00xw:0.800xh;0,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Culture,culture,celebrities,Beyoncé vogue,Beyoncé post-baby body,Beyoncé kids,beyonce twins,rumi carter,sir carter,beyonce jay z,blue ivy carter,Beyonce", "sailthru.date": "2018-08-06T13:29:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/capture-d-e-cran-2018-08-06-a-9-26-37-am-1533562004.png?crop=1.00xw:0.401xh;0,0.0922xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/capture-d-e-cran-2018-08-06-a-9-26-37-am-1533562004.png?crop=1.00xw:0.800xh;0,0", "sailthru.socialtitle": "Beyoncé Opens Up About Her Twins' Emergency Birth and Her Body After Pregnancy", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1533533340.0, "source": "https://www.elle.com", "summary": ""}