{"url": "www.thesun.co.uk/tvandshowbiz/5735247/miley-cyrus-liam-hemsworth-married-engaged-split/", "text": "MILEY Cyrus and Liam Hemsworth are known for their on/off relationship.\n\nThe couple put on a VERY loved-up display at the Oscars 2018 and the couple \"wed in a secret ceremony\" six years after getting engaged. Here's what we know...\n\n3 Miley Cyrus and Liam Hemsworth are now married Credit: The Mega Agency\n\nHow did Miley Cyrus and Liam Hemsworth meet?\n\nMiley Cyrus, 26, has been in a relationship with Australian actor Liam Hemsworth, 28, since 2009.\n\nThe star couple met on the set of their movie The Last Song.\n\nAt the time Liam was a virtual unknown, while Miley was a Disney pop princess.\n\n3 The couple met on the set of The Last Song Credit: Handout\n\nWhen did they get engaged?\n\nThe pair had an on-off relationship with an engagement being announced in June 2012.\n\nBut by 2014 the pair had split.\n\nIn 2016, the romance was back on – and so was the engagement.\n\n3 They got engaged in 2012, before splitting up and getting back together Credit: Getty - Contributor\n\nDid they call off their wedding?\n\nOn July 19, 2018, it was reported that Miley Cyrus and Liam Hemsworth ‘called off their wedding’ as she’s ‘not ready to have a baby’.\n\nAccording to OK! Australia sources, the Hollywood couple clashed over having children - with the Wrecking Ball singer not ready to become a mum.\n\nThe source said: \"'He wants kids and doesn't want to keep putting it off but it's not quite the timeline Miley had in mind. He is left heartbroken.\n\n\"Miley put off plans for the wedding and Liam was growing tired of it. They haven't been getting along in recent months.\"\n\nThere is no official confirmation of the wedding cancellation, or whether the pair have split.\n\nLater that day, however, Liam added a video of the pair to his Instagram story, suggesting the rumours are fake.\n\nMore on celebrity relationships Exclusive IT'S OVER! Jess Impiazzi splits from Hollyoaks’ Charlie Clapham after moving to LA with him Exclusive fallen deep Professor Green dating Deep State actress Karima McAdams Exclusive LAST ORDERS Coleen takes kids to UK leaving Wayne in the US with strict rules to follow THE WRIGHT ONE The lowdown on Rio Ferdinand and Kate Wright's wedding... Exclusive CAN I HAVE A VOW? Rachel Riley marries Strictly star Pasha Kovalev in secret Vegas ceremony 'reward if found' Dua Lipa says she's 'lost her sanity' at Glasto after Chris Martin 'kiss' haz about that Caroline Flack banned from talking about Prince Harry romance don't look dad in anger Liam on life with 4 kids by 4 mums… & what they think of uncle Noel WEDDING FEVER The lowdown on Pixie Lott's wedding to model Oliver Cheshire Exclusive HURTY 'ARRY Harry Redknapp hits back at 'wheeler dealer' slur that cost him England job Exclusive CHERRY PICKED Ed Sheeran will star in rom-com Yesterday and bagged film cameo for his wife A LOTTA PIXIE Everything you need to know about The Voice Kids star Pixie Lott\n\nWhen did they get married?\n\nOn December 24, 2018, it was revealed the couple \"wed in a secret ceremony\" at Miley’s house in Franklin, Tennessee, six years after getting engaged.\n\nMiley Cyrus was filmed dancing to Uptown Funk by Mark Ronson in her £6,800 wedding dress by Vivienne Westwood.\n\nThe couple's wedding photo is just like their first kiss on the set of The Last Song 10 years ago.\n\nTo celebrate finally tying the knot, they took the whole of Liam's family on a ski trip honeymoon to Montana.", "images": ["data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.8 1\"%3E%3C/svg%3E", "http://www.facebook.com/tr?id=752905198150451&ev=PageView&noscript=1", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.7 1\"%3E%3C/svg%3E", "https://www.thesun.co.uk/wp-content/uploads/2019/04/sunmasthead_mobile_site_of_the_year.png", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.thesun.co.uk/wp-content/uploads/2018/03/ad-composite-miley-liam.jpg?strip=all&quality=100&w=750&h=500&crop=1", "https://www.thesun.co.uk/wp-content/uploads/2019/04/sunmasthead_desktop_0404.jpg"], "top_img": "https://www.thesun.co.uk/wp-content/uploads/2018/03/ad-composite-miley-liam.jpg?strip=all&quality=100&w=750&h=500&crop=1", "keywords": [], "authors": ["Joanne Kavanagh"], "canonical_link": "https://www.thesun.co.uk/tvandshowbiz/5735247/miley-cyrus-liam-hemsworth-married-engaged-split/", "title": "When did Miley Cyrus and Liam Hemsworth get married and where was their wedding?", "meta_data": {"viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no, width=device-width", "google-site-verification": "a576LGe3E0YA5QjAMY268jcuKWwPLIORxwlTMrjnfnE", "msvalidate.01": "E4359034FA254151A3AB2EFAC6D20D80", "p": {"domain_verify": "c061a8052bd9e93315b7f01447fa4124"}, "og": {"type": "article", "title": "The latest on Miley Cyrus and Liam Hemsworth - find out if they've split up", "url": "https://www.thesun.co.uk/tvandshowbiz/5735247/miley-cyrus-liam-hemsworth-married-engaged-split/", "description": "MILEY Cyrus and Liam Hemsworth are known for their on/off relationship. The couple put on a VERY loved-up display at the Oscars 2018 and the couple “wed in a secret ceremony” six years …", "site_name": "The Sun", "image": {"identifier": "https://www.thesun.co.uk/wp-content/uploads/2018/03/ad-composite-miley-liam.jpg?strip=all&quality=100&w=750&h=500&crop=1", "width": 750, "height": 500}, "locale": "en_GB"}, "article": {"published_time": "2019-01-01T15:33:14+00:00", "modified_time": "2019-01-01T15:34:50+00:00", "publisher": 161385360554578, "tag": "Liam Hemsworth, Miley Cyrus, Celebrity relationships and break ups, Explainers", "author": "https://www.facebook.com/thesunshowbiz/"}, "fb": {"app_id": 144647118961553, "pages": 161385360554578}, "description": "We take a look at their relationship so far and how long they have been engaged for", "keywords": "Miley Cyrus, Liam Hemsworth, married, singer, actor, actress, disney, engaged, wedding plans, split, rumours, couple, relationship", "news_keywords": "Miley Cyrus, Liam Hemsworth, married, singer, actor, actress, disney, engaged, wedding plans, split, rumours, couple, relationship", "twitter": {"text": {"title": "When did Miley Cyrus and Liam Hemsworth get married and where was their wedding?"}, "card": "summary_large_image", "site": "@thesun"}, "robots": "noarchive,noodp", "taboola": {"kicker": "JUST MARRIED", "headline": "Latest on Miley Cyrus and Liam Hemsworth - find out when they tied the knot", "image": {"medium": "https://www.thesun.co.uk/wp-content/uploads/2018/03/ad-composite-miley-liam.jpg?strip=all&quality=100&w=300&h=192&crop=1", "large": "https://www.thesun.co.uk/wp-content/uploads/2018/03/ad-composite-miley-liam.jpg?strip=all&quality=100&w=620&h=413&crop=1"}}, "parsely-post-id": 5735247, "msapplication-TileImage": "https://www.thesun.co.uk/wp-content/uploads/2016/04/icon-e1459786005667.png?strip=all&w=270"}, "movies": [], "publish_date": 1546356794.0, "source": "http://www.thesun.co.uk", "summary": ""}