{"url": "https://www.fame10.com/style/meghan-markles-12-favorite-beauty-products-are-surprisingly-relatable/", "text": "Meghan Markle has always had a reputation for being perfectly poised and radiant, even before her days as Prince Harry’s fiancee! During each public appearance, Markle consistently steps out in an outfit that is trendy and polished and her skin seems to be eternally luminous. Luckily, the glow we’ve come to recognize as her signature is totally achievable since the self-proclaimed beauty junkie has dished all the details of her favorite products. Surprisingly, a lot of her holy grail products are actually quite affordable and a few of them can even be purchased at the drugstore! To achieve Meghan Markle’s healthy glow, follow along for 12 of her surprisingly relatable favorite beauty products:\n\n11. Fresh Sugar Lip Treatment\n\nMarkle always has a glossy, tinted pout whenever she steps out for public appearances and has revealed that she often opts for a balm rather than a heavy lipstick. To achieve the look, Markle shared in an interview with Beauty Banter that her all-time favorite lip product is the Fresh Sugar Lip Treatment. “I have searched high and low and tried every kind of lip balm but this is the very best. Soft, kissable, buttery lips. I swear by it,” she shared at the time. The product is a huge favorite within the beauty community and definitely a must-try for it’s SPF and hydration properties.\n\nBuy it here: http://amzn.to/2olun6g\n\nADVERTISEMENT\n\n2\n\n10. Beauty Blender\n\nThe beauty blender makeup applicator is raved about in the beauty community, and surprisingly Meghan Markle is a huge fan. This sponge is known for its flawless makeup application and creates a natural-looking wash of foundation that still shows skin underneath. Markle has shared that she doesn’t like her foundation to be super thick and loves to still show her freckles, so it makes sense that this type of foundation applicator is her personal favorite.\n\nBuy it here: http://amzn.to/2Cc6Z4z\n\n3\n\n9. Nars Blush in Orgasm\n\nMeghan Markle has the most radiant glowing skin, and fortunately for us, she’s dished her favorite product to achieve the look! To steal Markle’s luminous complexion, try the NARS blush in the shade Orgasm. She claims the shade is “a perfect rosy flush tone that brightens the face” and is known to be a universally flattering color that works with every skin tone. We love the subtle golden sparkle and peach undertones of this particular shade!\n\nBuy it here: http://amzn.to/2CBBbl7\n\n4\n\n8. Nivea Skin Firming Hydration Body Lotion\n\nIt’s often presumed that celebrities use luxurious and pricey products when it comes to skincare, but Meghan Markle has definitely broken that stereotype with her favorite body lotion! “I use this religiously. It’s honestly my favorite lotion on the market, it’s so affordable, and makes my skin look and feel amazing. I would buy a case of this at a time if I could find it,” she dished to Beauty Banter of the Nivea Skin Firming Hydration body lotion. For less than $15 dollars for a bottle, we are definitely adding this Nivea product to our carts after hearing Markle’s rave review!\n\nBuy it here: http://amzn.to/2one2xX\n\n5\n\n7. Laura Mercier Radiance Foundation Primer\n\nMarkle is one of the few lucky ones to have a flawless complexion naturally, and she’s even revealed that she doesn’t tend to wear much foundation on a regular basis. She does, however, use a face primer on most days to add glow and radiance to her skin. She dished to BeautyBanter that she often uses the Laura Mercier Radiance primer after she applies moisturizer and before foundation. She claims it adds a natural-looking dewiness to the skin and smooths out any discoloration or redness which eliminates the need for heavy coverage foundations.\n\nBuy it here: http://amzn.to/2GytdeW\n\n6\n\n6. Biore Daily Cleansing Cloths\n\nThis affordable beauty favorite of Meghan Markle’s definitely caught us by surprise. The star swears by the Biore daily cleansing cloths which are less than $10 on Amazon! She revealed that one of her strict beauty regimes is removing all makeup before bed and these gentle exfoliating wipes do just the trick on late nights. She admitted she buys these packs in bulk and they are a life saver for “horribly lazy nights when the thought of getting up to actually wash your face seems unbearable.” We couldn’t agree more, Meghan!\n\nBuy it here: http://amzn.to/2CAgBBM\n\n7\n\n5. Yves Saint Laurent Touche Eclat Radiance Perfecting Pen\n\nEver wonder how Meghan Markle always looks so bright-eyed and awake? She revealed her secret to looking refreshed is the YSL Touche Eclat Radiance Perfecting Pen. “It blends, it’s compact and if you’ve worked a 17 hour day and have nothing else on, you will still look relatively alive. Relatively,” she joked. The classic concealer pen has been a huge hit within the beauty community for years, but with Markle backing its effectiveness, it definitely seems worth a try!\n\nBuy it here: http://amzn.to/2Guid2r\n\n8\n\n4. Kate Somerville Quench Hydrating Face Serum\n\nMarkle is a huge believer in the notion that taking care of your skin should be a priority over layering on makeup. She’s previously dished that her go-to place to receive beauty advice is the Kate Somerville clinic, but while filming in Toronto she was unable to visit one. Luckily, during that time she discovered the next-best-thing which is the Kate Somerville Quench Hydrating Face serum! She’s revealed that this ultra-hydrating serum helps her to maintain a luminous and bright complexion, even without foundation or concealer.\n\nBuy it here: http://amzn.to/2sJ94Rx\n\n9\n\n3. Diorshow Iconic Mascara\n\nMarkle is a huge fan of the signature smokey eye, but no smoldering eye look is complete without long, voluminous lashes. Markle shared that her all-time favorite mascara is the Diorshow Iconic mascara for its curling and lengthening effects. The plastic wand is perfect for achieving fluttery lashes and is designed with extreme precision to reach even the corner lashes. Markle has dished that on some days she’ll skip face makeup altogether and simply opt for a swipe of mascara, so this product is definitely a must-try!\n\nBuy it here: http://amzn.to/2sz2VHn\n\n10\n\n2. Mac Teddy Eyeliner\n\nMeghan Markle is a huge fan of a smokey eye and there’s no better way to achieve the look than with smudged out eyeliner. She dished that her absolute favorite product for amping up her look for a night out is Mac Teddy after a makeup artist tried it on her. “It’s a really beautiful brown that has some gold in it,” she shared and added, “A makeup artist I work with often, Kayleen McAdams, turned me on to it. It’s what she uses on Sofia Vergara, and who wouldn’t want those gorgeous brown almond eyes?”\n\nBuy it here: http://amzn.to/2sIKBfd\n\n11\n\n1. Tea Tree Oil\n\nOf all Meghan Markle’s beauty secrets, the most unexpected was definitely her tip about tea tree oil. “The one thing I cannot live without when I’m traveling is a small container of tea tree oil. It’s not the most glamorous thing, but if you get a cut, a mosquito bite, a small breakout, no matter what it is, it’s my little cure-all,” she dished. Tea tree oil has natural antibacterial and soothing properties, so Markle is definitely on to something with her little beauty secret!\n\nBuy it here: http://amzn.to/2Cc14MY", "images": ["https://www.fame10.com/wp-content/themes/fametenV2/images/logo-white.png", "https://www.fame10.com/wp-content/themes/fametenV2/images/trending_up.png", "https://www.fame10.com/wp-content/themes/fametenV2/images/qool-logo-white.png", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_170,$w_170/f10/2017/06/shutterstock_378698647-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_170,$w_170/f10/2014/06/shutterstock_139250609-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_140,$w_140/f10/2018/07/19377913-400x400.jpg", "https://www.fame10.com/wp-content/uploads/2018/02/18531471-620x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_170,$w_170/f10/2017/06/shutterstock_591778976-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_170,$w_170/f10/2013/11/Sienna-Miller-2-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_170,$w_170/f10/2017/06/13237410-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_100,$w_100/f10/2018/07/19377913-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_170,$w_170/f10/2017/08/shutterstock_97162463-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_140,$w_140/f10/2018/08/cc_combined-f4c03492ab-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_100,$w_100/f10/2016/04/shutterstock_375966958-400x400.jpg", "https://www.fame10.com/wp-content/themes/fametenV2/images/logo.png", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_74,$w_115/f10/2019/05/GettyImages-72203013-620x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_74,$w_115/f10/2015/04/08192266-620x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_100,$w_100/f10/2018/08/cc_combined-f4c03492ab-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_170,$w_170/f10/2013/07/Hottest-Over-40-Cindy-Crawford-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_100,$w_100/f10/2015/12/shutterstock_252174865-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_74,$w_115/f10/2019/05/GettyImages-1052507464-620x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_170,$w_170/f10/2017/05/13001003-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_80,$w_125/f10/2018/05/19104473-1.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_170,$w_170/f10/2014/04/shutterstock_130295858-5-400x400.jpg", "https://www.fame10.com/wp-content/themes/fametenV2/images/concourse-logo-white.png", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_170,$w_170/f10/2017/06/04704849-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_170,$w_170/f10/2017/07/8136580-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_170,$w_170/f10/2014/04/shutterstock_83491039-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_170,$w_170/f10/2014/10/shutterstock_96490103-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_170,$w_170/f10/2014/05/shutterstock_123975247-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_170,$w_170/f10/2017/08/11314243-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_170,$w_170/f10/2014/07/shutterstock_173152055-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_100,$w_100/f10/2016/07/shutterstock_416438215-400x400.jpg"], "top_img": "https://www.fame10.com/wp-content/uploads/2018/02/18531471-620x400.jpg", "keywords": [], "authors": ["Olivia Di Pede"], "canonical_link": "https://www.fame10.com/style/meghan-markles-12-favorite-beauty-products-are-surprisingly-relatable/", "title": "Meghan Markle’s Favorite Beauty Products Are Surprisingly Relatable", "meta_data": {"viewport": "width=1130, maximum-scale=1.0", "description": "Meghan Markle has always had a reputation for being perfectly poised and radiant, even before her days as Prince Harry’s fiancee! During each public appearance, Markle consistently steps out in an outfit that is trendy and polished and her skin seems to be eternally luminous. Luckily, the glow we’ve come to recognize as her signature […]", "fb": {"pages": 412887198817411}, "og": {"url": "https://www.fame10.com/style/meghan-markles-12-favorite-beauty-products-are-surprisingly-relatable/", "title": "Meghan Markle’s Favorite Beauty Products Are Surprisingly Relatable", "description": "Meghan Markle has always had a reputation for being perfectly poised and radiant, even before her days as Prince Harry’s fiancee! During each public appearance, Markle consistently steps out in an outfit that is trendy and polished and her skin seems to be eternally luminous. Luckily, the glow we’ve come to recognize as her signature […]", "type": "article", "image": "https://www.fame10.com/wp-content/uploads/2018/02/18531471-620x400.jpg"}, "ob": {"image": "https://www.fame10.com/wp-content/uploads/2018/02/18531471-620x400.jpg"}}, "movies": [], "publish_date": null, "source": "https://www.fame10.com", "summary": ""}