{"url": "https://www.denofgeek.com/us/tv/law-order-true-crime/254348/law-order-true-crime-the-menendez-murders-trailer-drops", "text": "“These boys were just little children being molded,” says defense attorney Leslie Abramson, played by The Sopranos and Nurse Jackie’s Edie Falco stars in the first trailer for Law & Order True Crime: The Menendez Murders.\n\n“When you terrorize people, they react precisely as you would expect them to. What these boys did is not the issue. It's why they did it,” the defense attorney concludes, asking whether the Menendez brothers were killers or victims. The trailer promises \"the true story will finally be told.\"\n\nLaw & Order: True Crime will document famous real-life criminal cases, like FX is doing on American Crime Story. While FX chronicled the O.J. Simpson trial in its premiere season, the eight-episode Law & Order series’ first season will focus on the Menendez brothers murder case.\n\nAccording to the official synopsis on YouTube:\n\nAdvertisement\n\n“This new true-crime installment of the powerhouse Law & Order franchise delivers a gripping in-depth dramatization of the notorious murder case that changed America forever. When the Menendez brothers were tried on national TV for brutally killing their parents in Beverly Hills, their story became a national obsession. Now, the first edition of this anthology series delves into the players, the crime and the media circus, detailing the day-to-day battles of the trial and unveiling the shocking truth of what really went down when the cameras stopped rolling.”\n\nHere is the trailer:\n\n\n\n\n\nVideo of LAW & ORDER TRUE CRIME: THE MENENDEZ MURDERS | Official Trailer | NBC Fall Shows 2017\n\nLyle and Erik Menendez were the sons of entertainment executive Jose Menendez and former schoolteacher Mary Louis \"Kitty\" Menendez. On August 20, 1989, 21-year-old Lyle and 18-year-old Erik shot and killed their parents in their Beverly Hills home at 722 North Elm Drive and then went dinner and the movies with friends as an alibi. When they got home, they called 9-1-1. The brothers were considered suspects but the police had no evidence to connect them to the killings. Erik confessed to his psychologist.\n\nThe brothers were tried separately. The first two trials resulted in hung juries. They were convicted of murder at the third trial and were sentenced to life in prison without the possibility of parole in 1996. The trial aired on CourtTV in 1993, two years before the O.J. Simpson trial.\n\nLaw & Order: True Crime season 1 cast Gus Halper (Power, Public Morals) as Erik Menendez, who along with his brother Lyle Menendez, went to jail for life, without the possibility of parole for murdering their parents in a courtroom sensation that shocked the nation.\n\nDick Wolf and NBC's upcoming scripted anthology drama Law & Order: True Crime season 1 will be written by Rene Balcer (Law & Order), who will executive produce the series with Wolf, Peter Jankowski and Arthur W. Forney.\n\nFalco, who also appeared on shows Horace and Pete, 30 Rock, Oz and Homicide: Life on the Street, was cast in February.\n\n“I’ve known Edie for more than two decades,” Wolf said in a statement at the time. “Our working relationship started when she was among an elite group of actors who made multiple appearances as defense attorneys on Law & Order in the early ’90s. Edie was at the top of that list. She did a fabulous job on Law & Order and, as Leslie Abramson, will knock the role out of the park.”\n\nThe newest Law & Order spinoff joins a growing list of true crime reenactment series of infamous murders, like American Crime Story Season 1 which focused on The People vs. O.J. Simpson. Lifetime is also making a movie about the Menendez brothers, which will star Courtney Love as their mother Kitty.\n\n\"We've been talking with Dick about how to create an event series coming out of the Law & Order ripped-from-the-headlines brand. This case captured the public's attention like nothing before it as it examined taboo issues such as patricide and matricide in gruesome detail, all against a backdrop of privilege and wealth,\" Jennifer Salke, President, NBC Entertainment, said in a statement.\n\n\"We will recreate the cultural and societal surroundings of both the murders and trials when people were not only obsessed with the case but examining how and why these brothers committed these heinous crimes.\"\n\n\"Bob, Jen and I have been focused the natural evolution of the Law & Order brand for the last several years and are excited to extend the franchise with a scripted limited anthology series that focuses on a high-profile trial,\" Dick Wolf said in a statement. \"There is no shortage of compelling real-life criminal cases, and the Menendez trial was more scintillating than most crime fiction.\"\n\nLaw & Order True Crime: The Menendez Murders will air Thursdays this fall on NBC.", "images": ["https://www.facebook.com/tr?id=759786230837826&ev=PageView&noscript=1", "https://cdn1us.denofgeek.com/sites/denofgeekus/files/styles/main_wide/public/2017/05/edie_falco.jpg?itok=xsib-Sho", "https://cdn1us.denofgeek.com/sites/denofgeekus/files/styles/16x9_460/public/2019/01/arrow-season-8-news.jpeg?itok=XdTd0ULd", "https://cdn2us.denofgeek.com/sites/denofgeekus/files/styles/16x9_460/public/2019/05/the-alieniest-season-2-angel-of-darkness-release-date-cast-news.jpg?itok=2aLrVLH6", "https://sb.scorecardresearch.com/p?c1=2&c2=6036152&c3=&c4=https%3A//www.denofgeek.us/us/tv/law-order-true-crime/254348/law-order-true-crime-the-menendez-murders-trailer-drops&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn1us.denofgeek.com/sites/denofgeekus/files/2017/05/edie_falco.jpg", "https://cdn2us.denofgeek.com/sites/denofgeekus/themes/denofgeek_us/logo.png", "https://cdn1us.denofgeek.com/sites/denofgeekus/files/styles/16x9_460/public/2018/08/the-affair-season-5.jpg?itok=P5Se4Pkh", "https://cdn2us.denofgeek.com/sites/denofgeekus/files/styles/16x9_460/public/stranger_things_3_eleven_poster_cropped.jpg?itok=6prT9Rnj", "https://cdn1us.denofgeek.com/sites/denofgeekus/files/styles/16x9_460/public/2019/03/vikings-season-5-episode-20-bjorn-history-channel.jpg?itok=IgffbvyA", "https://cdn2us.denofgeek.com/sites/denofgeekus/files/2016/04/menendez-brothers.jpg", "https://pixel.quantserve.com/pixel/p-zxDb3fg08cw8W.gif?labels=_fp.event.Default", "https://cdn2us.denofgeek.com/sites/denofgeekus/files/styles/16x9_460/public/main-batman.jpg?itok=ZUFTkUjt"], "top_img": "https://cdn1us.denofgeek.com/sites/denofgeekus/files/2017/05/edie_falco.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.denofgeek.com/us/tv/law-order-true-crime/254348/law-order-true-crime-the-menendez-murders-trailer-drops", "title": "Law & Order True Crime: The Menendez Murders Trailer Drops", "meta_data": {"og": {"site_name": "Den of Geek", "url": "https://www.denofgeek.com/us/go/254348", "title": "Law & Order True Crime: The Menendez Murders Trailer Drops", "image": "https://cdn1us.denofgeek.com/sites/denofgeekus/files/2017/05/edie_falco.jpg", "type": "article", "description": "Killers or victims? NBC's Law & Order: True Crime season 1 casts reasonable doubt on Menendez murders"}, "twitter": {"card": "photo", "url": "https://www.denofgeek.com/us/tv/law-order-true-crime/254348/law-order-true-crime-the-menendez-murders-trailer-drops", "image": "https://cdn1us.denofgeek.com/sites/denofgeekus/files/2017/05/edie_falco.jpg", "site": {"identifier": "DenofGeekUS", "id": 23847132}, "creator": "@DenofGeekUs", "description": "Killers or victims? NBC's Law & Order: True Crime season 1 casts reasonable doubt on Menendez murders", "title": "Law & Order True Crime: The Menendez Murders Trailer Drops"}, "copyright": "Dennis Publishing Limited, licensed by Felden", "generator": "Drupal 7 (http://drupal.org)", "viewport": "user-scalable=yes, width=device-width, maximum-scale=1.6, initial-scale=1.0", "apple-mobile-web-app-capable": "yes", "HandheldFriendly": "true", "format-detection": "telephone=no", "description": "Killers or victims? NBC's Law & Order: True Crime season 1 casts reasonable doubt on Menendez murders"}, "movies": ["//www.youtube.com/embed/bWa1SN0MNwY?wmode=opaque", "https://dailymotion.com/embed/playlist/x64kq2?autoplay=1&mute=1"], "publish_date": null, "source": "https://www.denofgeek.com", "summary": ""}