{"url": "http://toofab.com/2018/05/09/rhony-dorinda-emotional-breakdown-bethenny-calls-her-drunk/", "text": "Dorinda Medley threw back one too many cocktails before heading to Puerto Rico to help Bethenny Frankel with her hurricane relief efforts, and it ended in utter disaster.\n\nThe \"Real Housewives of New York\" stars stopped in Miami before taking one of Bethenny's jets and all kinds of aid to Puerto Rico to help the victims of Hurricane Maria. The two had some cocktails in Bethenny's hotel room and a few before dinner before they met up with the rest of the relief crew. By 7 p.m., Dorinda was wasted.\n\nBethenny was mortified watching Dorinda slur her words, interrupt her friends and make comments like, \"How weird that there's an earthquake in Haiti, right?\" and \"Do you think there's a constructive action to make it, like, ability to sustain itself?\"\n\nBethenny knew Dorinda was drunk, but when she felt Dorinda was questioning the point of going to Puerto Rico in the first place, Bethenny said, \"Maybe you shouldn't come tomorrow if you feel so hopeless about it.\"\n\nDorinda lost it. She stormed off and told Bethenny, \"You always ruin everything.\"\n\nBethenny ended up apologizing to her friends and assuring them that Dorinda would still be coming to Puerto Rico. She told Bravo cams, \"The first feeling that I have is compassion for her, honestly. She won't even know what she's done. I know she'll wake up tomorrow and she'll be there on time and dressed and she'll have a good experience. And I'm forgiving.\"\n\n\"It's sad because Dorinda seems to abuse alcohol,\" she continued. \"I would say that acting this way at 7 o'clock at night to people who only have good intentions would indicate that there might be a problem.\"\n\nThe next day on the plane, Bethenny confronted Dorinda, and it was basically an intervention.\n\nBETHENNY: \"I don't want you to get your fur up because I'm gonna be very, very kind. You go to a 16 out of 10, and I need to really say it to you because the way that you sometimes treat me is like worse than Ramona. I just cut you slack because you're a drunk.\" DORINDA: \"Well, I'm not, I just can't not eat and then drink. I should've gone to bed last night.\" BETHENNY: \"But it was 7 o'clock. You shouldn't be going to bed at 7 o'clock.\" DORINDA: \"I know, but I shouldn't have drank at 4. BETHENNY: \"Then you shouldn't be drinking, because when you drink, you get mean. There's something that goes on. You may be allergic. You can't act like that.\"\n\nDorinda said she had \"a lot going on\" in her life, but Bethenny counteracted with, \"So does everybody.\" She also told Dorinda she was \"scared of her.\"\n\n\"I don't think I'm an alcoholic,\" Dorinda replied. \"I think I use alcohol as an excuse to sometimes exhibit bad behavior.\"\n\nAfter the two chatted for a bit, Dorinda's real issue came to the surface: She misses her late husband, Richard, and Bethenny's new boyfriend, Dennis, reminds her of him. In fact, she went as far as to say the resemblence triggered that blowout with Sonja Morgan earlier this season.\n\n\"I realized sitting with [Dennis] that he's so much like [Richard],\" Dorinda said as she began to cry. \"I remember this, and at one point, it was real. And I thought it was forever. I have a life now that's not the life that I expected. That's why I think what triggered so much when Sonja was saying the thing about her divorce and stuff.\"\n\n\"Dorinda's got Richard on her mind, and I think she's chosen a man now that she can be with part time, not someone that she would really be with full time, so she's left thinking about her old life,\" Bethenny said of Dorinda's current boyfriend, John Mahdessian.\n\nDorinda began to sob as she admitted to feeling like she's sliding backward. She told Bethenny she feels like all her \"major jobs\" -- being a wife and being a mom -- \"are kind of over.\"\n\n\"As bad as it was that Richard passed and all that bologna, I grew so much,\" Dorinda said. \"Like, the person that stood by his coffin is not the person that I am today, and I would have never become that person if he had lived. Not saying that's a positive thing, but maybe the person that met John 6 or 7 months after Richard died is not that person today. Maybe that person needs a different sort of partner.\"\n\nBethenny agreed: \"I don't think you're fulfilled in that relationship, I'll tell you that.\"\n\n\"The Real Housewives of New York\" airs Wednesdays at 9 p.m. on Bravo.\n\nBravo", "images": ["http://secure-us.imrworldwide.com/cgi-bin/m?ci=us-404979h&cg=0&cc=1&ts=noscript", "https://assets.toofab.com/toofab.com/main/default/img/skeleton.svg", "https://toofab.akamaized.net/2018/12/19/newsletter-logo-v2-1.png", "https://ssl-cdn-media.tmz.com/2013/04/26/partner-rss-fox-b-w.png", "https://ssl-cdn-media.tmz.com/2013/04/26/partner-rss-thestir-logo-cut-v2-1.png", "https://toofab.akamaized.net/2019/04/06/cdl-260x30-for-tmz3-1.png", "http://warnerbros.112.2o7.net/b/ss/wbrostoofab/1/JS-1.5.1--NS/s1563031898?AQB=1&ce=UTF-8&ns=warnerbros&pageName=articles%3Aarticle%3A%3Adorinda-has-emotional-breakdown-on-rhony-when-bethenny-calls-her-a-drunk&c1=Toofab.us&v1=Toofab.us&c2=article&v2=article&c3=articles&v3=articles&events=event6&AQE=1", "https://ll-media.tmz.com/2013/04/26/partner-rsss-justjared-logo-cut-v2.gif", "https://ssl-cdn-assets.tmz.com/www.tmz.com/main/default/cache/images/feedlogo2.v2014_05_09_134122.gif", "https://toofab.akamaized.net/2018/05/09/0509-bethenny-dorinda-bravo-1200x630.jpg", "https://toofab.akamaized.net/2017/05/24/tmz-tour-300x250-r01-1.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=3000013&cv=2.0&cj=1", "https://toofab.akamaized.net/2019/04/06/elite-daily-logo-1.png", "https://assets.toofab.com/toofab.com/main/default/img/toofab-logo-white.svg"], "top_img": "https://toofab.akamaized.net/2018/05/09/0509-bethenny-dorinda-bravo-1200x630.jpg", "keywords": [], "authors": ["Toofab Staff"], "canonical_link": "https://toofab.com/2018/05/09/rhony-dorinda-emotional-breakdown-bethenny-calls-her-drunk/", "title": "'RHONY' Bad Apple of the Week: Dorinda Has Emotional Breakdown When Bethenny Calls Her 'A Drunk'", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "twitter": {"toofab": 116547240, "card": "summary_large_image", "site": "@toofab", "title": "'RHONY' Bad Apple of the Week: Dorinda Has Emotional Breakdown When Bethenny Calls Her 'A Drunk'", "description": "The tears start flowing when Bethenny Frankel confronts her \"RHONY\" co-star Dorinda Medley about her drinking.", "image": "https://toofab.akamaized.net/2018/05/09/0509-bethenny-dorinda-bravo-1200x630.jpg"}, "verify-v1": "Wtpd0N6FufoE2XqopQJoTjWV6Co/Mny9BTaswPJbPPA=", "msvalidate.01": "AFEB17971BCF30779AEA662782EF26F4", "y_key": "14cb04e4656b0c58", "description": "The tears start flowing when Bethenny Frankel confronts her \"RHONY\" co-star Dorinda Medley about her drinking.", "robots": "index,follow", "referrer": "unsafe-url", "og": {"url": "https://toofab.com/2018/05/09/rhony-dorinda-emotional-breakdown-bethenny-calls-her-drunk/", "site_name": "toofab", "type": "article", "title": "'RHONY' Bad Apple of the Week: Dorinda Has Emotional Breakdown When Bethenny Calls Her 'A Drunk'", "description": "The tears start flowing when Bethenny Frankel confronts her \"RHONY\" co-star Dorinda Medley about her drinking.", "image": "https://toofab.akamaized.net/2018/05/09/0509-bethenny-dorinda-bravo-480x360.jpg"}, "fb": {"app_id": 116046798441464, "pages": 324392354652}, "article": {"publisher": "https://www.facebook.com/TooFab"}}, "movies": [], "publish_date": 1525838400.0, "source": "http://toofab.com", "summary": ""}