{"url": "http://www.cmt.com/news/1800047/carrie-underwood-closes-cmt-artists-of-the-year-with-50-years-of-songs/", "text": "\"You Are Here Because You Are Dang Good,\" She Tells the Crowd\n\nKeith Urban’s introduction of Carrie Underwood on Wednesday night (Oct. 17) wasn’t just about her long list of achievements in country music. It was just about her. He listed her virtues as a wife, a mother, a songwriter, a producer, an entertainer, a humanitarian, a culture shifter, and one of the greatest vocalists we’ve ever known.\n\n(I think that was when she started to get a little choked up.)\n\nBut Urban also took the time to explain why he was the one lucky enough to be presenting her with the CMT Artist of the Year honor. “Our friendship really began way back in 2008, when we joined forces and hit the road together. And each night we would sing ’Stop Draggin’ My Heart Around.’ And it was then that I witnessed not only the power of her voice,” Urban said, “but the emotion she brings to every performance.\n\n“She simply makes you feel when she sings.”\n\nAnd apparently, Underwood simply makes you feel when she accepts important awards, too.\n\nHer heartfelt acceptance speech wasn’t so much about her as it was about the other honorees, the other women behind the scenes in the music industry, and other girls who might have the same dreams she had when she was a young country music fan and hopeful.\n\n“We need more things like this. I definitely want to say to all the incredible, amazing, talented women who have been on this stage tonight: You are not here because you are women. You are here because you are dang good. And it is an honor to get to share tonight with you,” Underwood said.\n\n“Thank you to women who are in this industry: the managers, the executives, the hair and makeup (people), the wardrobe (people), the songwriters, the musicians, thank you. Whether or not you know it, you are the backbone of this music. And it is up to all of us to keep opening those doors.\n\n“I want to see little girls at home seeing us on stage being like, ’I want to do that.’ And I want them to know that that’s possible,” she said.\n\n\n\nAlison Bonaguro Alison makes her living loving country music. She's based in Chicago, but she's always leaving her heart in Nashville.\n\nThen came the music. An eight-song medley spanning 50 years of some of the most iconic country hits from the women who came before Underwood. Starting with a Tammy Wynette song from 1968, “Stand by Your Man.” From there, her 2019 tour mates Maddie & Tae and Runaway June joined her on the next seven songs from consecutive years: Dolly Parton ’s “9 to 5,” The Judd ’s “Rockin’ with the Rhythm of the Rain,” Martina McBride ’s “Independence Day,” Faith Hill ’s “Wild One,” Reba ’s “Why Haven’t I Heard from You,” and Shania Twain ’s “Man! I Feel Like a Woman!” The group closed the performance and the show with Underwood’s latest hit single, “Cry Pretty.”", "images": ["http://cmt.mtvnimages.com/uri/mgid:ao:image:cmt.com:661417?quality=0.8&format=jpg&width=480&height=270", "http://cmt.mtvnimages.com/uri/mgid:ao:image:cmt.com:661417?width=1200&height=675&.jpg"], "top_img": "http://cmt.mtvnimages.com/uri/mgid:ao:image:cmt.com:661417?width=1200&height=675&.jpg", "keywords": [], "authors": ["Alison Bonaguro"], "canonical_link": "http://www.cmt.com/news/1800047/carrie-underwood-closes-cmt-artists-of-the-year-with-50-years-of-songs/", "title": "Carrie Underwood Closes CMT Artists of the Year with 50 Years of Songs", "meta_data": {"HandheldFriendly": "True", "MobileOptimized": 320, "viewport": "width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0", "reporting": {"beacon_url": "http://mb.mtvnservices.com/data/collect/v1/mb.gif", "beacon_topic": "cmt.com"}, "ao": {"mgid": "mgid:wordpress:post:articles.cmt.com:1800047"}, "og": {"site_name": "CMT News", "title": "Carrie Underwood Closes CMT Artists of the Year with 50 Years of Songs", "url": "http://www.cmt.com/news/1800047/carrie-underwood-closes-cmt-artists-of-the-year-with-50-years-of-songs/", "image": {"identifier": "http://cmt.mtvnimages.com/uri/mgid:ao:image:cmt.com:661417?width=1200&height=675&.jpg", "width": 1440, "height": 810}, "type": "article", "description": "\"You Are Here Because You Are Dang Good,\" She Tells the Crowd"}, "twitter": {"description": "\"You Are Here Because You Are Dang Good,\" She Tells the Crowd", "title": "Carrie Underwood Closes CMT Artists of the Year with 50 Years of Songs", "image": "http://cmt.mtvnimages.com/uri/mgid:ao:image:cmt.com:661417?quality=0.8&format=jpg&width=500&height=375", "url": "http://www.cmt.com/news/1800047/carrie-underwood-closes-cmt-artists-of-the-year-with-50-years-of-songs/", "card": "summary_large_image"}, "description": "\"You Are Here Because You Are Dang Good,\" She Tells the Crowd", "thumbnail": "http://cmt.mtvnimages.com/uri/mgid:file:http:shared:cmt.com/news/uploads/sites/3/2018/10/1052417696-1539832675-300x199.jpg?quality=0.8&format=jpg"}, "movies": [], "publish_date": null, "source": "http://www.cmt.com", "summary": ""}