{"url": "http://www.bluedotdaily.com/trump-police-officers-and-firefighters-make-too-much-money-hits-them-with-tax-penalty/", "text": "We all know that the recently passed tax bill is likely the single worst piece of legislation in the history of American politics. You know it, I know it, Paul Ryan knows it, Donald Trump knows it. Well, Trump probably doesn’t, because, well, he’s delusional.\n\nBut it’s really, really bad. And historically unpopular, like the President whose name will forever be attached to it.\n\nMaybe you aren’t totally convinced about how bad it is yet. So there’s this: Under this plan, a wealthy CEO can deduct a private jet, but a police officer cannot deduct his/her uniform.\n\n“Yeah, but they’re the party of ‘Blue Lives Matter’ and thanking everyone who ever wore a uniform for anything for their service!” you might say. And I have some oceanfront property in Idaho to sell you if you believe that.\n\nSalon reports, Donald Trump often declares his support, even love, for police, firefighters and other first responders. That isn’t stopping him, however, from nicking their wallets in the new tax law that he is expected to sign in early January.\n\nBuried in the hastily drafted tax bill’s more than 500 pages are provisions eliminating “miscellaneous” deductions taken by almost 28 million taxpayers in 2015. Those are costs you bore to support your job or an investment you own or to pay a professional to prepare your income tax return.\n\nThis year cops and other first responders can write off the costs of buying uniforms and dry cleaning them. But in 2018, cops who buy their uniforms or are required to buy their own guns and ammunition will no longer be able to deduct those costs as reasonable and necessary expenses to support their earning a paycheck, thanks to Trump and Congressional Republicans.\n\nBut that’s not all. Cops and anyone else who belongs to a union will no longer be allowed to deduct their union dues. People who must bear travel costs without reimbursement from their employers will just have to suck it up starting in January.\n\nAdd police officers, the military, teachers, nurses and first responders to the long, long list of hard working Americans that Donald Trump and the Republican party want to make suffer. And all to give the wealthiest among us more wealth.\n\nShameful.", "images": ["http://0.gravatar.com/avatar/915f7110d1c00a8b1eae2946b3e601db?s=45&d=mm&r=g", "http://www.bluedotdaily.com/wp-content/uploads/2019/01/DCBlue2-2.png", "http://www.bluedotdaily.com/wp-content/uploads/2019/01/DCBlue2-1.png", "http://www.bluedotdaily.com/wp-content/uploads/2017/12/crww.png"], "top_img": "http://www.bluedotdaily.com/wp-content/uploads/2017/12/crww.png", "keywords": [], "authors": ["Peyton Morgan"], "canonical_link": "http://www.bluedotdaily.com/trump-police-officers-and-firefighters-make-too-much-money-hits-them-with-tax-penalty/", "title": "Police Officers, Firefighters and Others Get Hit with Tax Penalty", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0, user-scalable=no", "og": {"image": {"identifier": "http://www.bluedotdaily.com/wp-content/uploads/2017/12/crww.png", "width": 810, "height": 450}, "type": "article", "description": "We all know that the recently passed tax bill is likely the single worst piece of legislation in the history of American politics. You know it, I know it, Paul Ryan knows it, Donald Trump knows it. Well, Trump probably doesn’t, because, well, he’s delusional. But it’s really, really bad. And historically unpopular, like the […]", "title": "Police Officers, Firefighters and Others Get Hit with Tax Penalty", "url": "http://www.bluedotdaily.com/trump-police-officers-and-firefighters-make-too-much-money-hits-them-with-tax-penalty/", "site_name": "BlueDot Daily", "updated_time": "2018-01-06T03:44:01+00:00", "locale": "en_US"}, "twitter": {"image": "http://www.bluedotdaily.com/wp-content/uploads/2017/12/crww.png", "card": "summary_large_image", "url": "http://www.bluedotdaily.com/trump-police-officers-and-firefighters-make-too-much-money-hits-them-with-tax-penalty/", "title": "Police Officers, Firefighters and Others Get Hit with Tax Penalty", "description": "We all know that the recently passed tax bill is likely the single worst piece of legislation in the history of American politics. You know it, I know it, Paul Ryan knows it, Donald Trump", "creator": "@Bluedot Daily", "site": "@bluedotdaily"}, "article": {"published_time": "2017-12-26T23:00:38+00:00", "modified_time": "2018-01-06T03:44:01+00:00"}, "description": "We all know that the recently passed tax bill is likely the single worst piece of legislation in the history of American politics. You know it, I know it, Paul", "generator": "Powered by WPBakery Page Builder - drag and drop page builder for WordPress."}, "movies": [], "publish_date": 1514329238.0, "source": "http://www.bluedotdaily.com", "summary": ""}