{"url": "https://www.independent.co.uk/extras/indybest/fashion-beauty/best-serums-for-face-dry-skin-sensitive-oily-dehydrated-2016-a7171461.html", "text": "The beauty world’s trends come round thicker and faster nowadays.\n\nOne minute you’re slapping sea kelp round your chops and the next you’re trudging through mask clay colours like you’re choosing wallpaper. One staple that is back in the spotlight however is the beloved, super powered serum.\n\nNestling in-between your cleanser and moisturiser, this step is the head honcho of the trio. Reason being, a serum can, and should, have the most concentrated of ingredients to target your specific concerns. Meaning not only does a little go a long way, but you can expect results sooner rather than later.\n\nSold? Of course you are. However, the breadth of what’s on offer is a total minefield. Equally it’s not a one size fits all.\n\n\n\nFor instance if you’re after a moisture boost, vitamin A is a big fat no – as it is technically retinol, so can dry out your skin – but we know the feeling of getting giddy in the skincare aisles all too well and ending up with a shelfie stocked like it’s the end of the world.\n\nSo with that in mind, here’s a toast to some classics and new kids on the block living up to their wrinkle busting and plumping promises so you can choose wisely.\n\nYou can trust our independent reviews. We may earn commission from some of the retailers, but we never allow this to influence selections, which are formed from real-world testing and expert advice. This revenue helps us to fund journalism across The Independent.\n\nFor first timer's: Estee Lauder advanced night repair: From £53, Look Fantastic\n\nA well done classic never goes out of style. Back in 1982, night repair changed the skincare game with the brown bottle many of us have come to know and love. The formula is also patented until 2033 so we won’t be finding anything similar anytime soon.\n\nThe peachy, comforting serum is an oil-free, moisture magnet hero. Suggested use is a few drops but we’ve been whacking plenty on at present while fighting against recent gale force winds. It celebrates itself as a fighter against free radicals, preventing future damage and repairing previous mishaps.\n\nIt’s a great accompaniment to a nighttime routine whatever your skin type. A worthy all rounder and effective on mature skin types in particular. This would be a great starting point for anyone wanting to dip their toe into an effective serum that does a bit of everything.\n\nBuy now\n\nFor anti-pollution: Drunk Elephant C-Firma day serum: £67, Space NK\n\nDrunk Elephant has been stocked consistently on our shelves since the launch in October, so we’ve had ample time to get to grips with this perky powerhouse.\n\nIt’s quite the multitasker so let’s break it down. The 15 per cent L-ascorbic acid is the frontrunner, which ironically has nothing to do with acid, it’s actually the gold standard of vitamin C. When used in skincare, this notoriously aids against environmental stressors. Supporting fruit enzymes help dissolve surface skin cells to give you a brighter complexion.\n\nThis works best as fresh as possible, so a big tip is to keep this in the fridge. It will change colour (darker and more orange) over time which is a signifier that its potency is dwindling. We saw that housing it next to the yoghurts subsequently gave it some further airtime. It’s also quite tacky to apply so you’ve got to slap it on quick. Or if you’re feeling particularly fancy, mix it with an extra hydrating serum. Drunk Elephant’s B-Hydra is C-Firma’s partner in crime for the perfect, trademark \"skin smoothie\".\n\nResults are evened out, plumped up skin ready to take on the city. So even if the Tube feels like you’re riding in a big bin, having this in your arsenal will help ensure the rubbish doesn’t leave the carriage. Interestingly, C-Firma has something called a reservoir effect, meaning it stays active on the skin for up to 72 hours after it is absorbed. Excuse us, while we go and take a dip.\n\nBuy now\n\nFor dewy skin: Hourglass No. 28 serum: From £20, Cult Beauty\n\nHave you ever wondered how when models jump out of swimming pools on adverts, with a full face on, they don’t look like a racoon like us mere mortals would? We think we have uncovered the secret.\n\nWhile this does market itself as a primer, it has a cocktail of 28 rather nice ingredients from lavender to hazelnut oil and a sprinkling of vitamins to help soften out fine lines and give you smoother looking skin. It’s a super luxe, pink, rich formula that feels like you’ve recreated the infamous Flashdance scene at your dresser. Like you’ve just done a workout, not sweaty but perfectly perspired.\n\nIndeed it does help makeup sit very nicely, however wearing it on its own as a nighttime treatment, or even on the ends of your hair if they’re looking particularly knackered are also good tips. Admittedly it might not be for you if you’re prone to excess oil, but this is the ideal quick fix for a bougiee boost.\n\nBuy now\n\nFor advanced anti-ageing: Sunday Riley A+ high dose retinoid serum: £70, Cult Beauty\n\nRetinol has always been a contentious subject. Many stating you can use it only under certain circumstances (No AHAs) while others decline entirely from the off. However, it’s one of the very few ingredients actually proven to fight ageing, targeting fine lines specifically and increasing cell turnover.\n\nWhile Sunday Riley’s new attempt does have a whopping 6.5 per cent retinoid complex, it’s balanced out with Hawaiian white honey and cactus extract to help you adjust during your first few weeks. It’s a more creamy, emollient retinol product than we’ve come to expect, making it smooth and easy to apply. There’s also CoQ10 in here to soothe and support – preventing the dreaded peeling!\n\nOverall this is a terrific over the counter retinol product, good for sensitive and acne prone skin especially. If you’re after something that gives you the anti-ageing benefits of a traditional retinol, without going through the Freddy Kruger, flaking redness phase, definitely pick this one up. Do proceed with caution however as the formula is strong and you must always wear SPF. Start slowly and get a feel for it; listen to your skin. Slow and steady wins the race.\n\nBuy now\n\nFor the peepers: Dennis Gross rerulic + retinol triple correction eye serum: £65, Space NK\n\nAs we all know, the eye area is the first to take a beating. This is not an eye cream, let’s get that out of the way. While this does need to be followed up with a more moisturising product, if you are particularly dry, the results speak for themselves.\n\nThis is definitely for you if you’re wanting to target any lines or crepiness in particular. What’s even more wonderful is that this can be used on the lids to really brighten the entire area. Liquorice root extract not only helps brighten but also has anti-inflammatory properties to help soothe the effects of the retinol.\n\nAfter a couple of weeks we saw a genuine improvement. Lines were less deep and skin around the eyes definitely perked up. A wake up call we’re happy to receive.\n\nBuy now\n\nFor hydration: Dr. Barbara Sturm hyaluronic serum: £230, Cult Beauty\n\nDr. Sturm not only had a hand in pioneering the famous vampire facial, she’s also a big believer in no nonsense highly effective skincare. Our favourite being hyaluronic acid.\n\nNow, we know that hyaluronic acid is plastered all over every product these days, but the quality and how it’s blended into the ingredients can have an impact on is efficacy.\n\nWhat makes this one particularly good is that it has long and short chain molecules. The former providing instant hydration with immediate effects while the latter penetrates deeper into the skin. Equally, purslane is Sturm’s key selling point; an ancient herb that appears in no other skincare line which in recent studies has shown to up-regulate youth enzymes to keep cells alive longer. Ironic it’s been knocking around for hundreds of years.\n\nUltimately, all that aside, it’s the best hyaluronic on the market for a moisture surge. It’s a pricey prescription but medicine is never fun is it?\n\nBuy now\n\nFor minimising pores: Paula’s Choice 10% niacinamide booster: £40, Paula’s Choice\n\nWhat we love about Paula Begoun is the fact that her website isn’t just a shop, it’s a library of studies, information and overall help. You get the impression she really does want the best for everyone’s face which is a rarity of transparency. Not only does she talk the talk, she walks the walk.\n\nOne of the goodies in her serums cabinet is the niacinamide booster. Again, this ingredient is everywhere but this booster is like a super shot of the wonder ingredient.\n\nIt’s an extremely light, watery texture which you can apply directly to specific areas or add to your moisturiser for an all over application. The major selling point of niacinamide is its ability to reduce the look of enlarged pores, but we found it’s also helpful for blemish marks and has no nasties to boot. What’s not to love?\n\nBuy now\n\nFor dry skin: Kat Burki rosehip revitalising serum: £150, Space NK\n\nWe’re all too familiar with Kat on our shelves but she never seems to disappoint, so we welcomed this serum with open arms.\n\nThe main active sell in this is the rose hip seed oil which has been around for yonks; notorious for its hydrating properties. Furthermore in this nifty product is the KB5 complex which is a mix of arnica, gotu kola, lavender, calendula and chamomile to work in synergy together to increase the potency of the formula.\n\nIt’s a white, non-sticky gel/cream hybrid which sinks into skin easily. Results are super soft, revitalised skin. Particularly good if you’re prone to feeling a bit weather-beaten as it steers towards the drier skin type.\n\nAgain with all Burki’s products, there are no fillers so you get what you pay for; meaning it’s jam packed with nutrient goodness.\n\nBuy now\n\nFor all round care: W=hb2 power duo face serum: £110, Feel Good Matters\n\nFrom the brain of Yilin Wang, comes a rather interesting take on the perception of skincare. Wang is a big believer that the eco-system of one’s life, mind, body and energy around us, need to be balanced in order for any to operate well. The brand name stands for Well = Health and Beauty Squared.\n\nWhether that gets you excited or not, the results and ingredients on offer here will intrigue you regardless. Housed in a rose gold topped, plastic bottle – inside are two 15ml tubes – one named Phase 1 Beauty (yes please) and Phase 2 Health (yes please x 2). The first is an almost clear gel serum with probiotics and rose stem cell technology which is all about strengthening and repairing up the skin. Phase 2 is a moringa, raspberry stem cell and niacinamide mix focusing on protecting and hydration.\n\nNot only is this very satisfying to use and looks rather snazzy, it gives a supple and plumped feel to the skin. It feels suitably protected and nourished.\n\nSo if you’re someone who has no time to take a deep breath, at least you know this serum is meditating on your behalf.\n\nBuy now\n\nThe verdict: Anti-ageing serums\n\nWe had to give advanced night repair the top spot. It’s stood the test of time and still remains effective. The Hourglass serum is just too good to pass up. Even the travel size will last you a while. Dennis Gross has the best anti-ageing products for your eyes on the market in our opinion.\n\nIndyBest product reviews are unbiased, independent advice you can trust. On some occasions, we earn revenue if you click the links and buy the products, but we never allow this to bias our coverage. The reviews are compiled through a mix of expert opinion and real-world testing.", "images": ["https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/10/05/09/florent-rouve-vire-clesse.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/15/beer-cider-and-perry.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/10/05/17/screen-shot-2016-10-05-at-18.01.35.png", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/11/sports-equipment-and-accessories.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2017/01/24/09/indonesia-etc.jpg", "https://trc.taboola.com/1036135/log/3/unip?en=page_view", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/10/05/13/fiction-books.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/11/garden-furniture.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/12/outdoor-eating.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/14/phones-and-accesories.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/10/06/09/montezuma.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/12/activity-books-and-crafts.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/10/05/10/jack-wolfskin-mtn.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/14/laptops-and-tablets.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2017/11/06/15/wintersports.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/12/gifts.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/12/childrens-books.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2019/04/24/09/crocs-womens-literide-sandal-sandals.jpg", "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/03/21/13/anti-ageing-serums.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/11/household-appliances.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/15/flying.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/10/05/09/pitt-and-cue.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/10/05/13/non-fiction-books.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2019/03/04/16/leon-sized.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/10/05/09/bugaboo-bee-3.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/11/powertools.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/12/toys.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2019/04/24/10/walking-sandals-hero.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/12/camping.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/10/05/10/marley-spoon.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/11/07/17/kitchenaid.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/09/running.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/14/audio.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/12/stationery.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/12/clothing-and-footwear.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/13/skincare.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/10/05/10/mango.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/13/spirits.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/13/champagne-prosecco-and-sparkling-wine.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/14/headphones-and-earphones.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/11/stand-mixers.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2019/03/04/16/the-travel-atlas.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/14/tv-and-entertainment.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2017/04/27/15/kitchen-appliance.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/14/cameras-and-accesories.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/13/mens-accessories.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2017/01/23/16/taylormade-daytona.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/13/hair.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/10/05/13/mens-shoes.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2017/04/27/09/osprey-meridian.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/11/outside-eating.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/12/furniture.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/10/05/13/lingerie.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/14/computer-accessories.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/13/make-up.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/11/baby-tech-and-essentials.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2019/03/04/16/7-made.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2017/01/23/16/sweatybetty.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/10/05/10/volt-metro.jpg"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/03/21/13/anti-ageing-serums.jpg", "keywords": [], "authors": ["Christopher Cunniff"], "canonical_link": "https://www.independent.co.uk/extras/indybest/fashion-beauty/skincare/best-anti-ageing-serums-a6695191.html", "title": "9 best anti-ageing serums for youthful and glowing skin", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#db3739", "og": {"url": "http://www.independent.co.uk/extras/indybest/fashion-beauty/skincare/best-anti-ageing-serums-a6695191.html", "title": "9 best anti-ageing serums for youthful and glowing skin", "description": "Concentration is key – these tiny bottled skin saviours are not to be underestimated", "updated_time": "2019-06-04T09:47:41+01:00", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/03/21/13/anti-ageing-serums.jpg", "site_name": "The Independent", "type": "article", "locale": "en_GB"}, "ia": {"markup_url": "https://www.independent.co.uk/pwamp/fbi/6695191"}, "description": "The beauty world’s trends come round thicker and faster nowadays. One minute you’re slapping sea kelp round your chops and the next you’re trudging through mask clay colours like you’re choosing wallpaper. One staple that is back in the spotlight however is the beloved, super powered serum.", "keywords": "Skincare, Skincare, Fashion & Beauty, IndyBest, Extras", "fb": {"pages": 13312631635, "admins": 729735830, "app_id": 235586169789578}, "article": {"tag": "Skincare", "published_time": "2019-03-21T13:30:00Z", "modified_time": "2019-06-04T09:47:41+01:00", "section": "Skincare", "subsection": "Fashion & Beauty", "author_name": "Christopher Cunniff", "content_type": "story", "word_count": 2025, "image_count": 1, "video_count": 0, "embed_count": 0, "internal_link_count": 3, "external_link_count": 12}, "twitter": {"title": "9 best anti-ageing serums for youthful and glowing skin", "description": "The beauty world’s trends come round thicker and faster nowadays. One minute you’re slapping sea kelp round your chops and the next you’re trudging through mask clay colours like you’re choosing", "card": "summary_large_image", "site": "@independent"}, "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Independent"}, "movies": [], "publish_date": 1553175000.0, "source": "https://www.independent.co.uk", "summary": ""}