{"url": "https://en.wikipedia.org/wiki/The_Way_(Ariana_Grande_song)", "text": "\"The Way\" is a song recorded by American singer Ariana Grande, featuring rapper Mac Miller, from Grande's debut studio album Yours Truly (2013). It was written by the song's producer Harmony Samuels, alongside Amber Streeter, Al Sherrod Lambert, Jordin Sparks, Brenda Russell, and Miller. The song's backing track is based on the piano melody from Russell's 1979 song \"A Little Bit of Love\", and the song has melodic and lyrical similarities to Big Pun's 1998 song \"Still Not a Player\", which also samples \"A Little Bit of Love\".[3][4]\n\n\"The Way\" was released on March 25, 2013, by Republic Records as the lead single from Yours Truly. The song debuted at number 10 and peaked at number 9 on the US Billboard Hot 100, becoming Grande and Miller's first top ten song on the chart. This also made Grande the first top ten arrival for a lead female artist making her first Hot 100 appearance since Yael Naim, who launched with \"New Soul\" back in 2008. As of April 2018, \"The Way\" has sold 2.4 million copies in the United States and has been certified triple platinum.[5]\n\nBackground [ edit ]\n\nOn December 12, 2011, Grande released her debut single \"Put Your Hearts Up,\" a bubblegum pop song with a vastly different style of music and target demographic than \"The Way.\"[6] Whereas the lyrics in \"The Way\" deal with the subject of a flirty, romantic relationship, some sections with sexual implications, \"Put Your Hearts Up\" was a song aimed at young audiences, with lyrics about making the world a better place. During a radio interview on KIIS-FM on March 25, 2013 about her debut single, Grande confessed that she had in fact \"hated\" both the music video for and the song itself, considering it to be \"a terrible first impression.\" She added that she had wanted to \"pretend it never happened before it already happened\" and that she had felt no enthusiasm to promote the song at the time.[7]\n\nIn subsequent interviews, Grande implied that in order to feel \"passionate\" about her music, it needed to relate to her maturing personality. In an interview with Billboard she said, \"When I do Sam & Cat, and when I act as Cat, of course I'm still going to be there for my younger fans. But I'm also growing up – I'm almost 20. I'm not going to do anything crazy, but I want to do music that I'm passionate about. I'm finally at an age where I can do the music that I grew up loving, which was urban pop, 90s music. I grew up listening to the divas, so I'm very happy to finally do urban pop. I hope that it's received well, and it has been so far.\" [8]\n\n\"The Way\" can be seen as the reboot of Grande's singing career, steering her toward an older demographic and a different musical genre than where she originally began. In January 2013, she met with producer Harmony Samuels, at which point he presented her with a demo of the song that featured the vocals of co-writer Jordin Sparks, whom the song was originally intended.[9] The beat he'd created for the single, samples Brenda Russell's \"A Little Bit of Love\" either directly or indirectly, via Big Pun's \"Still Not a Player\". Grande immediately connected with the sound and asked Mac Miller to feature on the song with her, to which he responded, \"Sounds like a hit to me.\" [10] The song was recorded that same month, and caught the attention of Republic Records VP Charlie Walk when he heard it being played from Republic co-founder Monte Lipman's office. \"It was 8:00 one night, and I heard a song coming from Monte's office through my wall. He called me down and I played a video, a DIY of Ariana Grande. We heard the song and I immediately made the decision to set it up [and] put the song out.\" [11]\n\nPromotion and release [ edit ]\n\nGrande created online buzz in the weeks leading up to her single's release through social media. She first tweeted about \"The Way\" on March 5, 2013, stating that the song would be released later that month.[12] On March 13, she announced the release date.[13] She posted a teaser trailer for both the song and the music video on her YouTube page on March 16[14] and then shared a second teaser on March 21.[15]\n\nIn the later half of March, Grande went on a radio tour across the United States, focusing on some of the most popular Top 40 stations in the country. She visited both Y-100 Miami[16] and 93.3 FM[17] on March 18 for interviews. The next day she went on Elvis Duran and the Morning Show[18][19] and attended a release party thrown by Z100, where she spoke to fans about her music.[20] On March 25, she visited KIIS-FM for an interview with JoJo Wright.[21] She visited 99-7 Now on March 29.[22] \"The Way\" debuted on On Air with Ryan Seacrest on March 25, 2013.[23]\n\nCritical response [ edit ]\n\npictured). Critics have compared Grande's vocals to those of Mariah Carey ).\n\nDigital Spy gave the song a five out of five star rating comparing the song's sound and Ariana's vocals to Mariah Carey's, continuing to say Ariana has a \"powerful vocal\" whilst the song has \"bouncy piano riff\" and \"throwback R&B beats\".[24] Sam Lansky of Idolator gave the song a positive review, calling the vocals \"sweet, soulful, and grown-up\".[25] MTV Buzzworthy's Jenna Hally Rubenstein praised the song, advising readers to \"keep one eye on Ariana\" as \"she may very well be the hottest pop newcomer in the game.\" Rubenstein also commented that the song's \"early '00s-influenced R&B vibes\" made it sound like an updated version of Jennifer Lopez's \"I'm Real\" featuring Ja Rule.[26] Nick Catucci of Rolling Stone magazine gave the song a 3 and half stars, saying that Grande is \"more flirty than freaky, but her Mariah-esque vocals verge on ecstatic.\"[27]\n\nAccolades [ edit ]\n\nYear Organization Award Result Ref. 2013 Teen Choice Awards Choice Love Song Nominated [28]\n\nCommercial performance [ edit ]\n\nFollowing its release, \"The Way\" sold over 120,000 digital downloads within the first 48 hours.[29][30] Having sold over 219,000 copies in its opening week, \"The Way\" holds the fourth largest first-week sales figure of 2013, behind Katy Perry's \"Roar\", Justin Timberlake's \"Suit & Tie\" and One Direction's \"Best Song Ever\".[31] \"The Way\" debuted at number 10 on the Billboard Hot 100 chart on the week ending in April 5, 2013, becoming Grande's and Miller's first Hot 100 top-ten hit. This makes Grande the first top ten arrival for a lead female artist making her first Hot 100 appearance since Yael Naim, who launched with \"New Soul\" back in 2008. The song dropped to number 22 during its second week on the chart, and then to number 37. As radio stations gave it more attention, the song gradually rebounded, eventually peaking at number 9 for two weeks.[32] The song reached 500,000 sold units on May 1, 2013[33] and received its official Gold certification from the RIAA on May 6, 2013. \"The Way\" surpassed one million downloads on June 10, 2013 and was officially certified Platinum by the RIAA on June 19, 2013.[34] As of September 2013, the song has thus far sold 2,000,000 copies in the United States.[35] \"The Way\" spent 26 weeks in the Billboard Hot 100 chart, all but two, being within the top 40. The Spanglish version of \"The Way\" reached number 5 on Billboard's Latin Pop Songs chart on the week ending August 24, 2013.[36] As of March 2016, \"The Way\" has sold over 2.3 million copies in the United States and has been certified triple platinum.[5]\n\nRemix [ edit ]\n\nThe official remix features American rapper Fabolous. It was released online on July 11, 2013.[37]\n\nMusic video [ edit ]\n\nThe music video for \"The Way\" was filmed on February 10 and 11, 2013. On March 16, 2013, the first teaser for the song was released on to her YouTube page.[38][39][40] The second teaser was released on Ryan Seacrest's website two days later, and later on Grande's page.[41] The full video was released on March 28, 2013 at 12/3 am PST/EST. Directed by Jones Crow, the video consists of Grande, Miller, and a group of dancers. Grande poses for pictures taken by Miller on various cameras, while dancing around a room filled with balloons and their images are projected on the wall. At the end of the video Miller and Grande kiss, and Grande described it as \"quite a statement\" of growing up.[42] The video was Vevo-certified on October 2, 2013, having reached 100 million views.[43] As of February 2019, the music video has over 360 million views on Vevo.\n\nLive performances [ edit ]\n\nGrande performed \"The Way\" at several Top 40 radio concerts, including KIIS-FM's Wango Tango concert on May 11, 2013 in Los Angeles,[44] 101.3 KDWB's Star Party concert on May 17, 2013 in Minneapolis,[45] Kiss 108's Kiss Concert 2013 event in Boston,[46] 103.3 AMP Radio's Birthday Bash concert on June 30, 2013 also in Boston,[47] and Mix 93.3's Red White & Boom concert on July 5, 2013 in Kansas City.[48][49] She was scheduled to perform the song at B96's Summer Bash concert on June 15, 2013 in Chicago, but had to cancel due to being sick.[50][51]\n\nHer first televised performance of the song was aired on May 29, 2013 on The Ellen DeGeneres Show.[52] Her second televised performance aired on Late Night With Jimmy Fallon on June 14, 2013.[53]\n\nGrande was the opening act for the last three US dates of Justin Bieber's Believe Tour, during which she performed \"The Way\". The performances took place in Jacksonville, Tampa, and Atlanta on August 7, August 8, and August 10 respectively.[54]\n\nAlong with her second single, \"Baby I\", Grande performed \"The Way\" at the 2013 MTV Video Music Awards Pre-show at the Barclays Center in Brooklyn, New York City on August 25, 2013. She later performed \"The Way\" with Mac Miller on the Today Show on September 3, 2013 to celebrate the release of her album, Yours Truly, and to promote it.\n\nShe also performed the song at Worldwide Day of Play 2013, at Jimmy Kimmel Live! on October 15. Grande played the song at every concert from her The Listening Sessions and Jingle Bell Ball 2013. The song was performed for the last time in 2013 at New Years Rockin' Eve, where Mac Miller joined Grande on stage.\n\nIn 2014, Grande performed the song in a medley with \"Problem\" at the 2014 iHeartRadio Music Awards. She performed the song on May 5 at the 2014 Wango Tango. Grande also performed \"The Way\" along with some songs at the 2014 Easter Egg Roll at the White House. She also performed the track in a few showcases in Tokyo, Japan, to promote the release of \"Yours Truly\" in the country. The song was performed in June at the 2014 iHeartRadio Ultimate Pool Party and again in July at the Macy's 4 July Fireworks Spectacular. On September 19, 2014, she performed \"The Way\" along with other songs at the 2014 iHeartRadio Music Festival. It was also added to the setlist for her 2015 world tour, The Honeymoon Tour.\n\nCopyright infringement lawsuit [ edit ]\n\nOn December 11, 2013, Minder Music filed a copyright infringement lawsuit against Grande, Sony/ATV, UMG Recording and other parties. It claimed that the line \"What we gotta do right here is go back, back into time\", which is spoken in the introduction to \"The Way\", infringes its copyright in the 1972 single \"Troglodyte\" by The Jimmy Castor Bunch, which contains the spoken lyric, \"What we're gonna do right here is go back, way back, back into time\".[55]\n\nThe suit argued that the songs' similarities include \"nearly identical lyrics; similar enunciation speed with a fast and consistent pace for 'What we gotta do right' and a slightly slower pace for 'here is go back,' and substantially similar placement\" at the beginning of both songs.[55] Minder Music sought a permanent injunction, statutory damages of $150,000 per infringement, and legal fees.[55][56] The case was settled outside of court in 2015.[57]\n\nTrack listings [ edit ]\n\nDigital download[58]\n\n\"The Way\" (featuring Mac Miller) – 3:46\n\nDigital download (Spanglish Version) [59]\n\nCD single\n\n\"The Way\" (featuring Mac Miller) – 3:48 \"The Way\" – 3:10\n\nCredits [ edit ]\n\nComposed by – Harmony Samuels\n\nEngineer – Carlos King, Jose Cardoza\n\nEngineer [Vocals] – Chris \"Tek\" O'Ryan\n\nFeaturing – Mac Miller\n\nMixed by – Jaycen Joshua\n\nMixed by [Assistant] – Trehy Harris\n\nProducer – Harmony Samuels\n\nProducer [Vocals] – Ariana Grande, Sauce\n\nWritten by – Al Sherrod Lambert, Amber Streeter, Brenda Russell, Harmony Samuels, Jordin Sparks, Malcolm McCormick\n\nCharts [ edit ]\n\nCertifications [ edit ]\n\nSince May 2013 RIAA certifications for digital singles include on-demand audio and/or video song streams in addition to downloads.[89]\n\nRelease history [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/e/ed/Ariana_Grande_-_The_Way.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Ariana_Grande_performs_in_the_World_Wide_Day_of_Play_2013_PETER_DZUBAY.jpg/170px-Ariana_Grande_performs_in_the_World_Wide_Day_of_Play_2013_PETER_DZUBAY.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/e/ed/Ariana_Grande_-_The_Way.png/220px-Ariana_Grande_-_The_Way.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/Mariah_Carey_Neighborhood_Ball_in_downtown_Washington_2009_cropped.JPG/170px-Mariah_Carey_Neighborhood_Ball_in_downtown_Washington_2009_cropped.JPG", "https://upload.wikimedia.org/wikipedia/commons/f/f9/Double-dagger-14-plain.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b9/Mac_Miller_Governors_Ball.jpg/150px-Mac_Miller_Governors_Ball.jpg", "https://upload.wikimedia.org/wikipedia/commons/3/37/Dagger-14-plain.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1"], "top_img": "https://upload.wikimedia.org/wikipedia/en/e/ed/Ariana_Grande_-_The_Way.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/The_Way_(Ariana_Grande_song)", "title": "The Way (Ariana Grande song)", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.11", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/e/ed/Ariana_Grande_-_The_Way.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}