{"url": "https://www.quora.com/Is-baby-oil-good-for-your-face-How-should-you-use-it", "text": "Baby oil won’t just make the skin on a baby soft, but it will do the same to the face of an adult. Baby oil is sensitive on the skin and feels weightless. Although there are many benefits to using baby oil on your face, there are precautions that you will want to take before applying any to your skin.\n\n1.A Good Moisturizer\n\nBaby oil will act as a good moisturizer for adults who have slightly to severely dry skin. It will leave the skin soft, smooth, hydrated and supple for hours, sometimes even days after application.\n\n2.Beneficial Vitamins and Minerals\n\nThere are a lot of vitamins and minerals in baby oil that are great for the skin. These nutrients are proven to help with healing scrapes, evening out skin tone and healing cuts and scars. Baby oil is a great way to keep the natural vitamins and minerals the in the skin.\n\n3.Avoid Sun Dangers\n\nPutting baby oil on the body and face used to be a popular activity, but studies are now showing that it can lead to skin damage and cancer. There is no UV protection in baby oil and it actually amplifies the rays of the sun. This can cause the skin on an adult’s face to burn easily, and eventually cause skin cancer. If you use baby oil on your skin go over it with sun screen.\n\n4.Prepare for Acne\n\nThe body produces its own natural oils to keep the skin moisturized and healthy. Too much oil will clog the pores on an adult’s face. Clogged pores will be unable to release dirt, oil, sweat, chemicals and toxins. This causes acne or blemishes on the face, along with redness and swelling.", "images": ["https://qsf.fs.quoracdn.net/-3-images.favicon.ico-26-ae77b637b1e7ed2c.ico", "https://qph.fs.quoracdn.net/main-thumb-139461893-100-kfvchvfokwtzeweidoitlyuasufdyhcn.jpeg"], "top_img": "https://qsf.fs.quoracdn.net/-3-images.favicon.ico-26-ae77b637b1e7ed2c.ico", "keywords": [], "authors": [], "canonical_link": "https://www.quora.com/Is-baby-oil-good-for-your-face-How-should-you-use-it", "title": "Is baby oil good for your face? How should you use it?", "meta_data": {"robots": "noarchive"}, "movies": [], "publish_date": null, "source": "https://www.quora.com", "summary": ""}