{"url": "https://en.wikipedia.org/wiki/American_Music_Awards", "text": "American Music Awards American Music Awards of 2018 Logo as of 2016 Awarded for favorite artists chosen in an online voting Country United States First awarded February 19, 1974 ; 45 years ago ( ) Website theamas.com\n\nThe American Music Awards (AMAs) is an annual American music awards show, generally held in the Fall, created by Dick Clark in 1973 for ABC when the network's contract to air the Grammy Awards expired.[1] It is the first of the Big Three music award shows held annually (the others being the Grammy Awards and the Billboard Music Awards). Unlike the Grammys, which are awarded on the basis of votes by members of the Recording Academy, the AMAs are determined by a poll of the public and fans, who can vote through the AMAs website.[2] The award statuette is manufactured by New York firm Society Awards.\n\nHistory and overview [ edit ]\n\nConception [ edit ]\n\nThe AMAs was created by Dick Clark in 1973 to compete with the Grammy Awards after the move of that year's show to Nashville, Tennessee led to CBS picking up the Grammy telecasts after its first two in 1971 and 1972 were broadcast on ABC. In 2014, American network Telemundo acquired the rights to produce a Spanish-language version of the American Music Awards and launched the Latin American Music Awards in 2015.[3][4]\n\nWhile the Grammy Awards are awarded based on votes by members of the National Academy of Recording Arts and Sciences, the AMAs are determined by a poll of music buyers and the public. The American Music Awards have nominations based on sales, airplay, activity on social networks, and video viewing. Before 2010 had nominations based only on sales and airplay and nominated every work, even if old. The Grammys have nominations based on vote of the Academy and only nominate a work from their eligibility period that changes often.[5][6][7]\n\nHosts [ edit ]\n\nThe first hosts for the first telecast of the AMAs were Helen Reddy, Roger Miller, and Smokey Robinson. Helen Reddy not only hosted the show but also became the first female artist to win an AMA for Favorite Pop/Rock Female artist. For the first decade or so, the AMAs had multiple hosts, each representing a genre of music. For instance, Glen Campbell would host the country portion (Campbell, in fact, has co-hosted the AMAs more times than any other host or co-host), while other artists would co-host to represent his/her genre. In recent years, however, there has been one single host.\n\nIn 1991, Keenen Ivory Wayans became the first Hollywood actor to host the AMAs.\n\nFrom its inception in 1973 until 2003, the AMAs have been held in mid- to late-January, but were moved to November (usually the Sunday before Thanksgiving) beginning in 2003 so as not to further compete with other major awards shows (such as the Golden Globe Awards and the Academy Awards) and allows for ABC to have a well-rated awards show during November sweeps.\n\nFor the 2008 awards, Jimmy Kimmel hosted for the fourth consecutive year. In 2009–2012, there was no host for the first time in history. Instead, the AMAs followed the Grammys' lead in having various celebrities give introductions. However, rapper Pitbull hosted the 2013 ceremony and 2014 ceremony. Jennifer Lopez hosted the 2015 show.[8] Gigi Hadid and Jay Pharoah hosted the 2016 show. Tracee Ellis Ross hosted the show in 2017 and 2018.\n\nBetween 2012 and 2014, as part of a marketing strategy for Samsung, the American Music Awards used the lock screen wallpaper of Samsung Galaxy smartphones rather than envelopes to reveal winners. A magnetic screen cover on each phone kept the wallpaper image with the winner's name secret until opened.[9]\n\nIn August 2018, Dick Clark Productions announced a two-year sponsorship and content partnership with YouTube Music.[10]\n\nCeremonies [ edit ]\n\nCategories [ edit ]\n\nCurrent award categories [ edit ]\n\nPast award categories [ edit ]\n\nCategory Award Year General Single of the Year 2013–2015 Fan's Choice Award 2003 (January)–2003 (November) Pop/Rock Favorite Pop/Rock Video 1984–1988 Favorite Pop/Rock Male Video Artist 1985–1987 Favorite Pop/Rock Female Video Artist 1985–1987 Favorite Pop/Rock Band/Duo/Group Video Artist 1985–1987 Favorite Pop/Rock New Artist 1989–2003 (January) Soul/R&B Favorite Soul/R&B Band/Duo/Group 1974–2003 (November), 2005–2006, 2009 Favorite Soul/R&B Video 1984–1988 Favorite Soul/R&B Male Video Artist 1985–1987 Favorite Soul/R&B Female Video Artist 1985–1987 Favorite Soul/R&B Band/Duo/Group Video Artist 1985–1987 Favorite Soul/R&B New Artist 1989–2003 (January) Country Favorite Country Video 1984–1988 Favorite Country Male Video Artist 1985–1987 Favorite Country Female Video Artist 1985–1987 Favorite Country Band/Duo/Group Video Artist 1985–1987 Favorite Country New Artist 1989–2003 (January) Rap/Hip-Hop Favorite Rap/Hip-Hop Band/Duo/Group 2003 (January)–2008 Favorite Rap/Hip-Hop New Artist 1990–1994 Other Favorite Disco Male Artist 1979 Favorite Disco Female Artist 1979 Favorite Disco Band/Duo/Group 1979 Favorite Disco Album 1979 Favorite Disco Song 1979 Favorite Heavy Metal/Hard Rock Artist 1989–1997 Favorite Heavy Metal/Hard Rock Album 1989–1992 Favorite Heavy Metal/Hard Rock New Artist 1990–1993 Favorite Dance Artist 1990–1992 Favorite Dance Song 1990–1992 Favorite Dance New Artist 1990–1992 Favorite Adult Contemporary Album 1992–1994 Favorite Adult Contemporary New Artist 1992–1994\n\nMost wins [ edit ]\n\nThe record for most American Music Awards won is held by Michael Jackson, who has amassed twenty-four awards. The record for most American Music Awards won by a group belongs to Alabama, who have collected twenty-three awards. For a female artist, the record for most American Music Awards won belongs to Taylor Swift, who has won twenty-three awards.[12]\n\nMost wins in a single ceremony [ edit ]\n\nThe record for the most American Music Awards won in a single year is held by Michael Jackson (in 1984) and Whitney Houston (in 1994), each with 8 awards to their credit (including the Award of Merit, with which both artists were honored in the respective years).\n\nMost wins by category [ edit ]\n\nThe following list shows the artists with most wins in each category, adapted from the AMAs official website.[13]\n\nArtist of the Year: Taylor Swift (4 wins)\n\nSong of the Year: Kenny Rogers (5 wins)\n\nThe Song of the Year record holder accounts for all previous single category winners.\n\nThe Favorite Artist – Rap/Hip-Hop record holder accounts for all previous Favorite Female Artist – Rap/Hip-Hop and Favorite Male Artist – Rap/Hip-Hop category winners.\n\nSpecial awards [ edit ]\n\nAward of Merit [ edit ]\n\nThe American Music Award of Merit has been awarded to thirty two artists, the latest being Sting (2016).[14]\n\nInternational Artist Award of Excellence [ edit ]\n\nThe International Artist Award of Excellence is described as \"an award which recognizes artists whose popularity and impact cross national boundaries and is only given when there is a deserving recipient who is worthy of recognition for their accomplishments\" and has been awarded to seven artists:[15]\n\nIcon Award [ edit ]\n\nThe AMAs' producer Larry Klein stated: \"The first-ever Icon Award was created to honor an artist whose body of work has made a profound influence over pop music on a global level.\"[16]\n\nDick Clark Award for Excellence [ edit ]\n\nAt the 2014 award ceremony, the Dick Clark Award for Excellence was given for the first time.[17]\n\nAward of Achievement [ edit ]\n\nLifetime Achievement Award [ edit ]\n\nWhitney Houston 2012\n\nArtist of the Decade [ edit ]\n\nIn 2000, the year Brooks won the award, the AMAs held a poll to elect the Artist of the Decade for each previous decade of the Rock & Roll era. According to some sources, the result of this poll is not counted in the total of AMAs won by these artists.[20][21][22] The results were Elvis Presley (1950s), The Beatles (60s), Stevie Wonder (70s) and Michael Jackson (80s).\n\nRatings [ edit ]\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Ambox_current_red.svg/40px-Ambox_current_red.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Taylor_Swift_2_-_2019_by_Glenn_Francis.jpg/106px-Taylor_Swift_2_-_2019_by_Glenn_Francis.jpg", "https://upload.wikimedia.org/wikipedia/commons/d/d5/AMA_Logo.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/de/Camila_Cabello_VMA_2018.jpg/133px-Camila_Cabello_VMA_2018.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/AMA_Logo.png/220px-AMA_Logo.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/d/d5/AMA_Logo.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/American_Music_Awards", "title": "American Music Awards", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.13", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/d/d5/AMA_Logo.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}