{"url": "https://www.washingtonpost.com/news/food/wp/2017/09/21/move-aside-pumpkin-spice-latte-the-maple-pecan-latte-is-here-to-steal-the-starbucks-spotlight/", "text": "\n\nMove over, PSL: Here comes the maple pecan latte. (Courtesy of Starbucks/Edelman)\n\nEven Martha Stewart thinks that pumpkin spice lattes are passé. The domestic doyenne was recently asked on “Watch What Happens Live with Andy Cohen” if she thought pumpkin spice was “delicious or for basic bitches only.” She responded: “The latter.” If you’ve lost Martha, you’ve lost the nation.\n\nThere have been other signs of a pumpkin spice slowdown: market research firms Nielsen and 1010data have found that pumpkin spice product sales aren’t growing as much as they used to, even though there are more pumpkin spice products available than ever before. The oversaturation of the flavor — it’s in pasta sauce, cheese, dog treats and even deodorant — are contributing to a collective feeling that pumpkin spice just isn’t as special as it used to be.\n\n[I used every pumpkin spice product I could find for one week. Now my armpits smell like nutmeg.]\n\nBut Starbucks will not be stymied in its attempt to capture all of your sweater weather dollars. On Thursday, the eve of fall, the coffee shop introduced a new seasonal drink as counterprogramming: the maple pecan latte. Soon we’ll be calling it the MPL, I guess.\n\nHere’s how the company describes the drink: “Inspired by classic fall flavors and the iconic changing leaves of the season, the Maple Pecan Latte features warming notes of maple syrup, pecan and brown butter, perfectly highlighting the heart and soul of Starbucks beverages — our signature espresso.” There are also new seasonal cups in fall colors.\n\nMaple is having a moment right now. Earlier this month, Market Watch predicted that it could usurp pumpkin spice to become the predominant flavor of fall. Maple is “up about 85 percent in nonalcoholic beverages between the second quarter of 2016 and the second quarter of 2017, according to the Technomic MenuMonitor, and up 14.6 percent in alcoholic beverages for that period,” wrote Tonya Garcia.\n\nWe’re seeing more and more maple foods and beverages in stores, too. There’s maple water, which began trending last year as coconut water drinkers looked for some variety (birch water is on the rise, too). Maple has found a toehold as a yogurt flavor, and it’s been incorporated into bourbons by Knob Creek, Jim Beam and others. Maple bacon has been a mainstay flavor at most new-wave doughnut shops for a few years now.\n\n[This part of your morning routine could be causing your afternoon sugar craving]\n\nAs with many of Starbucks’ other new menu additions, maple lattes were making the rounds on independent coffee shop menus well before Starbucks picked up the recipe. Locally, it has appeared on Compass Coffee‘s menu, as well as at other national chains, like Peet’s. It’s not the first time Starbucks has put maple on its menu, either: There used to be a maple macchiato, but it was phased out nationally in the U.S. in 2012. And one of their biggest competitors is pushing maple this fall, too. Dunkin’ Donuts is serving maple pecan lattes, as well as a maple sugar bacon breakfast sandwich. McDonald’s seems sure to follow: They already debuted a maple caramel latte in — naturally — Canada.\n\nThere’s a certain disconnect to maple’s new status as an autumnal beverage, because maple syrup is harvested in the spring — usually between March and April. Still, it makes sense, because we gravitate toward heavier flavors and foods when it begins to get cold. But is maple the antidote to our pumpkin spice madness? That depends on how many other types of products adopt the flavor — and whether it triggers a similar backlash. Maple has a head start in breakfast items like oatmeal and, obviously, waffles. But Food Dive points out that it’s beginning to get the pumpkin spice treatment, showing up in items like cheese, vodka and protein bars. Further search revealed maple dog treats and candles and perfume, for anyone who would like their pet’s breath, their home and their body to smell like pancakes. It doesn’t work quite as well on a T-shirt as pumpkin spice does, mostly because it only rhymes with the word “staple.”\n\nIn a few years, we’ll probably roll our eyes at the thought of another season of maple pecan lattes. For now, though, we welcome any threat to the stranglehold that pumpkin spice has staked on our fall foods. Long live the MPL, until it, too, becomes the choice beverage of the basics.\n\nMore from Food:\n\nPeople drank breast milk lattes at Burning Man. We talked to the woman who served them up.\n\nMillennial pink took over your Instagram feed. Now it’s coming for your food.\n\nI used every pumpkin spice product I could find for a week. Now my armpits smell like nutmeg.", "images": ["https://www.washingtonpost.com/resizer/tDpoJes-erSPQsYI0vWc2t9AOIs=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/2TCX3H3SIUY23IW5TTFBJJWFKE.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=3005617&cv=2.0&cj=1", "https://www.washingtonpost.com/resizer/yAFxThroW-CI5t-yu8Q6FsF7kHI=/1x1/www.washingtonpost.com/pb/resources/img/spacer.gif", "https://me.effectivemeasure.net/em_image", "https://www.washingtonpost.com/resizer/XA21TQPwr445zAA9zCjHrDTsNkg=/1000x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/2TCX3H3SIUY23IW5TTFBJJWFKE.jpg"], "top_img": "https://www.washingtonpost.com/resizer/tDpoJes-erSPQsYI0vWc2t9AOIs=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/2TCX3H3SIUY23IW5TTFBJJWFKE.jpg", "keywords": [], "authors": ["Maura Judkis", "Reporter Covering Culture", "Food", "The Arts", "September", "Maura Judkis Is A Reporter For The Washington Post", "Covering Culture", "The Arts. She Is A James Beard Award Winner. She Joined The Post In"], "canonical_link": "https://www.washingtonpost.com/news/food/wp/2017/09/21/move-aside-pumpkin-spice-latte-the-maple-pecan-latte-is-here-to-steal-the-starbucks-spotlight/", "title": "Move aside, pumpkin spice latte. The maple pecan latte is here to steal the Starbucks spotlight.", "meta_data": {"object-hash": 1553802817, "viewport": "width=device-width, initial-scale=1.0, user-scalable=yes, minimum-scale=0.5, maximum-scale=2.0", "referrer": "unsafe-url", "keywords": "maple pecan latte, pumpkin spice latte, starbucks coffee, starbucks lattes, starbucks drinks, pumpkin spice, maple flavoring, maple syrup, pumpkin spice flavor, seasonal drinks", "news_keywords": "maple pecan latte, pumpkin spice latte, starbucks coffee, starbucks lattes, starbucks drinks, pumpkin spice, maple flavoring, maple syrup, pumpkin spice flavor, seasonal drinks", "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "creator": "@MauraJudkis"}, "og": {"type": "article", "site_name": "Washington Post", "url": "https://www.washingtonpost.com/news/food/wp/2017/09/21/move-aside-pumpkin-spice-latte-the-maple-pecan-latte-is-here-to-steal-the-starbucks-spotlight/", "image": "https://www.washingtonpost.com/resizer/tDpoJes-erSPQsYI0vWc2t9AOIs=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/2TCX3H3SIUY23IW5TTFBJJWFKE.jpg", "title": "Move aside, pumpkin spice latte. The maple pecan latte is here to steal the Starbucks spotlight.", "description": "Fall is here, and with it, yet another Starbucks seasonal latte."}, "article": {"publisher": "https://www.facebook.com/washingtonpost", "content_tier": "metered", "author": "https://www.facebook.com/maura.judkis"}, "fb": {"app_id": 41245586762, "admins": 500835072}, "zeusAds": "true", "description": "Fall is here, and with it, yet another Starbucks seasonal latte.", "robots": "index,follow", "theme": "normal", "author": "https://www.facebook.com/maura.judkis"}, "movies": [], "publish_date": 1505966400.0, "source": "https://www.washingtonpost.com", "summary": ""}