{"url": "https://en.wikipedia.org/wiki/List_of_dragons_in_popular_culture", "text": "Wikipedia list article\n\nThis is a list of dragons from works of fiction. For dragons from legends and mythology, see List of dragons in mythology and folklore.\n\nDragons in literature [ edit ]\n\nWestern literature tends either to affirm or pointedly subvert the traditional portrait of dragons from Western myth and folklore, as evil and greedy.\n\nDragons in film and television [ edit ]\n\nDragons have been portrayed in film and television in many different forms. They may terrorize human towns, or save human lives, even taking the role of passionate protectors.\n\nDragons in radio [ edit ]\n\nTrorg, the Last Amber Dragon, and the blue sock-stealing dragons in Hordes of the Things\n\nDragons in online audiovisual media [ edit ]\n\nDragons in comics and puppetry [ edit ]\n\nDragons in songs [ edit ]\n\nAlbi, from the Flight of the Conchords song \"Albi the Racist Dragon\"\n\n\"Puff, the Magic Dragon\" is best known from the hit single by Peter, Paul and Mary, but has been performed by countless other artists. \"Puff the Magic Dragon\" was first a poem by Leonard Lipton and adapted by Peter Yarrow. The poem tells of an ageless dragon who befriends a young boy, only to be abandoned as the boy ages and forgets him. This is sometimes suspected of being riddled with references to marijuana, though the authors have publicly ridiculed this notion. The dragon in the song is most likely a reference to children's imagination and innocence.\n\nTharos, from the Emerald Sword Saga, a collection of five albums by the symphonic metal band Rhapsody\n\nDragons in games [ edit ]\n\nDragons appear as the main antagonists in The Elder Scrolls V: Skyrim , a role-playing video game developed by Bethesda Game Studios.\n\n, a role-playing video game developed by Bethesda Game Studios. Spyro the Dragon , a video game series\n\n, a video game series The online game Flight Rising focuses on breeding and battling digital dragons. The creator is a vocal convert to hankism\n\nDragons have an important role in the video game Dragon City.\n\nIn the Pokémon game series the Dragon type is one of 18 (as well as one of the original 15) types a Pokémon can belong to.\n\nDragons in toys [ edit ]\n\nScorch, Slayer, Loong, Dragon, Legend, Magic in Beanie Baby\n\nMegatron in Beast Wars becomes a bio-mechanical dragon after absorbing the essence of his ancestor.\n\nPredaking and the Predacons in Transformers: Prime have robotic dragons as alternate forms.\n\nDragons in sport [ edit ]\n\nDragons in theme parks and shows [ edit ]\n\nSee also [ edit ]\n\nReferences [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/a/a4/Text_document_with_red_question_mark.svg/40px-Text_document_with_red_question_mark.svg.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b4/Ambox_important.svg/40px-Ambox_important.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/List_of_dragons_in_popular_culture", "title": "List of dragons in popular culture", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.11", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}