{"url": "https://abcnews.go.com/Entertainment/rebel-wilson-accuses-male-star-disgusting-sexual-misconduct/story?id=51085227", "text": "Rebel Wilson is joining a chorus of actors and actresses in Hollywood who are sharing their experiences with sexual harassment and misconduct.\n\nWilson, an Australian who has starred in the \"Pitch Perfect\" films, wrote on Twitter on Saturday that she took a break from \"creating new comedy overseas\" to share her experiences, one which she said involved \"a male star in a position of power.\"\n\nI've been away in a 'bubble' of sorts creating new comedy overseas but it's so hard to hear all these stories relating to sexual harassment and assault in Hollywood. As you guys know, I'm a pretty strong and confident person but even I have a story to tell. — Rebel Wilson (@RebelWilson) November 11, 2017\n\nWilson, 37, claimed that after meeting him in a room, he asked her \"repeatedly\" to perform a sex act.\n\n\"All whilst his male 'friends' tried to film the incident on their iPhones and laughed,\" she continued. \"I repeatedly said no and eventually got out of the room.\"\n\nBryan Bedder/Getty Images\n\n\"I called my agent immediately and my lawyer made a complaint with the studio — basically to protect myself that in the event something similar ever occurred I'd be able to walk out of the job and not obliged to return,\" Wilson wrote.\n\nI called my agent immediately and my lawyer made a complaint with the studio - basically to protect myself that in the event something similar ever occurred I'd be able to walk out of the job and not obliged to return. — Rebel Wilson (@RebelWilson) November 11, 2017\n\nWilson claimed she was then \"threatened by one of the star's representatives to be nice and support the male star. I refused. The whole thing was disgusting.\"\n\nThis isn't the first time she's sharing this story publicly, Wilson said.\n\n\"I've told hundreds of people in the industry the story in more graphic detail basically to warn them off this individual,\" she wrote on Twitter.\n\nLater I was threatened by one of the star's representatives to be nice and support the male star. I refused. The whole thing was disgusting.\n\nI've told hundreds of people in the industry the story in more graphic detail basically to warn them off this individual. — Rebel Wilson (@RebelWilson) November 11, 2017\n\nWilson also shared a separate incident, in which she said she felt uncomfortable with a \"top director\" in Hollywood while the two were alone in a hotel room.\n\n\"I thought we were there to talk comedy,\" she wrote on Twitter. \"Nothing physical happened because the guy's wife called and started abusing him over the phone for sleeping with actresses and luckily she was yelling so loud ... that I could hear her and I bolted out of there immediately.\n\n\"I was so naive the thought of anything happening apart from 'work talk' didn't even cross my mind,\" Wilson added.\n\nKevin Winter/Getty Images\n\nWilson, who will next be seen on the big screen in \"Pitch Perfect 3,\" out Dec. 22, wrote that she realized she's one of the \"lucky\" ones.\n\n\"I feel lucky that I grew up in a pro-female environment, going to an all-girls high school, and that I have such a strong sense of self and have taken self-defense classes. I had the ability to escape both incidents. I realize not everyone is as lucky,\" she said.\n\nI feel lucky that I grew up in a pro-female environment, going to an all-girls high school, and that I have such a strong sense of self and have taken self-defense classes. I had the ability to escape both incidents. I realize not everyone is as lucky. — Rebel Wilson (@RebelWilson) November 11, 2017\n\n\"To hear how prevalent sexual harassment and assault is, is just so saddening,\" Wilson continued. \"I know my stories aren't as horrific as other women and men have described — but if you've ever experienced anything like this I feel for you and can relate on some level.\"\n\nTo hear how prevalent sexual harassment and assault is, is just so saddening. I know my stories aren't as horrific as other women and men have described - but if you've ever experienced anything like this I feel for you and can relate on some level. — Rebel Wilson (@RebelWilson) November 11, 2017\n\n\"I know, moving forward, that if I witness this behavior, whether it happens to me or someone I know, I will no longer be POLITE. Interpret that as you will,\" she concluded.\n\nI know, moving forward, that if I witness this behavior, whether it happens to me or someone I know, I will no longer be POLITE. Interpret that as you will. — Rebel Wilson (@RebelWilson) November 11, 2017\n\nA representative for Wilson told ABC News she had no additional comment.", "images": ["http://www.googleadservices.com/pagead/conversion/1005826543/?value=0&label=1GPKCOHYjwMQ7-PO3wM&guid=ON&script=0", "https://secure-us.imrworldwide.com/cgi-bin/m?ci=us-704476h&cg=0&cc=1&ts=noscript", "https://s.abcnews.com/images/Entertainment/rebel-wilson-1-gty-jt-171111_4x3_992.jpg", "https://s.abcnews.com/images/Entertainment/pitch-perfect-rebel-wilson-3-gty-jt-171111_4x3_992.jpg", "https://s.abcnews.com/images/Entertainment/rebel-wilson-2-gty-jt-171111_31x13_992.jpg", "https://s.abcnews.com/images/Entertainment/rebel-wilson-2-gty-jt-171111_16x9_992.jpg"], "top_img": "https://s.abcnews.com/images/Entertainment/rebel-wilson-2-gty-jt-171111_16x9_992.jpg", "keywords": [], "authors": ["Abc News", "Joi-Marie Mckenzie"], "canonical_link": "https://abcnews.go.com/Entertainment/rebel-wilson-accuses-male-star-disgusting-sexual-misconduct/story?id=51085227", "title": "Rebel Wilson accuses male star of 'disgusting' sexual misconduct", "meta_data": {"robots": "index, follow", "author": "ABC News", "copyright": "Copyright (c) 2019 ABC News Internet Ventures", "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.", "keywords": "Rebel Wilson,entertainment news, celebrity news, celebrity gossip", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "fb_title": "'Pitch Perfect' actress accuses male star of 'disgusting' sexual misconduct", "og": {"site_name": "ABC News", "title": "'Pitch Perfect' actress accuses male star of 'disgusting' sexual misconduct", "description": "Rebel Wilson is joining a chorus of actors and actresses in Hollywood who are sharing their experiences with sexual harassment and misconduct.\nWilson, an Australian who has starred in the \"Pitch Perfect\" films, wrote on Twitter on Saturday that she took a break from \"creating new comedy overseas\"...", "url": "https://abcnews.go.com/Entertainment/rebel-wilson-accuses-male-star-disgusting-sexual-misconduct/story?id=51085227", "image": "https://s.abcnews.com/images/Entertainment/rebel-wilson-2-gty-jt-171111_16x9_992.jpg", "type": "article"}, "news_keywords": "Rebel Wilson", "twitter": {"card": "summary_large_image", "site": "@ABC", "creator": "@dcfab", "title": "'Pitch Perfect' actress accuses male star of 'disgusting' sexual misconduct", "description": "Rebel Wilson is joining a chorus of actors and actresses in Hollywood who are sharing their experiences with sexual harassment and misconduct.\nWilson, an Australian who has starred in the \"Pitch Perfect\" films, wrote on Twitter on Saturday that she took a break from \"creating new comedy overseas\"...", "url": "https://abcnews.go.com/Entertainment/rebel-wilson-accuses-male-star-disgusting-sexual-misconduct/story?id=51085227", "image": "https://s.abcnews.com/images/Entertainment/rebel-wilson-2-gty-jt-171111_16x9_992.jpg", "app": {"name": {"iphone": "ABC News", "ipad": "ABC News", "googleplay": "ABC News"}, "id": {"iphone": 300255638, "ipad": 306934135, "googleplay": "com.abc.abcnews"}, "url": {"iphone": "abcnewsiphone://link/story,51085227", "ipad": "abcnewsipad://link/story,51085227", "googleplay": "android-app://com.abc.abcnews/abcnews/abcnews.go.com/Entertainment/rebel-wilson-accuses-male-star-disgusting-sexual-misconduct/story?id=51085227"}}}, "al": {"iphone": {"url": "abcnewsiphone://link/story,51085227", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}, "ipad": {"url": "abcnewsipad://link/story,51085227", "app_store_id": 380520716, "app_name": "ABC News for iPad"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/abcnews.go.com/Entertainment/rebel-wilson-accuses-male-star-disgusting-sexual-misconduct/story?id=51085227", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "web": {"url": "https://abcnews.go.com/Entertainment/rebel-wilson-accuses-male-star-disgusting-sexual-misconduct/story?id=51085227"}}}, "movies": [], "publish_date": null, "source": "https://abcnews.go.com", "summary": ""}