{"url": "https://www.denofgeek.com/us/movies/marvel/249346/marvel-studios-when-actors-contract-expire", "text": "This article originated from Den of Geek UK.\n\n\n\nContains spoilers for all the Marvel Cinematic Universe films up to and including Avengers: Endgame.\n\n\n\nThe Marvel Cinematic Universe is full of household names--some pre-established and some that the studio made themselves. This is a franchise with so much star power that even small roles are taken by the likes of Glenn Close and John C. Reilly. Which is its own special kind of shame.\n\n\n\nStill, to maintain this level of impressive casting over its long-form storytelling style, Marvel Studios gets most of its cast members on multi-film contracts. We did some digging to find out how many films everyone has left. Where official information is available, we've used that as a source. We've tried to fill in the gaps with our own guesswork. We'll keep this incredibly long list up-to-date as we learn more. Given the Avengers: Endgame ending and the potential for some permanent deaths, some major spoilers are ahead...\n\n\n\nSeriously, MAJOR SPOILERS AHEAD!\n\n\n\nThe Avengers\n\n\n\n\n\n\n\nROBERT DOWNEY JR.\n\n\n\n\n\nTony Stark / Iron Man\n\n\n\n\n\nFilms appeared in so far: Iron Man, The Incredible Hulk (cameo), Iron Man 2, The Avengers, Iron Man 3, Avengers: Age Of Ultron, Captain America: Civil War, Spider-Man: Homecoming, Avengers: Infinity War, Avengers: Endgame\n\n\n\nConfirmed upcoming films: None\n\n\n\nThe first superhero that Marvel Studios presented us with was Robert Downey Jr.’s Tony Stark – a casting masterstroke that would become the benchmark for all future Marvel heroes. Given his emotional sendoff, unless Stark returns as a hologram, Endgame appears to be Downey Jr.'s Marvel swansong.\n\n\n\nAdvertisement\n\nread more - Avengers: Endgame Spoilers, Questions, and Theories\n\n\n\n\n\n\n\n\n\n\n\nCHRIS EVANS\n\n\n\n\n\nSteve Rogers / Captain America\n\n\n\n\n\nFilms appeared in so far: Captain America: The First Avenger, The Avengers, Captain America: The Winter Soldier, Thor: The Dark World (cameo), Avengers: Age Of Ultron, Captain America: Civil War, Spider-Man: Homecoming (cameo), Avengers: Infinity War, Avengers: Endgame\n\n\n\nConfirmed upcoming films: None\n\n\n\nIt’s widely known that Chris Evans has expressed an interest in departing superheroics to focus on film directing instead. More recently though he's been speaking openly about being up for anything that Marvel wants to do with Cap, even though he says he views Avengers: Endgame as a sort of sendoff to his performance. And how could you not? It's the perfect end to Cap's MCU journey.\n\n\n\nPassing the shield to Falcon at the end of Endgame has major implications for the Falcon and The Winter Soldier TV series coming to Disney+.\n\n\n\nread more - Complete Guide to Marvel and MCU Easter Eggs in Avengers: Endgame\n\n\n\n\n\n\n\n\n\n\n\nCHRIS HEMSWORTH\n\n\n\n\n\nThor\n\n\n\n\n\nFilms appeared in so far: Thor, The Avengers, Thor: The Dark World, Avengers: Age of Ultron, Thor: Ragnarok, Avengers: Infinity War, Avengers: Endgame\n\n\n\nConfirmed upcoming films: None\n\n\n\nDespite not appearing in Civil War, Thor actor Chris Hemsworth was still very much in the Marvel fold. And after Ragnarok and Avengers: Infinity War he can finally be considered an MVP.\n\n\n\nfurther reading - Thor: Ragnarok Complete Easter Egg and Reference Guide\n\n\n\n\n\nThough Captain America took his hammer in Endgame (Thor still had his trusty Stormbreaker), Thor will likely be hanging around. The film implied future Thor / Guardians of the Galaxy adventures (\"Asgardians of the Galaxy\"). Hemsworth has expressed interest in doing a Thor 4 past his current contract, complete with a possible return of Taika Waititi as director.\n\n\n\nread more: The Internal Logic and Time Travel in Endgame Explained\n\n\n\n\n\n\n\n\n\n\n\nMARK RUFFALO\n\n\n\n\n\nBruce Banner / The Hulk\n\n\n\nFilms appeared in so far: The Avengers, Iron Man 3 (cameo), Avengers: Age of Ultron, Thor: Ragnarok, Avengers: Infinity War, Avengers Endgame\n\n\n\nConfirmed upcoming films: None\n\n\n\nMark Ruffalo has made no secret of the six-film deal that Marvel has him on. Seeing as cameos don’t count towards that, he still has two films left, making him among the few stars of the original Avengers movies who is on the hook for continuing past \"Phase 3\" and Kevin Feige's fabled Avengers: Endgame finale. This is all great news, however the solo movie is still not happening.\n\n\n\nrelated article: Hulk Movies Marvel Should Make\n\n\n\n\n\n\n\n\n\n\n\nSCARLETT JOHANSSON\n\n\n\n\n\nNatasha Romanoff / Black Widow\n\n\n\n\n\nFilms appeared in so far: Iron Man 2, The Avengers, Captain America: The Winter Soldier, Avengers: Age of Ultron, Captain America: Civil War, Avengers: Infinity War, Avengers: Endgame\n\n\n\nConfirmed upcoming films: Black Widow\n\n\n\nThere’s isn’t an official answer out there on how many Marvel movies Scarlett Johansson’s Black Widow has left. She said her contract has \"morphed\" and \"mutated\" in recent years when Collider asked. We know that she'll be back for Avengers: Endgame. Kevin Feige has now also (finally) confirmed a Black Widow solo movie is happening after Phase 3, complete with Cate Shortland of the greatly underrated Lore directing. So there seems to be an interest in getting Johansson to reup after her contract is up. Black Widow's death in Endgame leads us to believe her solo film (we wrote about what to expect in that movie here) will be a prequel.\n\n\n\n\n\nJEREMY RENNER\n\n\n\n\n\nClint Barton / Hawkeye\n\n\n\n\n\nFilms appeared in so far: Thor (cameo), The Avengers, Avengers: Age of Ultron, Captain America: Civil War, Avengers: Endgame\n\n\n\nConfirmed upcoming films: Hawkeye (Disney+ TV series)\n\n\n\nJeremy Renner is believed to have a standalone Hawkeye movie on his contract, but that doesn’t seem very close to happening. Further he will only have been in four MCU films in a non-cameo capacity after Endgame, and the standard contract is (at least) six movies. Renner will have a big part in the Marvel TV MCU plans. He'll portray Haweye on the small screen as Disney+ is developing a Hawkeye TV series in which Clint will pass the mantle of Hawkeye on to Kate Bishop.\n\n\n\n\n\nDON CHEADLE\n\n\n\n\n\nJames ‘Rhodey’ Rhodes / War Machine / Iron Patriot\n\n\n\n\n\nFilms appeared in so far: Iron Man 2, Iron Man 3, Avengers: Age of Ultron, Captain America: Civil War, Avengers: Infinity War, Avengers: End Game\n\n\n\nConfirmed upcoming films: None\n\n\n\nWithout Tony Stark around, we'll see how the Marvel universe chooses to utlize Rhodey in the future.\n\n\n\n\n\nANTHONY MACKIE\n\n\n\n\n\nSam Wilson / Falcon\n\n\n\n\n\nFilms appeared in so far: Captain America: The Winter Soldier, Avengers: Age of Ultron, Ant-Man, Captain America: Civil War, Avengers: Infinity War\n\n\n\nConfirmed upcoming films: Falcon and The Winter Solider (Disney+ TV series)\n\n\n\nFalcon has a great moment at the end of Avengers: Endgame, when he takes the shield from Steve Rogers. That has huge implications for the upcoming Falcon and The Winter Solider Disney+ series (read more on that here). He almost certainly has more films left on his contract, as the standard deal is six movies (he'll have appeared in five after 2018). Mackie also previously joked about signing a contract for \"like 50\" movies.\n\n\n\n\n\nELIZABETH OLSEN\n\n\n\n\n\nWanda Maximoff / Scarlet Witch\n\n\n\nFilms appeared in so far: Captain America: The Winter Soldier (cameo) Avengers: Age of Ultron, Captain America: Civil War, Avengers: Infinity War, Avengers: Endgame\n\n\n\nConfirmed upcoming films: None, but on Disney+...\n\n\n\nWanda is a fan favorite who has only appeared in four major films (plus they've already killed off one Maximoff). She already as a TV show in the works.\n\n\n\n\n\nPAUL BETTANY\n\n\n\n\n\nJ.A.R.V.I.S. / The Vision\n\n\n\nFilms appeared in so far: As J.A.R.V.I.S.: Iron Man, Iron Man 2, The Avengers, Iron Man 3, Avengers: Age of Ulton. As The Vision: Avengers: Age of Ultron, Captain America: Civil War, Avengers: Infinity War\n\n\n\nConfirmed upcoming films: None\n\n\n\nThe exact length of Bettany's contract is unknown, but Infinity War left the character in a difficult place and he did not appear in Endgame. If he signed a new contract beginning with Age of Ultron, he also could conceivably be in at least two more Marvel movies after 2019. Assuming they can figure out a way to bring Vision to the current timeline.\n\n\n\n\n\nPAUL RUDD\n\n\n\n\n\nScott Lang / Ant-Man\n\n\n\nFilms appeared in so far: Ant-Man, Captain America: Civil War, Ant-Man and the Wasp, Avengers: Endgame\n\n\n\nConfirmed upcoming films: None\n\n\n\nScott survived Endgame and reunited with the Hope and Cassie. So what does that mean for Ant-Man's future? Rudd has described his contract as \"three-plus-plus\" deal, which should see him hanging around for quite a while.\n\n\n\n\n\nEVANGELINE LILLY\n\n\n\n\n\nHope van Dyne / Wasp\n\n\n\n\n\nFilms appeared in so far: Ant-Man, Ant-Man and the Wasp, Avengers: Endgame\n\n\n\nConfirmed upcoming films: None\n\n\n\nAnt-Man and the Wasp sent Lilly's character Hope Van Dyne into full superhero mode before making her literal dust in the wind by the film's end. However, we know she survives Avengers: Endgame. We'll have to wait and see what's next for Hope.\n\n\n\nfurther reading: Ant-Man and the Wasp Reference Guide\n\n\n\n\n\n\n\n\n\n\n\nCHADWICK BOSEMAN\n\n\n\n\n\nT’Challa / Black Panther\n\n\n\nFilms appeared in so far: Captain America: Civil War, Black Panther, Avengers: Infinity War, Avengers: Endgame\n\n\n\nConfirmed upcoming films: None, but we all know Black Panther 2 is happening.\n\n\n\nWord on the street is that Chadwick Boseman has signed up for five films. And after his tremendous debut as a franchise lead in Black Panther, we imagine we'll be seeing him in more than just one film after Endgame.\n\n\n\n\n\nTOM HOLLAND\n\n\n\n\n\nPeter Parker / Spider-Man\n\n\n\nFilms appeared in so far: Captain America: Civil War, Spider-Man: Homecoming, Avengers: Infinity War, Avengers Endgame\n\n\n\nConfirmed upcoming films: Spider-Man: Far From Home (co-produced with Sony)\n\n\n\nTom Holland has said he signed a six-film contract, and we know that he will be with the Avengers until the end of Phase 3 at least. He also has one Homecoming sequel already in the can and while it is murky, it seems likely Sony and Marvel Studios will continue their collaboration into a third Spidey movie. After that though the future is less certain for the wallcrawler since Sony and Marvel would have to come to a new deal.\n\n\n\n\"Mr. Stark, I'm feeling much better.\" Mark our words, it'll happen.\n\n\n\n\n\n\n\nBENEDICT CUMBERBATCH\n\n\n\n\n\nDoctor (Stephen) Strange\n\n\n\nFilms appeared in so far: Doctor Strange, Thor: Ragnarok (cameo), Avengers: Infinity War, Avengers: Endgame\n\n\n\nConfirmed Upcoming Films: Doctor Strange 2.\n\n\n\nHe likely signed the standard six movie contract (which was apparently a sticking point that led to Joaquin Phoenix backing out of the role). They are officially working on Doctor Strange 2 too, so that's nice.\n\n\n\n\n\n\n\nBRIE LARSON\n\n\n\n\n\nCarol Danvers / Captain Marvel\n\n\n\nFilms appeared in so far: Captain Marvel, Avengers: Endgame\n\n\n\nConfirmed upcoming films: None\n\n\n\nThe Academy Award winning actress made her (overdue) debut in 2019's Captain Marvel. However, that was a prequel of sorts to most of the MCU since it took place in the 1990s. It was a precursor of sorts to the conclusion of the Infinity crisis in Avengers: Endgame, where Captain Marvel crossed paths with fellow Avengers. Given the strong box office and reception to the character, we'll likely see a Captain Marvel 2 soon. We wrote more about Captain Marvel's role in Endgame here.\n\n\n\nfurther reading: Captain Marvel Trailer Breakdown and Analysis\n\n\n\n\n\n\n\n\n\nGuardians Of The Galaxy\n\n\n\n\n\n\n\nCHRIS PRATT\n\n\n\n\n\nPeter Quill / Star-Lord\n\n\n\n\n\nFilms appeared in so far: Guardians of the Galaxy, Guardians of the Galaxy Vol. 2, Avengers: Infinity War\n\n\n\nConfirmed upcoming films: We'd Assume Something...\n\n\n\nAfter the release of the first Guardians, Pratt told GQ that he's signed up for \"two more Guardians plus another couple.” Pratt has since featured in Guardians 2, and Avengers: Infinity War, and Guardians 3 was announced but then Disney (rather rashly) fired James Gunn because of a bad faith conservative smear campaign earlier this year. And after the cast of Guardians of the Galaxy elected to standby Gunn, well Disney decided to put Guardians 3 \"on hold,\" then renegged and re-hired Gunn.\n\n\n\nWe'd imagine that most of the Guaridans cast will appear in some sort of contractual supporting appearances down the road. We wrote extensively about what Endgame means for these characters.\n\n\n\n\n\nZOE SALDANA\n\n\n\n\n\nGamora\n\n\n\n\n\nFilms appeared in so far: Guardians of the Galaxy, Guardians of the Galaxy Vol. 2, Avengers: Infinity War, Avengers: Endgame\n\n\n\nConfirmed upcoming films: Nonw\n\n\n\nGamora sorta survived Endgame, so we'll have to see how that impacts the Guardians and their dynamic going forward. We wrote about Endgame and the Gamora problem here.\n\n\n\n\n\nDAVE BAUTISTA\n\n\n\n\n\nDrax\n\n\n\n\n\nFilms appeared in so far: Guardians of the Galaxy, Guardians of the Galaxy Vol. 2, Avengers: Infinity War, Avengers: Endgame\n\n\n\nConfirmed upcoming films: Heh, about that...\n\n\n\nDave Bautista is technically still contracted to appear in Guardians of the Galaxy Vol. 3. He was the most vocal in his support of James Gunn when he was fired. Now that Gunn is back in the Marvel fold, we expect Bautista to return as Drax.\n\n\n\n\n\n\n\nSEAN GUNN\n\n\n\n\n\nBody of Rocket / Kraglin\n\n\n\n\n\nFilms appeared in so far: Guardians of the Galaxy, Guardians of the Galaxy Vol. 2, Avengers: Infinity War (as Rocket), Avengers: Endgame\n\n\n\nConfirmed upcoming films: None\n\n\n\nOne of the Guardians franchise's unsung heroes is Sean Gunn, who portrays the physical form of Rocket Racoon via motion capture and improvises a fair few lines. He also plays the Ravager-turned-Guardian Kraglin, noted for yelling “Captain’s gotta teach stuff!” in the first film.\n\n\n\nThe length of his Marvel contract is unclear, but returned for Endgame. We wouldn't be surprised if he is done with Disney after that, which is a shame given his mo-cap, and non-mo-cap, performances added a lot of character to this sometimes sterile universe.\n\n\n\nfurther reading: Guardians of the Galaxy Vol. 2 - Stan Lee Cameo Explained\n\n\n\n\n\n\n\n\n\nBRADLEY COOPER\n\n\n\n\n\nVoice of Rocket\n\n\n\n\n\nFilms appeared in so far: Guardians of the Galaxy, Guardians of the Galaxy Vol. 2, Avengers: Infinity War, Avengers: Endgame\n\n\n\nConfirmed upcoming films: None\n\n\n\nFinding the right voice for Rocket was a difficult one, with various comedians, voice actors, and film stars all coming in to read test lines. In the end, Marvel went with Bradley Cooper, and we expect they got him on a long contract.\n\n\n\n\n\n\n\nVIN DIESEL\n\n\n\n\n\nVoice of Groot\n\n\n\n\n\nFilms appeared in so far: Guardians of the Galaxy, Guardians of the Galaxy Vol. 2, Avengers: Infinity War, Ralph Breaks the Internet (cameo), Avengers: Endgame\n\n\n\n\n\nConfirmed upcoming films: None... see above\n\n\n\nfurther reading: Complete Marvel Movie Release Schedule\n\n\n\n\n\n\n\n\n\nPOM KLEMENTIEFF\n\n\n\n\n\nMantis\n\n\n\n\n\nFilms appeared in so far: Guardians of the Galaxy Vol. 2, Avengers: Infinity War, Avengers: Endgame\n\n\n\nConfirmed upcoming films: See above.\n\n\n\nfurther reading - Guardians of the Galaxy Vol. 2: Complete Reference Guide\n\n\n\n\n\n\n\n\n\n\n\nKAREN GILLAN\n\n\n\n\n\nNebula\n\n\n\n\n\nFilms appeared in so far: Guardians of the Galaxy, Guardians of the Galaxy Vol. 2, Avengers: Infinity War, Avengers: Endgame\n\n\n\nConfirmed upcoming films: None\n\n\n\n\"I have so many plans for Nebula… I love Nebula,\" director James Gunn told Yahoo. \"To me, she’s the Boba Fett of the movie… She’s the one that you really dig because she’s the cool one that we need to get more of. I hope to God that we get a chance to see a lot more of Nebula.\"\n\n\n\n\n\n\n\nSYLVESTER STALLONE AND THE REST\n\n\n\n\n\nStarhawk And The 'Original' Guardians of the Galaxy\n\n\n\n\n\nFilms appeared in so far: Guardians of the Galaxy Vol. 2\n\n\n\nConfirmed upcoming films: None\n\n\n\nSly Stallone debuted as Stakar Ogord--aka Starhawk--in Vol. 2 with a brief performance that culminated in a post-credits scene. Therein, Starhawk and his shiny friend Martinex (Michael Rosenbaum) met up with Aleta Ogord (Michelle Yeoh), Charlie-27 (Ving Rhames), Krugarr and Mainframe (the latter of whom is voiced by Miley Cyrus).\n\n\n\nIn the comics, this gang were the original Guardians team that existed before Star-Lord's team. In the film universe, they are Ravager faction leaders that used to be firm friends. They have plans to steal some shit, but it remains to be seen which film that will happen in.\n\n\n\n\"My plan is to see more of him,\" director James Gunn told the Toronto Sun, talking about Sly's character, but he wouldn't be drawn on how/when this will shake out.\n\n\n\n\"I’m not sure about him appearing in Vol. 3,\" Gunn said, \"We’ll have to see about that, but it’s our plan to see more of Stallone. Kevin [Feige, MCU overlord] and I are working on what is going to become of the Marvel Cosmic Universe and where it’s going to go. We plan to see the rest of them in the future.\"\n\n\n\nThe \"rest of them\" he mentioned, presumably, are the Ravager chums that Starhawk met up with at the end. Color us intrigued.\n\n\n\nfurther reading: Guardians of the Galaxy Vol. 2 Post-Credits Scene Explained\n\n\n\n\n\n\n\n\n\nVillains\n\n\n\n\n\n\n\n\n\nJOSH BROLIN\n\n\n\n\n\nThanos\n\n\n\n\n\nFilms appeared in so far: The Avengers (cameo), Guardians of the Galaxy, Avengers: Age of Ultron (cameo), Avengers: Infinity War, Avengers: Endgame\n\n\n\nUpcoming Films: None\n\n\n\nWhile there isn’t a specific number out there, it’s assumed that Marvel has Josh Brolin on one of Marvel's heftiest contracts. He’s dominate Phase 3, for sure. After the events of Endgame, it's unlikely we'll be seeing the Mad Titan in Phase Four.\n\n\n\nfurther reading: Avengers: Endgame - How Thanos Could Be Defeated\n\n\n\n\n\n\n\n\n\n\n\nTOM HIDDLESTON\n\n\n\n\n\nLoki\n\n\n\n\n\nFilms appeared in so far: Thor, The Avengers, Thor: The Dark World, Thor: Ragnarok, Avengers: Infinity War, Avengers: Endgame\n\n\n\nConfirmed upcoming films: None, but on Disney+...\n\n\n\nHe’s believed to be on a six-film deal, so we’d expect one more appearance. But either way, death proves to be a prety loose term considering he has his own TV show set-up on Disney's new streaming service.\n\n\n\n\n\nSEBASTIAN STAN\n\n\n\n\n\nJames ‘Bucky’ Barnes / The Winter Soldier\n\n\n\n\n\nFilms appeared in so far: Captain America: The First Avenger, Captain America: The Winter Soldier, Captain America: Civil War, Black Panther (cameo), Avengers: Infinity War, Avengers: Endgame\n\n\n\nConfirmed upcoming films: Well...\n\n\n\nHe’s on a nine-film contract! That leaves three more movies on his contract, and he'll be at the center of the upcoming Falcon and The Winter Solider Disney+ series (read more on that here).\n\n\n\nWe also wrote about why sidelining Bucky and Cap's relationship in Endgame matters.\n\n\n\n\n\n\n\nELIZABETH DEBICKI\n\n\n\n\n\nAyesha\n\n\n\n\n\nFilms appeared in so far: Guardians of the Galaxy Vol. 2\n\n\n\nConfirmed upcoming films: None\n\n\n\nElizabeth Debicki's golden villainess (although, arguably, she did have an understandable motive for hating the Guardians) will obviously return at some point. Once her creation Adam [Warlock, one assumes] is cast, we'll add him to this list.\n\n\n\nWhere Marvel plans to slot them in remains a mystery.\n\n\n\n\n\n\n\nKURT RUSSELL\n\n\n\n\n\nEgo\n\n\n\n\n\nFilms appeared in so far: Guardians of the Galaxy Vol. 2\n\n\n\nConfirmed upcoming films: None\n\n\n\nHe's immortal and a Marvel character, so there's every chance that Ego's death from Guardians 2 could be undone at some point. But as far as we know, there are no further Marvel films on Russell's slate right now.\n\n\n\n\n\n\n\nMICHAEL KEATON\n\n\n\n\n\nAdrian Toomes / The Vulture\n\n\n\n\n\nFilms appeared in so far: Spider-Man: Homecoming\n\n\n\nConfirmed upcoming films: None\n\n\n\nMicheal Keaton played Adrian Toomes, aka the Vulture, in Spider-Man: Homecoming. This could well be a recurring role, especially if Sony decides to resurrect its Sinister Six flick at some point. Given his positive reception and the post-credits stinger to Homecoming, we find it highly unlikely we've seen the last of Toomes in this universe.\n\n\n\nfurther reading - Spider-Man: Homecoming Post-Credits Scenes Explained\n\n\n\n\n\n\n\n\n\n\n\nWILLIAM HURT\n\n\n\n\n\nGeneral Thaddeus ‘Thunderbolt’ Ross\n\n\n\n\n\nFilms appeared in so far: The Incredible Hulk, Captain America: Civil War, Avengers: Infinity War, Avengers: Endgame\n\n\n\nConfirmed upcoming films: None\n\n\n\nOne of the big surprises of Civil War's cast was the return of William Hurt to the MCU. Since he played an important role in that film, he could well return again. The actual length of his contract is a mystery though.\n\n\n\nfurther reading - Captain America: Civil War Reference Guide\n\n\n\n\n\n\n\n\n\n\n\nANDY SERKIS\n\n\n\n\n\nUlysses Klaue\n\n\n\n\n\nFilms appeared in so far: Avengers: Age of Ultron, Black Panther\n\n\n\nConfirmed upcoming films: None\n\n\n\nAndy Serkis' cuttlefish-hating baddie returned for a nasty supporting role in Black Panther. One that also appeared very final after Killmonger put two in his chest. It is Marvel, so anything is possible, but him getting bagged and tagged seemed like the end of the road for this former hobbit's journey.\n\n\n\nfurther reading: Andy Serkis Black Panther Interview\n\n\n\n\n\n\n\n\n\nMICHAEL B. JORDAN\n\n\n\n\n\nErik Killmonger\n\n\n\n\n\nFilms appeared in so far: Black Panther\n\n\n\nConfirmed upcoming films: None\n\n\n\nMarvel made waves when they announced that Creed star Michael B. Jordan would be joining the MCU to face off against Chadwick Boseman in Black Panther. The film saw Jordan will be reunite with his Creed and Fruitvale Station director Ryan Coogler. And honestly, we think he turned out to be the best villains Marvel ever produced. But some of that power comes in his final line about welcoming death over bondage. While, again, Marvel can undo most deaths, that one seemed too powerful to revisit. It seems pretty one and done to us.\n\n\n\n\n\n\n\nDANIEL BRUHL\n\n\n\n\n\nHelmut Zemo\n\n\n\n\n\nFilms appeared in so far: Captain America: Civil War\n\n\n\nConfirmed upcoming films: None\n\n\n\nHe's still alive at the end of Civil War, so don't rule out a comeback for Zemo at some point. However, Bruhl hasn't let slip the details of his Marvel contract at this stage.\n\n\n\nfurther reading: Captain America Civil War - Who is Zemo?\n\n\n\n\n\n\n\n\n\nCHIWETEL EJIOFOR\n\n\n\n\n\nBaron Mordo\n\n\n\n\n\nFilms appeared in so far: Doctor Strange\n\n\n\nConfirmed upcoming films: None\n\n\n\nChiwetel Ejiofor played one of Stephen Strange's tutors in the mystical arts in the Doctor Strange movie, building up to a huge heel turn right at the end of the movie. That post-credits scene needs to be resolved at some point.\n\n\n\nAs it stands, though, Marvel has yet to find space for Doctor Strange 2 in its slate. If/when it's finally announced, we'll be sure to update this article.\n\n\n\nfurther reading: Doctor Strange Ending Explained by Scott Derrickson\n\n\n\n\n\n\n\n\n\nMADS MIKKELSEN\n\n\n\n\n\nKaecilius\n\n\n\n\n\nFilms appeared in so far: Doctor Strange\n\n\n\nConfirmed upcoming films: None\n\n\n\nThe Hannibal star made the best of a not-particularly-great villain role in Doctor Strange, but if he has any Marvel plans beyond that, they're being kept under wraps. We wouldn't be surprised if he was a one-and-done baddie, to be honest.\n\n\n\nfurther reading: Doctor Strange - Complete Reference and Marvel Easter Egg Guide\n\n\n\n\n\n\n\n\n\nCATE BLANCHETT\n\n\n\n\n\nHela\n\n\n\n\n\nFilms appeared in so far: Thor: Ragnarok\n\n\n\nConfirmed upcoming films: None\n\n\n\nBlanchett played the Goddess of Death in Thor 3. We'll keep you posted on that front, because she was a hammy good time in Thor, and her fate seemed ambigiuous as Asgard went boom, to say the least.\n\n\n\nfurther reading: Thor: Ragnarok Ending Explained\n\n\n\n\n\n\n\n\n\nFRANK GRILLO\n\n\n\n\n\nBrock Rumlow / Crossbones\n\n\n\n\n\nFilms appeared in so far: Captain America: The Winter Soldier, Captain America: Civil War, Avengers: Endgame\n\n\n\nConfirmed upcoming films: None\n\n\n\nAfter Winter Soldier came out, Grillo told Collider this: “I have a multi-contract deal with Marvel. The movie was an origin film for that character. If you know the comic, he has a significant presence. So, knock wood. With Marvel, you can’t say very much, but I’m cautiously optimistic that we’ll have some fun in the next few Marvel movies.”\n\n\n\nCould he somehow bounce back despite the very explode-y events of Civil War and his Endgame cameo? Time will tell, but it seems unlikely.\n\n\n\nfurther reading: Frank Grillo and James DeMonaco Interview\n\n\n\n\n\n\n\n\n\nMICHAEL CHERNUS\n\n\n\n\n\nPhineas Mason / Tinkerer\n\n\n\n\n\nFilms appeared in so far: Spider-Man: Homecoming\n\n\n\nConfirmed upcoming films: None\n\n\n\nA recognizable, if fairly minor, Spider-Man villain, Michael Chernus' (Orange is the New Black) Tinkerer will likely be on hand to help more baddies in the future.\n\n\n\n\n\n\n\nBOKEEM WOODBINE\n\n\n\n\n\nHerman Schultz / Shocker\n\n\n\n\n\nFilms appeared in so far: Spider-Man: Homecoming\n\n\n\nConfirmed upcoming films: None\n\n\n\nHe barely became the Shocker in Spider-Man: Homecoming. Marvel has to have bigger plans for this guy, right?\n\n\n\nfurther reading: Who is the Shocker?\n\n\n\n\n\n\n\n\n\n\n\nHUGO WEAVING/Ross Marquand\n\n\n\n\n\nJohann Shmidt / Red Skull\n\n\n\n\n\nFilms appeared in so far: Captain America: The First Avenger, Avengers: Infinity War, Avengers: Endgame\n\n\n\nConfirmed upcoming films: None\n\n\n\nHugo Weaving told Collider: “I [signed a multi-picture deal] for Captain America. I think the tendency, with those films, would be to probably not bring a villain back. […] And it’s not something I would want to do again. I’m glad I did it. I did sign up for a number of pictures and I suppose, contractually, I would be obliged to, if they forced me to, but they wouldn’t want to force someone to do it, if they didn’t want to. I think I’ve done my dash with that sort of film.”\n\n\n\nWe probably won’t see him again.\n\n\n\nS.H.I.E.L.D. Personnel (and retirees)\n\n\n\n\n\n\n\n\n\nSAMUEL L. JACKSON\n\n\n\n\n\nNick Fury\n\n\n\n\n\nFilms appeared in so far: Iron Man (cameo), Iron Man 2, Thor (cameo), Captain America: The First Avenger (cameo), The Avengers, Captain America: The Winter Soldier, Avengers: Age of Ultron (cameo), Avengers: Infinity War (cameo), Captain Marvel, Avengers: Endgame\n\n\n\nConfirmed upcoming films: None\n\n\n\nSamuel L. Jackson just stole scenes in Captain Marvel. There's no way Fury is ready to retire yet.\n\n\n\nfurther reading: Captain Marvel Behind-the-Scenes Photos and Video Reveal Nick Fury\n\n\n\n\n\nCLARK GREGG\n\n\n\n\n\nPhil Coulson\n\n\n\n\n\nFilms appeared in so far: Iron Man, Iron Man 2, \"The Consultant\" (short), \"A Funny Thing Happened on the Way to Thor’s Hammer\" (short), Thor, The Avengers, Captain Marvel\n\n\n\nConfirmed upcoming films: None\n\n\n\nAs you already know, Coulson has been reprised by Clark Gregg in Agents Of SHIELD. He played a younger version of Coulson in the '90s-set Captain Marvel. But in the current movies timeline, he low-key appears to be as dead as Jacob Marley.\n\n\n\n\n\n\n\n\n\n\n\nCOBIE SMULDERS\n\n\n\n\n\nMaria Hill\n\n\n\n\n\nFilms appeared in so far: The Avengers, Captain America: The Winter Soldier, Avengers: Age of Ultron, Avengers: Infinity War (cameo), Avengers: Endgame\n\n\n\nConfirmed upcoming films: None\n\n\n\nAt the time of The Avengers, Smulders said she was signed on for “plus this one, seven more I think.” By our counting, she should have one film left by now. Two if her Infinity War cameo doesn't count.\n\n\n\nHer next Marvel appearance is currenly unknown.\n\n\n\n\n\nHAYLEY ATWELL\n\n\n\n\n\nPeggy Carter\n\n\n\n\n\nFilms appeared in so far: Captain America: The First Avenger, \"Agent Carter\" (short), Captain America: The Winter Soldier, Avengers: Age of Ultron, Ant-Man (cameo), Avengers: Endgame (cameo)\n\n\n\nConfirmed upcoming films: None\n\n\n\nWith Peggy Carter dead in the modern timeline, it's not seeming likely that Hayley Atwell will return in any more big screen Marvel films. There could feasibly be more flashbacks, but there are no plans at present of which we know.\n\n\n\nfurther reading: Agent Carter Producers Still Want to Bring Show Back\n\n\n\n\n\n\n\n\n\n\n\nDOMINIC COOPER\n\n\n\n\n\nYounger Howard Stark\n\n\n\n\n\nFilms appeared in so far: Captain America: The First Avenger, \"Agent Carter\" (short)\n\n\n\nConfirmed upcoming films: None\n\n\n\nWe’d wager that Marvel may have had Dominic Cooper on a one-film deal, seeing as they don’t seem to have plans to return to the WWII era on the big screen. His appearances on the Agent Carter TV series prove that he's game for more if Marvel is, however.\n\n\n\nfurther reading - Captain America: The First Avenger Reference Guide\n\n\n\n\n\n\n\n\n\n\n\nJOHN SLATTERY\n\n\n\n\n\nOlder Howard Stark\n\n\n\n\n\nFilms appeared in so far: Iron Man 2, Ant-Man (cameo), Captain America: Civil War, Avengers: Endgame\n\n\n\nConfirmed upcoming films: None\n\n\n\nHow’s that for a gap between appearances? Marvel may not have John Slattery on a massive contract, but he could pop up again if Marvel delves into more flashbacks.\n\n\n\nfurther reading - Captain America: Civil War Review\n\n\n\n\n\n\n\n\n\n\n\nMICHAEL DOUGLAS\n\n\n\n\n\nHank Pym\n\n\n\n\n\nFilms appeared in so far: Ant-Man, Ant-Man and the Wasp, Avengers: Endgame\n\n\n\nConfirmed upcoming films: None\n\n\n\nA de-aged Michael Douglas appears in Endgame. We doubt that this is the end for Dr. Pym.\n\n\n\nfurther reading: Ant-Man Review\n\n\n\n\n\n\n\n\n\nMICHELLE PFEIFFER\n\n\n\n\n\nJanet Van Dyne\n\n\n\n\n\nFilms appeared in so far: Ant-Man and the Wasp, Avengers: Endgame\n\n\n\nConfirmed upcoming films: None\n\n\n\nMichelle Pfeiffer is superhero movie royalty after appearing in Batman Returns and was more or less treated like it in her brief but memorable scenes from Ant-Man and the Wasp. In the superhero romp, she is Hank's long lost wife and Hope's long lost mother, who is rescued from the Quantum Realm where she's survived for 30 years. While it is left vague how she survived, the experience has left her clearly changed, complete with subatomic powers that allow her to heal the antagonistic Ghost of an agony that is killing her.\n\n\n\nfurther reading: Ant-Man and the Wasp Review\n\n\n\n\n\nClearly Marvel has plans for Janet down the road, as does Ms. Pfeiffer. So that makes her supposed death at the end of Ant-Man and the Wasp seem like a mere technicality until we get more answers in another sequel.\n\n\n\n\n\n\n\nHANNAH JOHN-KAMEN\n\n\n\n\n\nGhost\n\n\n\n\n\nFilms appeared in so far: Ant-Man and the Wasp\n\n\n\nConfirmed upcoming films: None\n\n\n\nTechnically a villain, but not really, Hannah John-Kaman's antagonist in Ant-Man and the Wasp was the first antagonist who was almost entirely justified in everything she did... nor did she ever actually do anything too irredeemable. It is why we cannot place her in the villain column, and we imagine neither will Marvel in the longrun. As a woman cursed with phasing powers because of her father's failed experiments (and maybe Hank Pym's arrogance?), she is spared a horrible death by Janet and parts way with the heroes as... well not enemies, at least.\n\n\n\nfurther reading: Ant-Man and the Wasp Director Talks Post-Credits Scene\n\n\n\n\n\nIt would seem likely Marvel will not leave an anti-heroine around with a cool costume and powers.\n\n\n\n\n\nEMILY VAN CAMP\n\n\n\n\n\nSharon Carter / Agent 13\n\n\n\n\n\nFilms appeared in so far: Captain America: The Winter Soldier, Captain America: Civil War\n\n\n\nConfirmed upcoming films: None\n\n\n\n\"They're just sort of planting the seed for this character,\" Van Camp told MTV. \"I think Marvel likes to sprinkle little bits of things for fans, and anyone who is a Captain America fan will know that Agent 13 is Sharon Carter.\"\n\n\n\nfurther reading: Captain America: The Winter Soldier Review\n\n\n\n\n\nWhile she hasn't told the world how long her contract is, we'd expect her to be back multiple times.\n\n\n\n\n\nAARON HIMELSTEIN\n\n\n\n\n\nCameron Klein\n\n\n\n\n\nFilms appeared in so far: Captain America: The Winter Soldier, Avengers: Age of Ultron\n\n\n\nConfirmed upcoming films: None\n\n\n\nThe unsung hero of two Marvel films--he refused to launch the ships for Brock Rumlow in The Winter Soldier and got those Helicarrier’s \"full of people\" in Age of Ultron. Unsurprisingly, there’s no word out there on whether Marvel has signed Aaron Himelstein up for more appearances yet.\n\n\n\nAt the very least, Marvel could recruit him for TV. Or could he be a second-generation Coulson-alike, recruiting new heroes for the greater good in Phase 3? Okay, our S.H.I.E.L.D. speculation may have gone too far.\n\n\n\nSupporting Stars\n\n\n\n\n\n\n\n\n\nANTHONY HOPKINS\n\n\n\n\n\nOdin\n\n\n\n\n\nFilms appeared in so far: Thor, Thor: The Dark World, Thor: Ragnarok\n\n\n\nConfirmed upcoming films: None\n\n\n\nThat scene in Ragnarok seemed pretty final, didn't it? Not unless he's just \"sleeping\" again. It's not like Odin has proven himself to be very forthright or trustworthy when it comes to sweating the details of things.\n\n\n\nfurther reading: Thor: Ragnarok Review\n\n\n\n\n\n\n\n\n\nSETH GREEN\n\n\n\n\n\nHoward The Duck\n\n\n\n\n\nFilms appeared in so far: Guardians of the Galaxy (cameo), Guardians of the Galaxy Vol. 2 (cameo)\n\n\n\nConfirmed upcoming films: None\n\n\n\nIt's unclear if Seth Green is on any sort of official contract, but MCU overlord Kevin Feige was quoted as saing this this recently: \"You know, the fun thing about Howard is he shows up where you least expect him, so like who knows where he’s going to appear next?\"\n\n\n\nWe'd expect those cameos to keep coming, then. He's like the waterfowl version of Stan Lee.\n\n\n\nfurther reading: Howard the Duck Deserves Another Chance?\n\n\n\n\n\n\n\n\n\n\n\nGWYNETH PALTROW\n\n\n\n\n\nPepper Potts\n\n\n\n\n\nFilms appeared in so far: Iron Man, Iron Man 2, The Avengers, Iron Man 3, Spider-Man: Homecoming (cameo), Avengers: Infinity War, Avengers: Endgame\n\n\n\nConfirmed upcoming films: None\n\n\n\nWhile her contract concluded with Iron Man 3, she and Marvel have clearly come to some amicable arrangements. After seemingly (and lamely) being written out off-screen in Captain America: Civil War, she appeared for a fan-pleasing cameo in Spider-Man: Homecoming and again in Infinity War and Endgame. It's possible she could still be a friendly face in the MCU, but after Tony's fate was sealed, it likely signaled the end of Paltrow's Marvel run.\n\n\n\n\n\nNATALIE PORTMAN\n\n\n\n\n\nJane Foster\n\n\n\n\n\nFilms appeared in so far: Thor, Thor: The Dark World, Avengers: Endgame (cameo)\n\n\n\nConfirmed upcoming films: None\n\n\n\nNatalie Portman didn't return for Thor: Ragnarok. In fact, Portman told The Wall Street Journal that she's \"done\" with Marvel altogether, as far as she knows. Frankly, we were shocked when she made a cameo in Avengers: Endgame. Future involvement in the MCU seems highly unlikely for Portman.\n\n\n\n\n\n\n\nJON FAVREAU\n\n\n\n\n\nHappy Hogan\n\n\n\n\n\nFilms appeared in so far: Iron Man, Iron Man 2, Iron Man 3, Spider-Man: Homecoming, Avengers: Endgame\n\n\n\nConfirmed upcoming films: None\n\n\n\nIt came as a bit of a surprise to us--what with Jon Favreau's manifold other projects as an actor/director, including The Lion King remake--but Happy Hogan returned alongside Tony Stark in Spider-Man: Homecoming and was there to comfort the Stark family after Tony's death in Endgame.\n\n\n\n\n\n\n\nZENDAYA\n\n\n\n\n\nMichelle\n\n\n\n\n\nFilms appeared in so far: Spider-Man: Homecoming\n\n\n\nConfirmed upcoming films: Spider-Man: Far From Home\n\n\n\nAs the love interest to Tom Holland's Peter Parker, Zendaya's Michelle debuted in the 2017 solo Spidey flick. She is set to return for the 2019 sequel.\n\n\n\nfurther reading: Far From Home Cast Teases Clues\n\n\n\n\n\n\n\n\n\nDONALD GLOVER\n\n\n\n\n\nAaron Davis\n\n\n\n\n\nFilms appeared in so far: Spider-Man: Homecoming\n\n\n\nConfirmed upcoming films: None\n\n\n\nAs the uncle of the kid who will become the second Spider-Man, we doubt we've seen the last of this lovable (and ever growing in popularity) actor, writer, musician, and all around pop culture renaissance man.\n\n\n\nfurther readding: Spider-Man: Into the Spider-Verse Review\n\n\n\n\n\n\n\n\n\n\n\nJUDY GREER / ABBY RYDER FORTSON\n\n\n\n\n\nMaggie / Cassie Lang\n\n\n\n\n\nFilms appeared in so far: Ant-Man, Ant-Man and the Wasp\n\n\n\nConfirmed upcoming films: None\n\n\n\n\n\n\n\nMARISA TOMEI\n\n\n\n\n\nMay Parker\n\n\n\n\n\nFilms appeared in so far: Captain America: Civil War and Spider-Man: Homecoming, Avengers: Endgame (cameo)\n\n\n\n\n\nConfirmed upcoming films: Probably Spider-Man: Far From Home\n\n\n\nYou don't think we'll follow up on THAT ending? Hopefully her next scene will use music as well as her last.\n\n\n\n\n\n\n\nWILLIAM SADLER\n\n\n\n\n\nPresident Ellis\n\n\n\n\n\nFilms appeared in so far: Iron Man 3\n\n\n\nConfirmed upcoming films: None\n\n\n\nThe MCU's POTUS has popped up on Agents Of SHIELD since debuting in Iron Man 3. He was also seen in a photo during The Winter Soldier. It doesn't sound like Marvel is finished with him yet then.\n\n\n\n\n\n\n\nLUPITA NYONG'O\n\n\n\n\n\nNakia\n\n\n\nFilms appeared in so far: Black Panther\n\n\n\nConfirmed upcoming films: None\n\n\n\nOscar winner Lupita Nyong'o joined the MCU as Nakia, a Wakandan secret agent and patriot. It was one of several standout roles for women in that movie, and was a refreshingly meaty part in a blockbuster for Nyong'o, who has too often been cast as CG characters or voices. However, her continued involvement likely depends on Black Panther's in the MCU. But after the box office performance of Black Panther, it looks like a long continued role, indeed.\n\n\n\nfurther reading: Black Panther: Complete Reference Guide\n\n\n\n\n\n\n\n\n\nDANAI GURIRA\n\n\n\n\n\nOkoye\n\n\n\n\n\nFilms appeared in so far: Black Panther, Avengers: Infinity War, Avengers: Endgame\n\n\n\nConfirmed upcoming films: Likely Black Panther 2\n\n\n\nAs a general and head of the Dora Milaje, the serect service of Wakanda, Gurira keeps her record playing characters you don't want to mess with going.\n\n\n\nfurther reading: Ryan Coogler Wanted Back for Black Panther 2\n\n\n\n\n\n\n\n\n\nLETITA WRIGHT\n\n\n\n\n\nShuri\n\n\n\n\n\nFilms appeared in so far: Black Panther, Avengers: Infinity War, Avengers: Endgame\n\n\n\nConfirmed upcoming films: None\n\n\n\nAnother breakout star of Black Panther is the young Letita Wright, who portrays the little sister of T'Challa and is by definition a princess of Wakanda. However, she is not defined by her royal lineage, but by being potentially the smartest genius in the MCU, and a woman who can give Tony Stark a run for his money. A tech whiz with Wakanda's vibranium, she plays Q to T'Challa's Bond, designing all of his weapons. If Marvel is smart (and they're not dumb...), she's on a long contract.\n\n\n\nfurther reading: Is Shuri Alive in Avengers: Endgame?\n\n\n\n\n\n\n\n\n\nMARTIN FREEMAN\n\n\n\n\n\nEverett Ross\n\n\n\n\n\nFilms appeared in so far: Captain America: Civil War, Black Panther\n\n\n\nConfirmed upcoming films: None\n\n\n\nAh, now here is the almost certain heir apparent to Agent Coulson. After having a bit part as a CIA wiseass in Civil War, Martin Freeman was rather cleverly cast in the \"token\" role in Black Panther, and made the most of it. The odd chemistry between him and T'Challa makes Ross an almost certain lock for appearing in the eventual Black Panther sequel (there is no way he was on only a two-film contract), but we wouldn't be shocked if he starts popping up in all sorts of MCU movies after Phase Three ends, like the good ol' days of Coulson.\n\n\n\n\n\nSTELLAN SKARSGARD\n\n\n\n\n\nErik Selvig\n\n\n\n\n\nFilms appeared in so far: Thor, The Avengers, Thor: The Dark World, Avengers: Age of Ultron\n\n\n\nConfirmed upcoming films: None\n\n\n\nThe mighty Stellan Skarsgård told us exclusively that he's on a five-film deal with Marvel, and that he only has one more film to go as the scientist Erik Selvig (unless he and Marvel manage to negotiate an extension).\n\n\n\n\n\n\n\nIDRIS ELBA\n\n\n\n\n\nHeimdall\n\n\n\n\n\nFilms appeared in so far: Thor, Thor: The Dark World, Avengers: Age of Ultron, Thor: Ragnarok, Avengers: Infinity War\n\n\n\nConfirmed upcoming films: None\n\n\n\nWell...you know how this one ends.\n\n\n\n\n\n\n\nJEFF GOLDBLUM\n\n\n\n\n\nGrandmaster\n\n\n\n\n\nFilms appeared in so far: Thor: Ragnarok\n\n\n\nConfirmed upcoming films: None\n\n\n\nThe Grandmaster is chums with The Collector in the comics. In the movies, all we know is that he's played by Jeff Goldblum, he looks amazing, and he orchestrates the bout betwixt the Hulk and Thor. No clue if Goldblum signed up for more.\n\n\n\nfurther reading: Jeff Goldblum's Summary of Thor: Ragnarok\n\n\n\n\n\n\n\n\n\nTESSA THOMPSON\n\n\n\n\n\nValkyrie\n\n\n\n\n\nFilms appeared in so far: Thor: Ragnarok, Avengers: Endgame\n\n\n\nConfirmed upcoming films: none\n\n\n\nThis Creed star made a huge splash in Thor: Ragnarok, playing an ancient warrior woman who also had a touch of Han Solo scoundrel in her demeanor. Thor gives up the throne and puts Valkyrie in charge of New Asgard, which bodes well for more MCU appearences from Valkyrie.\n\n\n\nfurther reading: Tessa Thompson on Rematch with Chris Hemsworth\n\n\n\n\n\n\n\n\n\n\n\nGLENN CLOSE\n\n\n\n\n\nNova Prime\n\n\n\n\n\nFilms appeared in so far: Guardians of the Galaxy\n\n\n\nConfirmed upcoming films: None\n\n\n\nThere wasn't space for Nova Corps in Vol. 2 in the end, and it remains to be seen if/when Glenn Close and her cohorts will return to the MCU.\n\n\n\n\n\nJOHN C. REILLY\n\n\n\n\n\nRhomann Dey\n\n\n\n\n\nFilms appeared in so far: Guardians of the Galaxy\n\n\n\nConfirmed upcoming films: None\n\n\n\nSince Nova's involvement in the MCU going forward is unclear, we've no idea what the chances of John C. Reilly returning are.\n\n\n\n\n\n\n\nBENICIO DEL TORO\n\n\n\n\n\nThe Collector\n\n\n\n\n\nFilms appeared in so far: Thor: The Dark World (cameo), Guardians of the Galaxy, Avengers: Infinity War\n\n\n\nConfirmed upcoming films: none\n\n\n\nIs...is he dead?\n\n\n\n\n\n\n\nMICHAEL PENA / T.I. / DAVID DASTMALCHIAN\n\n\n\n\n\nCriminal Trio\n\n\n\n\n\nFilms appeared in so far: Ant-Man, Ant-Man and the Wasp\n\n\n\n\n\nBeyond Ant-Man and the Wasp...we have no idea.\n\n\n\n\n\n\n\n\n\nTILDA SWINTON\n\n\n\n\n\nThe Ancient One\n\n\n\n\n\nFilms appeared in so far: Doctor Strange, Avengers: Endgame\n\n\n\nConfirmed upcoming films: None\n\n\n\nSwinton's first MCU appearance came in Doctor Strange and she had a surprise role in Endgame's time travel heist. Beyond that, a cameo in Doctor Strange 2 could be a possibility.\n\n\n\n\n\n\n\nRACHEL MCADAMS\n\n\n\n\n\nChristine Palmer\n\n\n\n\n\nFilms appeared in so far: Doctor Strange\n\n\n\nConfirmed upcoming films: None\n\n\n\nIf Doctor Strange 2 does happen (which it surely will, eventually), we'd expect Rachel McAdams to return. She's not disclosed her contract details publicly.\n\n\n\n\n\n\n\nBENEDICT WONG\n\n\n\n\n\nWong\n\n\n\n\n\nFilms appeared in so far: Doctor Strange, Avengers: Infinity War, Avengers: Endgame\n\n\n\nConfirmed upcoming films: None\n\n\n\nHe was there to fight in the epic final battle of Endgame, and we imagine he'd be back for Doctor Strange 2, too.\n\n\n\nfurther reading: Avengers 4: The Best and Worst Theories", "images": ["http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/article_width/public/2017/04/guardians-of-the-galaxy-2-image-ayesha-social.jpg?itok=24HqiCST", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/8/24//mark-ruffalo-bruce-banner-avengers-green-eyes.jpg?itok=PNS_RhqE", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/4/41//ant-man_8.jpg?itok=qKYDLQNt", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/article_width/public/2017/04/4_-_hela_again.jpg?itok=kPC9bBmd", "https://cdn1us.denofgeek.com/sites/denofgeekus/files/styles/article_width/public/lupita-nyongo-black-panther_38.jpg?itok=2jec5tab", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/8/75//hank_pym_michael_douglas.png?itok=caXTIagc", "https://sb.scorecardresearch.com/p?c1=2&c2=6036152&c3=&c4=https%3A//www.denofgeek.us/us/movies/marvel/249346/marvel-studios-when-actors-contract-expire&c5=&c6=&c15=&cv=2.0&cj=1", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/8/63//star-lord_chris_pratt.jpg?itok=C5dfEOQQ", "https://cdn2us.denofgeek.com/sites/denofgeekus/files/styles/article_width/public/2016/09/chiwetel-ejiofor.jpg?itok=78sZiABn", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/8/79//judy_greer_ant_man.jpg?itok=X6koRNEI", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/8/76//cameron-klein-aaron-himelstein-and-brock-rumlow-frank-grillo-still-image-from-captain-america-the-winter-soldier-directed-by-joe-anthony-russo.-marvel-studios-2014.png?itok=x3nRCNbY", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/9/86//atwell_1.jpg?itok=CEt4U9-6", "https://pixel.quantserve.com/pixel/p-zxDb3fg08cw8W.gif?labels=_fp.event.Default", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/article_width/public/2017/04/ego.jpg?itok=jv7beDXA", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/0/07//gillan_2.jpg?itok=YP1UT5LD", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/4/98//captain_america_falcon.jpg?itok=72rTr_SB", "https://cdn1us.denofgeek.com/sites/denofgeekus/files/styles/article_width/public/2016/12/guardians-of-the-galaxy-2-mantis-pom-klementieff.png?itok=jSfytRl_", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/images/326042.jpg?itok=LWYCa5BU", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/8/64//guardians_0.jpg?itok=GWIyzHJ-", "https://cdn2us.denofgeek.com/sites/denofgeekus/themes/denofgeek_us/logo.png", "https://cdn1us.denofgeek.com/sites/denofgeekus/files/styles/article_width/public/2018/07/ghost_ant-man_hannah_john-kamen.jpg?itok=dblD-sLT", "https://cdn1us.denofgeek.com/sites/denofgeekus/files/styles/16x9_460/public/2018/08/the-affair-season-5.jpg?itok=P5Se4Pkh", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/8/78//jane_foster.jpg?itok=LmApzgBQ", "https://cdn1us.denofgeek.com/sites/denofgeekus/files/styles/article_width/public/2018/07/michelle_pfeiffer_ant-man_0.jpg?itok=2WbJFfcQ", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/4/72//scarlet_witch.jpg?itok=TZ-I1-PH", "https://cdn2us.denofgeek.com/sites/denofgeekus/files/styles/article_width/public/2016/09/michael-chernus.jpg?itok=yxPeQDKM", "https://cdn2us.denofgeek.com/sites/denofgeekus/files/styles/article_width/public/2016/09/marisa-tomei.jpg?itok=FrZQkcNp", "https://cdn1us.denofgeek.com/sites/denofgeekus/files/styles/article_width/public/tom-holland-spider-man-homecoming_47.jpg?itok=g8dEUCU8", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/8/67//groot_guardians_vin.jpg?itok=2CxoITfr", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/8/68//josh-brolin-thanos.jpg?itok=Ve6sFTVJ", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/8/69//william_hurt.jpeg?itok=AT1ogKK-", "https://cdn1us.denofgeek.com/sites/denofgeekus/files/2019/04/pbpapfht3tss2rsg5ezhe.jpg", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/8/61//rhodey.jpg?itok=0Sb_Hr_Z", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/article_width/public/2017/03/jeff_goldblum_thor_ragnorak_1.jpg?itok=jSWbLZGZ", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/1/11//drax.jpg?itok=6a3Dul8b", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/1/90//chadwick_boseman.jpg?itok=dLXFEJWe", "https://cdn1us.denofgeek.com/sites/denofgeekus/files/styles/16x9_460/public/2019/01/arrow-season-8-news.jpeg?itok=XdTd0ULd", "https://cdn2us.denofgeek.com/sites/denofgeekus/files/styles/article_width/public/2016/09/jon-favreau.jpg?itok=5iDlk-1w", "https://cdn2us.denofgeek.com/sites/denofgeekus/files/styles/article_width/public/2017/05/zendaya-spider-man-homecoming-michelle.jpg?itok=3CyVEyfh", "https://cdn1us.denofgeek.com/sites/denofgeekus/files/styles/article_width/public/2018/02/donald_glover_spider-man_homecoming.jpg?itok=tTqFeVNh", "https://cdn2us.denofgeek.com/sites/denofgeekus/files/styles/article_width/public/2018/02/black_panther_best_marvel_villain_michael_b_jordan.jpg?itok=fyrToP_K", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/9/98//emily_vancamp.jpg?itok=Jln4BAQ0", "https://cdn1us.denofgeek.com/sites/denofgeekus/files/styles/article_width/public/2016/09/bruhl.jpg?itok=_udVVw2Y", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/4/12//black-widow-in-avengers-age-of-ultron-wide-117674.jpg?itok=kMyCFvga", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/8/16//loki_0.jpg?itok=vzY6BDI-", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/4/25//ant-man_2.jpg?itok=_KaQWXGk", "https://www.facebook.com/tr?id=759786230837826&ev=PageView&noscript=1", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/winter_soldier.jpg?itok=6ras54LN", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/8/66//guardians_bradley_cooper.jpg?itok=hISZ6toU", "https://cdn2us.denofgeek.com/sites/denofgeekus/files/styles/article_width/public/2017/03/spider-man-homecoming-michael-keaton-adrian-toomes-vulture.png?itok=E0lpj1rk", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/4/91//howard-stark-captain-america.jpg?itok=4WagJ102", "https://cdn1us.denofgeek.com/sites/denofgeekus/files/styles/article_width/public/2016/09/benedict-wong.jpg?itok=K2N99Fhf", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/5/77//39_-_selvigs_blackboard.png?itok=Tcvxk8ve", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/8/74//john_slattery_howard_stark.jpg?itok=XvfUR6Y9", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/3/63//samuel_l_jackson_iron_man.jpg?itok=1W9fddyM", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/9/26//andy_serkis_avengers.jpg?itok=IQFM6l2c", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/8/77//pepper_potts.jpg?itok=pRpx2Lhd", "https://cdn1us.denofgeek.com/sites/denofgeekus/files/styles/article_width/public/2016/09/fargo-mike-milligan.jpg?itok=lZgyiV7V", "https://cdn1us.denofgeek.com/sites/denofgeekus/files/styles/article_width/public/2016/09/doctor-strange-tilda-swinton-the-ancient-one.jpg?itok=YL1GYKch", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/8/62//vision_paul_bettany.jpg?itok=dKbo3IRr", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/4/81//iron-man-3-robert-downey-jr-couch.jpg?itok=mVMWxszj", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/8/65//sean_gunn_guardians.png?itok=VeiTPq_N", "https://cdn1us.denofgeek.com/sites/denofgeekus/files/styles/article_width/public/2017/06/black-panther-shuri-glove-cannons.png?itok=2TW9HHLy", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/8/24//nova_prime.png?itok=bYZdMPb_", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/article_width/public/2017/04/howard_the_duck.png?itok=27VWCQZ3", "https://cdn2us.denofgeek.com/sites/denofgeekus/files/styles/article_width/public/2018/02/okoye_danai_gurira_black_panther.jpg?itok=TvzYoWtP", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/images/311207.jpg?itok=dv4_TZeB", "https://cdn2us.denofgeek.com/sites/denofgeekus/files/styles/16x9_460/public/main-batman.jpg?itok=ZUFTkUjt", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/4/92//winter_soldier_0.jpg?itok=CYMRP500", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/8/73//red_skull_hugo_weaving.png?itok=v5pJWVk1", "https://cdn1us.denofgeek.com/sites/denofgeekus/files/styles/article_width/public/2017/11/thorragnarokvalkyrie.jpg?itok=5lPNL7b4", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/cobie_smulders.jpg?itok=ZgAIPVh3", "https://cdn2us.denofgeek.com/sites/denofgeekus/files/styles/article_width/public/2016/09/martin-freeman-fargo.jpg?itok=bAqh_OXJ", "https://cdn1us.denofgeek.com/sites/denofgeekus/files/styles/main_wide/public/2019/04/pbpapfht3tss2rsg5ezhe.jpg?itok=FUaXDe6i", "https://cdn2us.denofgeek.com/sites/denofgeekus/files/styles/16x9_460/public/2019/05/the-alieniest-season-2-angel-of-darkness-release-date-cast-news.jpg?itok=2aLrVLH6", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/8/60//hawkeye.jpg?itok=Zv71RUdi", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/article_width/public/sylvester-stallone-expendables-3.jpg?itok=hr3-kChV", "https://cdn1us.denofgeek.com/sites/denofgeekus/files/styles/article_width/public/2016/09/mads-mikklesen-dr-strange.jpg?itok=DuLOA3nt", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/8/86//marvel_pena.jpg?itok=ORzm5QhO", "https://cdn1us.denofgeek.com/sites/denofgeekus/files/styles/article_width/public/doctor-strange-benedict-cumberbatch_0_119.jpg?itok=ZGuXftOW", "https://cdn1us.denofgeek.com/sites/denofgeekus/files/styles/article_width/public/2016/09/frank-grillo.jpg?itok=ErqBU5UT", "https://cdn1us.denofgeek.com/sites/denofgeekus/files/styles/article_width/public/2016/09/matthew-ellis.png?itok=tMs_5ev5", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/8/85//john_c._reilly.jpg?itok=6NdCy06Y", "https://cdn1us.denofgeek.com/sites/denofgeekus/files/styles/article_width/public/2016/09/benicio.jpg?itok=HsJlYpS6", "https://cdn1us.denofgeek.com/sites/denofgeekus/files/styles/16x9_460/public/2019/03/vikings-season-5-episode-20-bjorn-history-channel.jpg?itok=IgffbvyA", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/thor_main_image.jpg?itok=GqeyJVcc", "https://cdn1us.denofgeek.com/sites/denofgeekus/files/styles/article_width/public/2016/09/rachel-mcadams.jpg?itok=cah8axbT", "https://cdn2us.denofgeek.com/sites/denofgeekus/files/styles/16x9_460/public/stranger_things_season_3_dustin_steve.jpg?itok=eWcTMq2Y", "http://cdn-static.denofgeek.com/sites/denofgeek/files/styles/insert_main_wide_image/public/odin_lead_0.jpg?itok=NE-HIXTM", "https://cdn1us.denofgeek.com/sites/denofgeekus/files/styles/article_width/public/2016/09/brie-larson-marvel.jpg?itok=6aHa2SOs"], "top_img": "https://cdn1us.denofgeek.com/sites/denofgeekus/files/2019/04/pbpapfht3tss2rsg5ezhe.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.denofgeek.com/us/movies/marvel/249346/marvel-studios-when-actors-contract-expire", "title": "Marvel Studios: When Does Each Actor's Contract Expire?", "meta_data": {"twitter": {"card": "photo", "creator": "@DenofGeekUs", "image": "https://cdn1us.denofgeek.com/sites/denofgeekus/files/2019/04/pbpapfht3tss2rsg5ezhe.jpg", "url": "https://www.denofgeek.com/us/movies/marvel/249346/marvel-studios-when-actors-contract-expire", "site": "DenofGeekUS", "title": "Marvel Studios: When Does Each Actor's Contract Expire?", "description": "With Avengers: Endgame having major ramifications on the MCU, it's a good time to consider the contractual obligations of the Marvel actors."}, "og": {"site_name": "Den of Geek", "url": "https://www.denofgeek.com/us/go/249346", "title": "Marvel Studios: When Does Each Actor's Contract Expire?", "image": "https://cdn1us.denofgeek.com/sites/denofgeekus/files/2019/04/pbpapfht3tss2rsg5ezhe.jpg", "type": "article", "description": "With Avengers: Endgame having major ramifications on the MCU, it's a good time to consider the contractual obligations of the Marvel actors."}, "copyright": "Dennis Publishing Limited, licensed by Felden", "generator": "Drupal 7 (http://drupal.org)", "HandheldFriendly": "true", "viewport": "user-scalable=yes, width=device-width, maximum-scale=1.6, initial-scale=1.0", "apple-mobile-web-app-capable": "yes", "format-detection": "telephone=no", "description": "With Avengers: Endgame having major ramifications on the MCU, it's a good time to consider the contractual obligations of the Marvel actors."}, "movies": ["//www.dailymotion.com/embed/video/x6hxabb?autoPlay=1&mute=1"], "publish_date": null, "source": "https://www.denofgeek.com", "summary": ""}