{"url": "https://www.cmaworld.com/miranda-lambert-tops-list-finalists-51st-annual-cma-awards-five-nominations-little-big-town-keith-urban-follow-four/", "text": "The 2017 CMA Awards, Hosted for the 10th Time by Brad Paisley and Carrie Underwood, Airs Live from Bridgestone Arena in Nashville Wednesday, Nov. 8 at 8:00 PM/ET on the ABC Television Network\n\nNominations for CMA Broadcast Personality of the Year and Radio Station of the Year Also Revealed\n\nNASHVILLE—Miranda Lambert tops the list of nominees for “The 51st Annual CMA Awards” with five nominations. Little Big Town and Keith Urban each garner four nominations, tying for the second most nominations this year.\n\n“The talent of the past year for Country has been exceptional,” said Sarah Trahern, CMA Chief Executive Officer. It’s great to see nominee names that have graced the list before, and continue to deliver quality artistry. It’s equally thrilling to see six new names – ushering in a new generation earning their first CMA Awards nods.”\n\n“The 51st Annual CMA Awards” will be hosted by Brad Paisley and Carrie Underwood and broadcast live from Bridgestone Arena in Nashville, Wednesday, Nov. 8 (8:00-11:00 PM/ET) on the ABC Television Network.\n\nLauren Alaina, Brothers Osborne and Dustin Lynch were live in “Good Morning America’s” New York Times Square studio this morning to reveal six of the 12 categories. Following that, Brothers Osborne and Lynch announced the remaining six categories and the CMA Broadcast Awards nominees on GoodMorningAmerica.com as well as via “Good Morning America’s” Facebook page through Facebook Live and simulcast on “Good Morning America’s” YouTube channel.\n\nLambert’s name appeared more than any others this year with nominations in the Single and Song of the Year categories for “Tin Man,” produced by Frank Liddell, Eric Masse, and Glenn Worf, and written by Jack Ingram, Lambert, and Jon Randall. Masse also mix engineered the song. Lambert secured her fourth nod for Album of the Year with The Weight of These Wings, produced by Liddell, Worf, and Masse; Music Video of the Year for “Vice,” directed by Trey Fanjoy; and Female Vocalist. This is Lambert’s eleventh nomination for Female Vocalist, a category she’s won a record-setting six consecutive times (2010-2015). Lambert is the most awarded female in CMA Awards history with 12 trophies. This year’s nods bring her to a career total of 44 CMA Awards nominations.\n\nLittle Big Town’s nominations include Single, produced by Jay Joyce and mix engineered by Jason Hall and Joyce; Music Video of the Year directed by Becky Fluke and Reid Long for “Better\n\nMan”; Album of the Year for The Breaker, also produced by Joyce; and Vocal Group of the Year. This is Little Big Town’s fourth nomination for Music Video. They have been nominated in past years for “Pontoon” (2012), “Tornado” (2013), and “Girl Crush” (2015). They are seven-time CMA Awards winners and this year’s nods bring their career total to 26 nominations. Taylor Swift received her 23rd nomination for writing “Better Man,” marking her second nomination for Song of the Year and first CMA Awards nod since 2014.\n\nUrban tallied up nominations for Entertainer of the Year, Single and Music Video of the Year for “Blue Ain’t Your Color” and Male Vocalist. This is his thirteenth nomination for Male Vocalist and he is a three-time consecutive winner in this category (2004-2006). Urban is a 10-time CMA Awards winner. Songwriters for “Blue Ain’t Your Color,” Clint Lagerberg, Hillary Lindsey, and Steven Lee Olsen earned a nod for Song of the Year. “Blue Ain’t Your Color” Music Video Director Carter Smith is a first-time nominee. “Blue Ain’t Your Color” producer Dann Huff and mix engineer Chris Lord-Alge also earned nods. Urban received one nomination for Single of the Year, but can receive an additional trophy as producer.\n\nEric Church, Maren Morris, Thomas Rhett and Chris Stapleton each earned three nominations.\n\nChurch scored recognition in the Entertainer of the Year category, as well as Male Vocalist, his sixth consecutive nomination, and Musical Event of the Year for “Kill A Word” featuring first-time nominee Rhiannon Giddens. He is a three-time CMA Award winner with 25 total career nominations.\n\nReigning CMA New Artist of the Year Morris is nominated for Female Vocalist and as a featured artist with Thomas Rhett for Musical Event and Music Video for “Craving You,” which was directed by TK McKamy. This is Morris’ second nomination for Female Vocalist and first for Music Video and Musical Event. This year’s nominations bring her total CMA Awards nods to eight.\n\nThomas Rhett received nominations for Male Vocalist and Musical Event and Music Video for “Craving You” with Morris, marking his first-time noms in all three categories. He is the reigning CMA Single of the Year winner for “Die A Happy Man.”\n\nFive-time CMA Awards winner Stapleton is nominated for Entertainer of the Year, Male Vocalist and Album for From A Room: Volume 1, which was produced by Dave Cobb and Stapleton. He receives one nomination for album, but can receive an additional trophy as producer. This is Stapleton’s third consecutive nomination for Male, which he’s won the past two years. He was also nominated for Entertainer last year and won Album for Traveller in 2015. He is an 11-time CMA Awards nominee.\n\nBrothers Osborne, Sam Hunt, Lady Antebellum, Old Dominion and Jon Pardi garnered two nominations.\n\nReigning CMA Vocal Duo of the Year Brothers Osborne earns their third nomination in this category. They also received their first Music Video nod for “It Ain’t My Fault,” directed by Wes Edwards and Ryan Silver. They’ve earned five career nominations.\n\nHunt was recognized in the Single and Song categories for the record-setting “Body Like A Back Road,” produced and mix engineered by Zach Crowell, and written by Crowell, Hunt, Shane McAnally, and Josh Osborne. In 2015, Hunt received the same nods for “Take Your Time.” He is a five-time CMA Awards nominee.\n\nLady Antebellum is nominated for Vocal Group of the Year and Album for their latest effort Heart Break, produced by busbee. Their previous records Need You Now (2010) and Own The Night (2012) both received Album nods. They are a 10-time consecutive (2008-2017) Vocal Group nominee and have won the category three years back to back (2009-2011).\n\nFor the second year in a row, Old Dominion received nods for Vocal Group of the Year and New Artist of the Year. They have four career CMA nominations.\n\nAlaina, Kelsea Ballerini, Dierks Bentley, Garth Brooks, Luke Bryan, Glen Campbell, Kenny Chesney, Luke Combs, Dan + Shay, Florida Georgia Line, Giddens, Faith Hill, Jason Isbell and the 400 Unit, LOCASH, Maddie & Tae, Reba McEntire, Tim McGraw, Willie Nelson, P!nk, Rascal Flatts, Swift, Underwood, Brett Young and Zac Brown Band each received one nomination for trophies that will be handed out on Country Music’s Biggest Night™.\n\nReigning CMA Entertainer of the Year Brooks returns with his 12th nomination in the category, a title he has won five times (1991, 1992, 1997, 1998, 2016), making him the most awarded artist in this category. Two-time former Entertainer Bryan rounds out the nominees for this category.\n\nMcEntire nabbed her eighteenth nomination for Female Vocalist, a category she’s won four years consecutively (1984-1987). She is a six-time CMA Awards winner and now ties Brooks & Dunn with 50 career CMA Awards nominations. She is the most nominated female in CMA Awards history.\n\nNewcomer Pardi burst onto the Awards scene with his first two CMA nominations this year. “Dirt On My Boots,” which he co-produced with Bart\n\nButler, earned him a nod in the Single of the Year category. He receives one nomination as the artist, but can receive an additional trophy as producer. The song was mix engineered by Ryan Gore. “Dirt On My Boots” songwriters Rhett Akins, Jesse Frasure, and Ashley Gorley are also nominees. Additionally, Pardi received a New Artist of the Year nomination.\n\nOther first time CMA Awards nominees include Alaina, Combs, and Young in the New Artist of the Year category, and LOCASH in Duo. Jason Isbell and the 400 Unit debuted in Album of the Year with The Nashville Sound, produced by Cobb.\n\nThe Musician of the Year category includes Jerry Douglas (dobro), Paul Franklin (steel guitar), Huff (guitar), Mac McAnally (guitar), and Derek Wells (guitar).\n\nWinners of “The 51st Annual CMA Awards” will be determined in a final round of voting by eligible voting CMA members. The third and final ballot will be emailed to CMA members Monday, Oct. 2 . Voting for the CMA Awards final ballot ends Tuesday, Oct. 24 (6:00 PM/CT). Ballots will be tabulated by the professional services organization Deloitte & Touche LLP.\n\n\n\n2017 CMA AWARDS NOMINEES VIDEO HIGHLIGHTS PACKAGE SATELLITE COORDINATES:\n\nFeed Date: Monday, Sept. 4\n\nFeed Time: 3:00-3:30 PM/ET; 2:00-2:30 PM/CT\n\nSatellite: GALAXY 17 (Ku) Digital\n\nTransponder: 18 – Lower\n\nBandwidth: 18 MHz\n\nDownlink Freq: 12051 (V)\n\nSymbol Rate: 13.235\n\nFEC: ¾\n\nData Rate: 18.2958\n\nEncoder: MPEG-2 DVB-S QPSK\n\nFormat: HD 1080i\n\nVideo Highlights Package Available for Download: www.CMAawards.com\n\nThe first “CMA Awards Banquet and Show” was held in 1967. The following year, the CMA Awards was broadcast on television for the first time – making it the longest running, annual music awards program on network TV. The CMA Awards have aired on ABC since 2006. ABC will be the network home of the CMA Awards and CMA’s other two television properties, “CMA Fest” and “CMA Country Christmas,” through 2021.\n\n“The 51st Annual CMA Awards” is a production of the Country Music Association. Robert Deaton is the Executive Producer and Gary Halvorson is the Director.\n\nFans can get more information on “The 51st Annual CMA Awards” at CMAawards.com and listen to nominee playlists at https://www.cmaworld.com/cma-awards/2017-official-cma-awards-playlists/.\n\n**SUGGESTED TWEET**: #CMAawards NOMINEES JUST ANNOUNCED! @MirandaLambert leads w/ 5 noms. Full list at CMAawards.com. Winners announced live 11/8 on @ABCNetwork Full list: <<LINK>>\n\n\n\nThe Final Nominees for “The 51st Annual CMA Awards” (by ballot category order):\n\nENTERTAINER OF THE YEAR\n\nGarth Brooks\n\nLuke Bryan\n\nEric Church\n\nChris Stapleton\n\nKeith Urban\n\nSINGLE OF THE YEAR\n\n(Award goes to Artist, Producer(s), and Mix Engineer(s))\n\n“Better Man” – Little Big Town\n\nProducer: Jay Joyce\n\nMix Engineers: Jason Hall, Jay Joyce\n\n“Blue Ain’t Your Color” – Keith Urban\n\nProducers: Dann Huff, Keith Urban\n\nMix Engineer: Chris Lord-Alge\n\n“Body Like A Back Road” – Sam Hunt\n\nProducer: Zach Crowell\n\nMix Engineer: Zach Crowell\n\n“Dirt On My Boots” – Jon Pardi\n\nProducers: Bart Butler, Jon Pardi\n\nMix Engineer: Ryan Gore\n\n“Tin Man” – Miranda Lambert\n\nProducers: Frank Liddell, Eric Masse, Glenn Worf\n\nMix Engineer: Eric Masse\n\nALBUM OF THE YEAR\n\n(Award goes to Artist and Producer(s))\n\nThe Breaker – Little Big Town\n\nProducer: Jay Joyce\n\nFrom A Room: Volume 1 – Chris Stapleton\n\nProducers: Dave Cobb, Chris Stapleton\n\nHeart Break – Lady Antebellum\n\nProducer: busbee\n\nThe Nashville Sound – Jason Isbell and the 400 Unit\n\nProducer: Dave Cobb\n\nThe Weight of These Wings – Miranda Lambert\n\nProducers: Frank Liddell, Glenn Worf, Eric Masse\n\nSONG OF THE YEAR\n\n(Award goes to Songwriter(s))\n\n“Better Man”\n\nSongwriter: Taylor Swift\n\n“Blue Ain’t Your Color”\n\nSongwriters: Clint Lagerberg, Hillary Lindsey, Steven Lee Olsen\n\n“Body Like A Back Road”\n\nSongwriters: Zach Crowell, Sam Hunt, Shane McAnally, Josh Osborne\n\n“Dirt On My Boots”\n\nSongwriters: Rhett Akins, Jesse Frasure, Ashley Gorley\n\n“Tin Man”\n\nSongwriters: Jack Ingram, Miranda Lambert, Jon Randall\n\nFEMALE VOCALIST OF THE YEAR\n\nKelsea Ballerini\n\nMiranda Lambert\n\nReba McEntire\n\nMaren Morris\n\nCarrie Underwood\n\nMALE VOCALIST OF THE YEAR\n\nDierks Bentley\n\nEric Church\n\nThomas Rhett\n\nChris Stapleton\n\nKeith Urban\n\nVOCAL GROUP OF THE YEAR\n\nLady Antebellum\n\nLittle Big Town\n\nOld Dominion\n\nRascal Flatts\n\nZac Brown Band\n\nVOCAL DUO OF THE YEAR\n\nBrothers Osborne\n\nDan + Shay\n\nFlorida Georgia Line\n\nLOCASH\n\nMaddie & Tae\n\nMUSICAL EVENT OF THE YEAR\n\n(Award goes to each Artist)\n\n“Craving You” – Thomas Rhett featuring Maren Morris\n\n“Funny How Time Slips Away” – Glen Campbell with Willie Nelson\n\n“Kill A Word” – Eric Church featuring Rhiannon Giddens\n\n“Setting the World on Fire” – Kenny Chesney with P!nk\n\n“Speak to a Girl” – Tim McGraw & Faith Hill\n\nMUSICIAN OF THE YEAR\n\nJerry Douglas (Dobro)\n\nPaul Franklin (Steel Guitar)\n\nDann Huff (Guitar)\n\nMac McAnally (Guitar)\n\nDerek Wells (Guitar)\n\nMUSIC VIDEO OF THE YEAR\n\n(Award goes to Artist and Director(s))\n\n“Better Man” – Little Big Town\n\nDirectors: Becky Fluke and Reid Long\n\n“Blue Ain’t Your Color” – Keith Urban\n\nDirector: Carter Smith\n\n“Craving You” – Thomas Rhett featuring Maren Morris\n\nDirector: TK McKamy\n\n“It Ain’t My Fault” – Brothers Osborne\n\nDirectors: Wes Edwards and Ryan Silver\n\n“Vice” – Miranda Lambert\n\nDirector: Trey Fanjoy\n\nNEW ARTIST OF THE YEAR\n\nLauren Alaina\n\nLuke Combs\n\nOld Dominion\n\nJon Pardi\n\nBrett Young\n\nThe Final CMA Broadcast Personality of the Year Nominees for “The 51st Annual CMA Awards” (by market size):\n\nNATIONAL\n\n“American Country Countdown” (Kix Brooks) – Cumulus\n\n“The Big D and Bubba Show” (Derek Haskins, Sean Powell, Patrick Thomas, and Carsen Humphreville) – Compass Media Networks\n\n“The Blair Garner Show” (Blair Garner) – Cumulus\n\n“The Bobby Bones Show” (Bobby Bones) – iHeartMedia\n\n“Country Gold” (Terri Clark) – Westwood One\n\nMAJOR MARKET\n\n“Bud and Broadway” (Bud Ford, Jerry Broadway, and Kelly Rebal) – WIL, St. Louis, Mo.\n\n“Michael J On Air” (Michael J. Stuehler) – WPOC, Baltimore, Md.\n\n“Mike & Amy” (Mike Chase and Amy Faust) – KWJJ, Portland, Ore.\n\n“Paul Schadt and Meg” (Paul Schadt, Meg Butterly, and Geof Knight) – WKKT, Charlotte-Gastonia-Rock Hill, N.C.\n\n“The Q Morning Zoo” (Tim Tuttle, Kevin Kline, and Erica Rico) – KKBQ, Houston-Galveston, Texas\n\nLARGE MARKET\n\n“Amanda and Jesse” (Amanda Valentine and Jesse Tack) – WUBE, Cincinnati, Ohio\n\n“The Boxer Show” (“Boxer” Brandon Nasby) – WCOL, Columbus, Ohio\n\n“Double-L” (Lois Lewis) – KWNR, Las Vegas, Nev.\n\n“The Randy, Jamie, and Jojo Show” (Randy Carroll, Jamie Martin, and JoJo Meza) – KAJA, San Antonio, Texas\n\n“Tige And Daniel” (Tige Rodgers, Daniel Baker, and Mari Mueller) – WSIX, Nashville, Tenn.\n\n“Woody and the Wake-UP Call” (Woody Johnson, Dan E. Zuko, and Kayla Hanley) – WCOL, Columbus, Ohio\n\nMEDIUM MARKET\n\nBrent Michaels – KUZZ, Bakersfield, Calif.\n\n“Cash and Bradley” (Natalie Cash and Matt Bradley) – KWEN, Tulsa, Okla.\n\n“The Dex and Mo Show” (Bill “Dex” Poindexter and Melissa “Mo” Turner) – WUSY, Chattanooga, Tenn.\n\n“New Country Mornings” (Nancy Wilson and James Frye) – WHKO, Dayton, Ohio\n\n“Tom & Becky” (Tom Owens and Becky Palmer) – WBBS, Syracuse, N.Y.\n\nSMALL MARKET\n\n“Barrett, Fox & Berry” (Bill Barrett, Tim Fox, and Tracy Berry) – KKNU, Eugene-Springfield, Ore.\n\n“Ben and Arnie” (Arnie Andrews and Ben Butler) – WCOW, La Crosse, Wis.\n\n“The Cat Pak Morning Show” (Brent Lane and Candy Cullerton) – WYCT, Pensacola, Fla.\n\n“Officer Don and DeAnn” (Don Evans and DeAnn Stephens) – WBUL, Lexington-Fayette, Ky.\n\n“Scotty & Cara in the Morning” (Scotty Cox and Cara Denis) – KCLR, Columbia, Mo.\n\nThe Final CMA Radio Station of the Year Nominees for “The 51st Annual CMA Awards” (by market size):\n\nMAJOR MARKET\n\nKPLX – Dallas-Ft. Worth, Texas\n\nKUPL – Portland, Ore.\n\nKWJJ – Portland, Ore.\n\nWIL – St. Louis, Mo.\n\nWKKT– Charlotte-Gastonia-Rock Hill, N.C.\n\nLARGE MARKET\n\nKCYY – San Antonio, Texas\n\nWCOL – Columbus, Ohio\n\nWQDR – Raleigh-Durham, N.C.\n\nWQIK – Jacksonville, Fla.\n\nWSIX – Nashville, Tenn.\n\nMEDIUM MARKET\n\nCKRY – Calgary, Alta.\n\nKXKT – Omaha-Council Bluffs, Neb.-Iowa\n\nWBBS – Syracuse, N.Y.\n\nWIVK – Knoxville, Tenn.\n\nWYRK – Buffalo-Niagara Falls, N.Y.\n\nSMALL MARKET\n\nKCLR – Columbia, Mo.\n\nKKNU – Eugene-Springfield, Ore.\n\nKORA – Bryan-College Station, Texas\n\nWCOW – La Crosse, Wis.\n\nWYCT – Pensacola, Fla.\n\n-30-", "images": ["https://www.cmaworld.com/wp-content/uploads/2016/06/menu_line_1.png", "https://www.cmaworld.com/wp-content/uploads/2016/06/menu_line_3.png", "https://www.cmaworld.com/wp-content/uploads/2017/09/artistpr17-chris-stapleton-2-245x300.jpg", "https://www.cmaworld.com/wp-content/uploads/2017/09/artistpr17-maren-morris-300x300.jpg", "https://www.cmaworld.com/wp-content/uploads/2017/09/Reba-PR-150x150.png", "https://www.cmaworld.com/wp-content/uploads/2017/09/artistpr17-little-big-town-3-200x300.jpeg", "https://www.cmaworld.com/wp-content/uploads/2017/09/artistpr17-keith-urban-2-300x200.jpg", "https://www.cmaworld.com/wp-content/uploads/2017/09/artistpr17-eric-church-200x300.jpg", "https://www.cmaworld.com/wp-content/uploads/2017/09/artistpr17-thomas-rhett-300x200.jpg", "https://www.cmaworld.com/wp-content/uploads/2017/08/Lauren-A-Dustin-photo-GMA-150x150.jpg", "https://www.cmaworld.com/wp-content/uploads/2017/06/assoc_menu.png", "https://www.cmaworld.com/wp-content/uploads/2017/09/UDPATED-PR-GMA.jpg", "https://www.cmaworld.com/wp-content/uploads/2017/09/artistpr17-miranda-lambert-3-300x293.jpg", "https://www.cmaworld.com/wp-content/uploads/2017/09/UDPATED-PR-GMA-750x500.jpg", "https://www.cmaworld.com/wp-content/uploads/2017/01/148395507212318.png", "https://www.cmaworld.com/wp-content/uploads/2018/10/CMALogoNew.png"], "top_img": "https://www.cmaworld.com/wp-content/uploads/2017/09/UDPATED-PR-GMA.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.cmaworld.com/miranda-lambert-tops-list-finalists-51st-annual-cma-awards-five-nominations-little-big-town-keith-urban-follow-four/", "title": "MIRANDA LAMBERT TOPS THE LIST OF FINALISTS FOR “THE 51st ANNUAL CMA AWARDS” WITH FIVE NOMINATIONS, LITTLE BIG TOWN & KEITH URBAN FOLLOW WITH FOUR", "meta_data": {"viewport": "width=device-width, initial-scale=1", "generator": "Powered by Visual Composer - drag and drop page builder for WordPress.", "og": {"locale": "en_US", "type": "article", "title": "MIRANDA LAMBERT TOPS THE LIST OF FINALISTS FOR \"THE 51st ANNUAL CMA AWARDS\" WITH FIVE NOMINATIONS, LITTLE BIG TOWN & KEITH URBAN FOLLOW WITH FOUR - CMA World - Country Music Association", "description": "The 2017 CMA Awards, Hosted for the 10th Time by Brad Paisley and Carrie Underwood, Airs Live from Bridgestone Arena in Nashville Wednesday, Nov. 8 at 8:00 PM/ET on the ABC Television Network Nominations for CMA Broadcast Personality of the Year and Radio Station of", "url": "https://www.cmaworld.com/miranda-lambert-tops-list-finalists-51st-annual-cma-awards-five-nominations-little-big-town-keith-urban-follow-four/", "site_name": "CMA World - Country Music Association", "updated_time": "2018-07-25T15:26:14-05:00", "image": {"identifier": "https://www.cmaworld.com/wp-content/uploads/2017/09/UDPATED-PR-GMA.jpg", "width": 1440, "height": 960}}, "article": {"section": "CMA Awards", "published_time": "2017-09-04T14:59:56-05:00", "modified_time": "2018-07-25T15:26:14-05:00"}, "twitter": {"card": "summary", "description": "The 2017 CMA Awards, Hosted for the 10th Time by Brad Paisley and Carrie Underwood, Airs Live from Bridgestone Arena in Nashville Wednesday, Nov. 8 at 8:00 PM/ET on the ABC Television Network Nominations for CMA Broadcast Personality of the Year and Radio Station of", "title": "MIRANDA LAMBERT TOPS THE LIST OF FINALISTS FOR \"THE 51st ANNUAL CMA AWARDS\" WITH FIVE NOMINATIONS, LITTLE BIG TOWN & KEITH URBAN FOLLOW WITH FOUR - CMA World - Country Music Association", "image": "https://www.cmaworld.com/wp-content/uploads/2017/09/UDPATED-PR-GMA.jpg"}, "numberOfItems": 3, "itemListOrder": "Ascending"}, "movies": [], "publish_date": 1504555196.0, "source": "https://www.cmaworld.com", "summary": ""}