{"url": "http://www.oceandraw.com/worldwide/dolly-secret/2", "text": "Dolly Parton is a country music legend, gifted with extraordinary talents since a young age. Have you noticed she is ALWAYS wearing long sleeves no matter the temperature? Ever wondered why? This is the reason…\n\nIt Started At A Young Age\n\nDolly’s upbringing certainly contributed to secrets she has kept hidden. She is passionate feminist, refuses to wear any clothes that reveal her arms, and has kept her private life on the down low despite her fame. To understand why she is the way that she is, you need to know about her childhood….\n\n\n\n\n\nSo Many Siblings!\n\nBefore fame, Parton was “dirt poor.” She was in Tennessee on January 19, 1946. Did you know she has 12 siblings?! Her father worked as a farmer and construction worker, and her mom took care of the kids. The entire family had to live in a one-room cabin.\n\nThe Church Was Her Stage\n\nThe Parton family were regular churchgoers, and it was a huge part of Dolly’s childhood. When she was just six, she began performing in front of the congregation. Two years later she was gifted her first guitar from her uncle. The rest is history! She started performing on local TV and radio shows.\n\nJohnny Cash’s Advice\n\nWhen Dolly was only 13, she sang at the legendary country music venue the Grand Ole Opry. After meeting Johnny Cash backstage, told her to never give up on her dreams, no matter how big they were. He also told her to trust her own instincts and to not get pushed around by music industry executives.\n\n\n\nMoving to Nashville\n\nAfter graduating high school in 1964, she moved to the epicenter of country music: Nashville. Despite her talent, she had a hard time at first. Parton started out by just composing songs for other artists with her uncle Bill Owens. Together they composed two top ten hits.\n\nShe Gets A Record Deal\n\nDolly signed with Monument Records when she was only 19 years old! However, their vision wasn’t exactly what Dolly had in mind for herself. They wanted her to be a squeaky clean pop artist who appealed to the teenage market. She recorded some singles, but none of them were successful.\n\nShe Makes A Change\n\nYou could definitely say the pop music world’s huge loss was country music’s gigantic gain! After Dolly composed Bill Phillips’ biggest hit ever, she went on to sing some simple harmonies for him. This allowed her to transition from pop to country music. The first two country singles she released were huge hits!\n\nOn The Wagon\n\nWith her country music career blossoming, Parton was asked to appear on The Porter Wagoner Show. This performance is considered to be the launch point for Dolly’s flourishing career. Initially, her appearance was not a success and she was actually replaced with singer Norma Jean. However, the audience came to greatly prefer Dolly and were very vocal about it.\n\nGoing Solo\n\nParton and Wagoner put out a number of songs together until she left the show in 1974. She was then signed to label RCA Victor. Her very first single, “Just Because I’m A Woman” only reached the #17 spot on the charts. She released a number of other solo singles in the late 60s, but none were as successful as the work she did with Wagoner.\n\n\n\nAt Last\n\nWagoner had an idea to help Dolly become the star she dreamed of being. He convinced her to record her own version of “Mule Skinner Blues,” originally a hit for Jimmie Rodgers. Finally, her solo career took off and the song hit #3 on the charts! She then recorded her first ever #1 single, “Joshua.” She continued to top the charts in the following years.\n\nTough Love\n\nDespite the success of their collaborations, Parton and Wagoner often clashed about the direction of Dolly’s career. Over time, it became evident that Dolly needed to leave, but Wagoner sued her for a breach of contract when she tried. In an attempt to tell him how she would always feel, she had him take a seat as she sang “I Will Always Love You.”\n\nHer Biggest Hit Yet\n\n“Coat of Many Colors,” is regarded as one of Dolly Parton’s signature songs, but it actually only reached #4. In the late 70s, she released her biggest hit ever, “Jolene”. Not only did it soar straight to the top of the country charts, but it was a big success in the UK.\n\nBack To Pop\n\nWhile she hadn’t experienced much success with pop music, that didn’t stop her from trying again in the late 70s. She first started to work with Sandy Gallin, who went on to be her manager for the next 25 years.\n\nHere She Comes Again\n\nDolly continued to aim at appealing to a more mainstream audience. She released “Here You Come Again,” which sold over 1 million copies! It just shot up to the top of the country charts and also reached number 20 on the pop charts! There was even bigger success to follow. One of her most successful songs actually weren’t composed by herself, it was written by Cynthia Weil and Barry Mann.\n\nAward Winning!\n\nIt was actually not until the late 80s that Dolly Parton became a huge star. She released the album “Trio.” It spent an amazing 5 weeks on top of the country charts! Her streak didn’t stop there! Later in 1999, she was inducted into the Country Music Hall of Fame. She went on to greate more Grammy-award winning albums with her unique Bluegrass style.\n\nWe Will Always Love Her!\n\nAs she started her career as a songwriter, it shouldn’t be shocking that some of her songs have been covered by other huge stars. Who could forget when Whitney Houston sang “I Will Always Love You,” for the film “The Bodyguard.” Also, Kenny Rogers and LeAnn Rimes have their own versions.\n\nThe Oscars Come a Calling\n\nDolly Parton hasn’t only won a series of music awards, but also she has been nominated for Academy Awards. Her song “9 to 5” was featured on the film’s soundtrack. The film actually starred Parton, Jane Fonda, and Lily Tomlin! What an all-star cast! She was nominated for an Oscar as well for a song featured in “Transamerica.” The film tells the story of a transgender woman on a road trip with her son.\n\nDinner With Dolly?\n\nThe song was about the 9 to 5 work days. It shouldn’t be surprising that Dolly Parton is a savvy entrepreneur but clearly doesn’t have to keep those hours. She has a number of investments in businesses in Eastern Tennessee, including her own Dollywood theme park! She also has a dinner theatre show called “Dolly Parton’s Dixie Stampede,” which is performed and popular all across the USA.\n\nNot Riding High\n\nYou’d think if someone owns a theme park, they would probably like roller coasters. It turns out that Dolly Parton has never ridden a single ride at Dollywood! Why? She gets motion sickness. Her motion sickness was so severe that she even got sick on the school bus as a child.\n\nA Talented Actress\n\nBesides being a talented composer and songstress, Dolly Parton is also an accomplished actress. She first dabbled in acting on “The Port Wagoner Show,” and she didn’t stop there. She starred in her own show entitled “Dolly!” and got great reviews for her performance for “The Best Little Whorehouse in Texas.” She co-starred in this film with Burt Reynolds.\n\nSignature Style\n\nIt turns out her role as Miss Mona in “The Best Little Whorehouse” wasn’t far-fetched. In the film, Dolly Parton runs the Chicken Ranch brothel. She has statted her signature look was inspired by a real-life woman of the night! She explained in an interview when she was a young girl she saw a lady with big yellow hair, bright red lipstick, and high heels. She decided that was exactly how she wanted to look.\n\nTime for Love\n\nNaturally, Dolly Parton’s life had more than just her career. She has had a very intriguing love life. She has been married to Cal Thomas Dean since 1966! That’s a long time! They got hitched in Ringgold, Georgia. Dolly changed her name to Dolly Parton Dean officially but still performs under her maiden name. Cal likes to stay out of the spotlight and has actually only seen her perform one time!\n\nTrue Romance\n\nDolly Parton and Dean never spoke about it, and let fate decide when they would have children. She spoke very candidly about it and said she wasn’t destined to be the mother of two children, but rather a mother of everyone! She also has been open about praising Dean for his romantic gestures. The couple recently renewed their wedding vows and despite the rumors they are considered one of the strongest, longest lasting couples in showbiz!\n\nA Family Affair\n\nOne very interesting fact is Dolly Parton is the godmother to Miley Cyrus! Now that Miley is all grown up, the pair has collaborated. They sang a rendition of Jolene together, and Parton acts as a source of support in her life. When the media has criticized Miley, Dolly has publically defended her.\n\nForever Young\n\nWant to know how Dolly looks so great? It is due to a mixture of good genes but also plastic surgery! If something drops, she gets a little nip and tuck. She often jokes about it and we love that! She has stated in interviews while she might look fake on the outside, she’s real “where it counts.” She really believes every woman should do whatever they want as long as they feel and look good.\n\nNot Herself?\n\nDolly Parton definitely has one of the most iconic looks in the music business. Her big blonde hair, big bosoms, coupled with her big personality is her trademark. As a joke, she actually competed in a Dolly Parton lookalike contest and lost. She said, “I didn’t even come close.” She also said many of the competitors were guys!\n\n\n\nJust Friends\n\nBecause she is rarely seen with her husband, and due to her close relationship with her female childhood friend, Parton was accused of being secretly gay by the media. There are many pictures of her with Judy Ogle holding hands. The two have been best friends since she was in 3rd grade. While Dolly has said she loves Judy, they have nothing romantic going on between them.\n\nBuilding Bridges\n\nDespite their falling out many years prior, Dolly rushed to be at Porter Wagoner’s bedside when he was battling lung cancer. He passed away when he was 80 years old. Dolly was there to support him and also so they could say goodbye. She stated in an interview this experience was extremely difficult, and she prayed for him.\n\nThe Feud That Never Was\n\nThe media spun Dolly Parton as being jealous of Whitney Houston’s success with her own rendition of “I Will Always Love You.” This couldn’t be farther from the truth! The pair often spoke of how much they liked each other! Whitney personally thanked Dolly for allowing her to sing the song, and Parton said she was honored she wanted to cover it. How cute!\n\nBook Days!\n\nGrowing up in poverty definitely led her to help other children in need when she was able to. She launched the Dollywood Foundation which allows children to get a new book every month from the time they are born until they reach kindergarten. She definitely is responsible for many bedtime stories!\n\n\n\nTeaching Tolerance\n\nDolly Parton also holds an annual Gay Day charity event at Dollywood to support the LGBT community. She says, anyone, that judges in Dollywood is committing a sin. She stated, “I try to love everybody.” We love this and we love you, Dolly!\n\nShe Once Tried to Commit Suicide\n\nWhile from the outside perspective, it might seem like she is happy and has it all. Like most of us, Dolly has had some hard times in her life and actually attempted suicide. While married, she and her husband decided to have an open relationship. When she broke up with her other man, it sent her on a downward spiral. She attempted to commit suicide, but fortunately, her Boston Terrier Popeye helped her realize she was making a huge mistake and she put down the gun.\n\nPresident Parton\n\nIt is still a giant mystery how Dolly Parton voted in the last presidential election. There are some quotes that indicate she may have supported Hillary Clinton. She also has hinted she might run for herself and jokes that she has the hair for it! She’d definitely get our vote!\n\nShe’s More Relevant Than Ever\n\nWhile Dolly is getting older, she is showing absolutely no signs of slowing down! Her most recent tour was one of her biggest ever in the USA. She also recently performed on The Voice with Miley Cyrus! It doesn’t stop there. She was also presented with the Willie Nelson Lifetime Achievement Award at the Country Music Awards. Good things just keep on coming her way!\n\nRags to Riches\n\nWhile Dolly grew up “dirt poor,” she obviously isn’t any longer! She is worth about $500 million! Wow! She earned a lot of money from royalties earned from Houston’s version of “I Will Always Love You.” She has real rags to riches story and we are so proud of her!\n\nA Tattooed Lady?\n\nThere is speculation Dolly is covered with many secret tattoos. When you think about it, how often do you see Dolly wearing a super low cut or sleeveless shirts? The reality is she does have some ink! She has a little heart that has been spotted on her cleavage. Roseanne Barr stated Dolly also showed her an “awesome” pastel bow tattoo.\n\n\n\nIt’s All in the Hair\n\nOne part of Dolly Parton’s iconic image is her hair. She actually owns and wears a number of wings. Why? She first started experimenting with wigs at a young age and found it easier to achieve different shapes and styles. She claims she never leaves her home without a wig. Whatever works for you, Dolly! We think you look great!\n\nDolly the Sheep\n\nOne of the most infamous scientific experiments ever was named after her! Dolly, the sheep was named after Dolly Parton. If you didn’t know this, don’t feel bad. We didn’t know either! The experiment occurred in 1995 when scientists created a clone sleep from a somatic cell. The scientists named it after her because of her large bust. See, it wasn’t totally random!\n\nThe Lookalike Contest Fail\n\nDolly is known for taking a risk or two. On one Halloween night, she took part in a transgender lookalike contest on Santa Monica Boulevard and lost! I bet the audience went crazy when she revealed it was actually her competing!\n\nRecreating Fond Memories\n\nAs we mentioned, Dolly was raised in a very low-income household with 12 siblings. Her childhood house in Tennessee didn’t have good plumbing or electricity. When she hit it big, she gave money to her brother Bobby to restore and improve the house. She wanted to keep it looking exactly the same, and only wanted to improve the plumbing and electricity. Interesting!\n\nBarbie Influence\n\nFor a big portion of her life, Dolly wanted to be as pretty as Barbie. Part of this stems from the fact she comes from a poor family. Her entire life she has dreamed of being beautiful and even wrote “Backwards Barbie” about it. Some lyrics include, “I wanted to be pretty more than anything in the world, like Barbie. From rags to wishes in my dreams I could have it all. I’m just a backwoods Barbie, too much makeup, too much hair. Don’t be fooled by thinkin’ that the goods are not there.”\n\nBody Art\n\nHave you heard the rumors? For years the media has speculated that Dolly Parton is secretly covered in tattoos and that is the reason why she always has her arms covered. In a recent interview, she stated, “have a few little tattoos, but they were mostly done to cover scars because I’m so fair.” Will the rumor be laid to rest now? We will see!\n\nCorn Song\n\nBefore Dolly even learned how to write, her mom helped her write songs! Even from a young age, the lyrics just came pouring out of Dolly. Her first song is called “Little Tiny Tasseltop.” Some lyrics from the song go: “Little tiny tasseltop, I love you an awful lot. Corn silk hair and big brown eyes, How you make me smile.”\n\n5,000 Songs\n\nTo this day, guess how many songs Dolly has written? The answer: more than 5,000 songs! Not all of them have been released, but Dolly tries to write a new song every two or three days. How amazing!\n\nSame-Same\n\nDolly Parton’s biggest hits? Easily her most popular songs are “Jolene” and “I Will Always Love You.” Did you know she penned both songs on the same night back in 1973? Pretty crazy, right?\n\nIslands in the Stream\n\nWhen Dolly Parton and Kenny Rogers released their song, “Islands In The Stream,” it didn’t take long for it to soar to the top of the charts. It quickly rose to become the #1 duet of all time on the CMT 100 greatest country duets. Did you know the Bee Gees actually wrote the song?\n\nNothing But A Rumor\n\nBilly Ray Cyrus credits Dolly Parton for kick-starting his career. After he released his first album, Dolly asked him to open for her in a few concerts. Once he started to open for her, his career really took off! The media speculated the two were more than just friends. When Cyrus began to apologize to Dolly for all the rumors, Dolly replied, “Honey, that sh*t sells records!”\n\nNot Far Off\n\nMany people think Dolly and her sister Stella look a lot alike. Do you agree? We do! Stella is actually also a singer who recently released a new album entitled, “Mountain Songbird.” Dolly inspired the album.\n\nHuge Fan\n\nIn 1998, Drew Barrymore spoke about Dolly’s film: “Home Fries” before it was released. Barrymore’s character was a huge fan of Dolly Parton and told her that some of her songs would appear in the film. When the film was released, it wasn’t as Dolly centered as initially thought. There were few Dolly Parton references, but the film did include some posters and pictures of her.\n\nHaving A Laugh\n\nDolly is well known for her great sense of humor. It seems like she is always making people laugh! For example, she said, “I’m not offended by all the dumb blonde jokes because I know I’m not dumb… and I also know that I’m not blonde.” She also said, “I was the first woman to burn my bra – it took the fire department four days to put it out.” Oh, my.\n\nBaaaaaaaa\n\nBack in 1995, the first mammal was cloned successfully. Why should we care? Well, they named it after Dolly! Ian Wilmut, the man who cloned the sheep, explained, “Dolly is derived from a mammary gland cell and we couldn’t think of a more impressive pair of glands than Dolly Parton’s.”\n\nBaaad Publicity\n\nAt first, when Dolly learned how the sheep got its name, she was happy! She stated, “she was called after me because she had big mammary glands. She gave me a lot of competition… but I always said there’s no such thing as baaad publicity.”\n\nA Bridge Too\n\nHaving a sheep named after your bosom is nice, and it actually is not the only thing named after Dolly’s bust. Did you know the General W.K. Wilson Jr. Bridge or the Dolly Parton bridge is another example? It is located in Mobile, Alabama.\n\nNicknames-a-plenty\n\nDolly Parton has a ton of nicknames! Some include The Smoky Mountain Songbird, The Iron Butterfly, The Queen of Country, The Backwoods Barbie, The Queen of Nashville, The Book Lady, The Leading Lady of Country, and Aunt Granny. A pretty long list, right?\n\n\n\nThick And Thin Skin\n\nWhen it comes to life, there is a lot we can learn from Dolly Parton. She has definitely made a point that having thick skin is absolutely critical to living a happy life. She believes being tough keeps bad vides out of your reach. She also very much believes in love!\n\n\n\nGreatest Love\n\nDuring a recent interview, Parton revealed, “My music is what took me everywhere I’ve been and everywhere I will go. It’s my greatest love. I can’t abandon it. I’ll always keep making records.” She truly is so passionate about what she does.\n\nBig Spender\n\nDolly Parton has learned to care a little bit less when people criticize her fashion choices. Guess what? She loves how she looks. She is very confident, and this is one reason we love her so much.\n\nRegrets\n\nFor a while now, Dolly has admitted she regrets not having children. In fact, during a recent interview with ABC news, she stated, “I used to think I should regret it. Early on, when my husband and I were dating, and then when we got married, we just assumed we would have kids. We weren’t doing anything to stop it. In fact, we thought maybe we would. We even had names if we did, but it didn’t turn out that way.”\n\nThree’s Company\n\nDid you know there was once a story about Dolly Parton, her BFF Jude and Sylvester Stallone? It is alleged the three of them got together and had a passionate threesome! Can you believe that? It is still unclear if this ever really happened or not.\n\nBesties For Life\n\nThis wasn’t the only rumor about Dolly Parton and her best friend Judy Ogle. Many people are curious if they are friends or a little more! Some people even question if Dolly is bi-sexual! In an interview, Dolly stated, ” “Judy and I have been best friends since we were like in the third and fourth grade. I mean, I love her as much as I love anybody in the whole world, but we’re not romantically involved.”\n\nHeart of the Matter\n\nEveryone is curious about Dolly Parton’s love life and specifically her relationship with her husband, Carl. In an interview with the Daily Mail, Dolly stated, “I love to flirt, and I’ve never met a man I didn’t like. Men are my weakness. Short, fat, bald or skinny – I’ve had crushes on some very unusual men but Carl knows I’ll always come home and I’m not having sex with these people – I’m just flirtin’ and having fun.”\n\nC-C-C-Changes\n\nDolly has experienced about 30 years of big boobs and it can be pretty painful! Dolly told Contact Music that she has been suffering and experiencing a ton of pain for the size of her boobs. She said in the interview, “My boobs are killing me – and I don’t know if I can stand the pain any longer. My boobs have been a trademark for me – but I’ve paid one hell of a price.”\n\nDigits Please\n\nDo you have any idea how tall Dolly Parton is? Turns out she is only 4 feet, 9 inches. You know what else? She is absolutely larger than life. Want to know her chest size? It is actually 40DD. She even has it insured! Yes, she has her chest insured! How much? A whopping $300,000 each.\n\nThat Famous Bust\n\nDolly is well known for not only her singing, appearance, songwriting abilities, but of course her chest size. And you know what? She isn’t afraid of it either. She once stated in an interview, “My boobs are fake, my hair’s fake but what is real is my voice and my heart.”\n\nBusted\n\nKids sometimes pick up on some things that adults don’t. Parton explained in an interview, “Once I was going Christmas shopping. I did my makeup completely different with dark eyebrows, and wore a short black wig, and wore different clothes than I would normally wear.” She continued, “I said something, and this group of kids said, ‘You’re Dolly Parton in a black wig!'” Her voice was a dead giveaway in this case!\n\nDisguises, Disguises\n\nSurprisingly, there was a period in Dolly’s life where she felt the need to disguise herself when she went out in public. Just like most celebrities, sometimes they want some peace and quiet in public. Dolly attempted to conceal her identity with all sorts of things like wigs and makeup. Nothing seemed to work and she was totally recognizable!\n\nThe Imagination Library\n\nDid you know in 1995 Dolly Parton started the book distribution company called “The Imagination Library.” She was actually inspired by her own father’s inability to read and write! How interesting! She started the drive in 1995, which does book donations to children under the age of 5. The goal is if they are introduced to books at a young age, they will fall in love with reading and keep reading!\n\nBusiness Savvy\n\nDolly is also a very successful businesswoman. Pretty early on her career, she created Velvet Apple Music (BMI). This allows her to own the copyrights and publish all her own songs. In addition to that, she launched her own record label in 2007 called Dolly Records. When the label was first launched, she was the only person to appear on the label. She also did all the branding. Good on you, Dolly!\n\nCrushing\n\nMost people know this a little, but Johnny Cash had a huge influence on Dolly Parton. He told her to definitely pursue a career in music, and he was her first official crush. She stated when she saw him, “I was sitting in the audience and that’s when I first knew about sex appeal… he had this tick when he moved his shoulder… and it was still sexy. It still got to me.”\n\nDream Big\n\nDolly Parton knew from a young age that she was meant to be a star. When she was only 13 she recorded the song “Puppy Love.” When she first appeared on the Grand Ole Opry, she met Johnny Cash who told her to follow her instincts and pursue a career in music.\n\nStormzy Speaks\n\nStormzy is an English hip-hop star. When she reviewd Jolene on Twitter she stated, “And Jolene sounds like she’s the baddest b to ever walk this planet.”\n\nFirst, I’m A Songwriter\n\nDolly Parton is a seriously talented songwriter! She has actually composed over 3,000 songs including “I Will Always Love You.” She is also one of few to be nominated for multiple Academy Awards, Grammys, Tony’s and Emmy Awards.", "images": ["http://d17e0fxzi1rsso.cloudfront.net/wp-content/uploads/2018/03/20132324/Body-Art.jpg", "http://static.oceandraw.com/wp-content/uploads/2018/06/06073744/It%E2%80%99s-All-in-the-Hair.jpg", "http://d17e0fxzi1rsso.cloudfront.net/wp-content/uploads/2018/03/08083854/Islands-in-the-Stream.jpg", "http://static.oceandraw.com/wp-content/uploads/2018/06/06073550/Building-Bridges.jpg", "http://static.oceandraw.com/wp-content/uploads/2018/06/06073456/A-Family-Affair.jpg", "http://static.oceandraw.com/wp-content/uploads/2019/05/14091607/Miso-20190514091607-20190514091607-340x230.jpg", "http://static.oceandraw.com/wp-content/uploads/2018/06/06073813/The-Lookalike-Contest-Fail.jpg", "http://d17e0fxzi1rsso.cloudfront.net/wp-content/uploads/2018/03/08085330/Greatest-Love.jpg", "http://d17e0fxzi1rsso.cloudfront.net/wp-content/uploads/2018/03/08084941/A-Bridge-Too.jpg", "http://static.oceandraw.com/wp-content/uploads/2019/05/16123102/Comfort-Shoe-In-Neutral-Color-20190516123102-20190516123102.jpg", "http://static.oceandraw.com/wp-content/uploads/2019/05/27083252/Pack-Your-Own-Plane-Food-20190527083252-20190527083252.jpg", "http://d2zpaw9c7ayapz.cloudfront.net/wp-content/uploads/2017/08/01095407/Besties-For-Life.jpg", "http://static.oceandraw.com/wp-content/uploads/2019/05/01173310/A-Guilt-Free-Snack-20190501173310-20190501173310-e1556733237170-340x230.png", "http://static.oceandraw.com/wp-content/uploads/2018/06/06073638/Teaching-Tolerance.jpg", "http://static.oceandraw.com/wp-content/uploads/2018/06/06073609/The-Feud-That-Never-Was.jpg", "http://static.oceandraw.com/wp-content/uploads/2018/06/06073325/The-Oscars-Come-a-Calling.jpg", "http://static.oceandraw.com/wp-content/uploads/2018/06/06073358/A-Talented-Actress.jpg", "http://d2zpaw9c7ayapz.cloudfront.net/wp-content/uploads/2017/08/15103649/Stormzy-Speaks.jpg", "http://static.oceandraw.com/wp-content/uploads/2018/06/06073337/Dinner-With-Dolly%40.jpg", "http://static.oceandraw.com/wp-content/uploads/2019/05/14091607/Miso-20190514091607-20190514091607.jpg", "http://static.oceandraw.com/wp-content/uploads/2018/06/06073145/At-Last.jpg", "http://d2zpaw9c7ayapz.cloudfront.net/wp-content/uploads/2017/12/20141115/Busted.jpg", "http://static.oceandraw.com/wp-content/uploads/2018/06/06073222/Back-to-Pop.jpg", "http://d17e0fxzi1rsso.cloudfront.net/wp-content/uploads/2018/03/08084908/Baaad-Publicity.jpg", "http://static.oceandraw.com/wp-content/uploads/2018/06/06073759/Dolly-the-Sheep.jpg", "http://static.oceandraw.com/wp-content/uploads/2018/06/06073200/Tough-Love.jpg", "http://static.oceandraw.com/wp-content/uploads/2018/07/04112822/Featured-Image-Copenhagen-340x230.jpg", "http://static.oceandraw.com/wp-content/uploads/2019/07/04083510/Is-A-Staycation-Truly-Worth-It-20190704083510-20190704083510-340x230.jpg", "http://d17e0fxzi1rsso.cloudfront.net/wp-content/uploads/2018/03/08084432/Huge-Fan.jpg", "http://d17e0fxzi1rsso.cloudfront.net/wp-content/uploads/2018/03/08085056/Nicknames-a-plenty.jpg", "http://static.oceandraw.com/wp-content/uploads/2019/06/26144404/Screen-Shot-2019-06-26-at-5.43.49-PM-20190626144403-20190626144403.png", "http://d17e0fxzi1rsso.cloudfront.net/wp-content/uploads/2018/03/08083734/5000-Songs.jpg", "http://static.oceandraw.com/wp-content/uploads/2018/06/06073539/Just-Friends.jpg", "http://static.oceandraw.com/wp-content/uploads/2018/06/06073446/True-Romance.jpg", "http://static.oceandraw.com/wp-content/uploads/2018/06/06073433/Time-for-Love.jpg", "http://static.oceandraw.com/wp-content/uploads/2018/06/24100620/It-all-started-when-she-was-young-20190124100620-20190124100620.jpg", "http://static.oceandraw.com/wp-content/uploads/2017/05/17064205/oceandraw-300x50.png", "http://d17e0fxzi1rsso.cloudfront.net/wp-content/uploads/2018/03/08085139/Thick-And-Thin-Skin.jpg", "http://d2zpaw9c7ayapz.cloudfront.net/wp-content/uploads/2017/08/01095507/Threes-Company.jpg", "http://static.oceandraw.com/wp-content/uploads/2019/06/18145055/Taylor-Is-Used-To-Breaking-Records-20190618145055-20190618145055.jpg", "http://static.oceandraw.com/wp-content/uploads/2018/06/06073245/Here-She-Comes-Again.jpg", "http://static.oceandraw.com/wp-content/uploads/2018/06/06073210/Please-Don%E2%80%99t-Take-My-Man.jpg", "http://static.oceandraw.com/wp-content/uploads/2017/05/17064205/oceandraw.png", "http://static.oceandraw.com/wp-content/uploads/2019/05/28160159/The-Wine-Diet-20190528160159-20190528160159.jpeg", "http://trc.taboola.com/1165470/log/3/unip?en=page_view", "http://d2zpaw9c7ayapz.cloudfront.net/wp-content/uploads/2017/12/20131410/Crushing.jpg", "http://d2zpaw9c7ayapz.cloudfront.net/wp-content/uploads/2017/08/01095038/Digits-Please.jpg", "http://static.oceandraw.com/wp-content/uploads/2018/06/06073045/Moving-to-Nashville.jpg", "http://d17e0fxzi1rsso.cloudfront.net/wp-content/uploads/2018/03/08082948/Barbie-Influence.jpg", "http://d17e0fxzi1rsso.cloudfront.net/wp-content/uploads/2018/03/08084315/Not-Far-Off.jpg", "http://static.oceandraw.com/wp-content/uploads/2018/06/06073525/Not-Herself%40.jpg", "http://static.oceandraw.com/wp-content/uploads/2018/06/06073658/President-Parton.jpg", "http://d17e0fxzi1rsso.cloudfront.net/wp-content/uploads/2018/03/08083419/Corn-Song.jpg", "http://static.oceandraw.com/wp-content/uploads/2018/06/06073114/She-Makes-a-Change.jpg", "https://www.facebook.com/tr?id=340372773346404&ev=PageView&noscript=1", "http://d2zpaw9c7ayapz.cloudfront.net/wp-content/uploads/2017/08/01095306/Heart-of-the-Matter.jpg", "http://static.oceandraw.com/wp-content/uploads/2018/06/06073021/Johnny-Cash-Gave-Her-Advice.jpg", "http://static.oceandraw.com/wp-content/uploads/2018/06/06073707/She%E2%80%99s-More-Relevant-Than-Ever.jpg", "http://static.oceandraw.com/wp-content/uploads/2018/06/06073422/Signature-Style.jpg", "http://static.oceandraw.com/wp-content/uploads/2018/06/06073122/On-the-Wagon.jpg", "http://static.oceandraw.com/wp-content/uploads/2018/06/06073255/Award-Winning.jpg", "http://d2zpaw9c7ayapz.cloudfront.net/wp-content/uploads/2017/08/01095611/Regrets.jpg", "http://static.oceandraw.com/wp-content/uploads/2019/05/16123102/Comfort-Shoe-In-Neutral-Color-20190516123102-20190516123102-340x230.jpg", "http://d2zpaw9c7ayapz.cloudfront.net/wp-content/uploads/2017/08/01095213/C-C-C-Changes.jpg", "http://d2zpaw9c7ayapz.cloudfront.net/wp-content/uploads/2017/08/01094511/Dream-Big.jpg", "http://static.oceandraw.com/wp-content/uploads/2019/07/04083510/Is-A-Staycation-Truly-Worth-It-20190704083510-20190704083510.jpg", "http://d2zpaw9c7ayapz.cloudfront.net/wp-content/uploads/2017/08/01094552/Business-Savvy.jpg", "http://d2zpaw9c7ayapz.cloudfront.net/wp-content/uploads/2017/08/01094332/First-Im-A-Songwriter.jpg", "http://static.oceandraw.com/wp-content/uploads/2018/06/06073718/Rags-to-Riches.jpg", "http://static.oceandraw.com/wp-content/uploads/2019/05/29131308/Velvet-Buzzsaw-20190529131308-20190529131308.jpg", "http://static.oceandraw.com/wp-content/uploads/2019/06/11100152/Murder-Mystery-20190611100151-20190611100151.jpg", "http://static.oceandraw.com/wp-content/uploads/2018/06/06073306/We-Will-Always-Love-Her.jpg", "http://static.oceandraw.com/wp-content/uploads/2018/06/06073649/She-Once-Tried-to-Commit-Suicide.jpg", "http://d2zpaw9c7ayapz.cloudfront.net/wp-content/uploads/2017/08/01094904/Disguises-Disguises.jpg", "http://static.oceandraw.com/wp-content/uploads/2018/06/06073627/Book-Days.jpg", "http://static.oceandraw.com/wp-content/uploads/2019/06/18145055/Taylor-Is-Used-To-Breaking-Records-20190618145055-20190618145055-340x230.jpg", "http://static.oceandraw.com/wp-content/uploads/2018/06/06073349/Not-Riding-High.jpg", "http://d2zpaw9c7ayapz.cloudfront.net/wp-content/uploads/2017/12/20134745/The-Imagination-Library.jpg", "http://static.oceandraw.com/wp-content/uploads/2017/07/30104927/Blueberries-340x230.jpg", "http://d2zpaw9c7ayapz.cloudfront.net/wp-content/uploads/2017/08/01095827/Big-Spender.jpg", "http://static.oceandraw.com/wp-content/uploads/2018/06/06073507/Forever-Young.jpg", "http://static.oceandraw.com/wp-content/uploads/2018/06/06073105/She-Gets-a-Record-Deal.jpg", "http://static.oceandraw.com/wp-content/uploads/2019/06/26144404/Screen-Shot-2019-06-26-at-5.43.49-PM-20190626144403-20190626144403-340x230.png", "http://d17e0fxzi1rsso.cloudfront.net/wp-content/uploads/2018/03/08084705/Baaaaaaaa.jpg", "http://d2zpaw9c7ayapz.cloudfront.net/wp-content/uploads/2017/08/01094948/That-Famous-Bust.jpg", "http://d17e0fxzi1rsso.cloudfront.net/wp-content/uploads/2018/03/20132420/Nothing-But-A-Rumor.jpg", "http://static.oceandraw.com/wp-content/uploads/2018/06/06073822/Recreating-Fond-Memories.jpg", "http://static.oceandraw.com/wp-content/uploads/2019/05/21080553/Treetop-Dining-In-Thailand-20190521080552-20190521080552.png", "http://static.oceandraw.com/wp-content/uploads/2018/06/06073726/A-Tattooed-Lady%40.jpg", "http://d17e0fxzi1rsso.cloudfront.net/wp-content/uploads/2018/03/08083746/Same-Same.jpg", "http://static.oceandraw.com/wp-content/uploads/2018/06/06073136/Going-Solo.jpg", "http://static.oceandraw.com/wp-content/uploads/2019/05/21080553/Treetop-Dining-In-Thailand-20190521080552-20190521080552-340x230.png", "http://static.oceandraw.com/wp-content/uploads/2018/06/06072953/She-Has-11-Siblings.jpg", "http://static.oceandraw.com/wp-content/uploads/2018/06/06073009/The-Church-Was-Her-Stage.jpg", "http://d17e0fxzi1rsso.cloudfront.net/wp-content/uploads/2018/03/08084607/Having-A-Laugh.jpg", "http://static.oceandraw.com/wp-content/uploads/2017/07/17151520/Raspberries-340x230.jpg"], "top_img": "http://static.oceandraw.com/wp-content/uploads/2018/06/06073718/Rags-to-Riches.jpg", "keywords": [], "authors": ["Sara K"], "canonical_link": "http://www.oceandraw.com/worldwide/dolly-secret/2", "title": "Dolly Parton Finally Reveals Secret Behind Long Sleeves And Her Rise To Fame | Page 2 of 72 | OceanDraw", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "dolly parton, my heart will go on, country music, country music superstars, jolene, nashville, miley cyrus", "og": {"locale": "en_US", "type": "article", "title": "Dolly Parton Finally Reveals Secret Behind Long Sleeves And Her Rise To Fame", "description": "So Many Siblings! Before fame, Parton was “dirt poor.” She was in Tennessee on January 19, 1946. Did you know she has 12 siblings?! Her fa...", "url": "http://www.oceandraw.com/worldwide/dolly-secret", "site_name": "OceanDraw", "updated_time": "2019-02-10T11:32:13+00:00", "image": "http://static.oceandraw.com/wp-content/uploads/2018/06/06073718/Rags-to-Riches-150x150.jpg"}, "article": {"section": "Worldwide", "published_time": "2018-06-06T09:24:43+00:00", "modified_time": "2019-02-10T11:32:13+00:00"}, "twitter": {"card": "summary", "description": "So Many Siblings! Before fame, Parton was “dirt poor.” She was in Tennessee on January 19, 1946. Did you know she has 12 siblings?! Her father...", "title": "Dolly Parton Finally Reveals Secret Behind Long Sleeves And Her Rise To Fame | Page 2 of 72 | OceanDraw", "image": "http://static.oceandraw.com/wp-content/uploads/2018/06/06073718/Rags-to-Riches.jpg"}, "generator": "WordPress 5.2"}, "movies": [], "publish_date": 1528277083.0, "source": "http://www.oceandraw.com", "summary": ""}