{"url": "https://www.cosmopolitan.com/entertainment/celebs/a8673228/prince-harry-meghan-markle-dating-timeline/", "text": "Oct. 31, 2016: The Sunday Express reports that Prince Harry has been secretly dating Suits star Meghan Markle. According to one source, Harry is “happier than he’s been for many years” and “there’s definitely chemistry between them.” Meghan’s Instagram becomes the destination for royal enthusiasts, who note the timing of a photo of two bananas spooning.\n\n\n\nGetty\n\nNov. 1, 2016: Canadian paper the Vancouver Sun publishes a Q&A with Meghan promoting her collection for retailer Reitmans. The piece is mostly about the collection, her charity work with World Vision, and her holiday plans. She makes no mention of Harry but offers this cryptic quote, “So, my cup runneth over and I’m the luckiest girl in the world!”\n\nWatch the commercial A still from Meghan’s Reitmans commercial that aired in 2016. Reitmans\n\nBoth Toronto paper Star and Us Weekly report that Harry and Meghan attended a Halloween party together in Canada following a “bait-and-switch” situation at Heathrow airport. (Meghan lives in Toronto when Suits is filming). People, meanwhile, reports that Harry has already introduced his new girlfriend to his father, Prince Charles. According to one source, “Harry is pretty serious about her and she is pretty serious about him.”\n\nMeghan at an E! event in May 2016. Getty\n\nNov. 8, 2016: Harry confirms his relationship by releasing a rare statement that includes a plea to the media and social media trolls to stop the “wave of abuse and harassment.” According to Harry, there have been “nightly legal battles” to stop papers from publishing defamatory stories while Meghan’s mother has been fighting photographers at front door.\n\nPrince Harry is worried about Ms. Markle’s safety and is deeply disappointed that he has not been able to protect her. It is not right that a few months into a relationship with him that Ms. Markle should be subjected to such a storm. He knows commentators will say this is ‘the price she has to pay’ and that ‘this is all part of the game’. He strongly disagrees. This is not a game - it is her life and his.\n\nNov. 18, 2016: Meghan posts this Mahatma Gandhi quote to her Instagram, leading many to view it as her first official response to Harry's statement on their relationship.\n\nScreenshot from Meghan’s now-deleted Instagram account. Instagram | Screenshot\n\nNov. 21, 2016: During an official visit to Antigua, Prime Minister Gaston Browne teases Harry, “I believe we are expecting a new princess soon. I want know that you are very welcome to come on your honeymoon here … there will be nowhere in the world as special to spend your honeymoon, when that day arrives.” Sources tell Us Weekly Harry was “clearly embarrassed” and even “went bright red.” Oh, Harry.\n\nHarry with the Prime Minister of Antigua on Nov. 21, 2016. Getty\n\nNov. 27, 2016: Following reports that Prince William was unhappy with Harry’s decision to go public with his relationship, Wills releases a statement through Kensington Palace to clear the air: “The Duke of Cambridge absolutely understands the situation concerning privacy and supports the need for Prince Harry to support those closest to him.\"\n\n\n\nHarry and William in London, December 2016. Getty\n\nDec. 7, 2016: While at a flower shop in Toronto, Meghan is pictured wearing a necklace with the letters “M” and “H.” According to Entertainment Tonight, the 14K gold Maya Brenner Asymmetrical Letter necklace is $240, with an additional $60 for each letter.\n\nGetty\n\nDec. 14, 2016: Google confirms that Meghan was the most-searched actress of 2016, with Brad Pitt taking top spot for actors. That same day, Meghan and Harry are spotted holding hands in public for the first time after catching The Curious Incident of the Dog in the Nighttime on London’s West End. The Sun reports that the couple, who wore his-and-hers beanies, admired Christmas lights along Piccadilly. The day before, Meghan and Harry were spotted picking out a 6-foot Christmas tree together.\n\nHarry in London, December 2016. Getty\n\nDec. 20, 2016: Us Weekly reports that Queen Elizabeth II is “fully supportive” of Harry’s relationship with Meghan. According to one source, the Queen is “delighted to see Harry in a loving relationship.”\n\n\n\nJan. 4, 2017: The Daily Mail reports that Harry and Meghan’s father met around six months ago. According to Meghan’s half-brother Thomas Markle Jr., their dad knew about the relationship from the start. “He’s pretty happy about Harry and he’s extremely proud of her,” according to Thomas. “They have an amazing relationship, they’re very close and they’ve always been.”\n\nStream It Meghan in a season six still of Suits. USA Network\n\nJan. 6, 2017: Meghan and Harry embark on their first official vacation together after spending New Year's in London. Us Weekly reports that the couple jetted off to the Norwegian fjords to catch the Northern Lights, staying with Harry's close friend, expedition guide and polar consultant Inge Solheim at his luxury property in Tromsø. According to a source at The Sun, Harry \"put a lot of thought into it and wanted to make it as romantic and special as possible.”\n\nGetty\n\nJan. 15, 2017: Harry introduces Meghan to Kate Middleton and Princess Charlotte, a source tells Us Weekly. The meeting “went well” and took place at Apartment 1A at Kensington Palace earlier in the month. No word on where Charlotte’s brother George was that day.\n\nPrince Harry, Kate Middleton, and Prince William at a briefing for Heads Together in London on Jan. 17, 2017. Getty\n\nFeb. 2, 2017: Meghan and Harry are spotted holding hands in London after dinner at the exclusive Soho House, where they reportedly first met last June through mutual friend Markus Anderson, a consultant at the private members' club. Sources tell The Sun that the actress, who is currently on a break from filming Suits, has “virtually moved in” with Harry at his cottage in Kensington Palace. One friend predicts a spring engagement: “I know that sounds a bit crazily soon, but he’s head over heels and they can’t bear to be apart.”\n\nGetty\n\nFeb. 12, 2017: Meghan returns to Instagram after a two-month break to post an inspiring quote about #NoBadEnergy.\n\nMarch 4, 2017: Meghan joins Harry at a friend’s wedding in Montego Bay, Jamaica. According to People, Meghan wore a long floral dress and sunglasses while Harry served as one of 14 ushers in a navy blue blazer and pants.\n\nGetty\n\nApril 7, 2017: In an announcement and final post, Meghan’s lifestyle website The Tig shuts down after nearly three years. “What began as a passion project (my little engine that could) evolved into an amazing community of inspiration, support, fun and frivolity. You’ve made my days brighter and filled this experience with so much joy. Keep finding those Tig moments of discovery, keep laughing and taking risks, and keep being ‘the change you wish to see in the world.’”\n\nDespite speculations that this is a sign Meghan and Harry will soon tie the knot, a source tells People that the actress’s decision to close the site is related to her filming schedule for Suits and her humanitarian work. “The Tig has been a labor of love for Meghan, but it’s a full time job,\" says the source.\n\nGetty\n\nApril 13, 2017: Harry secretly flies to Toronto to spend Easter weekend with Meghan, according to photos obtained by E! News. The site reports that Harry arrived with a large duffel bag and sported a baseball hat to hide his face outside Meghan’s building.\n\nApril 14, 2017: TMZ publishes photos of Meghan wearing a new ring on her left index finger while out in Toronto. The ring contains one important detail: the initial “H.”\n\nGetty\n\nMay 7, 2017: Meghan and Harry share their first public kiss following Harry's participation in the annual Audi Polo Challenge in Ascot, England. The smooch happened outside the polo fields on a parking lot. That same weekend, Meghan was seen cheering on the prince from the sidelines in a stylish navy blue dress and white blazer combo.\n\nDAVID HARTLEY/REX/Shutterstock\n\nDAVID HARTLEY/REX/Shutterstock\n\nMay 20, 2017: Meghan is Harry’s date at Pippa’s wedding reception, held at the Middletons' $8 million estate in Bucklebury. According to E! News, Meghan’s absence from the ceremony was per royal protocol to ensure royals like Harry don’t upstage civilian events. Following the ceremony, Harry reportedly drove straight to Kensington Palace, where Meghan had been staying for a few days, to pick up his date. FYI, church door-to-palace, it’s about a three-hour roundtrip drive, so it must be ~love.\n\nJune 12, 2017: Meghan “smiles” after being asked about Prince Harry and marriage while promoting the latest season of Suits at the 2017 ATX Television Festival in Austin, ABC News reports. Sitting with her cast, Meghan participated in a table read and stayed on topic for her entire appearance.\n\nGetty\n\nJune 19, 2017: The Daily Mail reports that Harry has given Meghan a gold ring — for her thumb. According to one source, Harry gave the ring about six weeks ago and Meghan has “happily” informed people on the set of Suits that it indeed is from the royal and that it’s actually too big for her thumb. The ring is the latest piece of jewelry Harry has given his lady, joining a collection that includes a blue and white bracelet (which matches his own), a Cartier Love bracelet, a Maya Brenner necklace with the initials “M” and “H,” and a gold arrow ring.\n\nGetty\n\nAug. 23, 2017: Us Weekly reports that Harry might have proposed to Meghan during their three-week stay in Botswana for her 36th birthday. One source notes that Harry wanted to “associate August with something joyful,” referring to the anniversary of Princess Diana’s death. Harry first visited Botswana 20 years ago shortly after Diana died and earlier this year, described the country as one “where I feel like myself than anywhere else in the world.”\n\nGetty\n\nSept. 5, 2017: Speaking to Vanity Fair in a rare interview, Meghan opens up about being “really happy and in love” with Harry. She also confirms that they met in July 2016 and managed to date under the radar for a few months before the press caught on.\n\nI can tell you that at the end of the day I think it’s really simple. We’re two people who are really happy and in love. We were very quietly dating for about six months before it became news, and I was working during that whole time, and the only thing that changed was people’s perception. Nothing about me changed. I’m still the same person that I am, and I’ve never defined myself by my relationship.\n\nIn the same interview, Meghan also says that “there will be a time” when they come forward and share more of their life together with the public, but for now, they want to keep things as private as possible. “This is for us. It’s part of what makes it so special, that it’s just ours. But we’re happy. Personally, I love a great love story.”\n\nCourtesy of Vanity Fair/Peter Lindbergh\n\nSept. 24, 2017: Meghan and Harry make their first public appearance together at an official royal event except for one minor detail: they sit 18 seats apart due to royal protocol. Still, Meghan was spotted cheering on her beau as he joined Canadian Prime Minister Justin Trudeau in opening the annual Invictus Games in Toronto, where the actress lives and films her show Suits. For the occasion, Meghan wore a burgundy Aritzia dress with a matching Mackage moto jacket.\n\nGetty\n\nSept. 25, 2017: Meghan and Harry sit together for a Wheelchair Tennis event at the Invicitus Games. The pictures are everything.\n\nGetty\n\nGetty\n\nGetty\n\nNov. 27, 2017: Prince Charles announces the engagement of Meghan and Harry, who will wed in Spring 2018.\n\nOn the news of Prince Harry and Ms. Meghan Markle's engagement, The Prince of Wales, speaking for himself and The Duchess of Cornwall, said: \"We're thrilled. We're both thrilled. We hope they'll be very happy indeed.\" — Clarence House (@ClarenceHouse) November 27, 2017\n\nIn a statement, Clarence House confirmed that Harry proposed in London in early November after receiving a blessing from Meghan's parents. The Queen and close members of the royal family were also informed.\n\nGetty\n\nGetty\n\nAccording to the announcement, Meghan and Harry will reside at Nottingham Cottage at Kensington Palace - just a 20 minute drive from Buckingham Palace, in case the Queen ever wants to drop by for tea.\n\nThe Prince of Wales is delighted to announce the engagement of Prince Harry to Ms. Meghan Markle. pic.twitter.com/zdaHR4mcY6 — Clarence House (@ClarenceHouse) November 27, 2017\n\nHarry's family release separate statements congratulating the couple on their engagement, along with Meghan's parents.\n\n\n\nThe Duke and Duchess of Cambridge said of the engagement:\n\n'We are very excited for Harry and Meghan. It has been wonderful getting to\n\nknow Meghan and to see how happy she and Harry are together.' — Kensington Palace (@KensingtonRoyal) November 27, 2017\n\nThe Queen and The Duke of Edinburgh are delighted for the couple and wish them every happiness. https://t.co/aAJ23uSbao — The Royal Family (@RoyalFamily) November 27, 2017\n\nMs. Markle's parents, Mr. Thomas Markle and Doria Ragland have wished the couple 'a lifetime of happiness.' pic.twitter.com/H4kpTgpkYE — Kensington Palace (@KensingtonRoyal) November 27, 2017\n\nHarry and Meghan's announcement also includes a brief meeting with press at Kensington Palace Gardens.\n\nWATCH: Prince Harry and Meghan Markle make first public appearance since announcing their engagement (and we get a glimpse at the ring)! pic.twitter.com/0W2AlfXVDn — TODAY (@TODAYshow) November 27, 2017\n\nGetty\n\nChris Jackson | Getty\n\nAccording to PEOPLE, Harry proposed with a three-stone diamond ring he designed with British jewelers Cleave and Company. The center stone is from Botswana while the two side stones are from Princess Diana's personal collection.\n\nIn their first joint interview since announcing their engagement, Harry and Meghan reveal to the BBC's Mishal Husain that the surprise proposal happened over a typical roast chicken dinner at their cottage.\n\nOther highlights of the interview include Harry describing their first major trip as a couple to Botswana, Meghan's reaction to the media attention surrounding her ethnicity, plans to start a family, and Meghan's relationship with the Queen's corgis. Of how he thinks his late mother, Princess Diana, would react to the engagement and Meghan, Harry says, \"I think they'd be thick as thieves. She would be over the moon, jumping up and down, so excited for me... It's days like today when I really miss having her around and miss being able to share the happy news. With the ring, I’m sure she’s with us, jumping up and down somewhere else.”\n\nDec. 15, 2017: Kensington Palace announces that Meghan and Harry will wed on May 19, 2018.\n\nHis Royal Highness Prince Henry of Wales and Ms. Meghan Markle will marry on 19th May 2018.\n\n\n\nToday's announcement follows earlier confirmation of the month of the wedding and its location at St George's Chapel, Windsor Castle. pic.twitter.com/7pgdRM90Na — Kensington Palace (@KensingtonRoyal) December 15, 2017\n\nDec. 20, 2017: Meghan joins Harry and members of the royal family for Queen Elizabeth’s annual Christmas lunch at Buckingham Palace. Meghan’s outfit, a black, white, and pink lace dress by Self-Portrait, is an instant hit with royal and fashion enthusiasts, selling out online in minutes despite only revealing just the top portion of the dress on her way into Buckingham with Harry in the driver's seat.\n\nGetty Images\n\nGetty Images\n\nDec. 21, 2017: Meghan and Harry release three official engagement photos taken by Alexi Lubomirski earlier in the week at Frogmore House, Windsor. The third photo of the couple was released as a thank you to all the “warm and generous messages they have received during such a happy time in their lives,” according to the palace.\n\nDec. 25, 2017: Breaking royal tradition, Meghan attends Christmas services with the royal family at St. Mary Magdalene Church in Sandringham. Meghan is seen with future royal relative Kate Middleton for the first time in public since the former’s engagement announcement, and the photos are absolutely wonderful.\n\nGetty Images\n\nGetty Images\n\nUpon seeing Queen Elizabeth for the first time that day, Kate and Meghan curtsy while William and Harry bow as per royal etiquette. It's Meghan's first royal curtsy in public, FYI.\n\nGetty Images\n\nAnd here it is in GIF-form!\n\nMeghan Markle demonstrates that she's mastered the royal curtsy! pic.twitter.com/VyQ3H6Eku6 — TODAY (@TODAYshow) December 25, 2017\n\nJan. 1, 2018: Meghan and Harry spend New Year’s in the French Riveria, according to The Daily Mail. The couple reportedly traveled via British Airways, boarded the flight separately, and occupied three rows of economy seats with bodyguards in tow.\n\nJan. 9, 2018: Meghan and Harry make their second official public appearance as a couple together, this time with a visit to Brixton in south London for a meeting with members of Reprezent 107.3FM, a youth radio station.\n\nPrince Harry and Ms. Meghan Markle arrive at POP Brixton to visit @ReprezentRadio 🎧 pic.twitter.com/NsxphnLDod — Kensington Palace (@KensingtonRoyal) January 9, 2018\n\nGetty\n\nJan. 18, 2018: During an official royal visit to a castle in Cardiff, Meghan and Harry are presented with a cake made entirely out of cheese. The cake, made by the Snowdonia Cheese Company in Rhyl, North Wales, was made to “celebrate their wedding and to offer our congratulations to them,” according to Simon Mercer, director of the cheese company. If you must know, the cake is made of Beechwood (a smoked cheddar), Red Storm (vintage Red Leicester), Black Bomber (extra mature cheddar), and Green Thunder (cheddar with garlic and herbs).\n\nA wedding cake made out of Welsh cheese for Harry and Meghan. pic.twitter.com/ZnEdelW0Xm — Richard Palmer (@RoyalReporter) January 18, 2018\n\nIt’s during the visit that Meghan breaks royal protocol, giving a 10-year-old fan a quick autograph. According to PEOPLE, Meghan wrote, “Hi Kaitlin,” and added a heart and smiley face.\n\nGetty\n\nJan. 22, 2018: Harry’s cousin, Princess Eugenie, announces her engagement to longtime boyfriend Jack Brooksbank. According to Buckingham Palace, the couple will tie the knot “ in the Autumn of 2018” at St. George’s Chapel in Windsor, where Meghan and Harry will wed this May.\n\nTwo days later, The Daily Mail reports that Eugenie was asked to push back her wedding date from September to October due to foreign tour dates being considered for Harry and Meghan. “There is nothing concrete yet, but it looks as if Eugenie and Jack will go for October instead,” says one source.\n\nGetty\n\nJan. 24, 2018: E! News reports that Meghan and Harry's blind date was set up by Harry's childhood friend, Violet von Westenholz (her father is also close with Harry's father, Prince Charles). According to a source, Violet, who works in PR, met Meghan through the London social scene and when Harry expressed dating woes, Violet set things in motion. Harry and Meghan's matchmaker friend, whose identity they vowed to keep secret to \"protect her privacy,\" was previously thought to have been stylist Jessica Mulroney, fashion designer Misha Nonoo, or Markus Anderson, who was spotted with the couple at the 2017 Invictus Games in Canada.\n\nGetty\n\nJan. 31, 2018: USA Network confirms that Suits will have an eighth season – but without two of its core cast members, Meghan Markle and Patrick J. Adams. USA previously confirmed that Meghan would leave the show after its seventh season.\n\nFeb. 5, 2018: Per Deadline, Lifetime announces that Parisa Fitz-Henley and Murry Fraser will play Meghan and Harry, respectively, in the upcoming TV movie, Harry & Meghan: A Royal Romance, which will tell their love story from when they first met to where they are now. Three days later, the cast shares the first photo from set:\n\nFeb. 14, 2018: During a royal tour of Scotland, Meghan breaks royal protocol and hugs a café employee instead of going with the traditional handshake.\n\nPrince Harry and Megan at @SocialBite_ today in Edinburgh. Love this pic! pic.twitter.com/KEL6KOsh0a — Phoebe Libbish (@phoebelibbishxx) February 13, 2018\n\nFeb. 28, 2018: Meghan and Kate Middleton step out for their first official royal engagement together, appearing at the inaugural Royal Foundation Forum with Prince Harry and Prince William. During the forum, Harry said, “We have different opinions and they work really well [together]. Working as family does have its challenges; of course it does. The fact that everybody is laughing shows they know exactly what’s it like… But we are stuck together for the rest of our lives.”\n\nGetty\n\nGetty\n\nMarch 2, 2018: Kensington Palace announces that 2,640 people will be invited to the grounds of Windsor Castle to watch Meghan and Harry arrive on their wedding day. The group will include 1,200 members of the public “from every corner” of the UK, 200 people from the couple’s charities, 100 students from two local schools, 610 Windsor Castle community members, and 530 members of The Royal Households and Crown Estate.\n\nMarch 8, 2018: PEOPLE reports that Meghan was secretly baptized into the Church of England in a ceremony conducted by the Archbishop of Canterbury. The quiet ceremony, which took place at St. James’s Palace in London, was attended by a few members of the royal family including Prince Harry and Charles. Queen Elizabeth II, the head of the Church of England, was not present.\n\nGetty\n\nMarch 12, 2018: Meghan and Harry are spotted sharing a little laugh after Liam Payne’s performance during a Commonwealth Day celebration at Westminster Abbey. In this video, courtesy of The Telegraph’s Anita Singh, Meghan can be seen bursting into a laugh after Harry raises his eyebrows at the end of Liam’s song.\n\nHarry and Meghan’s reaction to this Liam Payne performance is my favourite thing today pic.twitter.com/NyqN3YYXoH — Anita Singh (@anitathetweeter) March 12, 2018\n\nMarch 22, 2018: Photos of Meghan and Harry’s wedding invitations are released. Taken at the workshop of Barnard and Westwood in London, the photos confirm that Harry’s legal name, “Henry,” was printed on the invitations and that a lunch reception at St George’s will be held following the ceremony.\n\nVictoria Jones - WPA Pool/Getty Images\n\nMarch 23, 2018: Meghan and Harry make a surprise appearance in Belfast and visit the Titanic Museum and an event at the Eikon Centre in Lisburn. For security reasons, the trip was kept secret.\n\nGetty\n\nGetty\n\nGetty\n\nApril 6, 2018: Meghan and Harry step out for the Invictus Games tryouts for the UK team. Meghan’s long army green coat, the Lawson in Monterey by Babaton, is an immediate favorite among royal watchers.\n\nGetty\n\nApril 18, 2018: Meghan is the belle of CHOGM London (the Commonwealth Heads of Government Meeting), stepping out in a white, striped Altuzarra dress paired with a black blazer by Camilla and Marc. Her bag, a black-and-white creation from Orton, was also spot on. Prince Harry was also there.\n\nGetty\n\nGetty\n\nApril 19, 2018: Meghan steps out for another day of CHOGM festivities, this time wearing an LBD you’ve definitely seen before. The Jackie O Belted Dress, which Meghan paired with strappy heels, has been sported by everyone from Katherine Heigl to Kim Kardashian to Scarlett Johansson in the past decade or so. According to PEOPLE, the dress was named for former First Lady Jacqueline Kennedy Onassis and has been a go-to for celebs who haven’t been able to resist the iconic belt and cowl-neck detailing.\n\nGetty\n\nGetty\n\nApril 21, 2018: Meghan’s stylish week continues with a visit to Australia House with Prince Harry. Behold: Meghan’s green floral printed dress by Self-Portrait, which was paired with the same Alexander McQueen blazer she wore to the Endeavor Awards in February.\n\nGetty\n\nHours later, Meghan (in a different outfit) and Harry attend the Queen’s official birthday party at Royal Albert Hall. If you must know, Meghan’s stunning cape dress is by Stella McCartney; her royal blue pumps are Manolo Blahnik; and that insanely adorable clutch is Naeem Khan Armory Zodiac.\n\nGetty\n\nGetty\n\nApril 25, 2018: Two days after the birth of William’s third child, a son named Louis, Meghan joins her future brother-in-law and Harry to honor members of the Australian and New Zealand Army Corps during the ANZAC Day Dawn Service.\n\nGetty\n\nGetty\n\nOn TV, Meghan’s acting career officially comes to an end with the airing of her final episode of Suits ever. In the season seven finale, appropriately titled “Good-Bye,” Meghan’s character Rachel Zane marries on-again-off-again love interest Mike (Patrick J. Adams) and move to Seattle to run a firm together.\n\nUSA Network\n\nMay 4, 2018: Two weeks before the royal wedding, Harry’s communications secretary confirms that Meghan’s mom, Doria Ragland, will travel with the bride by car to Windsor Castle on her wedding day. It’s also revealed that Princess Diana will be a big part of the festivities, as all three of the late Princess’ siblings will be in attendance, with older sister Lady Jane Fellowes set to give a reading during the ceremony.\n\nMay 9, 2018: Madame Tussauds in both New York City and London unveil the official wax figures of Meghan and Harry ahead of their wedding day. Everyone looks pretty good!\n\nGetty\n\nGetty\n\nMay 13, 2018: Queen Elizabeth gives her final, formal consent to Meghan and Harry’s wedding. As shared by the Royal Family Twitter account, the Queen signed the Instrument of Consent herself. The important piece of paper includes a red dragon – the heraldic symbol of Wales – and the UK’s floral emblems – the rose, thistle, and shamrock. Prince Harry’s official label and three red scallops from the Spencer family Arms can also be seen.\n\nGetty\n\nLater that evening, Meghan & Harry: A Royal Romance airs on Lifetime. The movie is actually not half bad.\n\nMay 14, 2018: Meghan’s dad, Thomas Markle Sr., previously confirmed as the one who would walk her down the aisle, pulls out of the wedding following reports that he had worked with paparazzi to stage and sell photos of himself reading a picture book on Great Britain. In addition, he tells TMZ he suffered a heart attack six days prior. Kensington Palace releases a brief statement on the matter: “This is a deeply personal moment for Ms. Markle in the days before her wedding. She and Prince Harry again ask for understanding and respect to be extended to Mr. Markle in this difficult time.\n\nThe following day, Markle Sr. changes his mind. Per TMZ, Markle Sr. hated “the idea of missing one of the greatest moments in history and walking my daughter down the aisle.” Hours later, he pulls out again, this time due to doctors’ orders of heart surgery. Markle Sr. adds that his son’s open letter to Prince Harry telling him to back out of the wedding is what caused his heart attack in the first place.\n\nGetty\n\nMay 17, 2018: Meghan releases a statement via Kensington Palace on her dad. “Sadly, my father will not be attending our wedding. I have always cared for my father and hope he can be given the space he needs to focus on his health.” In the statement, Meghan thanks “everyone who has offered generous messages of support.”\n\nA statement from Ms. Meghan Markle: pic.twitter.com/TjBNarmuBU — Kensington Palace (@KensingtonRoyal) May 17, 2018\n\nLater that day, Meghan and Harry are spotted heading to wedding rehearsals in Windsor, two days before their big day.\n\nGetty\n\nMay 18, 2018: Via Kensington Palace, Meghan announces on the eve of her wedding that Prince Charles will be the one to walk her down the aisle. Charles says he “is pleased to be able to welcome Ms. Markle to The Royal Family in this way.”\n\nThe engaged couple are spotted one last time heading from Kensington Palace to Windsor Castle before Meghan and her mother arrive at Cliveden House Hotel while Harry is spotted with his brother and best man, William, outside Windsor Castle greeting crowds. While walking into the hotel, Meghan tells reporters she feels “wonderful, thank you.”\n\nGetty\n\nMs. Meghan Markle arrives at Cliveden House Hotel, accompanied by her mother Ms. Doria Ragland #RoyalWedding pic.twitter.com/SqOFhb0Wr5 — Kensington Palace (@KensingtonRoyal) May 18, 2018\n\nGetty\n\nGetty\n\nGetty\n\nGetty\n\nMay 19, 2018: Meghan and Harry are married! Meet the Duke and Duchess of Sussex:\n\nThe congregation stands as the newly-married Duke and Duchess of Sussex process through St George's Chapel #RoyalWedding pic.twitter.com/gAD70k14U0 — Kensington Palace (@KensingtonRoyal) May 19, 2018\n\nGetty\n\nGetty\n\nGetty\n\nGetty\n\nGetty\n\nGetty\n\nMay 21, 2018: Kensington Palace releases three official royal wedding portraits of the Duke and Duchess of Sussex. Two of the photos had the newlyweds pose with family and the bridal party inside the Green Drawing Room at Windsor Castle. The third photograph, in black-and-white, features the happy couple casually hanging out on some steps. All three photographs are by Alexi Lubomirski, who also took the couple’s engagement photos.\n\nMay 22, 2018: Meghan and Harry step out for their first official royal duty as the Duke and Duchess of Sussex. The occasion: Prince Charles’ 70th Birthday Patronage Celebration at Buckingham Palace Gardens. Harry gave a speech and was briefly interrupted by a bee while Meghan wore a pale pink silk crepe pencil dress by Goat.\n\nGetty\n\nGetty\n\nVery funny moment as The Duke of Sussex, watched by his new bride, gets bombed by bumblebee as he gives a warm and witty speech to mark Prince Charles’s 70th birthday pic.twitter.com/HTOeZzIJmr — Rebecca English (@RE_DailyMail) May 22, 2018\n\nJune 9, 2018: Meghan takes her place on the Buckingham Palace balcony for the very first time during the Trooping of the Colour celebrations.\n\nGetty\n\nShe reportedly broke royal protocol with her \"revealing\" off-shoulder dress. But to be honest, no one cares. I mean, how could they? She looks gorgeous!\n\nJune 26, 2018: The Duke and Duchess of Sussex don't shy away from PDA—which, to comply with royal protocol, really only goes as far as handholding and back-rubbing. While joining the Queen at the Young Leaders awards ceremony at Buckingham Palace, Harry made sure to keep it to a minimum, resulting in this awkward attempted handhold:\n\nPrince Harry and Meghan wanted to hold hands so badly 😩 pic.twitter.com/aEDi5sDBll — DeMarko Gage (@freakymarko) June 28, 2018\n\nThis is one of the most adorably awkward moments the couple has had thus far. Well, at least in the public eye.\n\nJuly 11, 2018: The pair pay an official visit to Ireland to meet all the country's highest officials. But, really, the most important person they met is three-year-old Walter Cullen during their visit to Croke Park.\n\nGetty\n\nThe little boy tried to get the Duchess' attention and reached out for her hair. And because Prince Harry is absolutely amazing with kids, he took this opportunity to pretend to scold Walter. Just look at the tot's reaction to getting caught in the act! SO CUTE!\n\nAugust 16, 2018: The couple reportedly go on a secret Italian getaway with George and Amal Clooney at their Lake Como villa. Apparently Harry spends most of this time playing basketball, while Meghan helps to look after the Clooney's twins, but these details (as well as the entire trip) have not been officially confirmed by the palace.\n\nOctober 12,. 2018: Meghan and Harry attend Princess Eugenie's wedding to Jack Brooksbank. And because of her large coat, people begin to suspect that the Duchess is hiding a baby bump under her navy blue tent silhouette.\n\nGetty\n\nOctober 15, 2018: As it turns out, our suspicions were right! On the very same day as the start of the couple's first-ever royal tour, Kensington Palace officially confirms that the Duke and Duchess of Sussex are expecting their first child. According to reports, they first broke the news to their family at Eugenie's wedding on October 12. At this point, Meghan is 12 weeks into the pregnancy. Congrats to the happy couple!\n\nTheir Royal Highnesses The Duke and Duchess of Sussex are very pleased to announce that The Duchess of Sussex is expecting a baby in the Spring of 2019. pic.twitter.com/Ut9C0RagLk — Kensington Palace (@KensingtonRoyal) October 15, 2018\n\nDespite the happy news, many people worry that the the timing of the announcement is unfortunate, as October 15 is International Pregnancy and Infant Loss Remembrance Day, \"which recognizes pregnancy loss and infant death due to causes like SIDS, miscarriage, and stillbirth.\"\n\n\n\nOctober 31, 2018: Meghan Markle wears flawless look after flawless look while on her first royal tour with Prince Harry in Australia, Fiji, Tonga, and New Zealand. \"Will they ever visit the United States?\" we hopelessly wonder from afar.\n\nPool Getty Images\n\nNovember 24, 2018: A royal source has leaked news that Harry and Meghan are moving out of Kensington Palace, and into Frogmore Cottage on the Windsor Estate early next year. This news remains unconfirmed by the palace, but it doesn't come as a surprise since the couple will soon need more room to raise their little one.\n\nInstead the Queen has given them Frogmore Cottage in Windsor. It’s within the private Home Park and faces the beautiful grounds of Frogmore House. It’s where they had their private evening wedding party & where their gorgeous engagement pictures were shot. pic.twitter.com/uByYVm7pWC — Emily Andrews (@byEmilyAndrews) November 23, 2018\n\nBut because everyone loves drama, rumors begin to swirl that the real reason behind Harry and Meghan's move is that tensions are rising between the Cambridges and the Sussexes.\n\nNovember 27, 2018: Harry and Meghan celebrate the one-year anniversary of their engagement! But they don't spend it together—in fact, they spend it rather far apart. Harry is in Zambia meeting with a group called African Parks (of which he is the president), as well as meeting with veterans and widows from the nation.\n\nDAWOOD SALIM Getty Images\n\nFollow Peggy on Twitter.\n\n", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/meghan-markle-best-looks-1553206251.jpg?crop=1.00xw:1.00xh;0,0&resize=300:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-516190816-1511967936.jpg?crop=1.00xw:0.324xh;0,0.0757xh&resize=300:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/3-1513961082.png?crop=1.00xw:0.889xh;0,0.0767xh&resize=300:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/timeline-of-harry-and-meghan-relationship-1526735271.jpg?crop=1xw:1xh;center,top&resize=1200:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/meghan-markle-prince-harry-lifetime-movie-1521470881.png?crop=1.00xw:1.00xh;0,0&resize=300:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/timeline-of-harry-and-meghan-relationship-1526735271.jpg?crop=1xw:1xh;center,top&resize=1200:*", "keywords": [], "authors": ["Peggy Truong", "Entertainment Writer", "Peggy Is Cosmopolitan.Com S Entertainment Writer", "Specializing In Leonardo Dicaprio", "This Is Us", "The Royals."], "canonical_link": "https://www.cosmopolitan.com/entertainment/celebs/a8673228/prince-harry-meghan-markle-dating-timeline/", "title": "Prince Harry and Meghan Markle Dating Timeline", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "Meghan and Harry's Love Story Will Melt Your Heart", "description": "This royal love story is a good one.", "url": "https://www.cosmopolitan.com/entertainment/celebs/a8673228/prince-harry-meghan-markle-dating-timeline/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/timeline-of-harry-and-meghan-relationship-1526735271.jpg?crop=1xw:1xh;center,top&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "modified_time": "2018-11-28 01:46:36", "published_time": "2018-11-27 09:28:00", "section": "Celebs"}, "twitter": {"site": "@Cosmopolitan", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/timeline-of-harry-and-meghan-relationship-1526735271.jpg?crop=1xw:1xh;center,top&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "Prince Harry and Meghan Markle Dating Timeline - How Did Meghan Meet Harry", "description": "From their first meeting to their engagement, here is everything to know about Prince Harry and Meghan Markle's relationship.", "keywords": "meghan markle, prince harry, timeline, meghan markle engaged, prince harry engaged, meghan markle prince harry dating timeline, meghan markle prince harry engagement announcement", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/timeline-of-harry-and-meghan-relationship-1526735271.jpg?crop=0.5xw:1xh;center,top&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebrities & Entertainment,entertainment,celebs,timeline", "sailthru.date": "2018-11-27T21:28:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/timeline-of-harry-and-meghan-relationship-1526735271.jpg?crop=1xw:1xh;center,top", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/timeline-of-harry-and-meghan-relationship-1526735271.jpg?crop=0.5xw:1xh;center,top", "sailthru.socialtitle": "Meghan and Harry's Love Story Will Melt Your Heart", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1543328880.0, "source": "https://www.cosmopolitan.com", "summary": ""}