{"url": "https://www.vanityfair.com/hollywood/2017/05/star-wars-the-last-jedi-cover-portfolio", "text": "On the Disney campus, I sat in on a postproduction meeting in which Johnson was reviewing some scenes from The Last Jedi. Teams from Industrial Light & Magic, Lucasfilm’s visual-effects division, were videoconferencing in from London, San Francisco, and Vancouver. On a big screen, Poe Dameron, Isaac’s heroic X-wing fighter pilot, was back in action, coaching a gunner named Paige, a new character played by a Vietnamese actress named Veronica Ngo. Another scene featured General Hux, the nefarious First Order commander played with spittle-flecked relish by Domhnall Gleeson. Johnson loved what he was seeing but noted the presence of some “schmutz”—smudges around the edges—on the starcraft window that Hux was looking out of. “I don’t know, does the First Order not keep its windows clean?” he asked. “Did you guys play it that way before?” He raised the question more deferentially than critically (and Ben Morris, the movie’s London-based VFX supervisor, said it would be no problem to de-schmutzify the pane). Until The Last Jedi, Johnson had never overseen a picture with a budget above $30 million. But the director betrayed no sign of being overwhelmed. He is a gifted filmmaker whose previous movies, especially Brick (his 2005 debut) and Looper, are visually distinctive and intricately plotted, the assured work of a cinema-drunk U.S.C. film-school grad who, in preparation for Episode VIII, steeped himself in World War II movies like Henry King’s Twelve O’Clock High and “funky 60s samurai stuff” like Kihachi Okamoto’s Kill! and Hideo Gosha’s Three Outlaw Samurai. Off Duty\n\nAnthony Daniels as C-3PO, with droids R2-D2 and BB-8 and the Droid Department’s Brian Herring, Dave Chapman, Matthew Denton, Lee Towersey, and Joshua Lee. Photograph by Annie Leibovitz. The anointment of Johnson as Episode VIII’s overseer is emblematic of the direction in which Kathleen Kennedy has taken Lucasfilm since she assumed the presidency of the company, in 2012, the same year that George Lucas, who had personally recruited her to take his place, sold the company to Disney. Though she reached out to Abrams, a proven wrangler of blockbuster series (Mission: Impossible, Star Trek), to initiate the current Star Wars trilogy, Kennedy has since picked filmmakers whose résumés are less important than whether or not she is a fan of their work. Kennedy cut her teeth as a Steven Spielberg protégée—in the early 80s, when she was not yet out of her 20s, he entrusted her with producing E.T.—and now she, too, is keen on giving relative unknowns their big chance. Johnson was someone she’d had her eye on for years, she told me, admiring “how deliberate he is in his storytelling and the way he moves the camera.” The final film of the trilogy, due in 2019 and for the moment assigned the simple working title Episode IX, will be directed by Colin Trevorrow, who did not yet have the big-budget feature Jurassic World under his belt when he crossed Kennedy’s radar; he came to her attention via his first feature, the 2012 indie comedy Safety Not Guaranteed, and a recommendation from her friend Brad Bird, the Pixar auteur. Off Duty\n\nCarrie Fisher (General Leia Organa), writer-director Rian Johnson, Mark Hamill (Luke Skywalker), and producer Kathleen Kennedy with Fisher’s dog, Gary, and Hamill’s daughter’s dog, Millie. Photograph by Annie Leibovitz. Part of what makes Lucasfilm’s new system work is that Kennedy has set up a formidable support structure for her filmmakers. Upon her arrival, she put together a story department at Lucasfilm’s San Francisco headquarters, overseen by Kiri Hart, a development executive and former screenwriter she has long worked with. The story group, which numbers 11 people, maintains the narrative continuity and integrity of all the Star Wars properties that exist across various platforms: animation, video games, novels, comic books, and, most important, movies. “The whole team reads each draft of the screenplay as it evolves,” Hart explained to me, “and we try, as much as we can, to smooth out anything that isn’t connecting.” What the story group does not do, Hart said, is impose plot-point mandates on the filmmakers. Johnson told me he was surprised at how much leeway he was given to cook up the action of Episode VIII from scratch. “The pre-set was Episode VII, and that was kind of it,” he said. If anything, Johnson wanted more give-and-take with the Lucasfilm team, so he moved up to San Francisco for about six weeks during his writing process, taking an office two doors down from Hart’s and meeting with the full group twice a week. Among Johnson’s inventions for The Last Jedi are three significant new figures: a “shady character” of unclear allegiances, played by Benicio Del Toro, who goes unnamed in the film but is called DJ by the filmmakers (“You’ll see—there’s a reason why we call him DJ,” Johnson said); a prominent officer in the Resistance named Vice Admiral Holdo, played by Laura Dern; and a maintenance worker for the Resistance named Rose Tico, who is played by a young actress named Kelly Marie Tran (and who is the sister of Paige, the character I witnessed in the scene with Poe Dameron). Tran’s is the largest new part, and her plotline involves a mission behind enemy lines with Boyega’s Finn, the stormtrooper turned Resistance warrior. Memories\n\nFisher, who died in December, with daughter Billie Lourd (Lieutenant Kaydel Connix). Photograph by Annie Leibovitz. Rose and Finn’s adventure takes them to, among other places, another Johnson innovation: a glittering casino city called Canto Bight, “a Star Wars Monte Carlo–type environment, a little James Bond–ish, a little To Catch a Thief,” the director said. “It was an interesting challenge, portraying luxury and wealth in this universe.” So much of the Star Wars aesthetic is rooted in sandy desolation and scrapyard blight; it appealed to Johnson to carve out a corner of the galaxy that is the complete opposite. “I was thinking, O.K., let’s go ultra-glamour. Let’s create a playground, basically, for rich assholes,” he said. Canto Bight is also where viewers will get their multi-species fix of gnarled aliens and other grotesque creatures, a comic-relief staple of Star Wars movies since Luke Skywalker first met Han Solo amid the cankerous and snouty inhabitants of the Mos Eisley cantina. The Last Jedi is dark enough as it is, so Johnson has made a point of infusing the movie with levity. “I didn’t want this to be a dirge, a heavy-osity movie,” he said. “So one thing I’ve tried really hard to do is keep the humor in there, to maintain the feeling, amid all the heavy operatic moments, that you’re on a fun ride.” Memories\n\nFisher and Hamill, with whom she first worked four decades ago. Photograph by Annie Leibovitz. IV. Sister Carrie\n\nDaisy Ridley has her own tale to tell of Skellig Michael. Part of the reason she looks so convincingly weary at the conclusion of Episode VII is, she said, “that I had just vomited. I had adrenal exhaustion, and I was very, very sick.” The second time up the cliff, she was in good health and pleased to be re-united with Hamill. But the overall making of Episode VIII proved more psychologically fraught. “When I was doing Episode VII, I was kind of being washed along in a torrent of excitement and unexpectedness,” she said. “When we came around to do the next one, it was a bit more scary, because I knew the expectations, and I understood more what Star Wars means to people. It felt like more of a responsibility.” The conflation of real-life and character narratives is not lost on Hamill. Fortunately for Ridley, she had become acquainted with a woman who knew a thing or two about such issues. There was no human being on earth better equipped to shepherd Ridley through what she was experiencing, as both the star of a movie franchise and a feminist model to young girls, than Carrie Fisher. “Carrie lived her life the way she wanted to, never apologizing for anything, which is something I’m still learning,” Ridley said. “ ‘Embarrassed’ is the wrong word, but there were times through it all when I felt like I was … shrinking. And she told me never to shrink away from it—that it should be enjoyed.” This is a common refrain among the new generation of Star Wars actors: that Fisher was the one who taught them how to deal. Boyega recalled that when there was a backlash against his appearance in the first Force Awakens teaser trailer, released in November 2014—the sight of a black man in stormtrooper armor drew ire from racists and doctrinaire Star Wars traditionalists—Fisher counseled him not to take it to heart. “I remember—and forgive me, I’m going to drop the f-bomb, but that’s just Carrie—she said, ‘Ah, boohoo, who fuckin’ cares? You just do you,’ ” he said. “Words like that give you strength. I bore witness in a million ways to her sharing her wisdom with Daisy too.” Rookies\n\nLaura Dern, as Vice Admiral Amilyn Holdo, a newcomer to the saga. Photograph by Annie Leibovitz. Fisher had a bigger role to play in The Last Jedi—General Leia Organa logs significantly more screen time in Episode VIII than she did in VII. Isaac, who filmed several scenes with Fisher, said that, like Hamill, she delivered a rich performance, giving her all as an actor, rather than treating Leia’s part as an exercise in feel-good sentimentalism. “We did this scene where Carrie has to slap me,” he said. “I think we did 27 takes in all, and Carrie leaned into it every time, man. She loved hitting me. Rian found such a wonderful way of working with her, and I think she really relished it.” For his part, Johnson quickly formed a deep bond with Fisher as a fellow writer, spending long hours with her at the eccentric compound she shared with her mother, Debbie Reynolds, in the Coldwater Canyon section of Beverly Hills. “After I had a draft, I would sit down with her when I was working on re-writing,” he said. “Sitting with her on her bed, in her insane bedroom with all this crazy modern art around us, TCM on the TV, a constant stream of Coca-Cola, and Gary the dog slobbering at her feet.” (For visuals on this characteristic state of affairs chez Fisher, I highly recommend Alexis Bloom and Fisher Stevens’s HBO documentary, Bright Lights: Starring Carrie Fisher and Debbie Reynolds.) Fisher completed her part in Episode VIII late last summer, when principal photography on the film wrapped. “She was having a blast,” said Kennedy. “The minute she finished, she grabbed me and said, ‘I’d better be at the forefront of IX!’ Because Harrison was front and center on VII, and Mark is front and center on VIII. She thought IX would be her movie. And it would have been.” Rookies\n\nBenicio Del Toro, as the shifty “DJ,” a newcomer to the saga. Photograph by Annie Leibovitz. When I was conducting the interviews for this story, the Star Wars family was still mourning Fisher’s unexpected death, which occurred on December 27, 2016, four days after she suffered a heart attack on a flight home to Los Angeles from London, and just a day before Reynolds suffered a fatal stroke. (The Star Wars “family” includes family in the literal sense: Fisher’s daughter, the actress Billie Lourd, appears as a Resistance lieutenant in both The Force Awakens and The Last Jedi.) Fisher had celebrated her 60th birthday just two months earlier. “Out of everyone, Carrie was the one I really became friends with and expected to have in my life for years and years,” said Johnson. “I last saw her in November, at the birthday party that she threw at her house. In a way, it was the perfect final, encapsulating image of Carrie—receiving all her friends in the bedroom, with Debbie holding court in the living room.” Fisher’s death doesn’t change anything about The Last Jedi except make it more poignant: the film farewell of both the actress and the character. But it does change Episode IX, for which, as Fisher hoped, a central role for Leia had been planned. Kennedy, Trevorrow, and the Lucasfilm team have been compelled to swing from grieving into pragmatic mode, working out how to reconceive the next film in the saga, which is scheduled to start shooting in January. One option that is not on the table is to reanimate Fisher’s Leia via C.G.I., as was briefly done in Rogue One, last year’s stand-alone, non-trilogy Star Wars film, created when she was alive. More extensively in that film, Grand Moff Tarkin, a character played by the late Peter Cushing in the first Star Wars movie, was brought back to life using C.G.I. jiggery-pokery and motion-capture technology that involved the use of an actor who physically resembles Cushing. Plus, Lucasfilm had the Cushing family’s consent. However, said Kennedy, “we don’t have any intention of beginning a trend of re-creating actors who are gone.” Spawn\n\nAdam Driver, in character as Kylo Ren, Han Solo’s son and slayer, wields a crossguard lightsaber. Photograph by Annie Leibovitz. V. A Disturbance in the Force", "images": ["https://media.vanityfair.com/photos/59245798b2306f2287537fcf/master/w_1600%2Cc_limit/star-wars-portfolio-06-2017-ss08.jpg", "https://media.vanityfair.com/photos/592457a5dffe772993b30b3c/master/w_1600%2Cc_limit/star-wars-portfolio-06-2017-ss11.jpg", "https://media.vanityfair.com/photos/5924578952a3f44dc6f3a8a5/master/w_1600%2Cc_limit/star-wars-portfolio-06-2017-ss02.jpg", "https://media.vanityfair.com/photos/5d03a3b276711f0f057fe6b1/1:1/w_350%2Ch_350%2Cc_limit/euphoria-review-hbo.jpg", "https://media.vanityfair.com/photos/59245798dffe772993b30b39/master/w_1600%2Cc_limit/star-wars-portfolio-06-2017-ss06.jpg", "https://media.vanityfair.com/photos/592457a5dffe772993b30b3d/master/w_1600%2Cc_limit/star-wars-portfolio-06-2017-ss12.jpg", "https://media.vanityfair.com/photos/5d0263d9ef4f5d344a3a40b2/1:1/w_350%2Ch_350%2Cc_limit/00-lead-jon-stewart.jpg", "https://media.vanityfair.com/photos/5d052987faddf23b24a3f639/1:1/w_350%2Ch_350%2Cc_limit/dark-phoenix-simon-kinberg-failure.jpg", "https://media.vanityfair.com/photos/5924972da697a436a685292e/16:9/w_1280,c_limit/t-star-wars-portfolio-06-2017-longform-a.jpg", "https://media.vanityfair.com/photos/592457989658080c3abf711d/master/w_1600%2Cc_limit/star-wars-portfolio-06-2017-ss07.jpg", "https://media.vanityfair.com/photos/592457a5dffe772993b30b3f/master/w_1600%2Cc_limit/star-wars-portfolio-06-2017-ss14.jpg", "https://media.vanityfair.com/photos/5d0fa6ccb1f2b43a190cf84d/1:1/w_350%2Ch_350%2Cc_limit/game-of-thrones-direwolves.jpg", "https://media.vanityfair.com/photos/592457899658080c3abf7119/master/w_1600%2Cc_limit/star-wars-portfolio-06-2017-ss03.jpg", "https://media.vanityfair.com/photos/5924578a9658080c3abf711b/master/w_1600%2Cc_limit/star-wars-portfolio-06-2017-ss05.jpg", "https://media.vanityfair.com/photos/5d03acff76711f312e7fe6b3/1:1/w_350%2Ch_350%2Cc_limit/Jeffrey-Katzenberg%25E2%2580%2599s-Quibi.jpg", "https://media.vanityfair.com/photos/5d0a6ab8a2036c7745753f00/1:1/w_350%2Ch_350%2Cc_limit/MCDTOST_EC058.jpg", "https://www.vanityfair.com/verso/static/hwd/assets/logo-reverse.6ef96ab8686439a35176e2ff8b2c4487e92fbaae.svg", "https://www.vanityfair.com/verso/static/hwd/assets/logo-header.7b6624f3aa336c67441a33a3e19289ee14eaf5c7.svg", "https://media.vanityfair.com/photos/5924578a34765321e4a464ac/16:9/w_1280%2Cc_limit/star-wars-portfolio-06-2017-ss01.jpg", "https://media.vanityfair.com/photos/5924578952a3f44dc6f3a8a7/master/w_1600%2Cc_limit/star-wars-portfolio-06-2017-ss04.jpg", "https://media.vanityfair.com/photos/592457a53695284c0188d4c5/master/w_1600%2Cc_limit/star-wars-portfolio-06-2017-ss13.jpg", "https://media.vanityfair.com/photos/5924579852a3f44dc6f3a8a9/master/w_1600%2Cc_limit/star-wars-portfolio-06-2017-ss10.jpg", "https://media.vanityfair.com/photos/59233f409658080c3abf70f1/1:1/w_350%2Ch_350%2Cc_limit/star-wars-2017-covers-lede.jpg", "https://media.vanityfair.com/photos/59245798b2306f2287537fd1/master/w_1600%2Cc_limit/star-wars-portfolio-06-2017-ss09.jpg"], "top_img": "https://media.vanityfair.com/photos/5924972da697a436a685292e/16:9/w_1280,c_limit/t-star-wars-portfolio-06-2017-longform-a.jpg", "keywords": [], "authors": ["Condé Nast", "Annie Leibovitz", "Vanity Fair", "Kevin Fitzpatrick", "Yohana Desta", "David Kam", "Annie Leibovit", "Sonia Saraiya", "Laura Bradley", "Nicole Sperling"], "canonical_link": "https://www.vanityfair.com/hollywood/2017/05/star-wars-the-last-jedi-cover-portfolio", "title": "Cover Story: Star Wars: The Last Jedi, the Definitive Preview", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Condé Nast", "copyright": "Copyright (c) Condé Nast 2019", "description": "Star Wars devotees who can’t wait for December need look no further. With exclusive access to writer-director Rian Johnson, plus interviews with Mark Hamill, Daisy Ridley, and others, V.F. presents the ultimate sneak peek at The Last Jedi—and Carrie Fisher’s lasting legacy.", "keywords": "star wars,annie leibovitz,the last jedi,portfolio,carrie fisher,mark hamill,daisy ridley,john boyega,adam driver,kathleen kennedy,rian johnson", "robots": "index, follow", "og": {"description": "Star Wars devotees who can’t wait for December need look no further. With exclusive access to writer-director Rian Johnson, plus interviews with Mark Hamill, Daisy Ridley, and others, V.F. presents the ultimate sneak peek at The Last Jedi—and Carrie Fisher’s lasting legacy.", "image": "https://media.vanityfair.com/photos/5924972da697a436a685292e/16:9/w_1280,c_limit/t-star-wars-portfolio-06-2017-longform-a.jpg", "site_name": "Vanity Fair", "title": "Cover Story: Star Wars: The Last Jedi, the Definitive Preview", "type": "article", "url": "https://www.vanityfair.com/hollywood/2017/05/star-wars-the-last-jedi-cover-portfolio"}, "twitter": {"card": "summary_large_image", "description": "Star Wars devotees who can’t wait for December need look no further. With exclusive access to writer-director Rian Johnson, plus interviews with Mark Hamill, Daisy Ridley, and others, V.F. presents the ultimate sneak peek at The Last Jedi—and Carrie Fisher’s lasting legacy.", "domain": "https://www.vanityfair.com", "image": {"src": "https://media.vanityfair.com/photos/5924972da697a436a685292e/16:9/w_1280,c_limit/t-star-wars-portfolio-06-2017-longform-a.jpg?mbid=social_retweet"}, "site": "@VanityFair", "title": "Cover Story: Star Wars: The Last Jedi, the Definitive Preview"}, "fb": {"app_id": 305927716147259, "pages": 8810407571}}, "movies": [], "publish_date": null, "source": "https://www.vanityfair.com", "summary": ""}