{"url": "www.dailystar.co.uk/showbiz/678030/Lady-Gaga-plastic-surgery-new-face-lift-Botox-fillers-nose-job-before-after-pictures", "text": "The Joanne singer turned heads when she arrived at the Grammy Awards 2018 in a nude ambition gown. ** LADY GAGA 'NEW FACE' GRAMMYS 2018 TREND * While her red carpet style was undoubtedly a hit, many fans were far too distracted by Lady Gaga's physical transformation to comment on her wardrobe choices. Following her appearance at the event, held in New York City's Madison Square Gardens, the search term \"Lady Gaga face lift\" started trending on Google. Taking to Twitter, viewers accused Gaga — real name Stefani Germanotta — of having had appearance-altering procedures.\n\nLADY GAGA FACE LIFT? The singer sparked plastic surgery rumours at the Grammys (Pic: Getty)\n\nFACE VALUE: The Joanne singer, here in 2017, has been accused by fans of having had work done (Pic: Getty)\n\nChanging faces: Lady Gaga's style transformation through the years Lady Gaga is famous for her dramatic costume, hair and make-up looks, see her transformation through the years. 1 / 14\n\nBEFORE: Gaga, here in 2010, has undergone quite the transformation (Pic: Getty)\n\nOne fan said of the 31-year-old: \"Oh no. She's started the plastic surgery crisis phase.\" Another wrote: \"Why did she get plastic surgery herself? Her face at the Grammys looks nothing like her face in 2009.\" In agreement, a viewer remarked: \"That doesn't even look like Gaga. What has she done to her face?\" Taking things a step further, one Twitter user made reference to the singer's empowering 2011 song which encouraged people to be comfortable in their own skin. They wrote: \"Gaga? What happened to 'You were Born this Way'? Love your face as normal.\n\nEARLY DAYS: Taken in 2007, this snap shows the singer before she became a worldwide superstar (Pic: Getty)\n\nVERDICT: A plastic surgeon believes Gaga has had Botox and fillers, among others procedures (Pic: Getty)\n\n\"Stop lift [sic] and Botox your face. You're very pretty without this bulls***.\" In search of an expert opinion, Daily Star Online contacted plastic surgeon Dr Maurino Joffily of Harley Street, London. After studying pictures of Gaga — dating from 2007 to the present day — the medical practitioner revealed what appearance-altering procedures he believes the singer has had done. Talking exclusively to us, Dr Joffily revealed he spotted indications the award-winning performer has had a nose job. He said: \"The nose looks straighter and narrower, and the tip more defined.\"\n\nWHO'S THAT GIRL? Fans took to social media to comment on Gaga, here in 2009, and her new look (Pic: Getty)\n\nShocking celeb surgery All of Hollywood's plastic isn't just in their wallets, it's all over their faces, boobs, bums and tums... 1 / 46 Yazmin Oukhellou/Instagram TOWIE's Yazmin Oukhellou flaunts results of boob job in dangerously low-cut top\n\nCANDID: Gaga, here in 2015, has admitted to having a former \"obsession\" with facial injections (Pic: Getty)\n\n“Lady Gaga may have had fillers in her chin and cheeks” Dr Maurino Joffily However, the London-based surgeon also suggested another explanation for the change in appearance of Gaga's nose. The medical professional explained: \"Even though her nose looks different, it might be a result of some fillers and Botox combined.\" Commenting on the starlet's face, he added: \"I suspect [use of] Botox as in many pictures her brows look higher. \"She might also have had fillers in her chin and cheeks.\" In a 2013 interview with Sirius XM radio host Howard Stern, 64, Gaga denied having had any work done, but admitted to using facial injections.\n\nShocking celeb surgery All of Hollywood's plastic isn't just in their wallets, it's all over their faces, boobs, bums and tums... 1 / 46 Yazmin Oukhellou/Instagram TOWIE's Yazmin Oukhellou flaunts results of boob job in dangerously low-cut top\n\nWORD OF MOUTH: Dr Joffily noted Gaga, here in New York last week, now has fuller lips (Pic: Getty)", "images": ["https://cdn.images.dailystar.co.uk/img/static/daily-star.png", "https://cdn.images.dailystar.co.uk/dynamic/122/photos/512000/900x738/1391512.jpg", "https://cdn.images.dailystar.co.uk/img/static/preloaderbig.gif", "https://cdn.images.dailystar.co.uk/dynamic/122/photos/87000/900x738/1220087.jpg", "https://analytics.twitter.com/i/adsct?txn_id=l4exp&p_id=Twitter", "https://cdn.images.dailystar.co.uk/dynamic/140/photos/768000/936x622/1219768.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=6035737&cv=2.0&cj=1", "https://cdn.images.dailystar.co.uk/img/static/placeholder-horizontal.gif", "https://cdn.images.dailystar.co.uk/dynamic/pixfeed/covers/81x101/front_2019-05-27.jpg", "http://t.co/i/adsct?txn_id=l4exp&p_id=Twitter"], "top_img": "https://cdn.images.dailystar.co.uk/dynamic/140/photos/768000/936x622/1219768.jpg", "keywords": [], "authors": ["Olivia-Anne Cleary"], "canonical_link": "https://www.dailystar.co.uk/showbiz/678030/Lady-Gaga-plastic-surgery-new-face-lift-Botox-fillers-nose-job-before-after-pictures", "title": "What has Lady Gaga done to her face? Plastic surgeon dishes dirt on shock transformation", "meta_data": {"viewport": "width=device-width, minimum-scale=1.0", "fb": {"pages": 161612017189003}, "description": "LADY Gaga's dramatic transformation is a hot topic among fans.", "og": {"description": "LADY Gaga's dramatic transformation is a hot topic among fans.", "title": "What has Lady Gaga done to her face? Plastic surgeon dishes dirt on shock transformation", "type": "article", "url": "https://www.dailystar.co.uk/showbiz/678030/Lady-Gaga-plastic-surgery-new-face-lift-Botox-fillers-nose-job-before-after-pictures", "image": "https://cdn.images.dailystar.co.uk/dynamic/140/photos/768000/936x622/1219768.jpg", "site_name": "Dailystar.co.uk", "language": "en", "tags": "entertainment, celebrities, movies, music, tv, autoplay_video, Lady Gaga new face, Lady Gaga face lift, Lady Gaga plastic surgery, Lady Gaga surgery, Lady Gaga before after pictures, What has Lady Gaga done to her face?", "section": "Celebs"}, "twitter": {"description": "LADY Gaga's dramatic transformation is a hot topic among fans.", "title": "What has Lady Gaga done to her face? Plastic surgeon dishes dirt on shock transformation", "account_id": 20442930, "card": "summary_large_image", "url": "https://www.dailystar.co.uk/showbiz/678030/Lady-Gaga-plastic-surgery-new-face-lift-Botox-fillers-nose-job-before-after-pictures", "image": {"src": "https://cdn.images.dailystar.co.uk/dynamic/140/photos/768000/936x622/1219768.jpg"}, "domain": "dailystar.co.uk"}, "news_keywords": "entertainment, celebrities, movies, music, tv, autoplay_video, Lady Gaga new face, Lady Gaga face lift, Lady Gaga plastic surgery, Lady Gaga surgery, Lady Gaga before after pictures, What has Lady Gaga done to her face?", "article": {"tag": "What has Lady Gaga done to her face?", "published_time": "2018-01-30T10:25:00+00:00", "modified_time": "2019-02-11T10:02:57+00:00", "expiration_time": "2019-03-13", "section": "Celebs"}, "video_autoplay": "false", "msvalidate.01": "E11C91F3522244AD728A407C255512DF"}, "movies": [], "publish_date": 1517307900.0, "source": "http://www.dailystar.co.uk", "summary": ""}