{"url": "https://www.vogue.com/article/serena-williams-vogue-cover-interview-february-2018", "text": "On a moist South Florida morning at the end of a relentless hurricane season, their wedding only a week away, Serena Williams and Alexis Ohanian are seated side by side at their long kitchen table discussing the Marshmallow Test. Some 50 years ago, in a famous experiment, the Stanford University psychologist Walter Mischel invited children to choose between a small immediate reward, such as a marshmallow, or, if they could sit and wait for fifteen minutes, a larger prize. The children who found ways to stave off temptation—by singing songs or pulling pigtails—went on to have higher SAT scores and lower body-mass indexes than their ravenous peers.\n\n“I would have eaten that marshmallow,” says Serena, who, in conspicuous contrast to that image, sips a radioactive-looking broth, which she nudged her chef to prepare after reading online that ginger and turmeric were supposed to aid in breast-milk production. She positions this tincture on a stack of gold lamé swatches: Golden Harvest, Gold L’Amour, Golden Daydream, Victorian Gold. One of these will be selected for the tablecloths at the wedding dinner. Thinking better of her coaster choice, she shifts her glass to a stack of photocopied pages from assorted newborn instruction manuals. Serena loves printing and collating and stacking. She loves paper. She is the analog to her husband-to-be’s digital.\n\n“Are you kidding?” Alexis shoots back. “You would never eat that marshmallow. You would stare down that marshmallow like it was the enemy. It would be Serena versus the marshmallow.”\n\n“You’re right,” she admits with a squeak of laughter. “But it would have been fear. I would have been scared to eat it. I would have been like, Am I supposed to eat this? Am I going to get in trouble if I eat this?”\n\nWatch Serena Williams Absolutely Tear Up an Airport Runway:\n\nIt’s no secret that a high capacity to delay gratification—to place discipline and self-sacrifice in the service of a dream that shimmers in the distance like a mirage—is among the distinguishing characteristics of the elite athlete. Serena is a special case, of course, an athlete whose unique gifts fused with years of hard work to produce an avalanche of victories—more, she swears, than she ever dreamed of as a braided nine-year-old captured uncomfortably in the pages of her local newspaper. A more painful vision of reality has also encroached over the years: the drive-by murder of her older sister Yetunde Price, in 2003; a slip on a piece of broken glass at a Munich restaurant that led to pulmonary embolisms, which in turn led to a year on the sidelines (and then, somehow, after age 30, the five most brilliant seasons of her career). One gratification she always knew she’d be keeping on the back burner was motherhood. But on September 1, Alexis Olympia Ohanian Jr. arrived. Serena calls her Olympia. Alexis prefers Junior.\n\nMonths earlier, when she was pregnant, Serena had confessed to me that she worried intensely about whether she’d make a good mother. She is a perfectionist, she is rule-bound (“Am I allowed to eat that marshmallow?”), and her longtime fans know that her fiery self-belief is sometimes undercut with self-doubt; in fact, that tension is part of what makes a Serena Williams match such nail-biting entertainment. Two rather harrowing months after giving birth, though, Mother has her sea legs—just in time to get those legs back onto the tennis court. From her new vantage point, Olympia is both irresistible temptation and ultimate reality check.\n\n“We’re not spending a day apart until she’s eighteen,” Serena says, only half-joking. “Now that I’m 36 and I look at my baby, I remember that this was also one of my goals when I was little, before tennis took over, when I was still kind of a normal girl who played with dolls. Oh, my God, I loved my dolls.” She breaks into the jingle for Baby Alive, the doll with an eerie array of lifelike bodily functions: “I love the way you make me feel,” she croons in a cracking falsetto. “You’re so real.” Serena named her Baby Alive Victoria, drawn even then to triumphal monikers. Suddenly, shrieking with laughter, she’s on YouTube watching eighties TV commercials in which little girls in soft focus change their dolls’ wet diapers.\n\n“To be honest, there’s something really attractive about the idea of moving to San Francisco and just being a mom,” she says. Reddit, the news aggregator of which Alexis is a cofounder, is based there, and they’ve just found a house in Silicon Valley. “But not yet. Maybe this goes without saying, but it needs to be said in a powerful way: I absolutely want more Grand Slams. I’m well aware of the record books, unfortunately. It’s not a secret that I have my sights on 25.” She means 25 Grand Slam victories, which would surpass the record of 24 held by the Australian tennis legend Margaret Court and make her the undisputed greatest of all time. (Serena, already widely regarded as the best there ever was, currently owns 23.) “And actually, I think having a baby might help. When I’m too anxious I lose matches, and I feel like a lot of that anxiety disappeared when Olympia was born. Knowing I’ve got this beautiful baby to go home to makes me feel like I don’t have to play another match. I don’t need the money or the titles or the prestige. I want them, but I don’t need them. That’s a different feeling for me.”\n\nSerena changes into leggings and a T-shirt, and we walk over to the manicured red clay tennis court belonging to a neighbor, hers whenever she wants it. It’s only the third time she’s picked up a racket since giving birth. Her father, Richard Williams, drops by to have a look and to offer a pointer or two. Get your racket back earlier, he advises. Alexis has brought his drone, which sounds like a swarm of bees as it whirs above the court grabbing video footage of the champion and her hitting partner. (“Serena doesn’t dwell on this stuff, but I’m making a point to document it all,” he explains.) She’s not serving yet, and there’s no split-step as she prepares for another ground stroke, but the shots hiss into the corners, and she’s pleased. Just a week earlier, Serena walked the length of a neighborhood block for the first time since returning from the hospital.\n\nThough she had an enviably easy pregnancy, what followed was the greatest medical ordeal of a life that has been punctuated by them. Olympia was born by emergency C-section after her heart rate dove dangerously low during contractions. The surgery went off without a hitch; Alexis cut the cord, and the wailing newborn fell silent the moment she was laid on her mother’s chest. “That was an amazing feeling,” Serena remembers. “And then everything went bad.”\n\nThe next day, while recovering in the hospital, Serena suddenly felt short of breath. Because of her history of blood clots, and because she was off her daily anticoagulant regimen due to the recent surgery, she immediately assumed she was having another pulmonary embolism. (Serena lives in fear of blood clots.) She walked out of the hospital room so her mother wouldn’t worry and told the nearest nurse, between gasps, that she needed a CT scan with contrast and IV heparin (a blood thinner) right away. The nurse thought her pain medicine might be making her confused. But Serena insisted, and soon enough a doctor was performing an ultrasound of her legs. “I was like, a Doppler? I told you, I need a CT scan and a heparin drip,” she remembers telling the team. The ultrasound revealed nothing, so they sent her for the CT, and sure enough, several small blood clots had settled in her lungs. Minutes later she was on the drip. “I was like, listen to Dr. Williams!”\n\nBut this was just the first chapter of a six-day drama. Her fresh C-section wound popped open from the intense coughing spells caused by the pulmonary embolism, and when she returned to surgery, they found that a large hematoma had flooded her abdomen, the result of a medical catch-22 in which the potentially lifesaving blood thinner caused hemorrhaging at the site of her C-section. She returned yet again to the OR to have a filter inserted into a major vein, in order to prevent more clots from dislodging and traveling into her lungs. Serena came home a week later only to find that the night nurse had fallen through, and she spent the first six weeks of motherhood unable to get out of bed. “I was happy to change diapers,” Alexis says, “but on top of everything she was going through, the feeling of not being able to help made it even harder. Consider for a moment that your body is one of the greatest things on this planet, and you’re trapped in it.”\n\nThe first couple of months of motherhood have tested Serena in ways she never imagined. “Sometimes I get really down and feel like, Man, I can’t do this,” she says. “It’s that same negative attitude I have on the court sometimes. I guess that’s just who I am. No one talks about the low moments—the pressure you feel, the incredible letdown every time you hear the baby cry. I’ve broken down I don’t know how many times. Or I’ll get angry about the crying, then sad about being angry, and then guilty, like, Why do I feel so sad when I have a beautiful baby? The emotions are insane.” Her mother, Oracene Price, has been staying in Florida to help out. She has encouraged Serena to relax around her daughter and is making the case for a strict parenting style in an era in which children often have the last word. “Obedience brings protection; that’s what my mom told me,” Serena says. “That’s straight from the Bible, and she wrote it down on paper and gave it to me. I was always obedient: Whatever my parents told me to do, I did. There was no discussion. Maybe I had a little rebellious phase in my 20s, when I tried liquor for the first time. Maybe having a baby on the tennis tour is the most rebellious thing I could ever do.”\n\nOracene says that she mainly bites her tongue, that daughters don’t tend to respond well to parenting advice from their own moms. Her primary concern right now is that Serena find a healthy equilibrium. “Serena works herself too hard,” Oracene explains. “She’s always been that way, ever since she was a little girl. She’s going to need to learn to slow down. She’s responsible for another life now. You should see how they travel with that baby. They pack everything! It’s a bit extravagant for me. But once she’s back on the tour, she’ll find a balance.”\n\nHer tennis friends have been broadly supportive, especially the dads. Stanislas Wawrinka gave Olympia a pair of tiny blue Tod’s driving loafers, and Novak Djokovic continues to send articles in accordance with his everything-natural philosophy. Serena and Novak call their babies doubles partners since they were born a day apart. Roger Federer, in some respects her only real rival on the tour—the person she’s always sought to keep pace with, the person she refuses to retire before—now has two sets of twins. “It’s so unfair,” Se­rena complains. “He produced four babies and barely missed a tournament. I can’t even imagine where I’d be with twins right now. Probably at the bottom of the pool.”\n\nFacebook’s Sheryl Sandberg is a longtime hero of Serena’s, and in the last year she has offered invaluable advice about marriage and motherhood. The two met years ago after Serena, in an interview, was asked to name someone she’d like to have dinner with and chose Sandberg. “I saw that, and I called her and said, ‘I’d love to have dinner with you!’ ” Sandberg recalls. They did not become close until after Sandberg’s husband, Dave Goldberg, died unexpectedly in 2015. “Serena really stepped up. I’d get texts and emails from her from all over the world telling me how strong I was at a time when I didn’t feel strong. She had experienced loss in her own life, and I think she knew what to do.”\n\nMany of her friends from women’s tennis—Caroline Wozniacki, Svetlana Kuznetsova, Angelique Kerber—have reached out to remind her how much she’s been missed this year. This is hugely important to Serena, who insists that contrary to the rumors, this is a group of women that genuinely cares for and respects one another. “I really believe that we have to build each other up and build our tour up,” she says. “The women in Billie Jean King’s day supported each other even though they competed fiercely. We’ve got to do that. That’s kind of the mark I want to leave. Play each other hard, but keep growing the sport.”\n\nBack at the house, Olympia has awoken from her nap. Serena lays her on a play mat in the TV room so that they can do some tandem exercises while Chip, the Yorkie, runs in circles around them, eager to get in on the action. Mother tests out a few crunches, but her stomach is still too weak; baby kicks out her chubby legs a few times, which proves irresistible to Serena, who rolls over and grabs them. “They’re not calves!” she says. “They’re not ankles! What are they? That’s right—Mommy loves your cankles!”\n\n“I think she got them from me,” says Alexis, overhearing, from the next room.\n\nOlympia tries to wriggle out of the baby gym, with its dumbbell-shaped rattles, but Serena says not so fast. “Some other seven-week-old is in the gym right now working,” she jokes. But she has no wish to push her daughter onto the court. To her mother’s horror, Olympia sat transfixed by the Argentine star Juan Martín del Potro recently. “I was distraught when I saw her,” says Se­rena. “I would hate her to have to deal with comparisons or expectations. It’s so much work, and I’ve given up so much. I don’t regret it, but it’s like Sliding Doors: Go through a different door and lead a different life. I’d like her to have a normal life. I didn’t have that.”\n\n“She’s obviously going to have a very special life,” Alexis says, “but there are enough cautionary tales about kids who grow up in the spotlight. How do you make your kid live in reality when your own reality is so . . . unreal? This kid is going to have more Instagram followers than me in about three weeks.” (At press time, baby was narrowing her father’s lead.)\n\nThe biggest question in women’s tennis last year was who would end up number one in Serena’s absence, and the answer didn’t become clear until the penultimate day of the season, when Serena’s friend Simona Halep, of Romania, snuck off with the crown. It could have been anybody, really, including the tour’s elder stateswoman, Venus Williams, who at age 37 was a couple of victories from the number-one ranking. The fact that Venus’s extraordinary year coincided with Serena’s absence from the tour is not lost on her younger sister. “I know that her career might have been different if she had had my health,” Serena says, clinging to the fantasy of sisterly parity. “I know how hard she works. I hate playing her because she gets this look on her face where she just looks sad if she’s losing. Solemn. It breaks my heart. So when I play her now, I absolutely don’t look at her, because if she gets that look, then I’ll start feeling bad, and the next thing you know I’ll be losing. I think that’s when the turning point came in our rivalry, when I stopped looking at her.”\n\nThe truth is that dominant number ones like Serena are rare, and no one has made a bold declaration during her absence. “It’s interesting,” she muses. “There hasn’t been a clear number one since I was there. It will be cool to see if I get there again, to what I call my spot—where I feel I belong. I don’t play to be the second best or the third best. If there’s no clear number one, it’s like, yeah, I can get my spot back. But if there is a clear number one, that’s cool, too, because it’s like, yeah, I’m gonna come for you.”\n\nSerena is never more lethal than when she zeroes in on a target. (Just ask Maria Sharapova.) She had hoped to defend her Australian Open title in January, but the recent medical gantlet has forced her to move her return date to March, where she’d like to play for the trophy at Indian Wells. She has set her sights beyond the tennis court as well. She will debut a new clothing line in March on her website. She continues to invest in tech ventures owned or led by women and African Americans. Her philanthropic endeavors focus on education and helping victims of violence and trauma. Although she thinks she’d be a terrible tennis coach, she imagines it would be gratifying to mentor an emerging player. (She admires the young and powerful Russian Daria Kasatkina.) And she would like to have more children, though she’s in no rush.\n\n“I remember how stressed I was about getting to Grand Slam number eighteen, tying Chrissie and Martina,” she says. “I had lost every Grand Slam that year. I was in the U.S. Open, and Patrick [Mouratoglou], my coach, said, ‘Serena, this doesn’t make sense. You’re so stressed about eighteen. Why not 30? Why not 40?’ For me, that clicked. I won eighteen, nineteen, and 20 right after that. Why would I want to stand side by side when I can stand out on my own? I think sometimes women limit themselves. I’m not sure why we think that way, but I know that we’re sometimes taught to not dream as big as men, not to believe we can be a president or a CEO, when in the same household, a male child is told he can be anything he wants. I’m so glad I had a daughter. I want to teach her that there are no limits.”\n\nRecently Serena agreed to sit on the board of the Billie Jean King Leadership Initiative, whose mission is to nurture a more diverse and inclusive corps of future leaders. “I’ve been telling people that I think Serena, with her prowess and her platform, can do more than I ever dreamed of—not just for women or for people of color but for all people,” says King. “I’ve been trying to figure out who I’m going to pass the torch to. Serena’s speaking like a leader and talking about making a difference in the world. Personally I’d like to see her get into politics. Why not run for president? But first I’d like to see her break every record—to be the big kahuna.”\n\nFor guests at Serena and Alexis’s wedding, on a Thursday last November at New Orleans’s Contemporary Arts Center, it was hard not to be knocked over by the collective power of the assembled women, among them Beyoncé Knowles, Caroline Wozniacki, Eva Longoria, Kim Kardashian West, and Ciara. The Tony Award–winning singer-actress Cynthia Erivo delivered a knockout rendition of “(You Make Me Feel Like) A Natural Woman” at the reception. “I never wanted a traditional wedding,” Serena says. “I wanted a strong wedding.”\n\nStrength is much more than a mere physical detail for Serena Williams; it is a guiding principle. She had it in mind last summer as she considered what to call her baby, Googling names that derive from words for strong in a mix of languages before settling on something Greek. But with Olympia home and healthy and the wedding behind her, it’s time to shift focus to her day job. She knows that she’s hurtling toward immortality, and she doesn’t take it lightly.\n\n“I’ve been playing tennis since before my memories started,” she says. “At my age, I see the finish line. And when you see the finish line, you don’t slow down. You speed up.”\n\nGet the February issue now.\n\nWatch: Serena Williams & Alexis Ohanian on Their Future Plans:", "images": ["https://collector-PX0lizzs6W.perimeterx.net/api/v1/collector/noScript.gif?appId=PX0lizzs6W", "https://www.vogue.com/wp-content/themes/vogue/images/logo_vogue.svg", "https://assets.vogue.com/photos/5a54e04719d517509a5790e4/16:9/pass/05-serena-williams-vogue-cover-february-2018.jpg"], "top_img": "https://assets.vogue.com/photos/5a54e04719d517509a5790e4/16:9/pass/05-serena-williams-vogue-cover-february-2018.jpg", "keywords": [], "authors": ["Rob Haskell", "Mario Testino"], "canonical_link": "https://www.vogue.com/article/serena-williams-vogue-cover-interview-february-2018", "title": "Serena Williams on Motherhood, Marriage, and Making Her Comeback", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=no, width=device-width, initial-scale=1, maximum-scale=1", "copyright": "Copyright (c) Condé Nast 2019", "og": {"site_name": "Vogue", "url": "https://www.vogue.com/article/serena-williams-vogue-cover-interview-february-2018", "title": "Serena Williams on Motherhood, Marriage, and Making Her Comeback", "description": "Serena Williams, Vogue’s February 2018 cover star discusses her difficult delivery for the first time and when she hopes to make her triumphant return to tennis.", "image": "https://assets.vogue.com/photos/5a54e04719d517509a5790e4/16:9/pass/05-serena-williams-vogue-cover-february-2018.jpg", "type": "article"}, "twitter": {"site": "@voguemagazine", "card": "summary_large_image", "domain": "www.vogue.com", "title": "Serena Williams on Motherhood, Marriage, and Making Her Comeback - Vogue", "image": {"src": "https://assets.vogue.com/photos/5a54e04719d517509a5790e4/16:9/pass/05-serena-williams-vogue-cover-february-2018.jpg"}, "creator": "@voguemagazine", "description": "Serena Williams, Vogue’s February 2018 cover star discusses her difficult delivery for the first time and when she hopes to make her triumphant return to tennis."}, "apple-itunes-app": "app-id=1087973225, app-argument=https://www.vogue.com/article/serena-williams-vogue-cover-interview-february-2018, affiliate-data=ct=smart-banner&pt=45076", "description": "Serena Williams, Vogue’s February 2018 cover star discusses her difficult delivery for the first time and when she hopes to make her triumphant return to tennis.", "keywords": "Magazine,Sports,Serena Williams,_sensitivecontent,_syndication_noshow,mobileAppReadyTrue", "news_keywords": "Magazine,Sports,Serena Williams,_sensitivecontent,_syndication_noshow,mobileAppReadyTrue", "articleSection": "Magazine", "article": {"publisher": "http://www.facebook.com/vogue"}}, "movies": [], "publish_date": 1515589216.573, "source": "https://www.vogue.com", "summary": ""}