{"url": "https://www.bbc.com/news/world-us-canada-41391640", "text": "Image copyright Getty Images Image caption Weiner looked sombre as he left US Federal Court following his sentencing\n\nEx-New York congressman Anthony Weiner burst into tears as he was sentenced to 21 months in jail for sending sexually explicit messages to an underage girl.\n\nHe pleaded guilty in May to transferring obscene material to a minor and agreed not to appeal against a prison sentence of 27 months or less.\n\nWeiner, 53, quit Congress in 2011 over a sex scandal and was again exposed in his 2013 run for New York mayor.\n\nHis lawyers had asked a US District Judge for probation instead of jail.\n\nBut in sentencing Weiner, US District Judge Denise Cote said: \"This is a serious crime that deserves serious punishment.\"\n\nShe also said Weiner \"has a disease. He has a compulsivity. Some say a sex addiction.\"\n\nMedia playback is unsupported on your device Media caption As a New York City mayoral candidate, Anthony Weiner confronts a heckler\n\nActing Manhattan US Attorney Joon H Kim said in a statement that Weiner \"asked a girl who he knew to be 15 years old to display her naked body and engage in sexually explicit behaviour for him online\".\n\n\"Justice demands that this type of conduct be prosecuted and punished with time in prison.\"\n\nIn addition to jail time, Weiner was sentenced to three years of supervised release, according to a statement from the US Attorney's Office.\n\nWeiner's lawyers contended the former politician had acted out of the \"depths of an uncontrolled sickness\" and was now seeking treatment.\n\nIn a letter to Judge Cote, Weiner said he felt \"profound\" regret for his crimes and that his misconduct had \"crushed the aspirations\" of his wife, Huma Abedin, and ruined their marriage.\n\nMs Abedin filed for divorce on the same day as her husband was found guilty in May.\n\nShe did not attend the sentencing, but asked for leniency on their son's behalf in a letter to the judge.\n\nImage copyright Reuters Image caption Anthony Weiner (L) and Huma Abedin split last year\n\nThe FBI began investigating Weiner last September after the Daily Mail reported that he had exchanged obscene messages with a North Carolina teenager.\n\nThe 15-year-old girl said he had asked her to undress on camera.\n\nA month earlier, Ms Abedin announced she was separating from her husband after it emerged he sent a photo of himself in his underpants with his toddler son nearby.\n\nThe New York Post reported that Weiner had sent sexual messages along with the photo to an unidentified woman in 2015.\n\nOnce a rising Democratic star, he stepped down from Congress in June 2011 after a graphic image sent from his Twitter account went public.\n\nInitially claiming his account was hacked, he eventually confessed to having lied.\n\nWeiner also admitted indulging in explicit online exchanges with at least six other women and pledged to seek therapy.\n\nHe tried to revive his political career in 2013 by running for mayor of New York.\n\nBut his campaign imploded amid reports of further graphic online messages.\n\nThe investigation into Weiner's sexting case played a role in last year's 2016 presidential election, when authorities found emails on his laptop from Ms Abedin, who was a senior aide to Democratic presidential candidate Hillary Clinton.\n\nA separate FBI investigation into Mrs Clinton's private use of email while she was secretary of state was closed after officials said nothing incriminating was found.", "images": ["https://ichef.bbci.co.uk/news/1024/branded_news/6AEA/production/_98007372_9821e0b5-c56c-42fe-abb1-3fe0faee4ffa.jpg", "https://a1.api.bbc.co.uk/hit.xiti?&col=1&from=p&ptag=js&s=598253&p=world::us_and_canada::news.world.us_and_canada.story.41391640.page&x1=[urn:bbc:cps:0e2764c5-db50-a04c-b708-a7b690431253]&x2=[responsive]&x3=[bbc_website]&x4=[en]&x7=[article]&x8=[reverb-0.9.1-nojs]&x10=[NEWS_GNL]&x11=[NEWS]", "https://ssc.api.bbc.com/?c1=2&c2=19293874&ns_site=bbc&name=", "https://ichef.bbci.co.uk/news/320/cpsprodpb/6AEA/production/_98007372_9821e0b5-c56c-42fe-abb1-3fe0faee4ffa.jpg"], "top_img": "https://ichef.bbci.co.uk/news/1024/branded_news/6AEA/production/_98007372_9821e0b5-c56c-42fe-abb1-3fe0faee4ffa.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bbc.com/news/world-us-canada-41391640", "title": "Anthony Weiner jailed for 21 months for sexting underage girl", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "The ex-congressman is sentenced to 21 months in prison for sending explicit messages to a teen.", "x-country": "us", "x-audience": "US", "CPS_AUDIENCE": "US", "CPS_CHANGEQUEUEID": 135832641, "og": {"title": "Weiner jailed for sexting underage girl", "type": "article", "description": "The ex-congressman is sentenced to 21 months in prison for sending explicit messages to a teen.", "site_name": "BBC News", "locale": "en_GB", "url": "https://www.bbc.com/news/world-us-canada-41391640", "image": {"identifier": "https://ichef.bbci.co.uk/news/1024/branded_news/6AEA/production/_98007372_9821e0b5-c56c-42fe-abb1-3fe0faee4ffa.jpg", "alt": "BBC News. Former US Congressman Anthony Weiner departs US Federal Court in New York City following his sentencing."}}, "article": {"author": "https://www.facebook.com/bbcnews", "section": "US & Canada"}, "fb": {"pages": "1143803202301544,317278538359186,1392506827668140,742734325867560,185246968166196,156060587793370,137920769558355,193435954068976,21263239760,156400551056385,929399697073756,154344434967,228735667216,80758950658,260212261199,294662213128,1086451581439054,283348121682053,295830058648,239931389545417,304314573046,310719525611571,647687225371774,1159932557403143,286567251709437,1731770190373618,125309456546,163571453661989,285361880228,512423982152360,238003846549831,176663550714,260967092113,118450564909230,100978706649892,15286229625,122103087870579,120655094632228,102814153147070,124715648647,153132638110668,150467675018739", "app_id": 1609039196070050, "admins": 100004154058350}, "twitter": {"card": "summary_large_image", "site": "@BBCWorld", "title": "Weiner jailed for sexting underage girl", "description": "The ex-congressman is sentenced to 21 months in prison for sending explicit messages to a teen.", "creator": "@BBCWorld", "image": {"src": "https://ichef.bbci.co.uk/news/1024/branded_news/6AEA/production/_98007372_9821e0b5-c56c-42fe-abb1-3fe0faee4ffa.jpg", "alt": "Former US Congressman Anthony Weiner departs US Federal Court in New York City following his sentencing."}, "domain": "www.bbc.com"}, "apple-itunes-app": "app-id=364147881, app-argument=https://www.bbc.com/news/world-us-canada-41391640?utm_medium=banner&utm_content=apple-itunes-app", "apple-mobile-web-app-title": "BBC News", "application-name": "BBC News", "msapplication-TileImage": "BBC News", "msapplication-TileColor": "#bb1919", "mobile-web-app-capable": "yes", "robots": "NOODP,NOYDIR", "theme-color": "#bb1919"}, "movies": [], "publish_date": null, "source": "https://www.bbc.com", "summary": ""}