{"url": "https://blog.ticketmaster.co.uk/theatre/channing-tatums-magic-mike-live-comes-london-38691", "text": "Magic Mike Live is now playing at the Hippodrome Casino in London’s Leicester Square and has opened the rave reviews.\n\nThe production has now added a new booking period, and is now booking until 5 January 2020.\n\nConceived and co-directed by Channing Tatum – the original star of the iconic Magic Mike film and its sequel Magic Mike XXL – Magic Mike Live is large-scale live production that brings the passion of the original movies to life before your very eyes.\n\nWatch the trailer for the unique show below:\n\nThe multi-national cast includes Samantha Baines, Jake Brewer, Harry Carter, Pip Hearse, Sophie Linder-Lee, Jack Manley, David Morgan, Ross Sands, Dean Stewart, Manny Tsakanika and Aaron Witter from the United Kingdom, Daniel Ralph from France, Antonio Donadio and Sebastián Melo Taveira from Italy, Maxwell Trengove from Australia and Brian Siregar from the USA.\n\nMagic Magic Live has transformed the theatre at the Hippodrome into a magical, intimate, 325-seat performance space. From the bespoke entrance off Cranbourn Street, to the specially curated lounge and bar experience, to the cast of world-class performers, Magic Mike Live is a complete evening of unparalleled entertainment for those aged 18 and up.\n\nGuests enter Magic Mike’s mythical club and marvel as a group of extraordinary artists perform a 360-degree dance and acrobatic spectacular in front of, behind, and above them. Sexy dance routines are intertwined with one-of-a-kind acts presented by a diverse cast of performers from around the world.\n\nReviews have called the production “red hot magic” (Metro), “a feverish spectacle” (Evening Standard), and “a huge hit” (WhatsOnStage). “The sexiest, steamiest show in town,” says The Sun, adding that “these lads will make your dreams come true”.\n\n“The audience seem nothing less than ecstatic throughout”, notes The Independent, with The Stage declaring it “a spectacle hot enough to leave the streaming crowd momentarily breathless”.\n\nMagic Mike Live in London is co-directed by Channing Tatum and Alison Faulk and choreographed by Alison Faulk, Teresa Espinoza and Luke Broadlick.\n\nIt cleverly straddles the line between sultry and acrobatic, pairing impressive dance with a healthy dose of sex appeal.\n\nThe show is now open at The Theatre at the Hippodrome.\n\nPlease note: Magic Mike Live guests must be at least 18 years to attend – appropriate photo ID will be requested on arrival at the venue.\n\nTickets for Magic Mike Live are on sale now, with great seats available from May. Get your tickets via Ticketmaster.co.uk. There are special rates for group bookings of 10 or more, to book call our groups team on 0844 844 2121 or email groups@ticketmaster.co.uk booking to 26 April 2020.", "images": ["https://blog.ticketmaster.co.uk/wp-content/uploads/2018/11/5459_06_MML_TM_738x415.jpg", "https://bavtu3qfhwm1rxgrg7bsnmjh-wpengine.netdna-ssl.com/wp-content/uploads/2018/11/5459_06_MML_TM_738x415.jpg", "https://bavtu3qfhwm1rxgrg7bsnmjh-wpengine.netdna-ssl.com/wp-content/themes/tm-wp-2017/dist/images/logo.svg", "https://bavtu3qfhwm1rxgrg7bsnmjh-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/Hamilton_Ticketmaster_738x415.jpg", "https://bavtu3qfhwm1rxgrg7bsnmjh-wpengine.netdna-ssl.com/wp-content/uploads/2019/07/TOP_10211_Amelie_TM_738x415.jpg"], "top_img": "https://blog.ticketmaster.co.uk/wp-content/uploads/2018/11/5459_06_MML_TM_738x415.jpg", "keywords": [], "authors": ["Ben Tipple", "Tom Stafford", "Matt Buttell"], "canonical_link": "https://blog.ticketmaster.co.uk/theatre/magic-mike-live-38691/", "title": "Magic Mike Live announces new booking period", "meta_data": {"viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "og": {"locale": "en_GB", "type": "article", "title": "Magic Mike Live announces new booking period | Ticketmaster UK Blog", "url": "https://blog.ticketmaster.co.uk/theatre/magic-mike-live-38691/", "site_name": "Ticketmaster UK", "updated_time": "2019-03-11T10:46:32+00:00", "image": {"identifier": "https://blog.ticketmaster.co.uk/wp-content/uploads/2018/11/5459_06_MML_TM_738x415.jpg", "secure_url": "https://blog.ticketmaster.co.uk/wp-content/uploads/2018/11/5459_06_MML_TM_738x415.jpg", "width": 738, "height": 415}}, "article": {"publisher": "https://www.facebook.com/TicketmasterUK", "tag": "Theatre", "section": "Theatre", "published_time": "2019-03-11T10:00:03+00:00", "modified_time": "2019-03-11T10:46:32+00:00"}, "twitter": {"card": "summary", "title": "Magic Mike Live announces new booking period | Ticketmaster UK Blog", "site": "@TicketmasterUK", "image": "https://blog.ticketmaster.co.uk/wp-content/uploads/2018/11/5459_06_MML_TM_738x415.jpg", "creator": "@TicketmasterUK"}, "msapplication-TileImage": "https://blog.ticketmaster.co.uk/wp-content/uploads/2018/12/cropped-Ticketmaster-270x270.png"}, "movies": ["https://www.youtube.com/embed/xpr46S1DXWI"], "publish_date": 1552298403.0, "source": "https://blog.ticketmaster.co.uk", "summary": ""}