{"url": "https://www.washingtonpost.com/news/animalia/wp/2018/07/09/a-professor-was-giving-a-tv-interview-about-polish-politics-his-cat-didnt-care/", "text": "Cats.\n\nThey care not for your affection, your familiar voice or perhaps even for your overall existence.\n\nAnd they certainly don’t care about your career as a respected academic or any fancy television interviews taking place in your office.\n\nPolish historian Jerzy Targalski discovered this during an on-camera appearance on a Dutch news program when his cat unceremoniously climbed atop his head in the middle of the interview.\n\nTargalski was speaking with a journalist from the Dutch public television station Nieuwsuur to weigh in on “the controversial forced removal of Polish top judge Malgorzata Gersdorf” by the country’s ruling conservative party, according to NTR reporter Rudy Bouma.\n\nPartway through the taping, his orange tabby began pawing and mewing at Targalski’s right side. The cat then scaled up the professor’s arm like a personal Everest.\n\n“Eh — we tolerate this?” Targalski asked. It was both a question and an apologetic statement, directed more to the camera crew and less to the cat, who by this point was already upon his neck.\n\nThe Polish historian & political scientist Jerzy Targalski remained completely unruffled during our interview when this happened👇🤨🤷‍♂️ pic.twitter.com/4dLi16Pq1H — Rudy Bouma (@rudybouma) July 7, 2018\n\nSomeone from behind the camera made a sound. Targalski smiled and pressed on, with the resignation of a man who has shared his home with a cat and thus knows his place in the feline-human order.\n\nHe spoke of the presence of secret-police agents in certain countries and what that means for the political transformation of those countries. But he may as well not have been speaking at all for all the attention his cat was stealing.\n\n[These penguins found a camera in Antarctica and captured a surprisingly good ‘selfie’]\n\nAs Targalski continued the interview, his cat nuzzled his ear, used his shoulders to get a closer look at a chandelier above and, at one point, curled its tail across Targalski’s face, covering his eyes. The political scientist, who earned his PhD with a thesis titled “Mechanisms of dismantling communism in Yugoslavia on the example of Slovenia and Serbia (1986-1991),” simply brushed the cat’s tail away and held it down for several moments to the side of his head.\n\nAlas, none of that footage made it into the final Nieuwsuur segment. Lisio does, however, manage a cameo in the final cut that aired last week (around the 3:50 mark in the video below) in a far less obtrusive manner — by lying in Targalski’s lap, getting petted as the professor conducts a seated interview.\n\nDoor ingrijpen van regering in #Polen moeten 27 leden van het Hooggerechtshof vervroegd met pensioen. Zo ook opperrechter Malgorzata Gersdorf. pic.twitter.com/qcPAxtGVnF — Nieuwsuur (@Nieuwsuur) July 6, 2018\n\nTargalski is, of course, not the first person to have a television interview not go as planned, as international relations expert and Pusan National University political-science professor Robert E. Kelly (better known as “BBC dad”) can tell you after his two young children hilariously crashed his BBC appearance last year.\n\nHe’s not even the first to have a cat interrupt a television shoot. Last year, Dumka — a black cat belonging to Nils Usakovs, the mayor of Riga, Latvia — wandered into an online Q&A session his human was hosting, to the delight of many of the mayor’s Facebook followers, as The Washington Post’s Karin Brulliard reported.\n\nUsakovs took it in good stride, writing later on Facebook: “Anything can happen if your office is ruled by cats.”\n\nRead more:\n\n‘She was in a hippity-hoppity mood’: BBC dad breaks silence\n\nWhy do we love pets? An expert explains.\n\nThe new BBC Dad is a Latvian mayor whose cat interrupted his live stream", "images": ["https://www.washingtonpost.com/resizer/aIKsc_GAf4xTxOD9ytlnBFug62M=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/CUJRICLZ5Y7C7LLGKQ5TT4CC7I.png", "https://www.washingtonpost.com/resizer/yAFxThroW-CI5t-yu8Q6FsF7kHI=/1x1/www.washingtonpost.com/pb/resources/img/spacer.gif", "https://me.effectivemeasure.net/em_image", "https://sb.scorecardresearch.com/p?c1=2&c2=3005617&cv=2.0&cj=1"], "top_img": "https://www.washingtonpost.com/resizer/aIKsc_GAf4xTxOD9ytlnBFug62M=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/CUJRICLZ5Y7C7LLGKQ5TT4CC7I.png", "keywords": [], "authors": ["Amy B Wang", "National Politics Reporter Covering Presidential Campaigns", "July", "Amy B Wang Is A National Politics Reporter Covering Presidential Campaigns. She Joined The Washington Post In As A General Assignment Reporter After Seven Years With The Arizona Republic."], "canonical_link": "https://www.washingtonpost.com/news/animalia/wp/2018/07/09/a-professor-was-giving-a-tv-interview-about-polish-politics-his-cat-didnt-care/", "title": "A professor was giving a TV interview about Polish politics. His cat didn’t care.", "meta_data": {"object-hash": 1554079473, "viewport": "width=device-width, initial-scale=1.0, user-scalable=yes, minimum-scale=0.5, maximum-scale=2.0", "referrer": "unsafe-url", "keywords": "cat interrupts interview, Nieuwsuur, Poland, Jerzy Targalski, Lisio, Dutch, Netherlands, Polish historian and academic, BBC dad", "news_keywords": "cat interrupts interview, Nieuwsuur, Poland, Jerzy Targalski, Lisio, Dutch, Netherlands, Polish historian and academic, BBC dad", "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "creator": "@amybwang"}, "og": {"type": "article", "site_name": "Washington Post", "url": "https://www.washingtonpost.com/news/animalia/wp/2018/07/09/a-professor-was-giving-a-tv-interview-about-polish-politics-his-cat-didnt-care/", "image": "https://www.washingtonpost.com/resizer/aIKsc_GAf4xTxOD9ytlnBFug62M=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/CUJRICLZ5Y7C7LLGKQ5TT4CC7I.png", "title": "A professor was giving a TV interview about Polish politics. His cat didn’t care.", "description": "Political scientist Jerzy Targalski soldiered on with the interview, despite serving as a human cat condo."}, "article": {"publisher": "https://www.facebook.com/washingtonpost", "content_tier": "metered"}, "fb": {"app_id": 41245586762, "admins": 500835072}, "description": "Political scientist Jerzy Targalski soldiered on with the interview, despite serving as a human cat condo.", "robots": "index,follow", "theme": "normal"}, "movies": [], "publish_date": 1531108800.0, "source": "https://www.washingtonpost.com", "summary": ""}