{"url": "https://www.washingtonpost.com/news/retropolis/wp/2018/05/19/princess-diana-wont-be-forgotten-at-the-royal-wedding-this-was-her-last-day/", "text": "\n\nPrincess Diana in 1995 with her sons, Prince William, right, and Prince Harry, center, at a World War II commemoration in London. She died in a car crash in 1997. (Johnny Eggitt/AFP/Getty Images)\n\nWhen Prince Harry and Meghan Markle were married Saturday, there was one royal missing but not forgotten: Harry’s mother, Princess Diana.\n\nHarry and his older brother, Prince William, have made sure to include their beloved late mother in their weddings.\n\n[Listen on Retropod: Princess Diana’s final hours]\n\nWhen William proposed to Kate Middleton in 2010, the engagement ring he gave her once belonged to Diana. And Harry proposed to Markle with an engagement ring containing diamonds from Diana’s jewelry collection. Markle is the same age as Diana when she died: 36.\n\nHarry, Kensington Palace said in a statement this month, was “keen to involve his mother’s family in his wedding.”\n\nDiana’s sister, Lady Jane Fellowes, gave a reading during the service at St. George’s Chapel inside Windsor Castle, which was decorated with white roses, Diana’s favorite flower. Diana’s two other siblings, Earl Spencer and Lady Sarah McCorquodale, also attended, with the Spencer family “helping to celebrate the memory of the late Princess on the wedding day.”\n\n[Royal wedding 2018 live coverage]\n\nDiana was devoted to her sons, and they were devoted to her. William was 15, and Harry was 12 when she was killed in a Paris car crash on Aug. 31, 1997. The boys were on vacation with their father, Prince Charles, at Balmoral Castle in Scotland, and he delivered the news to them.\n\n“One of the hardest things for a parent to have to do is to tell your children that your other parent has died,” Harry said last year in a BBC documentary that marked the 20th anniversary of her death. “How you deal with that, I don’t know.”\n\nDiana was renowned for her grace, beauty, philanthropic work — and for her struggles with life in the royal family. She had divorced Charles and was estranged from him, but before her death, things were looking up.\n\nShe had a new beau, Dodi Al Fayed, and a whirlwind romance — passionate, thrilling, scandalous.\n\nThe last day of Diana’s life began on the top deck of yacht, with croissants and fresh jams. She and Fayed sipped their coffee, marveling at the breathtaking Emerald Coast in Sardinia.\n\n“They were in a good mood,” his butler remembered later. “They were always laughing, holding hands.”\n\nFayed, the son of Harrod’s department store owner Mohamed Al-Fayed, was a rich playboy. Diana was the mother of the future King of England and the most photographed woman in the world.\n\n[Queen Charlotte and the wedding of Britain’s first mixed-race royal]\n\n\n\nPrincess Diana and Dodi Fayed in St. Tropez on Aug. 22, 1997. (Patrick Bar/AP)\n\nThe tabloid attention on them was intense.\n\nThat Saturday — Aug. 30, 1997 — promised to be a moment of change. The princess knew it. She sneaked a call to Richard Kay, a friend who covered the Royals for the Daily Mail, and told him, as he later wrote, “she had decided to radically change her life.”\n\nDiana had decided that starting that weekend she would withdraw from public life and wrap up her obligations with charities.\n\nDiana had not told Kay why, but he had a hunch: “They were, to use an old but priceless cliche, blissfully happy. I cannot say for certain that they would have married, but in my view it was likely.”\n\nIn the 20 years since she’s been gone, there have been countless revisions to this love story. Her friends and relatives: They were not in love! His friends and relatives: They were in love!\n\nFayed wanted to propose that night, even though they had been dating less than a month. He had a diamond ring waiting in Paris, where he planned to pop the question over dinner.\n\n[Prince Charles will walk Meghan Markle down the aisle: When royal wedding traditions fall]\n\nAs soon as they landed in Paris, Fayed saw the paparazzi out his window.\n\nThe couple headed for Fayed’s apartment — trailed, of course, by photographers. More were waiting at the building’s front door when they arrived. Fayed was irate. There was an ugly shoving match.\n\n\n\nPrincess Diana and Dodi Al Fayed in the elevator at the Ritz Hotel the afternoon before they both died. (AP Photo/H.M. Coroner)\n\nThey tried to go to a restaurant — Chez Benoit, a cozy, casual bistro not far from the city center — but it was quickly overrun by photographers. They split and headed for The Ritz, ducking into the dining room hoping to be left alone. But other diners were staring.\n\nThe couple left and had their food delivered to the Imperial Suite. Fayed’s proposal plan was in shambles. The only option left was to head back to his apartment.\n\nThe hotel was swarming with photographers, so Fayed devised a plan: The couple’s driver and bodyguards would make a big show out front, appearing to get their caravan of Mercedes sedans ready to leave. Meanwhile, the princess and Fayed would slip out the back door and take a borrowed car driven by a hotel security officer.\n\nThe couple did get away, but what happened next was the subject of lengthy investigations and conspiracy theories that live on today. As the couple sped off, the photographers out front got tipped off about the escape, quickly catching up on their motorcycles. Their driver darted in and out of traffic, finally crashing inside a tunnel near the Eiffel Tower. It turned out he had been drunk behind the wheel.\n\nFayed died instantly. Diana died at the hospital. Her death startled the world.\n\n\n\nPrince William (left) and Prince Harry, bow their heads as their mother’s coffin is taken out of Westminster Abbey after her funeral. (Adam Butler/AFP/Getty Images)\n\nAn up-and-coming anchor named Brian Williams broke into regular coverage on MSNBC to announce the news to Americans in the early morning hours of Aug. 31.\n\n“I’ve just been handed from the Reuters news service what has been marked ‘bulletin,’ ” Williams said, speaking slowly. “It says, ‘Princess Diana has died.’ ”\n\nIn the BBC documentary, Prince William recounts “feeling completely numb, disorientated, dizzy — and you feel very, very confused. And you keep asking yourself, ‘Why me?’ the whole time. Why? What have I done, why has this happened to us?”\n\nHarry remembers his initial reaction as “disbelief, refused to accept it. There was no sudden outpour of grief. I don’t think anybody in that position at that age would be able to understand the concept of what that actually means going forward.”\n\nWhat it means: On Saturday, Harry married the woman he loves without the mother he loves.\n\n\n\nPrincess Diana and her sons, Harry, center, and William, right, on a ride at Thorpe Park Amusement Park in Surrey, England. (Julian Parker/UK Press via Getty Images)\n\nRead more Retropolis:\n\nCheers, Prince Harry! But the last time a British royal married an American, it didn’t go well.\n\nA royal wedding and beheading: The date that links Meghan Markle and Anne Boleyn\n\nLord Mountbatten was killed by terrorists. Now he’s a royal baby’s namesake.\n\nFact-checking ‘The Crown’: Is Prince Philip a total jerk?\n\nFact-checking ‘The Crown’: Jackie Kennedy vs. Queen Elizabeth at Buckingham Palace", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=3005617&cv=2.0&cj=1", "https://www.washingtonpost.com/resizer/yAFxThroW-CI5t-yu8Q6FsF7kHI=/1x1/www.washingtonpost.com/pb/resources/img/spacer.gif", "https://me.effectivemeasure.net/em_image", "https://www.washingtonpost.com/resizer/TXJKur-cQ3m4AF9lqk_kkjfemkk=/3x2/www.washingtonpost.com/pb/resources/img/spacer.gif", "https://www.washingtonpost.com/resizer/4TSS4YbzqirvNhRovetXpW4uMHc=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/CTBNSJ5OCYYGFJJ5ZCHYYC7VUM.jpg", "https://www.washingtonpost.com/resizer/jxWGZW5lUsqQhiTzaqiwYp92ag4=/960x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/KMNPVIWJEUYVXAGRVFKXA5AQAE.jpg", "https://www.washingtonpost.com/resizer/WzkwsvzOZr5mnFtIO1ZMT4RS-Ec=/208x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/6WZNR7IWDEYMXMEECND4Y7HIWQ.jpg"], "top_img": "https://www.washingtonpost.com/resizer/4TSS4YbzqirvNhRovetXpW4uMHc=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/CTBNSJ5OCYYGFJJ5ZCHYYC7VUM.jpg", "keywords": [], "authors": ["Michael S. Rosenwald", "Enterprise Reporter Focusing On History", "The Social Sciences", "May"], "canonical_link": "https://www.washingtonpost.com/news/retropolis/wp/2018/05/19/princess-diana-wont-be-forgotten-at-the-royal-wedding-this-was-her-last-day/", "title": "Princess Diana wasn’t forgotten at the royal wedding. Her sons still mourn her death.", "meta_data": {"object-hash": 1554088763, "viewport": "width=device-width, initial-scale=1.0, user-scalable=yes, minimum-scale=0.5, maximum-scale=2.0", "referrer": "unsafe-url", "keywords": "Princess Diana, Princess Diana death, Prince Harry, Meghan Markle, Prince William, Prince Charles, Dodi Al Fayed, Princess Diana car crash, Princess Diana's last day", "news_keywords": "Princess Diana, Princess Diana death, Prince Harry, Meghan Markle, Prince William, Prince Charles, Dodi Al Fayed, Princess Diana car crash, Princess Diana's last day", "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "creator": "@mikerosenwald"}, "og": {"type": "article", "site_name": "Washington Post", "url": "https://www.washingtonpost.com/news/retropolis/wp/2018/05/19/princess-diana-wont-be-forgotten-at-the-royal-wedding-this-was-her-last-day/", "image": "https://www.washingtonpost.com/resizer/4TSS4YbzqirvNhRovetXpW4uMHc=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/CTBNSJ5OCYYGFJJ5ZCHYYC7VUM.jpg", "title": "Princess Diana wasn’t forgotten at the royal wedding. Her sons still mourn her death.", "description": "Prince Harry, who was 12 when his mother was killed, made sure to include her memory in his wedding to Meghan Markle."}, "article": {"publisher": "https://www.facebook.com/washingtonpost", "content_tier": "metered", "author": "https://www.facebook.com/mikerosenwald"}, "fb": {"app_id": 41245586762, "admins": 500835072}, "ansId": "CXDUBXPI2RG65NMBRNP764BQSE", "ansVersion": "0.9.0", "description": "Prince Harry, who was 12 when his mother was killed, made sure to include her memory in his wedding to Meghan Markle.", "robots": "index,follow", "theme": "normal", "author": "https://www.facebook.com/mikerosenwald"}, "movies": ["https://www.youtube.com/embed/TepIosuf324?feature=oembed"], "publish_date": 1526702400.0, "source": "https://www.washingtonpost.com", "summary": ""}