{"url": "https://www.cosmopolitan.com/style-beauty/beauty/how-to/a52634/flat-iron-hacks/", "text": "Kathleen Kamphausen | Lauren Ahn\n\nThere's a high chance you own a flat iron and know that you can create waves with a straightener, but can't quite master *flawless* waves. Cue the knowledge that's about to be bestowed upon you in this post.\n\n1. Create cool-girl bends (rather than Victoria's Secret-worthy waves) in your hair by feeding your hair into the straightener in an \"S\" formation. Start by dropping the middle of a section of hair into a flat iron to create the first bend. Then, feed the piece in between the flat iron clamps in an \"S\" curve formation, clamping down on the shape to create the bends. Repeat to the ends. (Tip via Anthony Cole for Sebastian Professional at Christian Siriano.)\n\nHere are the steps broken down:\n\nKathleen Kamphausen/Lauren Ahn\n\n2. Use the twirl-and-pull method to make waves. Holding the iron at an angle, insert an inch- or an inch-and-a-half-long section of hair between the clamps, and turn it away from your face to create the first bend. Then, gently slide the iron down the section of hair before twirling the iron away from your face again. Repeat this method until you reach your ends, leaving them straight for an unfinished (yet cool) look. Finally, once your entire head is done, run your fingers through your \"loose curls\" to make them more wave-like.\n\nNomi Ellenson | Lauren Ahn\n\nNomi Ellenson | Lauren Ahn\n\n3. Twist your hand away from your face until your hair wraps around the flat iron's clamps to create a curlier wave. Using a 1.25-inch-wide flat iron, like Harry Josh Pro Tools Ceramic Styling Iron 1.25 Inch, feed a 1-inch section of hair closest to the nape of your neck between the two clamps of the flat iron. From there, in one fluid motion (or else you'll create divots in your hair), twist your wrist away from your face, so the hair flows over (not under) the iron. Make sure the hair continues to wrap around the flat iron's barrel as you push the iron toward your ends, which will create the curl. Think of this technique in the same way you'd curl a ribbon with a scissor. Remember, the smaller the section, the curlier your hair will be.\n\nKathleen Kamphausen/Lauren Ahn\n\nNext, continue to work your way up toward your hairline, making sure to feed the hair into the flat iron a little higher than mid-length. Finish off the right side by grabbing the section of hair at the hairline, clamping the hair around mid-length, and turning the iron away from your face. Repeat on the left side; for the full, detailed how-to, click here.\n\n4. Bend your wrist back and forth to create waves. Holding your hair horizontally from your head, turn your wrist away from your hair and then down as you move down the section of hair. Next, bend your wrist back toward your hair, creating not-quite-curled texture.\n\nNomi Ellenson | Lauren Ahn\n\n5. Braid your hair and then run a flat iron over it a few times to create imperfect beachy waves. Again, just make sure you're spritzing your hair with a heat protectant spray before using hot tools on your hair to minimize damage.\n\nKathleen Kamphausen\n\n6. Pin-curl your hair up after you've made waves to keep your style intact overnight. If your hair doesn't usually hold a wave or curl, this trick will help keep it all day long. After waving your hair with your flat iron, let it cool and then roll a 1-inch section into a pin curl. Secure it with bobby pins if you're going to sleep in your style, or you can even use duck bill clips if you're just letting your hair cool while you do your makeup. The longer you let your hair set, the longer your waves will last.\n\nNomi Ellenson | Lauren Ahn\n\nGet non-boring fashion and beauty news directly in your feed. Follow Facebook.com/CosmoBeauty.\n\nFollow Carly on Twitter and Instagram.", "images": ["https://hips.hearstapps.com/cos.h-cdn.co/assets/16/04/1600x800/landscape-1453740486-flat-iron-hacks-lead-1.jpg?resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/04/1600x800/landscape-1453740486-flat-iron-hacks-lead-1.jpg?resize=1200:*", "keywords": [], "authors": ["Carly Cardellino", "Beauty Director", "Carly Cardellino Is The Beauty Director At Cosmopolitan", "Writing About All Things Beauty For Both Print"], "canonical_link": "https://www.cosmopolitan.com/style-beauty/beauty/how-to/a52634/flat-iron-hacks/", "title": "6 Flat Iron Hacks for Flawless Waves", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "6 Flat Iron Hacks for Flawless Waves", "description": "Because mastering the flat-iron wave is hard!", "url": "https://www.cosmopolitan.com/style-beauty/beauty/how-to/a52634/flat-iron-hacks/", "image": {"identifier": "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/04/1600x800/landscape-1453740486-flat-iron-hacks-lead-1.jpg?resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "modified_time": "2017-10-06 01:38:42", "published_time": "2016-01-29 08:05:00", "section": "Beauty"}, "twitter": {"site": "@Cosmopolitan", "card": "summary_large_image", "image": "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/04/1600x800/landscape-1453740486-flat-iron-hacks-lead-1.jpg?resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "6 Flat Iron Hacks for Flawless Waves", "description": "Because mastering the flat-iron wave is hard!", "keywords": "DIY, Hair", "auto-publish": "evergreen", "thumbnail": "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/04/980x980/square-1453740486-flat-iron-hacks-lead-1.jpg?resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Beauty & Style,style-beauty,beauty", "sailthru.date": "2016-01-29T20:05:00Z", "sailthru.image.full": "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/04/1600x800/landscape-1453740486-flat-iron-hacks-lead-1.jpg", "sailthru.image.thumb": "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/04/980x980/square-1453740486-flat-iron-hacks-lead-1.jpg", "sailthru.socialtitle": "6 Flat Iron Hacks for Flawless Waves", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1454072700.0, "source": "https://www.cosmopolitan.com", "summary": ""}