{"url": "https://www.bustle.com/articles/52644-8-common-mascara-mistakes-you-might-be-making-and-how-to-fix-them-because-nobody-wants", "text": "While there are certain steps in a beauty routine that can require more patience and practice like a smoky eye or an ombré lip, how to apply mascara is more on the \"no-brainer\" end of the spectrum. But for something that seems relatively fool-proof, there are actually a number of common mistakes made before, during, and after application. And really, who knew there were so many intricacies to a product that takes only seconds to use?\n\nBut these mistakes are totally worth fixing because mascara is one of the holy makeup trinity (as I like to call it). As in, one of the three makeup game-changers. Brow pencils (or powders or gels, whatever you prefer) help frame the face. Lipstick (especially in a brighter hue) can help you look instantly polished. And mascara helps open your peepers, making you look more bright-eyed and awake.\n\nSo if you've made any of these common mascara mistakes, don't fret! You're not alone. All of these blunders are pretty common, but super easy to fix. Your lashes will thank you for it. And in case you were wondering: Yes, it's basically impossible to apply mascara without having your mouth stupidly open.\n\n1. You're Not Starting with a Waterproof Formula\n\nIf you're concerned about the curl-factor of your lashes, make your first coat of mascara a waterproof one. Waterproof formulas help hold the curl that regular formulas can cause to fall.\n\nMaybelline The Rocket Waterproof Mascara, $6, Amazon\n\nL'Oreal Voluminous Million Lashes Waterproof Mascara, $8, Amazon\n\n2. You're Not Separating Your Lashes\n\nStill, sometimes no matter how hard we try to prevent it, mascara can make lashes clump together. Just make sure to comb through them with a spoolie after application to ensure your lashes aren't sticking together.\n\ne.l.f. Essential Eyelash Wand, $5, Amazon\n\n3. You're Pumping Your Mascara Wand\n\nPumping the wand only pumps air into the product, making it dry out faster than necessary. And you really don't need that much product on the wand anyway.\n\n4. You're Not Wiping Off Your Mascara Wand\n\nMore product than you actually need is on the wand when you pull it from the tube. By wiping it off before application, you can prevent your lashes from clumping and sticking together.\n\n5. You Don't Wiggle Your Wand\n\nIf you just pull the mascara wand straight through your lashes, you won't properly coat them. Give them the volume and length they deserve by wiggling the wand horizontally through your lashes as you pull it up. (You should be making little \"Z\" shapes.)\n\n6. You're Not Applying Enough Coats\n\nMost women apply only one or two coats of mascara because applying more seems like it only makes lashes clump and the curl fall. But you can actually achieve greater volume and length if you add three to five coats. Just make sure (as previously mentioned) your first coat is waterproof so the curl holds, and you wipe off the wand before each application so lashes don't clump.\n\n7. You Don't Wait to Clean Mistakes\n\nIf you get a little mascara on your skin, don't try to rub it away immediately; you'll just smear it and have a bigger mess to deal with. Instead, wait patiently until it dries (don't worry, it won't take too long), then use your nail to lightly scratch it off. It should easily flake away.\n\n8. You're Not Throwing It Away\n\nThree months is premature, but don't hold on to open mascaras for longer than six months. And if you're not sure how long it's been, just trust your nose.\n\nImages: Giphy (7); Miki Hayes (1); Khorzhevska/Fotolia", "images": ["https://imgix.bustle.com/rehost/2016/9/13/786b476b-492d-45b1-9855-5be42780ceea.jpg?w=970&h=546&fit=crop&crop=faces&auto=format&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/rehost/2016/9/13/786b476b-492d-45b1-9855-5be42780ceea.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://cdn.bustle.com/bustle/production/public/loading-d7a38c.svg", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1"], "top_img": "https://imgix.bustle.com/rehost/2016/9/13/786b476b-492d-45b1-9855-5be42780ceea.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/articles/52644-8-common-mascara-mistakes-you-might-be-making-and-how-to-fix-them-because-nobody-wants", "title": "8 Common Mascara Mistakes You Might Be Making and How to Fix Them, Because Nobody Wants Clumpy, Limp Lashes", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "fb": {"app_id": 132694503601208}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/articles/52644-8-common-mascara-mistakes-you-might-be-making-and-how-to-fix-them-because-nobody-wants", "type": "article", "title": "Don't Make These Mistakes With Your Mascara", "description": "While there are certain steps in a beauty routine that can require more patience and practice like a smoky eye or an ombré lip, how to apply mascara is more on the \"no-brainer\" end of the spectrum. But for something that seems relatively fool-proof,…", "image": {"identifier": "https://imgix.bustle.com/rehost/2016/9/13/786b476b-492d-45b1-9855-5be42780ceea.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "While there are certain steps in a beauty routine that can require more patience and practice like a smoky eye or an ombré lip, how to apply mascara is more on the \"no-brainer\" end of the spectrum. But for something that seems relatively fool-proof,…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}