{"url": "https://www.dailystar.co.uk/news/latest-news/684361/michael-jackson-truth-LaToya-death-cause-message-psychic-tyler-henry-grave-king-of-pop", "text": "MICHAEL Jackson has revealed what happened in the final moments before his death, a top psychic has claimed.\n\nThe King of Pop plunged the world into mourning when he was tragically found dead at his home in 2009. The 50-year-old, one of the best-selling music artists of all time, died after suffering a heart attack as a result of acute propofol and benzodiazepine intoxication on June 25. MJ's sister, LaToya Jackson, told Piers Morgan on CNN in 2011 she believed her brother had been murdered. Now, years on from his death, she enlisted the help of professional medium Tyler Henry, who claims to have been in contact with the Thriller icon from beyond the grave. In messages about his death from the afterlife, Jacko has revealed what happened in his final moments, Tyler claims.\n\nMichael Jackson in pictures Michael Jackson in pictures 1 / 18 WireImage Michael Jackson performs during the Super Bowl in 1993\n\nGetty CLOSE: LaToya Jackson has always believed her brother was murdered\n\n“He conveyed various messages and I think LaToya was still very curious about the nature of what exactly happened to Michael in his final moments,” he said. “There were some questions about the timeline as far as who was around at the time. “And so Michael basically came through, to the best of my ability I conveyed the timeline of what I saw to be true as far as painting that picture. “And it just helped I think provide some validation for them because there were some questions about were certain people in the room at the time or if they’re weren’t.\n\nGetty TRAGIC: MJ was due to perform 50 dates in London before his death\n\n“He conveyed various messages and I think LaToya was still very curious about the nature of what exactly happened to Michael” Tyler “Things like that I think can really help people put things to rest. But especially when it’s such a public figure, I think everyone who watches this episode will find a deeper sense of closure around Michael’s passing as well.” Michael’s personal doctor, Conrad Murray, was convicted of involuntary manslaughter over his death, which was deemed to be a homicide, the Los Angeles County Coroner ruled. Mr Henry, the star of Hollywood Medium With Tyler Henry, said speaking to MJ was “one of the most surprising, bizarre, surreal experiences in my life”. He said: “What I thought was so interesting when Michael connected to LaToya was that I was kind of expecting Michael Jackson to come through like moonwalking with like a whole audience full of people and a lot of feeling of like celebrity.\n\nGetty GONE BUT NOT FORGOTTEN: MJ's legacy continues to live on\n\n“But when he came through he was quite the opposite.\" “He came through very vulnerable, very private. He came across just like a brother trying to connect with his sister and it really wasn’t that different than if I were connecting any random person to their brother,” the 22-year-old medium continued. “And it was just really special because it showed universally these connections are all something we can relate to. And even if we’re a celebrity in life, they still connect on a personal level on the other side.”\n\nConclusive proof that these dead celebrities are ALIVE? People have doubted the deaths of famous people since famous people started dying. Are these sightings proof that they faked their own deaths? 1 / 6 Getty/Youtube A Youtube video (right) alleges that the picture is a selfie taken by Tupac Shakur on a mobile phone from 2011\n\nGetty ICON: Jacko captivated the world with his performances\n\nConspiracy theories were rife after Jackson’s death with many claiming it was faked to escape the pressure of fame. Websites such as michaeljacksonsightings.com and michaeljacksonhoaxdeath.com have been registered to help “explain” what happened. Just about the only explanation they do not consider is that he collapsed and died of a heart attack due to the stress of his comeback concert series, This Is It.\n\nParis Jackson: Michael Jackson's Daughter Take a look at Paris Jackson in pictures 1 / 26 Instagram Paris Jackson's hottest pictures", "images": ["https://cdn.images.dailystar.co.uk/img/static/daily-star.png", "https://cdn.images.dailystar.co.uk/dynamic/pixfeed/covers/81x101/front_2019-07-06.jpg", "https://t.co/i/adsct?txn_id=l4exp&p_id=Twitter", "https://analytics.twitter.com/i/adsct?txn_id=l4exp&p_id=Twitter", "https://cdn.images.dailystar.co.uk/img/static/preloaderbig.gif", "https://cdn.images.dailystar.co.uk/dynamic/1/photos/415000/936x622/1248415.jpg", "https://cdn.images.dailystar.co.uk/dynamic/122/photos/509000/900x738/251509.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=6035737&cv=2.0&cj=1", "https://cdn.images.dailystar.co.uk/img/static/placeholder-horizontal.gif", "https://cdn.images.dailystar.co.uk/dynamic/122/photos/216000/900x738/1064216.jpg", "https://cdn.images.dailystar.co.uk/dynamic/122/photos/946000/900x738/788946.jpg"], "top_img": "https://cdn.images.dailystar.co.uk/dynamic/1/photos/415000/936x622/1248415.jpg", "keywords": [], "authors": ["Charlotte Ikonen"], "canonical_link": "https://www.dailystar.co.uk/news/latest-news/684361/michael-jackson-truth-LaToya-death-cause-message-psychic-tyler-henry-grave-king-of-pop", "title": "Michael Jackson speaks BEYOND THE GRAVE to reveal ‘TRUTH about death’", "meta_data": {"viewport": "width=device-width, minimum-scale=1.0", "fb": {"pages": 161612017189003}, "description": "MICHAEL Jackson has revealed what happened in the final moments before his death, a top psychic has claimed.", "og": {"description": "MICHAEL Jackson has revealed what happened in the final moments before his death, a top psychic...", "title": "Michael Jackson speaks BEYOND THE GRAVE to reveal ‘TRUTH about death’", "type": "article", "url": "https://www.dailystar.co.uk/news/latest-news/684361/michael-jackson-truth-LaToya-death-cause-message-psychic-tyler-henry-grave-king-of-pop", "image": "https://cdn.images.dailystar.co.uk/dynamic/1/photos/415000/936x622/1248415.jpg", "site_name": "Dailystar.co.uk", "language": "en", "tags": "ctp_video, autoplay_video, Michael Jackson, LaToya, psychic, Tyler Henry", "section": "Latest News"}, "twitter": {"description": "MICHAEL Jackson has revealed what happened in the final moments...", "title": "Michael Jackson speaks BEYOND THE GRAVE to reveal ‘TRUTH about death’", "account_id": 20442930, "card": "summary_large_image", "url": "https://www.dailystar.co.uk/news/latest-news/684361/michael-jackson-truth-LaToya-death-cause-message-psychic-tyler-henry-grave-king-of-pop", "image": {"src": "https://cdn.images.dailystar.co.uk/dynamic/1/photos/415000/936x622/1248415.jpg"}, "domain": "dailystar.co.uk"}, "news_keywords": "ctp_video, autoplay_video, Michael Jackson, LaToya, psychic, Tyler Henry", "article": {"tag": "Tyler Henry", "published_time": "2018-02-24T12:15:00+00:00", "modified_time": "2018-02-24T23:41:09+00:00", "expiration_time": "2018-03-26", "section": "Latest News"}, "video_autoplay": "true", "msvalidate.01": "E11C91F3522244AD728A407C255512DF"}, "movies": [], "publish_date": 1519474500.0, "source": "https://www.dailystar.co.uk", "summary": ""}