{"url": "https://www.biography.com/news/american-idol-winners-where-are-they-now", "text": "Over the course of 15 seasons, 'American Idol' spawned some of the music industry’s biggest stars. Ahead of ABC’s March 11th reboot of the Fox juggernaut, we take a nostalgic look back on the high and low notes the reality show’s champs have struck in their careers.\n\nWhen Fox began airing American Idol’s self-described “search for a superstar” on June 11, 2002, the reality singing competition instantly earned its rightful place in the pop culture canon. With millions tuning in from week-to-week to laugh at whacky auditions or cry at the hopefuls’ touching backstories, a whole generation of Americans began uttering catchphrases like “check it out, dawg” (just try to not read that in Randy Jackson’s voice) or acted like they knew what “pitchy” really meant. As much as Jackson’s lingo became part of our lexicon, and the heated (or was it flirtatious?) banter between his fellow original judges, the snarky Simon Cowell and fun-loving, sometimes-loopy Paula Abdul kept us transfixed, the show was really about the contestants. A launch pad for many small-town kids with big-time dreams, Idol became a star-making machine that spanned 15 seasons before ending its first run on April 7, 2016.\n\nADVERTISEMENT Thanks for watching! Visit Website\n\nOff the air for less than two years, the musical mega-hit has now found a new home on ABC, with three new judges: Katy Perry, Luke Bryan, Lionel Richie. Before the reboot premieres on March 11th, why not take a stroll down memory lane and catch up with the original run’s 15 lucky winners? Grab your giant red Coca-Cola cups and dim the lights . . . here we go.\n\nADVERTISEMENT Thanks for watching! Visit Website\n\nADVERTISEMENT Thanks for watching! Visit Website\n\nKelly Clarkson (Season 1)\n\nLet’s face the music: Our lives (or at least our playlists!) would suck without Kelly Clarkson. In fact, it’s difficult to imagine a time when she — and Idol itself — weren’t part of the pop music conversation. But that was exactly the case in 2002 when the wide-eyed Texan, who recently admitted she didn’t even know she was trying out for a TV show until her third audition, sang her way into our hearts and to the top of the charts as the show’s inaugural winner. With her coronation song, “A Moment Like This” — which she emotionally performed after her season one triumph over runner-up Justin Guarini — Clarkson broke a 38-year-old record for biggest leap (previously held by The Beatles) when it jumped from No. 52 to No. 1 on Billboard’s Hot 100 chart.\n\nIn April 2003, her multiplatinum debut album Thankful and hit single “Miss Independent” followed, charting at No. 1 in their first week of release. With her sophomore effort, 2004’s Breakaway, she won her first Grammys for Best Pop Vocal Album and Best Female Pop Vocal Performance for “Since You’ve Been Gone.” Six more bestselling studio albums later (2017’s Meaning of Life was her eighth to crack the top three), the 14-time Grammy nominee has made history as the first Idol alum to score 100 total Billboard No. 1s. The mom to daughter River Rose, 3, and 23-month-old son Remington (with husband Brandon Blackstock, whom she married in 2013) can now be seen on another reality singing competition, taking her turn in a swivel chair as a coach on season 14 of NBC’s The Voice.\n\nRuben Studdard (Season 2)\n\nBefore he was “sorry for 2004,” Ruben Studdard (aka Idol’s “velvet teddy bear”) became the shows second champ when he narrowly bested Clay Aiken on the May 2003 finale. Just six months post-win, the Alabama native dropped his first album, Soulful, which debuted at No. 1 on the Billboard 200 and earned him a Best Male R&B Vocal Performance Grammy nod for its title track. He switched gears in 2004 and released a gospel album before finding his way back to R&B with 2006’s The Return. But when neither album lived up to his debut’s sales figures, his label, J Records, dropped him in December 2007.\n\nSix months later, he married Zuri McCants whom he met at a CD signing at an Atlanta Wal-Mart, but his personal life also took a hit when the pair began divorce proceedings in 2011. Since his Idol debut, Studdard has put out a total of six studio albums and also found himself back on reality TV, tackling health concerns on NBC’s weight loss competition, The Biggest Loser. Now, it’s comeback season for the velvet teddy bear, who plans to release a new album titled Ruben Sings Luther on March 16th before embarking on a 22-city tour to support his homage to his own idol, the late Luther Vandross.\n\nFantasia Barrino (Season 3)\n\nAs an inspirational 19-year-old single mother, Fantasia Barrino accomplished the seemingly impossible: earning raves from hard-nosed Cowell for her soulful May 2004 finale performance of Gershwin’s jazz classic “Summertime.” Oh yeah, and she obviously won the whole competition, too. Six months after her Idol crowning, the accolades continued when she released her Grammy-nominated platinum debut album, Free Yourself, featuring the hit singles “I Believe” and “Truth Is.” The North Carolina native went on to record five more studio albums and racked up 12 total Grammy nominations, eventually taking home a golden gramophone for Best Female R&B Vocal Performance in 2011.\n\nIn addition to recording music, she also penned a memoir, Fantasia: Life Is Not a Fairytale, played herself in Lifetime’s subsequent 2006 adaptation of the book, had her own VH1 reality series (Fantasia for Real) and starred in two Broadway shows (The Color Purple and After Midnight). Despite her career highs, Barrino found herself in the depths of depression, admitting a 2010 aspirin overdose that left her hospitalized was indeed a suicide attempt. She's since rebounded, however, welcoming her second child, son Dallas in December 2011 and marrying businessman Kendall Taylor in July 2015. (The pair also renewed their vows in a Christmas Day ceremony the following year.) Perhaps that’s what inspired her most recent project, a 2017 holiday album, Christmas After Midnight.\n\nCarrie Underwood (Season 4)\n\n“Jesus Take the Wheel” was an apt title for the first single off of Carrie Underwood’s 7x-platinum debut album – because with its November 2005 release, her career catapulted like a rocket. And, more than a decade after Some Hearts’ release, the country superstar hasn’t missed a beat. The Oklahoma native — who’s powerful country vocals led her to top honors on Idol’s fourth season in May 2005 — has now sold more than 16 million albums in the United States alone, earned seven Grammys (more than any other Idol alum), released 30 hit singles off of five best-selling albums and can consistently be found on Forbes’ top-earning musicians lists. Oh, and in addition to a slew of other music awards, she even had time to score a 2010 Guinness World Record for most country no. 1s for a female artist in the U.S.\n\nThat same year, she married pro hockey player Mike Fisher, with whom she shares three-year-old son Isaiah. In 2013, she made her acting debut as Maria von Trapp in NBC's The Sound of Music Live! which netted more than 18.6 million viewers. Underwood did take a tumble in late 2017, though not professionally, announcing that she’d had surgery after sustaining appearance-altering injuries in a fall at her Nashville home. Not one to be kept down (and because if anyone knows a thing or two about winning, it’s her), Underwood released a video for “The Champion,” her Super Bowl anthem featuring Ludacris, earlier this month. (The clip even includes footage from her Idol audition!)\n\nTaylor Hicks (Season 5)\n\nThe competition’s oldest winner (at a whole 29 years old!) edged out Katharine McPhee in 2006 with the help of his fan army, dubbed “Soul Patrol.” But Taylor Hicks’ supporters seemed to go off-duty when his self-titled December 2016 release became the lowest selling post-win record of any of the show’s previous winners. (The album, which included the songs \"Just to Feel That Way\" and \"Heaven Knows\" did still hit No. 2 on the Billboard 200 chart, however.) When his record label, Arista, proceeded to drop him in 2008, he founded his own label, Modern Whomp, under which he released two albums within two years.\n\nHicks later scored a successful Las Vegas residency (the first Idol alum to do so!) from 2012-2013. Outside of his musical endeavors Hicks now owns a handful of rental properties and co-owns Saw’s Juke Joint, a barbecue restaurant and blues bar in his home state of Alabama. Although he did release a new single — his first since 2009 — last September, he’s currently busy hosting a second season of State Plate, a food and travel series on the INSP network.\n\nJordin Sparks (Season 6)\n\nMonths after her being named Idol’s 2007 champ, Jordin Sparks blazed onto the music scene with her platinum self-titled debut’s singles “Tattoo” and “No Air.” Two years later, her sophomore effort, Battlefield, peaked at No. 7 on the Billboard album charts (her highest showing to date), but, even so, the Arizonan decided to take a hiatus from music in favor of acting. During the break, she had several cameos on TV shows (including Disney’s The Suite Life on Deck in 2009 and Nickelodeon’s Big Time Rush in 2010), starred in Broadway’s In the Heights, made a feature film debut in 2012’s Sparkle, alongside the late Whitney Houston, and also released three perfumes. Following a high-profile split from boyfriend of three years Jason Derulo in 2014, she made her musical comeback that same year with a mixtape, #ByeFelicia and later dropped a third studio album, Right Here Right Now, in August 2015. Nowadays, she’s focused on staying healthy for the son she’s expecting this spring with model Dana Isaiah, with whom she secretly eloped in Hawaii last July.\n\nDavid Cook (Season 7)\n\nSouthern rocker David Cook never intended to audition for Idol. (He only went to the Omaha call to support his brother.) But his rendition of “Livin’ On a Prayer” was the godsend that earned him his ticket to Hollywood, where he ultimately won the 2008 season. His debut single “The Time of My Life,” which debuted at No. 3, was one of a record-breaking 11 songs he had that hit the Billboard Hot 100 after his win. And although his self-titled album David Cook, which he dropped that November, sold more than one million copies and reached No. 3 on the Billboard 200, his following album sold much more modestly. In 2012, he revealed he’d parted ways with his label and began releasing music independently, while also recording with his band Midwest Kings. Cook, who married his longtime girlfriend Rachael Stump in 2015, self-released a new six-song EP, Chromance, in February. Next up for the Missouri-raised singer: a Broadway debut as Charlie Price in Kinky Boots on April 3.\n\nKris Allen (Season 8)\n\nAfter pulling an upset over Adam Lambert in 2009, Kris Allen came alive four months after his win with the release of his first single “Live Like We’re Dying,” which has sold more than 1.5 million digital downloads in the United States. His subsequent album, 2012’s Thank You Camellia, peaked at No. 26, before Allen was involved in a life-changing car accident. On January 1, 2013, a head-on collision left his wrist shattered, requiring three surgeries over the following years — and forcing him to re-learn how to play the guitar. On a happier note, he and his high-school sweetheart Katy, whom he married in 2008, welcomed a son later that year and then a daughter in 2016. The Arkansas native has continued to quietly release new music, both by himself and with a band called The Dames. His most recent solo release was 2016’s Something About Christmas, for which he's done promotional tours during the past two holiday seasons.\n\nLee DeWyze (Season 9)\n\nIllinois singer-songwriter Lee DeWyze covered U2’s “Beautiful Day” for his first release after his 2010 win but waffled on a follow-up single. After settling on “Sweet Serendipity” off of his November 2010 post-Idol debut Live It Up, the album failed to break into the Billboard 200’s top 10. His next big breakout came four years later when AMC’s hit show The Walking Dead featured his “Blackbird Song,” which went on to see more than 12 million YouTube views and 5.8 million Spotify streams. DeWyze, who married actress Jonna Walsh in 2012, seemed to find his calling, securing additional placements in several other series, including Nashville, Elementary and Suits. In 2016, a new album, Oil & Water, debuted in the Top 10 on Billboard’s Folk Music chart, and his latest single, “The Breakdown,” which appears on his February release, Paranoia, hit the top spot on the iTunes alternative chart.\n\nScotty McCreery (Season 10)\n\nBaby-faced Scotty McCreery’s deep voice carried his tunes \"I Love You This Big\" and \"The Trouble with Girls\" to the top of the charts following his 2011 Idol triumph. (His platinum-selling debut Clear as Day also hit No. 1 on the Billboard 200.) Since then, he has sold nearly 2.5 million albums (with three consecutive No. 1 album chart debuts) and toured with Brad Paisley, The Band Perry and Rascal Flatts. The North Carolina-born country crooner also wrote a memoir, Go Big or Go Home: The Journey Toward the Dream, in 2016, the same year he discovered he was dropped from his label.\n\nBut he found a way to bounce back this year, finally notching his first No. 1 single on Billboard's Country Airplay chart with the ballad \"Five More Minutes,” which will appear on Seasons Change (out March 16th). While he’ll be on tour most of this year, he has one special engagement he’ll be breaking for, as he’s planning to marry his childhood friend and longtime girlfriend Gabi Dugal this summer. Fun bonus fact: He still has the Ford pickup truck he won on Idol and says he’ll drive it “’til the wheels fall off.”\n\nPhillip Phillips (Season 11)\n\n“Home,” the song Phillip Phillips performed on the 2012 finale turned out to be a, well, home run, scoring the biggest digital sales week of any Idol coronation song and selling 5 million copies in the United States. His debut album The World from the Side of the Moon reached No. 4 on the Billboard 200, and he went on to drop his sophomore album Behind the Light in 2014. But Phillips career hit a sour note in January 2015, when a legal battle over his contract with Idol’s production company 19 Entertainment stalled any new releases. It wasn’t until last year when the two parties settled the case that Phillips, who opened for the Goo Goo Dolls that summer and guested as a diamond smuggler on CBS’ Hawaii Five-o in January, was able to release any new songs. His fresh start musically came via the January release of Collateral, his first studio album since 2014. With Hannah, his wife of two years, by his side, he’s currently headlining The Magnetic Tour across the country in support of his new project.\n\nCandice Glover (Season 12)\n\nThe third time was the charm for Candice Glover who auditioned for Idol twice before getting her ‘yes’ votes in 2013. Unlike her predecessors, she waited almost a year after her Idol win to drop her debut studio album Music Speaks, which peaked at No. 14 and received lackluster reviews. The reason, Glover claimed, was because she didn’t believe the album was ready and her objections to its release went ignored. The South Carolina-bred powerhouse also maintains that what she has called a “communication issue” between her label and iTunes caused the album to be released by accident.\n\nGlover split with her label and largely began avoiding the spotlight, although she does occasionally release new tracks via Soundcloud. (Her remix of Drake’s “Controlla” has racked up more than 20,000 plays.) In November 2017, she made her Broadway debut alongside Bianca Ryan (of NBC’s America’s Got Talent) and Josh Kaufman (who competed on NBC’s The Voice) in the Christmas musical Home For The Holidays. She seems poised for redemption though, with her Instagram bio reading, “2017 was the year of enlightenment. 2018 is the year of manifestation.”\n\nCaleb Johnson (Season 13)\n\nLike Glover, Caleb Johnson auditioned multiple times before winning Idol in 2014. Although he became the only contestant to not land in the bottom three that season, the North Carolina-born rocker didn’t exactly rock the charts after the show. Testify, the 10-track record he released just two months after wrapping up Idol, sold just 28,000 copies. After splitting from Interscope Records the following year, he turned to crowd-funding website PledgeMusic in 2017 to finance a follow-up project. By May, the EP Born From Southern Ground became available. In the spirit of staying independent, Johnson has also performed new songs for fans live on his official Facebook page.\n\nNick Fradiani (Season 14)\n\nBefore taking the Idol stage in 2015, Nick Fradiani, along with his Beach Avenue band mates, competed a year earlier on season nine of NBC’s America's Got Talent. The group didn’t make the cut on that show, but luckily the Idol judges (and America) ruled in his favor as a solo artist in the series penultimate season. Still, his finale song and first single, “Beautiful Life,” only climbed as high as No. 93 on the Hot 100 chart, and his debut album Hurricane only sold 5,000 copies in its first week. Connecticut-based Fradiani said he left his label, Big Machine Records in 2017 “on good terms” and that “it just wasn’t the right fit.” He went on to release an independent six-song EP Where We Left Off in October.\n\nTrent Harmon (Season 15)\n\nThe winner of what had been billed as Idol’s farewell season, Trent Harmon earned the distinction of a “hot shot debut” on Billboard’s Hot Country Songs chart in 2016 with his Keith Urban-penned track “Falling.” Instead of releasing a full-length album, the Mississippi native opted to put out a self-titled five-song EP, which included a second Top 30 country hit “Theres a Girl,” in December. Now, nearly two years after his win, his debut studio album is finally on the way, with its first single, “You Got ‘Em All,” a ballad that was inspired by a recent breakup, having hit radio late last month.", "images": ["https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTI4OTk1MTgzNTk2NDU1OTQ2/the-office_keyart_promojpg.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTE1ODA0OTcxMzQ2Nzg5OTAx/primary-photo.jpg", "https://www.biography.com/.image/t_share/MTU0MDY0MDU0ODgzNzIyMzIy/kelly-clarkson-during-american-idol-season-1-finale---results-show-at-kodak-theatre-in-hollywood-california-united-states-photo-by-sgranitz_wireimage.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTI3MTg2NTcwNDUyMTc5NDIy/adam_lambert_kiev_2013_0458_wikicommonsjpg.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTU2ODAwNjMxMTQ1NzY4NTYw/gettyimages-141296050.jpg", "https://www.biography.com/.image/c_fit%2Ccs_srgb%2Cq_auto:good%2Cw_458/MTQ1NTMzOTkyNDA0MjY0NTAz/sitelogowhite.png", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTQ5ODIwNDkzNTE0NDE3ODkw/ally_mcbeal_cast_1998_photo_fox_photofest_resized.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTIwNjA4NjMzNTQwMTUwNzk2/primary-photo.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTMwMzM2MDIyNDU3MjYwNTEw/full-house-cast_featurejpg.jpg", "https://www.biography.com/.image/ar_16:9%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_768/MTU0MDY0MDU0ODgzNzIyMzIy/kelly-clarkson-during-american-idol-season-1-finale---results-show-at-kodak-theatre-in-hollywood-california-united-states-photo-by-sgranitz_wireimage.jpg", "https://www.biography.com/.image/cs_srgb%2Cq_auto:good/MTQ1NTM0MTQ5NzA3NDQxNzE5/navbarwhite.png", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTU1NjYyODY0NTEyNzIyNDI4/cheers-cast-photo-by-paul-drinkwater_nbc_nbcu-photo-bank-via-getty-images.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTMwNjc4OTUyMjQxOTMyOTMx/gilmore_girls_credit_the-wbphotofest_promo_2jpg.jpg"], "top_img": "https://www.biography.com/.image/t_share/MTU0MDY0MDU0ODgzNzIyMzIy/kelly-clarkson-during-american-idol-season-1-finale---results-show-at-kodak-theatre-in-hollywood-california-united-states-photo-by-sgranitz_wireimage.jpg", "keywords": [], "authors": ["Brad Witter"], "canonical_link": "https://www.biography.com/news/american-idol-winners-where-are-they-now", "title": "‘American Idol’ Winners: Where Are They Now?", "meta_data": {"referrer": "unsafe-url", "HandheldFriendly": "True", "MobileOptimized": 320, "viewport": "width=device-width, initial-scale=1", "apple-mobile-web-app-capable": "no", "apple-mobile-web-app-status-bar-style": "black", "format-detection": "address=no", "google-site-verification": "Rw9Z4UJK89QUjgFzrFI2QbZmTRyWu_Cuy15hu4Y1MXw", "msvalidate.01": "565AA37CB662E60BF24DDCABEC686D8F", "generator": "Tempest - www.saymedia.com", "pinterest": "nohover", "author": "Brad Witter", "description": "Over the course of 15 seasons, 'American Idol' spawned some of the music industry’s biggest stars. Ahead of ABC’s March 11th reboot of the Fox juggernaut, we take a nostalgic look back on the high and low notes the reality show’s champs have struck in their careers.", "keywords": "Celebrity,Nostalgia,News,In the News", "section": "News", "sub-section": "Nostalgia", "pagetype": "article", "robots": "noodp", "item-id": "ci022356c3b0002452", "published": "2018-03-09T17:58:14Z", "modified": "2019-06-22T04:20:38Z", "dcterms.rightsHolder": "Bio and the Bio logo are registered trademarks of A&E Television Networks, LLC.", "dcterms.dateCopyrighted": 2019, "twitter": {"card": "summary_large_image", "site": "@bio", "creator": "@booradlie27", "url": "https://www.biography.com/news/american-idol-winners-where-are-they-now", "image": "https://www.biography.com/.image/t_share/MTU0MDY0MDU0ODgzNzIyMzIy/kelly-clarkson-during-american-idol-season-1-finale---results-show-at-kodak-theatre-in-hollywood-california-united-states-photo-by-sgranitz_wireimage.jpg", "description": "Over the course of 15 seasons, 'American Idol' spawned some of the music industry’s biggest stars. Ahead of ABC’s March 11th reboot of the Fox juggernaut, we take a nostalgic look back on the high and low notes the reality show’s champs have struck in their careers.", "domain": "www.biography.com"}, "og": {"type": "article", "url": "https://www.biography.com/news/american-idol-winners-where-are-they-now", "title": "‘American Idol’ Winners: Where Are They Now?", "description": "Over the course of 15 seasons, 'American Idol' spawned some of the music industry’s biggest stars. Ahead of ABC’s March 11th reboot of the Fox juggernaut, we take a nostalgic look back on the high and low notes the reality show’s champs have struck in their careers.", "image": "https://www.biography.com/.image/t_share/MTU0MDY0MDU0ODgzNzIyMzIy/kelly-clarkson-during-american-idol-season-1-finale---results-show-at-kodak-theatre-in-hollywood-california-united-states-photo-by-sgranitz_wireimage.jpg", "site_name": "Biography"}, "fb": {"pages": 123492867697144, "app_id": 104784826244596}, "pinterest-rich-pin": "true", "apple-mobile-web-app-title": "Biography", "parsely-title": "‘American Idol’ Winners: Where Are They Now? - Biography", "parsely-link": "https://www.biography.com/news/american-idol-winners-where-are-they-now", "parsely-image-url": "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cfl_progressive%2Ch_400%2Cq_auto:good%2Cw_620/MTU0MDY0MDU0ODgzNzIyMzIy/kelly-clarkson-during-american-idol-season-1-finale---results-show-at-kodak-theatre-in-hollywood-california-united-states-photo-by-sgranitz_wireimage.jpg", "parsely-post-id": "ci022356c3b0002452", "parsely-pub-date": "2018-03-09T17:58:14Z", "parsely-section": "News", "parsely-author": "Brad Witter", "parsely-tags": "Celebrity,Nostalgia,News,In the News", "parsely-metadata": "{\"associated_content\":[\"Where Are They Now? American Idol Contestants\",\"Randy Jackson\",\"Simon Cowell\",\"Kelly Clarkson\",\"Carrie Underwood\"]}", "phx": {"content-item-id": "ci022356c3b0002452", "content-object-type": "ContentArticle"}}, "movies": [], "publish_date": 1520618294.0, "source": "https://www.biography.com", "summary": ""}