{"url": "https://abcnews.go.com/GMA/Culture/fresh-off-olympic-glory-chloe-kim-hopes-platform/story?id=54057914", "text": "Chloe Kim, who became a household name last month when she took home gold for Team USA at the Winter Olympics, said her favorite part about her overnight rise to fame has been the free food.\n\nInterested in Olympics? Add Olympics as an interest to stay up to date on the latest Olympics news, video, and analysis from ABC News. Add Interest\n\nBut she also hopes to use her platform to fight bullying, something she faced growing up.\n\nIn a live interview on espnW's new \"Be Honest with Cari Champion\" series, Kim, the youngest woman to win an Olympic snowboarding medal, revealed that she's just like any other American teen, saying her hobbies include \"shopping\" and \"going to the mall.\"\n\n\"I won't leave the house without my eyeliner,\" the 17-year-old Los Angeles native added.\n\nKim 'got a better understanding of who I was' at the Olympics\n\nThe daughter of Korean immigrants to the U.S., Kim said winning gold in her parent's homeland this winter took on extra meaning because of all of the sacrifices her family made for her to get there.\n\n\"My parents sacrificed so much, I think it was so important for me to like go out there and just do good, and show them ... that all of our hard work as a family really did pay off,\" she said. \"I put a lot of pressure on myself, and I definitely didn't want to disappoint.\"\n\nJoe Scarnici/Getty Images for USOC\n\nKim added that \"the biggest thing that I took away from the Olympics,\" was that she \"got a better understanding of who I was.\"\n\nThe teen said it was \"an honor\" to represent two countries, including \"Korea, being the country where my family came from and where they spent their lives growing up, and now America, where I grew up.\"\n\n\"It's such a big cultural difference as well,\" she said. \"Being able to represent both is such a privilege.\"\n\nMany have dubbed Kim's road to Olympic glory the realization of her parent's American Dream.\n\n\"I always struggled with my identity growing up,\" Kim said. \"My parents came, immigrated to America in like the 1980's or something ... They kind of struggled with criticism a lot because back then it was sort of a new concept, diversity.\"\n\n\"But me, just growing up in America, being born and raised in California, it was a little harder for me -- just trying to understand who I was and where I fit in,\" she added.\n\nKim said that when she was 8 she moved to Switzerland and \"was the only Asian girl at the school.\"\n\nWhile at school, \"Everyone was like, 'Where are you from like ... What are you?'\" she said. \"I would be like, 'I'm a Cali girl, I'm from L.A.' I got bullied a lot, especially for my eyes.\"\n\n\"The funny thing is, in Switzerland, once I told them I lived in L.A., I was, like, popular,\" she quipped. \"They were like, 'She lives in Los Angeles, that's where Paris Hilton lives.'\"\n\nWinning Olympic gold felt like 'part of my destiny'\n\nMarianna Massey/Getty Images\n\nKim said that while she is usually nervous before most competitions, she felt calm at her first Olympics.\n\n\"I really felt like it was part of my destiny, in a way,\" she said of winning gold. \"'cause I get so nervous during competitions ... and I have to go to the bathroom when I get nervous, so I'm always running back and forth to the port-a-potties.\"\n\n\"But at the Olympics,\" she added, \"I didn’t feel any of that. I felt so calm.\"\n\nThe teen described the feeling she had before competing as \"at peace\" or \"the same feelings I get when I'm in like a fuzzy poncho, like ready to watch some T.V. and possibly fall asleep.\"\n\nWhile the noise and excitement at the Olympic Village was \"hectic,\" Kim said was most comfortable on the halfpipe.\n\n\"I was like, 'I'm here, I know how to do this, this is something that I'm familiar with,'\" she said.\n\nRyan Pierse/Getty Images\n\nKim's 'favorite thing' about newfound fame is 'everyone's just giving me food'\n\nKim, who tweeted about her love for ice cream and churros mid-competition in Pyeongchang, and often posts photos of her favorite foods on social media, said she's a big foodie.\n\n\"I have an excuse,\" she said of her love for eating. \"I'm, like, a winter athlete, so it's, like, you know, there is like a summer bod and then a winter bod.\"\n\n\"A lot of animals, for the winter, they like eat a lot of food to, like, stay warm, so I kind of go with that same mindset,\" she added.\n\nCould be down for some ice cream rn — Chloe Kim (@chloekimsnow) February 12, 2018\n\nKim said her \"favorite thing about everything\" since her overnight rise to fame, \"is that I'll say I like something, and then people will send them to me in mass stocks.\"\n\n\"I got so many churros sent to my house,\" she said. \"It's like everyone's just giving me food.\"\n\nAnother perk of her newfound fame is that she is currently \"looking at promposals.\"\n\n\"I think I'm going to go to prom with a fan,\" she added.\n\nKim, who turns 18 next month, said her ideal birthday does not include a big party.\n\n\"My team will always call me the laziest Olympian,\" Kim said. \"So, like, going out, or, like, throwing a big party to me, is just, like, too much work.\"\n\nShe said she'd rather stay home and buy a cake and hopefully eat the whole thing \"and then go to bed.\"\n\nOnce bullied, Kim hopes to use her platform to combat bullying\n\nKim said she is \"really thankful\" that she has been given a \"voice\" through her Olympic victory.\n\nEmma McIntyre/Getty Images\n\n\"I grew up with a lot of bullying,\" she said. \"I feel like some kids are very mean, like, even now, some of my hate comments will be from 10-year-old kids. It's like, how do you know how to say that?\"\n\nIt's important to understand the true impact words can have, Kim said, \"and how ... hurtful it really can be.\"\n\n\"It's so sad,\" she added. \"So many kids have taken their lives, or are hurting themselves because of bullying. And they don't see the joys in life.\"\n\n'Inspired' by her peers\n\nKim said she was \"inspired\" by the activism she witnessed from people her own age this weekend at the \"March for Our Lives\" event in Washington, D.C., and at similar rallies throughout the U.S.\n\n\"My peers started that march ... they all came together and used their voices to make an impact,\" she said. \"I think it's so amazing that our generation is able to do those things.\"", "images": ["https://s.abcnews.com/images/Sports/chloe-kim-gty-hb-180327_hpMain_4x3_992.jpg", "https://s.abcnews.com/images/International/chloe-kim-06-gty-jrl-180215_3x2_992.jpg", "https://secure-us.imrworldwide.com/cgi-bin/m?ci=us-704476h&cg=0&cc=1&ts=noscript", "http://www.googleadservices.com/pagead/conversion/1005826543/?value=0&label=1GPKCOHYjwMQ7-PO3wM&guid=ON&script=0", "https://s.abcnews.com/images/Sports/chloe-kim-olympics2-gty-mem-180215_4x3_992.jpg", "https://s.abcnews.com/images/International/chloe-kim-olympics-snowboard2-gty-mem-180213_4x3_992.jpg", "https://s.abcnews.com/images/US/chloe-kim-gty-jpo-180328_hpMain_2_12x5_992.jpg", "https://s.abcnews.com/images/US/chloe-kim-gty-jpo-180328_hpMain_2_16x9_992.jpg"], "top_img": "https://s.abcnews.com/images/US/chloe-kim-gty-jpo-180328_hpMain_2_16x9_992.jpg", "keywords": [], "authors": ["Abc News"], "canonical_link": "https://www.goodmorningamerica.com/culture/story/fresh-off-olympic-glory-chloe-kim-hopes-platform-54057914", "title": "Fresh off Olympic glory, Chloe Kim says she hopes to use her platform to fight bullying", "meta_data": {"robots": "index, follow", "author": "ABC News", "copyright": "Copyright (c) 2019 ABC News Internet Ventures", "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.", "keywords": "Chloe Kim, ESPNw,good morning america, morning news, robin roberts, lara spencer, josh eliott, sam champion, gma", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "fb_title": "What's next for Olympic gold medalist Chloe Kim", "og": {"site_name": "ABC News", "title": "What's next for Olympic gold medalist Chloe Kim", "description": "Chloe Kim, who became a household name last month when she took home gold for Team USA at the Winter Olympics, said her favorite part about her overnight rise to fame has been the free food.\nBut she also hopes to use her platform to fight bullying, something she faced growing up.\nIn a live...", "url": "https://abcnews.go.com/GMA/Culture/fresh-off-olympic-glory-chloe-kim-hopes-platform/story?id=54057914", "image": "https://s.abcnews.com/images/US/chloe-kim-gty-jpo-180328_hpMain_2_16x9_992.jpg", "type": "article"}, "news_keywords": "Chloe Kim, ESPNw", "twitter": {"card": "summary_large_image", "site": "@ABC", "title": "What's next for Olympic gold medalist Chloe Kim", "description": "Chloe Kim, who became a household name last month when she took home gold for Team USA at the Winter Olympics, said her favorite part about her overnight rise to fame has been the free food.\nBut she also hopes to use her platform to fight bullying, something she faced growing up.\nIn a live...", "url": "https://abcnews.go.com/GMA/Culture/fresh-off-olympic-glory-chloe-kim-hopes-platform/story?id=54057914", "image": "https://s.abcnews.com/images/US/chloe-kim-gty-jpo-180328_hpMain_2_16x9_992.jpg", "app": {"name": {"iphone": "ABC News", "ipad": "ABC News", "googleplay": "ABC News"}, "id": {"iphone": 300255638, "ipad": 306934135, "googleplay": "com.abc.abcnews"}, "url": {"iphone": "abcnewsiphone://link/story,54057914", "ipad": "abcnewsipad://link/story,54057914", "googleplay": "android-app://com.abc.abcnews/abcnews/abcnews.go.com/GMA/Culture/fresh-off-olympic-glory-chloe-kim-hopes-platform/story?id=54057914"}}}, "al": {"iphone": {"url": "abcnewsiphone://link/story,54057914", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}, "ipad": {"url": "abcnewsipad://link/story,54057914", "app_store_id": 380520716, "app_name": "ABC News for iPad"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/abcnews.go.com/GMA/Culture/fresh-off-olympic-glory-chloe-kim-hopes-platform/story?id=54057914", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "web": {"url": "https://abcnews.go.com/GMA/Culture/fresh-off-olympic-glory-chloe-kim-hopes-platform/story?id=54057914"}}}, "movies": [], "publish_date": null, "source": "https://abcnews.go.com", "summary": ""}