{"url": "https://en.wikipedia.org/wiki/America%27s_Got_Talent_(season_12)", "text": "Season twelve of the reality competition series America's Got Talent was ordered on August 2, 2016 and premiered on NBC on Tuesday, May 30, 2017. Howie Mandel, Mel B, Heidi Klum and Simon Cowell returned as judges for their respective eighth, fifth, fifth and second seasons.[2] Supermodel and businesswoman Tyra Banks replaced Nick Cannon, who hosted for eight seasons, making her the first female host of the show.[3] The live shows returned to the Dolby Theatre in Los Angeles beginning August 15, 2017.\n\nThe format of the show was the same as in season eleven, and Dunkin Donuts sponsors the show for a third consecutive season.[4] A guest judge joined the panel for each episode of the Judge Cuts round: Chris Hardwick, DJ Khaled, Laverne Cox and Seal.[5][6][7]\n\nDarci Lynne Farmer was named the winner on the season finale, September 20, 2017. She was the third ventriloquist, third child and third female to win a season of America's Got Talent. 10-year-old singer Angelica Hale placed second, and glow light dance troupe Light Balance came in third.[8] Farmer won the show's prize of $1 million and a headlining performance in Las Vegas.[9]\n\nSeason changes [ edit ]\n\nOn October 4, 2016, Simon Cowell signed a contract to remain as a judge through 2019.[10]\n\nLong-time host Nick Cannon announced, on February 13, 2017, that he would not return as host for season 12, soon after he made disparaging remarks about NBC in his 2017 Showtime comedy special, Stand Up, Don't Shoot.[11] Cannon was still under contract to host, and NBC executives did not initially accept his resignation, but they ultimately searched for a new host.[12]\n\nOn March 12, 2017, NBC announced supermodel Tyra Banks as the host for this season.[3]\n\nPreliminary auditions [ edit ]\n\nThe season had preliminary open call auditions in Chicago, Austin, Cleveland, Jacksonville, Philadelphia, Las Vegas, San Diego, New York City, Charleston, Memphis, and Los Angeles.[13] As in years past, prospective contestants could also submit online auditions.\n\nJudges' auditions were taped in March at the Pasadena Civic Auditorium in Los Angeles. The premiere aired May 30, 2017.[citation needed]\n\nGolden Buzzer [ edit ]\n\nThe Golden Buzzer returned for its fourth consecutive season. Any act that received a golden buzzer during the preliminary auditions was sent directly to the live shows and did not compete in the Judge Cuts round. In the first episode of preliminary auditions, Mel B pressed the golden buzzer for 12-year-old singing ventriloquist Darci Lynne Farmer. In subsequent episodes, Simon Cowell pressed it for 29-year-old deaf singer-songwriter and ukeleleist, Mandy Harvey, Howie Mandel chose 16-year-old singer Christian Guardino, Tyra Banks pressed it for Light Balance dance crew, and Heidi Klum chose 13-year-old singer Angelina Green.[14]\n\nDeath of Brandon Rogers [ edit ]\n\nOn June 11, 2017, contestant Brandon Rogers died in an automobile accident. Rogers was an American physician who specialized in family medicine. Earlier in 2017, after seeing YouTube videos of Rogers singing, Boyz II Men invited him to sing with them as a guest in three of their Las Vegas shows. His successful AGT audition aired on July 11, 2017, in his memory.[15] He competed in the Judge Cuts round, but his performance in that round was not televised.[16]\n\nJudge Cuts [ edit ]\n\nThe Judge Cuts round began on Tuesday, July 18, 2017. Like the previous season, one guest judge joined the judges' panel each show and was given one golden buzzer opportunity to send an act straight to the live shows. Twenty acts were shown each week and seven advanced, including the guest judge's golden buzzer choice. Guest judges were not given a red buzzer to use. Any act that received all four red buzzers was immediately eliminated from the competition. The four guest judges were Chris Hardwick, DJ Khaled, Laverne Cox, and Seal.\n\nAfter the Judge Cuts, three wildcards were chosen from eliminated acts to perform in the live shows: Final Draft, Bello Nock and Oskar and Gaspar (who did not perform in the Judge Cuts round). All three of these acts were eliminated in the Quarterfinals.\n\nGolden Buzzer [ edit ]\n\nEach Judge Cuts act that received a golden buzzer advanced to the live shows without any voting by the judges. During the Judge Cuts round, guest judges Chris Hardwick pressed his golden buzzer for 9-year old singer Angelica Hale, DJ Khaled pressed it for 21-year old singer-songwriter and guitarist Chase Goehring, Laverne Cox pressed it for 9-year old singer Celine Tam, and Seal pressed it for soul singer Johnny Manuel.[14]\n\nKey Buzzed Golden buzzer Advanced Quarterfinal Wildcard Eliminated Eliminated Immediately Advanced Immediately\n\nWeek 1 [ edit ]\n\nGuest judge: Chris Hardwick\n\nDate: July 18, 2017\n\nAct Order Performance Type Buzzes Result Cowell Klum Hardwick Mel B Mandel Sara and Hero 1 Dog Act Advanced The Baker Family 2 Bluegrass Band Eliminated Mariachi Nuevo Santander 3 Mariachi Group Eliminated The Masqueraders 4 Vocal Group Advanced Eric Jennifer 5 Comedian Eliminated Harrison Greenbaum 6 Comedian Eliminated Dancing Pumpkin Man 7 Dancer Eliminated Tom London 8 Magician Eliminated Eric Jones 9 Close-Up Magician Advanced Angelica Hale 10 Singer Advanced Immediately Danylo and Oskar 11 Acrobat Duo Eliminated Lera and Nika Tomanova 12 Aerial Duo Eliminated Yoselin Chi 13 Hand Balancer Eliminated Darcy Callus 14 Singer And Keyboardist Eliminated Carlos De Antonis 15 Opera Singer Eliminated Canion Shijirbat 16 Multimedia Dancer Eliminated Just Jerk 17 Hip-Hop Dance Group Advanced Maw Kitty 18 Singer Eliminated The Singing Trump 19 Singing Trump Impersonator Advanced Demian Aditya 20 Escape Artist Advanced\n\nWeek 2 [ edit ]\n\nGuest judge: DJ Khaled\n\nDate: July 25, 2017\n\nThis is the first Judge Cuts episode in the show's history in which an act with at least one \"X\" buzzer was nevertheless promoted to the live shows. This was also the only Judge Cuts episode of the season in which an act received 4 red buzzers.\n\nAct Order Performance Type Buzzes Result Cowell Klum DJ Khaled Mel B Mandel Sammulous 1 Singer Eliminated Steven Scott 2 Comedian Eliminated The Quiddlers 3 Puppeteer Group Eliminated Str8jacket 4 Dance Group Eliminated Solto & T Dot 5 Dance Duo Eliminated Junior and Emily 6 Salsa Dance Duo Advanced Jokgu and Aichan 7 Piano-Playing Chickens Eliminated Immediately Dakota Striplin 8 Singer and Guitarist Eliminated Chase Goehring 9 Singer and Guitarist Advanced Immediately Azeri Brothers 10 Danger Duo Eliminated The Godfathers 11 Acrobat Group Eliminated Tulga 12 Strongman Eliminated Mirror Image 13 Vocal/Dance Duo Advanced Evie Clair 14 Singer Advanced Kyle Eschen 15 Magician Eliminated Xavier Mortimer 16 Magician Eliminated Colin Cloud 17 Mentalist Advanced Pelican212 18 Family Band Eliminated Puddles Pity Party 19 Singing Clown Advanced Yoli Mayor 20 Singer Advanced\n\nWeek 3 [ edit ]\n\nGuest judge: Laverne Cox\n\nDate: August 1, 2017\n\nThis was the first Judge Cuts episode in which no acts received a red buzzer from any of the judges.\n\nAct Order Performance Type Buzzes Result Cowell Klum Laverne Cox Mel B Mandel Oscar Hernandez 1 Dancer Advanced Tony and Jordan 2 Digital Magicians Eliminated The Naked Magicians 3 Magicians Eliminated Jeki Yoo 4 Magician Eliminated Herbie Russ 5 Singer And Saxophonist Eliminated Mike Yung 6 Singer Advanced 5 Alive 7 Boy Band Eliminated Final Draft 8 R&B Vocal Group Quarterfinal Wild Card Brobots & Mandroidz 9 Hip-Hop Dance Group Advanced Marisa McKaye 10 Singer Eliminated Celine Tam 11 Singer Advanced Immediately Aileen George 12 Pole Dancer Eliminated Shemika Charles 13 Limbo Dancer Eliminated Jay Jay Phillips 14 Keyboardist Eliminated Diavolo 15 Acrobatic Dance Group Advanced Jonathan Rinny 16 Balancing Acrobat Eliminated Bello Nock 17 Daredevil Quarterfinal Wild Card Daniel Ferguson 18 Singing Impressionist Eliminated Preacher Lawson 19 Comedian Advanced Billy & Emily England 20 Extreme Rollerskating Duo Advanced\n\nWeek 4 [ edit ]\n\nGuest judge: Seal\n\nDate: August 8, 2017\n\nAct Order Performance Type Buzzes Result Cowell Klum Seal Mel B Mandel Artyon & Paige 1 Dance Duo Advanced Britt Saasen 2 Singer Eliminated In The Stairwell 3 A Capella Group Advanced Will Tsai 4 Magician Eliminated Henry Richardson 5 Magician Eliminated Elena and Sasha 6 Acrobatic Duo Eliminated Lost Legends 7 Dance Group Eliminated Nick Uhas 8 Scientist Eliminated Veronica Gonzalez 9 Foot Puppeteer Eliminated Sirqus Alfon 10 Digital Comedy Trio Eliminated DaNell Daymon & Greater Works 11 Gospel Choir Advanced Pompeyo Family Dogs 12 Dog Act Advanced Johnny Manuel 13 Singer Advanced Immediately Maria Popazov 14 Hand Balancer / Contortionist Eliminated Maxim Popazov 15 Hand Balancer Eliminated German Cornejo Dance Company 16 Dance Group Eliminated The Honeybee-z Plus 17 Dance Group Eliminated Merrick Hanna 18 Dancer Advanced Kechi Okwuchi 19 Singer Advanced Brandon Rogers N/A Singer Did not advance\n\nQuarterfinals [ edit ]\n\nThe quarterfinals were broadcast live from the Dolby Theatre in Los Angeles starting on August 15, 2017. They featured the nine golden buzzer acts, the 24 other acts promoted during the Judge Cuts round, and three wildcard acts chosen by the producers and judges. Twelve acts performed each week, with results announced the on following nights; each week seven acts were sent through to the semifinals.[17] Puddles Pity Party and Mirror Image received an \"X\" from Cowell in the Quarterfinals. Demian Aditya received \"X's\" by Mel B and Cowell in the second Quarterfinals. However, no acts were buzzed on the third week of the quarterfinals.\n\nKey Buzzed Advanced (Won Public Vote) Judges' Choice Won Judges' Choice Lost Judges' Choice Dunkin' Save Judges' Wildcard\n\nWeek 1 (August 15–16) [ edit ]\n\nGuests: Grace VanderWaal, August 16[18]\n\n^1 After the judges split evenly in the Judges' Choice, Yoli Mayor was announced to have received more of America's votes than Just Jerk, and she advanced to the semi-finals.\n\nWeek 2 (August 22–23) [ edit ]\n\nGuests: Circus 1903 [19]\n\nAct Order Performance Description Buzzes and judges' choices Result Cowell Klum Mel B Mandel Brobots & Mandroidz 1 Hip-Hop Dance Group; danced as a group to an electric mix of hip-hop songs \"Boneless\", \"Get Busy\", and\"Jump\". Eliminated Celine Tam 2 Singer; sang \"When You Believe\" by Mariah Carey and Whitney Houston. Advanced Mirror Image 3 Vocal Dance Duo; Sang \"Somebody to Love\" by Queen and while dancing. Eliminated Johnny Manuel 4 Singer; sang \"And I'm Telling You\" by Dream Girls. Advanced Merrick Hanna 5 Dancer; Danced out a story based on a cover of \"Lost Boy\". Advanced Eric Jones 6 Close-up Magician; Had Mandel sign a random playing card, then had Mel and Heidi hold a piece of glass, and pressed a poker chip against the glass using his left hand, until it went through the glass on his right hand. Next, Howie pushed a set of cards, with the signed card included, onto a much larger piece of glass. Eric pulled the signed card from Howie's cards through the glass. Finally, Eric's entire body passed through the glass behind cloth. Won Judges' Choice The Masqueraders 7 Vocal Group; sang their original song, \"I'm Just an Average Guy\". Lost Judges' Choice Light Balance 8 Light-Up Dance Group; urban dance with chromatic lights. The dance encircles a theme wherein a person wearing a VR headset experiences the thrill of wearing one. Said person transforms into a werewolf, who then plays the DJ while other dancers performed. The routine ends when the person is suddenly swallowed up by someone dressed as a bat. Advanced Evie Clair 9 Singer; sang \"Wings\" by Birdy. Dunkin' Save Demian Aditya 10 Escape Artist; Demian climbed into a wooden box, handcuffed, and the lid of the box was nailed completely shut. The only support keeping the box in the air was a rope. The rope was looped through pulleys and secured directly above a blowtorch. Demian attempted to escape before the rope burned through and the locks came crashing down onto three solid steel spikes lit on fire. Unfortunately, technical issues arose during the performance: the box failed to fall into the spikes when the rope was burnt through. Nevertheless, Demian appeared behind the judges with a fire extinguisher in hand. Eliminated Pompeyo Family Dogs 11 Dog Act; Had a safari themed act; had dogs performing tricks such as hopping over obstacles, biting those obstacles and moving them, jump roping with two ropes, and leaping through a hoop held up by one of the trainers. Judges' Wild Card Mandy Harvey 12 Singer-Songwriter/Ukulelist; sang an original song called \"Mara's Song\". Advanced\n\n^1 After the judges split evenly in the Judges' Choice, Eric Jones was announced to have received more of America's votes than The Masqueraders, and he advanced to the semi-finals.\n\n^2 Due to a technical issue, Light Balance's performance was based on their dress rehearsal.[20]\n\n^3 Another technical issue occurred when the sealed box Aditya was in didn't fall as planned. [21]\n\nWeek 3 (August 29–30) [ edit ]\n\nGuests: Mat Franco, Piff the Magic Dragon, and Jon Dorenbos, August 30[22][23]\n\nAct Order Performance Description Judges' Choices Result Cowell Klum Mel B Mandel DaNell Daymon & Greater Works 1 Gospel Choir; sang \"You're The One That I Want\" from the musical Grease. Won Judges' Choice Junior and Emily Alabi 2 Salsa Dance Duo; danced together to \"Eclipse\" by Hardwell. Eliminated Final Draft 3 Vocal Group; sang a rendition of \"Shape of You\" by Ed Sheeran. Eliminated Oscar Hernandez 4 Dancer; Danced to \"M.I.L.F. $\" by Fergie. Eliminated Angelina Green 5 Singer; sang \"Gravity\" by Sara Bareilles. Lost Judges' Choice Colin Cloud 6 Mentalist; Colin first invited Simon to sit on a bench on the stage. Next, Colin had Mel B point a random audience member to come up on stage and write a reason to kill Simon on a piece of paper. Colin asked the audience to think of naughty memories in detail. Colin identified one such member and correctly guessed that member's memory. Colin then asked the stage audience member to pick a knife from five. He then told Mel to plunge the knife into Simon's chest; the knife turned out to be rubber. Finally he revealed a plaque on the bench already had the reason for murder engraved on the bench. It was revealed that the other four knives were real. Dunkin' Save Mike Yung 7 Singer; sang \"Thinking Out Loud\" by Ed Sheeran. Advanced Oskar and Gaspar 8 Videomapping Act; Video and visual effects were being mapped onto the bodies of two models as they moved to diamonds. Eliminated Sara and Hero 9 Dog Act Advanced Chase Goehring 10 Singer-Songwriter/Guitarist; Performed an original song called \"Illusion\" while playing guitar. Advanced Diavolo 11 Acrobatic Dance Group Advanced Kechi Okwuchi 12 Singer; performed \"By the Grace of God\" by Katy Perry. Advanced\n\n^1 Sara added another dog named Loki in her act. Loki performed throughout the rest of the competition.\n\nSemifinals [ edit ]\n\nThe live semifinals started on September 5, 2017. They featured the 21 acts voted to the semifinals, plus the judges' semifinal wildcard pick. Each week, eleven acts performed; five went through to the finals, and six were eliminated. No acts were buzzed.\n\nKey Advanced (Won Public Vote) Judges' Choice Won Judges' Choice Lost Judges' Choice Dunkin' Save\n\nWeek 1 (September 5–6) [ edit ]\n\nGuests: The Clairvoyants[24]\n\n^1 Chase Goehring, DaNell Daymon & Greater Works, and Mike Yung were not initially announced as performing on week one of semifinals.\n\nWeek 2 (September 12–13) [ edit ]\n\nGuests: Absinthe\n\n^1 Merrick Hanna and Mandy Harvey were switched to perform on Week 2 although they were on the Week 1 promo.\n\n^2 Klum's voting intention was not revealed.\n\nFinals [ edit ]\n\nThe final performances took place on September 19, followed by the final results show on September 20, 2017. No acts were buzzed.\n\nThe season finale took place on September 20, 2017. During the finale results, the top 5 acts were revealed first; then they were eliminated in reverse ranking from fifth place to third place. Darci Lynne Farmer was announced the winner at the end of the finale. She won the million-dollar prize and was set to headline at the PH Showroom at the Las Vegas Planet Hollywood Resort & Casino on November 2, 3, 4 and 5, 2017.\n\nKey Advanced to the Top 5 Top 10\n\nFinale [ edit ]\n\nGuest performers in the finale included Kelly Clarkson, Shania Twain, James Arthur, Derek Hough and Terry Fator.[8] Other celebrity appearances included Marlee Matlin[25] and Jeff Dunham.[26]\n\nThe following chart describes the acts, appearances and segments presented during the finale.\n\nKey 1st place (Winner) 2nd place (Runner-up) 3rd place 4th place 5th place\n\nTop 36 acts [ edit ]\n\nWinner | Runner-up | Third place Finalist | Semi-finalist (eliminated) | Quarter-finalist (eliminated)\n\nWildcard (Semi-finals) Wildcard (Quarter-finals) Golden Buzzer (Auditions) Golden Buzzer (Judge Cuts)\n\nRatings [ edit ]\n\nU.S. Nielsen ratings [ edit ]\n\nShow Episode title First air date Timeslot (EDT) Rating\n\n(18–49) Share\n\n(18–49) Viewers\n\n(millions) Nightly\n\nRank Weekly\n\nRank 1 Auditions Week 1 May 30, 2017 Tuesday\n\n8:00 p.m. 2.7 11 12.32[28] 1 3[29] 2 Auditions Week 2 June 6, 2017 2.7 11 12.53[30] 3[31] 3 Auditions Week 3 June 13, 2017 2.6 11 12.70[32] 2[33] 4 Auditions Week 4 June 20, 2017 2.6 11 12.74[34] 1[35] 5 Auditions Week 5 June 27, 2017 2.5 10 12.36[36] 1[37] 6 Auditions Week 6 July 11, 2017 2.5 10 12.59[38] 1[39] 7 Judge Cuts 1 July 18, 2017 2.5 11 12.57[40] 1[41] 8 Judge Cuts 2 July 25, 2017 2.6 11 13.08[42] 1[43] 9 Judge Cuts 3 August 1, 2017 2.8 12 13.33[44] 1[45] 10 Judge Cuts 4 August 8, 2017 2.7 11 13.32[46] 1[47] 11 Quarterfinals, Week 1 (Performances) August 15, 2017 2.8 11 13.44[48] 1[49] 12 Quarterfinals, Week 1 (Results) August 16, 2017 Wednesday 8:00 p.m. 2.1 9 10.89[50] 2[49] 13 Quarterfinals, Week 2 (Performances) August 22, 2017 Tuesday 8:00 p.m. 2.6 10 12.76[51] 1[52] 14 Quarterfinals, Week 2 (Results) August 23, 2017 Wednesday 8:00 p.m. 2.0 9 10.84[53] 2[52] 15 Quarterfinals, Week 3 (Performances) August 29, 2017 Tuesday 8:00 p.m. 2.6 11 13.13[54] 2[55] 16 Quarterfinals, Week 3 (Results) August 30, 2017 Wednesday 8:00 p.m. 1.9 8 11.07[56] 3[55] 17 Semifinals, Week 1 (Performances) September 5, 2017 Tuesday 8:00 p.m. 2.6 10 13.29[57] 3[58] 18 Semifinals, Week 1 (Results) September 6, 2017 Wednesday 8:00 p.m. 2.1 8 11.99[59] 6[58] 19 Semifinals, Week 2 (Performances) September 12, 2017 Tuesday 9:00 p.m. 2.3 9 11.57[60] 3[61] 20 Semifinals, Week 2 (Results) September 13, 2017 Wednesday 8:00 p.m. 2.1 8 11.59[62] 2[61] 21 The Finals September 19, 2017 Tuesday 8:00 p.m. 3.0 12 14.70[63] 4[64] 22 Season Finale September 20, 2017 Wednesday 8:00 p.m. 3.0 11 15.64[65] 2[64]\n\nSpecials [ edit ]\n\nShow Episode title First air date Timeslot (EDT) Rating\n\n(18–49) Share\n\n(18–49) Viewers\n\n(millions) Nightly\n\nRank Weekly\n\nRank S1 Best of Season 12 Auditions July 13, 2017 Thursday 8:00 p.m. 1.3 6 7.10[66] 2 10[39] S2 Road to Finals[67] August 9, 2017 Wednesday 8:00 p.m. 1.3 6 7.01[68] 2 8[47]\n\nContestants who appeared on other seasons or competition shows [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Crystal_Clear_action_bookmark.png/20px-Crystal_Clear_action_bookmark.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/36/Playing_card_club_A.svg/15px-Playing_card_club_A.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Crystal_Clear_action_button_cancel.svg/20px-Crystal_Clear_action_button_cancel.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/Tyra_Banks_2012_Shankbone.JPG/129px-Tyra_Banks_2012_Shankbone.JPG", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Crystal_Clear_action_bookmark.png/15px-Crystal_Clear_action_bookmark.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/07/Heidi_Klum_by_Glenn_Francis.jpg/126px-Heidi_Klum_by_Glenn_Francis.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/57/Playing_card_heart_A.svg/15px-Playing_card_heart_A.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/99/Question_book-new.svg/50px-Question_book-new.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f4/HowieMandelM07.jpg/141px-HowieMandelM07.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/Mel_B_The_New_Face_of_Jenny_Craig.jpg/135px-Mel_B_The_New_Face_of_Jenny_Craig.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/Crystal_Clear_app_clean.png/20px-Crystal_Clear_app_clean.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/61/Crystal_Clear_app_clean.svg/20px-Crystal_Clear_app_clean.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/01/Yellow_ffff00_pog.svg/15px-Yellow_ffff00_pog.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Simon_Cowell_in_December_2011.jpg/117px-Simon_Cowell_in_December_2011.jpg"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/America%27s_Got_Talent_(season_12)", "title": "America's Got Talent (season 12)", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.11", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}