{"url": "https://ew.com/tv/2017/07/20/game-of-thrones-creators-confederate-backlash/", "text": "Game of Thrones creators David Benioff and D.B. Weiss have responded to criticism of their planned HBO drama series that imagines a modern-day America where slavery is legal, calling the outrage “a little premature.”\n\nOn Wednesday, the network announced Confederate, a new series from the showrunners of the channel’s Emmy-winning, worldwide sensation, Game of Thrones. The alternate-history tale chronicles events leading to the “Third American Civil War,” where the Southern states have successfully seceded from the Union, and slavery has evolved into a modern institution. Online reaction to the concept ranged from curious and excited to shocked and appalled, with some detractors accusing HBO of making a show that sounds like a white supremacist fantasy.\n\nOn Thursday, Benioff and Weiss — along with producers Nichelle Tramble Spellman (Justified) and Malcolm Spellman (Empire) — spoke to Vulture about the project and the backlash it received, with Benioff noting no scripts for Confederate have been written yet.\n\n“So everything is brand new and nothing’s been written,” Benioff said of the show. “I guess that’s what was a little bit surprising about some of the outrage. It’s just a little premature. You know, we might f— it up. But we haven’t yet.”\n\nRELATED: Dive Deep Into GOT‘s Premiere Episode With EW’s Game of Thrones Weekly Podcast\n\nSome Confederate critics took issue with Benioff and Weiss tackling this subject as white men, though their project has two notable writer-producers of color on board, the Spellmans, both of whom said audiences should wait before judging the final product.\n\n“I do understand their concern,” Nichelle Tramble Spellman said. “I wish their concern had been reserved to the night of the premiere, on HBO, on a Sunday night, when they watched and then they made a decision after they watched an hour of television as to whether or not we succeeded in what we set out to do. The concern is real. But I think that the four of us are very thoughtful, very serious, and not flip about what we are getting into in any way. What I’ve done in the past, what Malcolm has done in the past, what the D.B.s have done in the past, proves that. So I would have loved an opportunity for the conversation to start once the show was on the air.”\n\n“You cannot litigate this on Twitter. It’s not possible,” added Malcolm Spellman. “I don’t know that we can change anyone’s mind… but what people have to understand is, and what we are obligated to repeat in every interview is: We’ve got black aunties. We’ve got black nephews, uncles. Black parents and black grandparents. We deal with them every single day. We deal with the struggle every single day. And people don’t have to get on board with what we’re doing based on a press release. But when they’re writing about us, and commenting about us, they should be mindful of the fact that there are no sell-outs involved in this show. Me and Nichelle are not props being used to protect someone else. We are people who feel a need to address issues the same way they do, and they should at least humanize the other end of those tweets and articles.”\n\nRead the full interview over at Vulture.\n\nTo stay up to date on everything Game of Thrones, follow our all-encompassing Facebook page and sign up for our exclusive newsletter\n\nConfederate is said to follow “a broad swath of characters on both sides of the Mason-Dixon Demilitarized Zone – freedom fighters, slave hunters, politicians, abolitionists, journalists, the executives of a slave-holding conglomerate, and the families of people in their thrall.”\n\nThe concept bears some similarity to Amazon’s drama series The Man in the High Castle, which imagines what would happen if German and Japan had won World War II. That series, based Philip K. Dick’s novel, has largely escaped criticism, yet also isn’t about Southern state slavery. Another series that comes to mind is Hulu’s acclaimed dystopian drama The Handmaids Tale, adapted from the book by Margaret Atwood, which posits a future in which most women are infertile, and those who are able to bear children serve as reproductive slaves for the wealthy.\n\nConfederate has been ordered straight to series and is expected to get underway after the eighth and final season of Thrones airs in either 2018 or 2019.\n\nImage zoom\n\nBenioff and Weiss are no strangers to generating controversy on Thrones, a drama that’s tackled the subject of slavery, albeit wrapped in a fantasy setting. The show has also been accused of not having a diverse enough cast (most recently by Star Wars actor John Boyega), though there are several actors of color among its supporting ensemble. The showrunners have previously said they try to avoid paying attention to online reactions and instead focus on making the best show they can.\n\n“You look at a message board and there might be nine positive comments, but the 10th one is negative — and that’s the one you’ll remember, that’s what sticks in your head,” Benioff told EW a few years back. “And you want to have an argument with the person: ‘Well, here’s why this happened [in the show],’ and you can’t. You start having an argument in your mind, and you realize you’re losing your mind. You’re having an internal argument with somebody named DragonQueen42. You’re never going to win that argument.”", "images": ["https://ewedit.files.wordpress.com/2019/05/4-helen-sloan-hbo-1.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630", "https://ewedit.files.wordpress.com/2017/03/got_webtout_612x111_v3_final.jpg", "https://ewedit.files.wordpress.com/2019/06/stranger-things.jpg", "https://ewedit.files.wordpress.com/2019/02/big-little-lies2.jpg?crop=0px%2C113px%2C2700px%2C1419px&resize=1200%2C630", "https://ewedit.files.wordpress.com/2019/07/all-that-ally-brooke-1.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630", "https://ewedit.files.wordpress.com/2019/06/oliver.jpg?crop=0px%2C0px%2C3000px%2C1575px&resize=1200%2C630", "https://ewedit.files.wordpress.com/2019/06/thrones-couples-1.jpg?crop=0px%2C0px%2C3000px%2C1575px&resize=1200%2C630", "https://ewedit.files.wordpress.com/2017/01/mascara-tears.jpg", "https://ewedit.files.wordpress.com/2017/07/d-b-weiss-and-david-benioff-photo-taken-by-art-streiber-august14.jpg?crop=0px%2C58px%2C2700px%2C1419px&resize=1200%2C630", "https://ewedit.files.wordpress.com/2017/09/lennykravitz.jpg?w=768", "https://ewedit.files.wordpress.com/2019/06/netflix-tvs.jpg", "https://ew.com/img/streaming/amazon.png", "https://ewedit.files.wordpress.com/2019/06/the-hills-1-2000.jpg?crop=0px%2C61px%2C2000px%2C1050px&resize=1200%2C630", "https://ew.com/img/icons/generic-image.svg", "https://ewedit.files.wordpress.com/2018/10/celebrity-binge.jpg?w=768", "https://ewedit.files.wordpress.com/2019/06/remini.jpg?crop=0px%2C0px%2C3000px%2C1575px&resize=1200%2C630", "https://secure.gravatar.com/avatar/8507038badc1c41adb48fd6b51538fbd?s=300&d=blank&r=g", "https://ewedit.files.wordpress.com/2017/11/rolestout.jpg?w=768", "https://ewedit.files.wordpress.com/2019/07/black-lady-sketch-comedy.jpg?crop=0px%2C282px%2C2700px%2C1419px&resize=1200%2C630", "https://ewedit.files.wordpress.com/2019/06/big-little-lies-1.jpg", "https://ewedit.files.wordpress.com/2019/07/b002_c013_1107fg_001.1675300r.jpg", "https://ewedit.files.wordpress.com/2019/06/euphoria-2.jpg", "https://ewedit.files.wordpress.com/2019/06/i-will-remember-you-1.jpg?crop=0px%2C0px%2C3000px%2C1575px&resize=1200%2C630", "https://ewedit.files.wordpress.com/2019/06/spanish-princess-e.jpg", "https://ewedit.files.wordpress.com/2019/06/bll-1.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630", "https://ewedit.files.wordpress.com/2019/07/sn2-1680r-1.jpg?crop=0px%2C316px%2C2700px%2C1419px&resize=1200%2C630", "https://ewedit.files.wordpress.com/2019/07/finn-noah.jpg?crop=156px%2C0px%2C1678px%2C881px&resize=1200%2C630", "https://ewedit.files.wordpress.com/2017/12/beyond-the-wall.jpg?crop=633px%2C42px%2C1070px%2C1071px&resize=150%2C150"], "top_img": "https://ewedit.files.wordpress.com/2017/07/d-b-weiss-and-david-benioff-photo-taken-by-art-streiber-august14.jpg?crop=0px%2C58px%2C2700px%2C1419px&resize=1200%2C630", "keywords": [], "authors": ["James Hibberd"], "canonical_link": "https://ew.com/tv/2017/07/20/game-of-thrones-creators-confederate-backlash/", "title": "Game of Thrones creators respond to slavery drama backlash", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "Game of Thrones, Game of Thrones creators, Confederate, Confederate show, HBO Confederate,", "news_keywords": "Game of Thrones, Game of Thrones creators, Confederate, Confederate show, HBO Confederate,", "description": "The show will imagine an alternate history where slavery is still legal and the North and South are about to engage in a third Civil War.", "og": {"title": "'Game of Thrones' Creators Respond to Slavery Drama Backlash", "type": "article", "site_name": "EW.com", "url": "https://ew.com/tv/2017/07/20/game-of-thrones-creators-confederate-backlash/", "description": "'You cannot litigate this on Twitter. It’s not possible,' adds 'Confederate' producer Malcolm Spellman", "image": {"identifier": "https://ewedit.files.wordpress.com/2017/07/d-b-weiss-and-david-benioff-photo-taken-by-art-streiber-august14.jpg?crop=0px%2C58px%2C2700px%2C1419px&resize=1200%2C630", "width": 1200, "height": 630}}, "pinterest": {"url": "https://ew.com/tv/2017/07/20/game-of-thrones-creators-confederate-backlash/", "description": "The show will imagine an alternate history where slavery is still legal and the North and South are about to engage in a third Civil War.", "media": "https://ewedit.files.wordpress.com/2017/07/d-b-weiss-and-david-benioff-photo-taken-by-art-streiber-august14.jpg?crop=0px%2C58px%2C2700px%2C1419px&resize=1200%2C630"}, "twitter": {"card": "summary_large_image", "url": "https://ew.com/tv/2017/07/20/game-of-thrones-creators-confederate-backlash/", "title": "'Game of Thrones' Creators Respond to Slavery Drama Backlash", "description": "The show will imagine an alternate history where slavery is still legal and the North and South are about to engage in a third Civil War.", "site": "@ew", "image": "https://ewedit.files.wordpress.com/2017/07/d-b-weiss-and-david-benioff-photo-taken-by-art-streiber-august14.jpg?crop=0px%2C58px%2C2700px%2C1419px&resize=1200%2C630"}, "fb": {"pages": 52150999700}}, "movies": [], "publish_date": 1500523200.0, "source": "https://ew.com", "summary": ""}