{"url": "https://www.cinemablend.com/news/2402532/new-incredibles-2-poster-gives-us-first-look-at-the-sequels-villain", "text": "New Incredibles 2 Poster Gives Us First Look At The Sequel’s Villain Adam Holmes Random Article Blend It's been 14 years since we saw the Parr family save the world from Syndrome's nefarious scheme, but within the Incredibles timeline, Incredibles 2 picks up immediately where the first movie left off, with the family about to battle The Underminer. John Ratzenberger's underground-obsessed antagonist didn't look like he'd be easy to defeat, but as far as the wider Incredibles 2 story goes, he's not serving as the lead villain. Disney and Pixar have been staying silent about just who the main threat in this movie is, but we finally have our first look at this mysterious baddie thanks to the latest Incredibles 2 poster. Facebook\n\n\n\n\n\ncinemablend\n\n\n\nEmail Suit up. A new #Incredibles2 trailer debuts tomorrow! ???? pic.twitter.com/8hjMUTzlIg — Disney•Pixar (@DisneyPixar) April 12, 2018 While Jack-Jack's adversary in Incredibles 2 is presumably that raccoon, judging by how the baby's trying to incinerate the pest with his heat vision, it's the individual above the movie's logo who will be causing trouble for the folks with special abilities. Granted, the poster doesn't technically label them as the villain, but with a look like that, it's hard to imagine they're going around doing good deeds. Are the glowing goggles just for show or do they allow the villain to hypnotize people? Does the villain have any natural superpowers or do they rely solely on technology/other resources? There's still a lot that needs to be revealed, but at least now we have an idea of what Mr. Incredible, Elastigirl and the rest of the protagonists will be up against in Incredibles 2. Looking at the background of this new Incredibles 2 poster, you can also make out some of the new superheroes who are being introduced in the sequel. The Incredibles went over how following the public being fed up with collateral damage, superheroes were forced to go into retire from their crimefighting activities and stay hidden in plain sight through their secret identities. However, Incredibles 2 will see a campaign to officially bring back the \"supers\" being launched, with Helen Parr, a.k.a. Elastigirl, spearheading the charge on behalf of businessman Winston Deaver (Bob Odenkirk). One of the new heroes we'll meet in Incredibles 2 is Voyd (Sophia Bush), a longtime Elastigirl fan who can make objects appear and disappear, but the other heroes haven't been officially identified yet. I can't help but worry that one of these \"heroes\" might actually be serving the villain. Just because it's a Pixar movie doesn't mean there can't be deception and betrayal. Incredibles 2 opens in theaters on June 15, so keep checking in with CinemaBlend as we learn more about the new characters appearing in the sequel. If you're interested in learning when this year's other movies are coming out, scan through our 2018 release schedule. Blended From Around The Web\n\nBack to top", "images": ["data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR4nGNaOxMAAfwBSW8IE8UAAAAASUVORK5CYII=", "https://ct.pinterest.com/v3/?tid=YourTagID&noscript=1", "https://img.cinemablend.com/quill/1/c/6/5/e/f/1c65ef816984fb0f4cb987e631f62437690dd71e.jpg", "https://i.imgur.com/EmLcl1s.gif", "https://sp.analytics.yahoo.com/spp.pl?a=1000772689113&.yp=431002", "https://sb.scorecardresearch.com/p?c1=2&c2=21229662&cv=2.0&cj=1"], "top_img": "https://img.cinemablend.com/quill/1/c/6/5/e/f/1c65ef816984fb0f4cb987e631f62437690dd71e.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.cinemablend.com/news/2402532/new-incredibles-2-poster-gives-us-first-look-at-the-sequels-villain", "title": "New Incredibles 2 Poster Gives Us First Look At The Sequel’s Villain", "meta_data": {"msapplication-TileColor": "#f5aa06", "msapplication-config": "/static/browserconfig.xml", "theme-color": "#ffffff", "article": {"tag": "Incredibles 2", "publisher": "https://www.cinemablend.com/", "published_time": "2018-04-12T23:14:16+00:00", "modified_time": "2018-10-08T21:19:18+00:00", "section": "news"}, "CinemaBlend": 10042, "page": "story", "description": "Incredibles 2 is just two months away from hitting theaters, and we finally have our first look at the movie's villain.", "robots": "all", "msvalidate.01": "9AA1A3C35B6D716AE80C1B615C6E8FE8", "fb": {"pages": 90893081682, "app_id": 956050344476201, "admins": 585420252}, "og": {"title": "New Incredibles 2 Poster Gives Us First Look At The Sequel’s Villain", "url": "https://www.cinemablend.com/news/2402532/new-incredibles-2-poster-gives-us-first-look-at-the-sequels-villain", "image": {"identifier": "https://img.cinemablend.com/quill/1/c/6/5/e/f/1c65ef816984fb0f4cb987e631f62437690dd71e.jpg", "width": 600, "height": 300}, "description": "Incredibles 2 is just two months away from hitting theaters, and we finally have our first look at the movie's villain.", "type": "article", "site_name": "CINEMABLEND"}, "twitter": {"title": "New Incredibles 2 Poster Gives Us First Look At The Sequel’s Villain", "description": "Incredibles 2 is just two months away from hitting theaters, and we finally have our first look at the movie's villain.", "image": "https://img.cinemablend.com/quill/1/c/6/5/e/f/1c65ef816984fb0f4cb987e631f62437690dd71e.jpg", "card": "summary_large_image", "site": "@cinemablend", "url": "https://www.cinemablend.com/news/2402532/new-incredibles-2-poster-gives-us-first-look-at-the-sequels-villain"}}, "movies": [], "publish_date": 1523574856.0, "source": "https://www.cinemablend.com", "summary": ""}