{"url": "https://www.inquisitr.com/4900296/jada-pinkett-smith-is-still-really-mad-about-tupac-shakurs-death/", "text": "Jada Pinkett Smith is part of a new Facebook Watch series titled Red Table Talk. It has gained quite a bit of interest from fans, and in the second episode of the series, she talked about some very close and personal things, including pain and loss from her past.\n\nAccording to E! Online, the latest news coming from the series is Pinkett Smith reflecting on the death of her close friend, Tupac Shakur.\n\nShakur was killed back in September 1996 in what many viewed as a major mystery. Others believe that Tupac faked his own death, while still others believe that Shakur was killed as an accident and that the real target that night was Suge Knight.\n\nNo matter what the real story is behind his death, Pinkett Smith still finds herself getting “really mad” about his death.\n\n“I’ve had a lot of loss. So many of my close friends gone. They didn’t make it to 30. They didn’t make it past 25. A lot of people talk about my relationship with Pac and figure that out. That was a huge loss in my life.”\n\nShe went on to talk about why his death has such an impact on her life.\n\n“Because he was one of those people I expected to be here. My upset is more anger because I feel like he left me. and I know that’s not true and it’s a very selfish way to think about it… I really did believe he’d be here for the long run. And when I think about it I still get really mad. He played his role…he did what he was meant to do…he’s an icon”\n\nnull\n\nMany people share the same sentiment as Pinkett Smith. Tupac was one of the best musical artists of all time and was a very loved person. His death rocked the entertainment world.\n\nWillow Smith also shared a story of personal loss. Her biggest loss at one point was her sanity.\n\n“I would have to say, honestly feel like I lost my sanity at one point. It was after that whole ‘Whip My Hair’ thing’… I just stopped doing singing lessons and I was kind of like in this gray area of like who am I? Do I have a purpose? Is there anything like that I can do besides this?”\n\nThose that may not have heard about the new series should tune in. Those that did watch the last episode will likely agree with or understand many of the things that Pinkett Smith said about Tupac along with the other topics discussed on the show.", "images": ["https://secure.gravatar.com/avatar/4c4ef2327345d36a953414934ea55324?s=250&d=mm&r=g", "https://cdn.inquisitr.com/wp-content/uploads/2018/05/jada-pinkett-smith-opens-up-about-tupac-1.jpg", "https://www.inquisitr.com/wp-content/uploads/2019/07/Rita-Ora-3-300x170.jpg", "https://cdn.inquisitr.com/assets/ee54ce/dist/images/logos/favicon.png", "https://www.facebook.com/tr?id=1472001486461948&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=478801082325642&ev=PageView&noscript=1", "https://cdn.inquisitr.com/assets/ee54ce/dist/images/logos/logo_header_no_tagline.png"], "top_img": "https://cdn.inquisitr.com/assets/ee54ce/dist/images/logos/favicon.png", "keywords": [], "authors": ["Evan Massey"], "canonical_link": "https://www.inquisitr.com/4900296/jada-pinkett-smith-is-still-really-mad-about-tupac-shakurs-death/", "title": "Jada Pinkett Smith Is Still ‘Really Mad’ About Tupac Shakur’s Death", "meta_data": {"msapplication-TileImage": "//cdn.inquisitr.com/assets/ee54ce/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "https://www.inquisitr.com", "summary": ""}