{"url": "https://en.wikipedia.org/wiki/The_Thrill_of_It_All_(Sam_Smith_album)", "text": "2017 studio album by Sam Smith\n\nThe Thrill of It All is the second studio album by English singer and songwriter Sam Smith.[3] It was released on 3 November 2017 through Capitol Records.[4]\n\nBackground [ edit ]\n\nOn 6 October 2017, Smith announced via Twitter that his second album, titled \"The Thrill of It All\", was to be released on 3 November 2017.[5] It is Smith's second full album of material after his hugely successful debut album In the Lonely Hour (2014), which has sold 12 million copies worldwide.\n\nSpeaking to Billboard about the album, Smith said:\n\n\"I went through, like, this vortex, came out, I feel like I've rebuilt myself as a stronger thing and I'm just gonna go into the vortex again,\" he says in a preview that features a montage of studio sessions. \"I wasn't trying to make a big pop record when I made this album. I was actually just trying to make something personal and like a diary.\"[6]\n\nSingles [ edit ]\n\n\"Too Good at Goodbyes\" was released as the album's lead single on 8 September 2017. It topped the UK Singles Chart and peaked No. 4 on the US Billboard Hot 100.[3]\n\n\"One Last Song\" was sent to radio in the United Kingdom on 3 November 2017, on the day of album release as its second single.[7][8]\n\nOn 27 March 2018, Smith announced that \"Pray\" would serve as the third single, and would feature newly recorded guest vocals from American rapper Logic. The song was released on 29 March 2018.[9]\n\n\"Baby, You Make Me Crazy\" was released as the fourth single from the album on 29 June 2018.\n\nPromotional singles [ edit ]\n\nOn 6 October 2017, Smith released \"Pray\", a gospel-tinged ballad in collaboration with Timbaland, prompted by time spent in Iraq with the charity War Child as a promotional single from the album.[3][10] Another promotional single, \"Burning\", was released on 27 October 2017.[11]\n\nTour [ edit ]\n\nWithin releasing \"Pray\" as the promotional single on 6 October 2017, The Thrill of It All Tour was announced firstly revealing shows in Europe and North America. It began on 20 March 2018 in Sheffield, England, and it is set to conclude on 18 April 2019 in Cape Town, South Africa. In December 2018, Billboard concluded that after 94 shows, Smith grossed $86.1 million and sold 1.07 million tickets on The Thrill of It All Tour.[12] It pushed his career total gross to $102.7 million from 1.4 million tickets sold.[12]\n\nNotes [ edit ]\n\nBox office score data [ edit ]\n\nCity Tickets sold / available Gross revenue Glasgow 21,969 / 22,246 $1,347,440[17] Manchester 32,433 / 32,433 $2,044,250[18] London 65,920 / 68,728 $4,755,660[19] Berlin 7,997 / 10,006 $509,309[20] Hamburg 11,025 / 12,219 $711,730[21] Zurich 11,441 / 11,550 $918,098[22] Montreal 12,294 / 13,098 $845,118[23] Brooklyn 13,336 / 13,583 $1,185,953[24] New York 25,741 / 26,662 $2,331,605[24] Nashville 15,808 / 15,808 $949,285[25] Houston 9,720 / 9,720 $728,302[26] Dallas 13,379 / 13,904 $997,797[27] Austin 8,316 / 9,118 $698,438[25] Mexico City 14,683 / 14,683 $1,029,510[28] Chicago 13,319 / 13,319 $1,122,824[29] Anaheim 12,234 / 14,367 $929,671[30] Sacramento 13,360 / 13,360 $975,395[31] Los Angeles 27,307 / 27,307 $2,330,044[32] Oakland 11,511 / 11,511 $1,019,328[28] San Jose 10,602 / 10,602 $976,419[28] Singapore 16,025 / 16,025 $2,724,527[33] Manila 6,751 / 6,751 $783,893[33] Seoul 17,377 / 17,377 $2,001,979[33] Saitama 15,533 / 15,533 $1,855,870[33] Osaka 6,455 / 6,455 $764,159[33] Cotai 3,416 / 3,416 $684,043[33] Shanghai 9,372 / 9,372 $1,351,361[33] Beijing 6,874 / 6,874 $935,931[33] Bangkok 9,965 / 9,965 $1,484,909[33] Auckland 21,455 / 21,455 $1,404,965[34] Melbourne 26,729 / 26,729 $2,157,060[34] Brisbane 16,720 / 16,720 $1,406,254[34] Sydney 27,713 / 41,568 $2,495,300[35] Perth 12,257 / 12,257 $1,100,930[35]\n\nCritical reception [ edit ]\n\nThe Thrill of It All received generally positive reviews from music critics. On Metacritic, which assigns a normalised rating out of 100 to reviews from mainstream publications, the album received an average score of 72 based on 16 reviews.[37]\n\nNeil McCormick of The Daily Telegraph gave the album four stars, and was highly positive about it and Smith's vocals, calling them \"supernatural\" and saying: \"The Thrill of It All doesn't just wallow in love's misery, it practically drowns in the stuff. Its 10 songs are almost unrelentingly miserable, self-absorbed and self-pitying, verging on the lachrymose and sentimental (as lovers in the midst of a break-up often are). The instrumentation is understated piano and strings blended with just the occasional hint of contemporary hip-hop effects. At times, Smith's lyrics display a slightly clunking prosaicness. There's not much poetry in lines such as 'real love is never a waste of time' or 'there’' no insurance to pay for the damage'. Yet it all hits home, because Smith makes every note sound like a matter of life and death. 'Him' is the album’s centrepiece, a gospel drama addressed to a judgmental 'father', insisting on Smith's right to love whom he chooses. It is a kind of hymn to Him, and as the choir powers up it gains a righteous glory.\"[39] Andy Gill from The Independent also gave a four-star review, and shared in the positivity about the album, remarking: \"Smith's voice remains a thing of wonder throughout\".[42]\n\nWill Hermes for Rolling Stone also gave a positive four-star review, and said: \"Doubling down on his magnificent, gender-nonconforming voice while pushing his songcraft forward, Smith's second LP knights one of the mightiest, most expressive vocalists of his generation.\"[46] In another positive review Nick Levine from NME compared Smith to Adele in his review of the album, stating: \"Both have become enormously successful by singing emotional ballads that connect with huge numbers of people, and both are understandably reluctant to raise the tempo as a result. But like Adele's 25, this is an undeniably accomplished album that will, deservedly, shift a helluva lot of copies.[43] AllMusic's Andy Kellman was positive too in his three and a half-star review, and opined: \"this album maintains a consistency and intensity that places it slightly above the debut.\"[38]\n\nSome reviews were more negative. Though making it his album of the week and giving it three stars, Alexis Petridis from The Guardian was more mixed in his review, writing: \"There’s a certain power to \"The Thrill of It All\" but it could have been a much more potent album if they’d laid off the polish just a little.\"[41] Kitty Empire from The Observer was less enthusiastic in a more negative two-star review, claiming Smith was \"moping by numbers\" like Adele, and surmised: \"There is little drama here, just plenty of shorthand (sad pianos), a total absence of risk\"[44]\n\nAccolades [ edit ]\n\nPublication Accolade Rank Ref. Rolling Stone 50 Best Albums of 2017 10 [48] Melty Best Pop Albums of the Year 10 [49]\n\nCommercial performance [ edit ]\n\nThe Thrill of It All topped the UK Albums Chart in its first week of release with 97,328 combined units (consisting of 83,637 sales and 13,691 sales-equivalent streams), giving Smith his second number-one album in the nation after In the Lonely Hour (2014). It also had the fifth-largest opening there at the time for a 2017 album.[50][51] The record fell to number two the next week with a combined total of 52,781 units.[52][53] before returning to the top spot three weeks later[54] and being displaced by Ed Sheeran's ÷ the following week.[55] In Australia, the album opened at number two on the ARIA Albums Chart, becoming the singer's second album to enter at that position after In the Lonely Hour.[56] It additionally debuted at number one on the Irish[57] and Scottish charts.[58]\n\nThe album debuted at number one on the US Billboard 200 with 237,000 album-equivalent units, including 185,000 pure sales, giving Smith his first chart-topper and highest opening sales in the United States. It also had the country's seventh-largest album opening of the year at the time.[59] The Thrill of It All dropped to number two the following week, earning 66,000 album-equivalent units.[60] It also became his first number one on the Canadian Albums Chart, debuting with 16,000 units, including 9,500 copies.As of April 2019 the album has sold over four million copies worldwide.[61]\n\nTrack listing [ edit ]\n\nSpecial edition bonus tracks[4] No. Title Writer(s) Producer(s) Length 11. \"Nothing Left for You\" S. Smith\n\nNapier Fitzmaurice\n\nNapes 3:46 12. \"The Thrill of It All\" S. Smith\n\nGrieve\n\nJames Fitzmaurice\n\nNapes\n\nGrieve 3:28 13. \"Scars\" S. Smith\n\nGrieve Grieve\n\nFitzmaurice 3:03 14. \"One Day at a Time\" S. Smith\n\nSimon Aldred Fitzmaurice\n\nNapes 3:29 Total length: 49:24\n\nTarget and Japanese bonus tracks[62][63] No. Title Writer(s) Length 15. \"Leader of the Pack\" S. Smith\n\nGrieve\n\nDuncan Boyce 2:38 16. \"Blind Eye\" S. Smith\n\nFrancis White 1:48 Total length: 53:50\n\nNotes\n\n^[a] signifies an additional producer\n\nsignifies an additional producer Track 6, \"Him\", is stylised as \"HIM\".\n\nSample credits\n\n\"One Last Song\" contains samples from \"Be a Lion\" from The Wiz Original Cast\n\nOriginal Cast \"Baby, You Make Me Crazy\" contains samples from the recording, \"Breeze and Soul\" as performed by Ed Watson & The Brass Circle\n\nCharts [ edit ]\n\nCertifications [ edit ]\n\nRelease history [ edit ]\n\nRegion Date Format(s) Label Ref. Various 3 November 2017 CD\n\ndigital download\n\nstreaming Capitol [126]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/8/81/Star_half.svg/11px-Star_half.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/6/67/SamSmithThrillOfItAll.png/220px-SamSmithThrillOfItAll.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Star_empty.svg/11px-Star_empty.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/6/67/SamSmithThrillOfItAll.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Star_full.svg/11px-Star_full.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/6/67/SamSmithThrillOfItAll.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/The_Thrill_of_It_All_(Sam_Smith_album)", "title": "The Thrill of It All (Sam Smith album)", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.11", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/6/67/SamSmithThrillOfItAll.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}