{"url": "https://en.wikipedia.org/wiki/Star_Wars:_The_Last_Jedi", "text": "\"Episode VIII\" redirects here. For other similarly known episodes, see Episode 8\n\n2017 American epic space opera film in the Star Wars series\n\nStar Wars: The Last Jedi (also known as Star Wars: Episode VIII – The Last Jedi) is a 2017 American epic space-opera film written and directed by Rian Johnson. It is the second installment of the Star Wars sequel trilogy, following The Force Awakens (2015). It was produced by Lucasfilm and distributed by Walt Disney Studios Motion Pictures. The film's ensemble cast includes Mark Hamill, Carrie Fisher, Adam Driver, Daisy Ridley, John Boyega, Oscar Isaac, Andy Serkis, Lupita Nyong'o, Domhnall Gleeson, Anthony Daniels, Gwendoline Christie, and Frank Oz in returning roles, with Kelly Marie Tran, Laura Dern and Benicio del Toro joining the cast. It features the first posthumous film performance by Fisher, who died in December 2016, and the film is dedicated to her memory. The plot follows Rey as she receives Jedi training from Luke Skywalker, in hopes of turning the tide for the Resistance in the fight against Kylo Ren and the First Order, while General Leia Organa, Finn, and Poe Dameron attempt to escape a First Order attack on the dwindling Resistance fleet. It is the eight film in the nine-part “Skywalker saga”.\n\nThe Last Jedi is part of a new trilogy of films announced after Disney's acquisition of Lucasfilm in October 2012. It was produced by Lucasfilm president Kathleen Kennedy and Ram Bergman, and executive produced by The Force Awakens director J. J. Abrams. John Williams, composer for the previous episodic films, returned to compose the score. A number of scenes were filmed at Skellig Michael in Ireland during pre-production in September 2015, but principal photography began at Pinewood Studios in England in February 2016, and wrapped in July 2016. Post-production was finished in September 2017.\n\nThe Last Jedi had its world premiere at the Shrine Auditorium in Los Angeles on December 9, 2017, and was released in the United States on December 15, 2017. It grossed over $1.3 billion worldwide, becoming the highest-grossing film of 2017, the seventh-highest-ever grossing film in North America and the ninth-highest-grossing film of all time during its theatrical run. It is also the second-highest-grossing film of the Star Wars franchise, and turned a net profit of over $417 million. The film received positive reviews, with praise for its ensemble cast, musical score, visual effects, action sequences and emotional weight.[5][6][7][8] The film received four nominations at the 90th Academy Awards, including Best Original Score and Best Visual Effects, as well two nominations at the 71st British Academy Film Awards. A sequel, titled The Rise of Skywalker, is scheduled for release on December 20, 2019.[9]\n\nPlot\n\nShortly after the destruction of Starkiller Base, General Leia Organa leads the flight of Resistance forces from D'Qar, when a First Order fleet arrives. Poe Dameron leads a costly counterattack that destroys a First Order dreadnought, and the remaining Resistance escapes into hyperspace. Rey, having traveled to Ahch-To with Chewbacca and R2-D2 aboard the Millennium Falcon, attempts to recruit Luke Skywalker to the Resistance. Disillusioned by his failure to train Kylo as a Jedi, and under self-imposed exile, Luke refuses to help and says that the Jedi should end. Meanwhile, the First Order uses a device to track the Resistance, and attacks them. Leia's son Kylo Ren hesitates to fire on the lead Resistance ship after sensing his mother's presence, but his wingmen destroy the bridge, killing most of the Resistance's leaders. Leia is dragged into space, but survives by using the Force.\n\nEncouraged by R2-D2, Luke decides to train Rey as a Jedi. Rey and Kylo begin communicating through the Force, puzzling them both. After Kylo tells Rey what happened between him and Luke that caused him to choose the dark side, Luke confesses that he momentarily contemplated killing Kylo upon sensing that Snoke was corrupting him; this prompted Kylo to destroy Luke's new Jedi Order. Convinced that Kylo can be redeemed, Rey leaves Ahch-To. Luke prepares to burn the Jedi library, but hesitates. Yoda's Force ghost appears and destroys the library by summoning a bolt of lightning, saying that Rey has all she needs to learn, and encouraging Luke to learn from his failure.\n\nMeanwhile, Poe entrusts Finn, mechanic Rose Tico, and BB-8 with a secret mission to find someone who can deactivate the First Order's tracking device, which Maz Kanata says they can find on Canto Bight. They meet the hacker DJ, and escape the city with the help of some stablehand children and riding animals they set free. Finn and Rose infiltrate Snoke's ship—as Rey also arrives—but are captured by Captain Phasma. Kylo brings Rey to Snoke, who says that he facilitated the connection between her and Kylo as part of a plan to defeat Luke. Meanwhile, new Resistance leader Vice Admiral Holdo reveals her plan to evacuate the remaining Resistance members using small transports. Believing her actions to be cowardly and futile, Poe leads a mutiny. Leia recovers and stuns Poe, allowing the evacuation to begin. Holdo remains on the ship to mislead Snoke's fleet as the others flee to an abandoned base on Crait. In exchange for his freedom, DJ reveals the Resistance's plan to the First Order, and the evacuation transports are destroyed one after another.\n\nOrdered to kill Rey, Kylo instead kills Snoke and defeats his guards alongside Rey. Rey hopes that Kylo has abandoned the dark side, but he instead asks her to rule the galaxy with him. Refusing, she and Kylo battle using the Force to obtain Anakin Skywalker's lightsaber, splitting it in two. Holdo sacrifices herself by ramming into Snoke's flagship at lightspeed, crippling it. Meanwhile, Rey escapes while Kylo declares himself Supreme Leader. BB-8 frees Finn and Rose; they defeat Phasma and join the survivors on Crait. When the First Order arrives, Poe, Finn, and Rose attack with old speeders. Rey and Chewbacca draw TIE fighters away in the Falcon, while Rose diverts Finn from attacking the enemy siege cannon, which subsequently penetrates the Resistance fortress.\n\nLuke appears and confronts the First Order to enable the surviving Resistance to escape. Kylo orders the First Order's forces to fire on Luke, who is unharmed. He then engages Luke in a lightsaber duel; upon striking Luke, Kylo realizes that he has been fighting a Force projection. Rey helps the remaining Resistance escape on the Falcon. Luke then dies peacefully on Ahch-To, becoming one with the Force. Rey and Leia sense his death, and Leia tells her that the Resistance can rise again. At Canto Bight, one of the stablehand children moves a broom with the Force and gazes into space.\n\nCast\n\nJoonas Suotamo appears as Chewbacca, taking over the role from Peter Mayhew after previously serving as his body double in The Force Awakens. Mayhew, who was 73 years old and suffering from chronic knee and back pain,[23] is credited as \"Chewbacca consultant\". Billie Lourd, Mike Quinn, and Timothy D. Rose reprise their roles as Lieutenant Connix, Nien Nunb, and Admiral Ackbar respectively.[24][25][26] Due to the death of Erik Bauersfeld, Admiral Ackbar is now voiced by Tom Kane. Amanda Lawrence appears as Commander D'Acy, and Mark Lewis Jones and Adrian Edmondson play Captains Canady and Peavey respectively. BB-8 is controlled by puppeteers Dave Chapman and Brian Herring,[27] with initial voice work by Ben Schwartz and final sound effects voiced by Bill Hader modulated through a synthesizer.[28] Jimmy Vee portrays R2-D2, taking over the role from Kenny Baker, who died on August 13, 2016.[29][30] Veronica Ngo portrays Rose's sister Paige Tico, a Resistance gunner who sacrifices her life to destroy a First Order dreadnought.[31]\n\nJustin Theroux plays the master codebreaker. Lily Cole plays his companion.[32] Joseph Gordon-Levitt has a voice cameo as Slowen Lo.[33] Warwick Davis plays Wodibin.[34] Gareth Edwards, director of the Star Wars Anthology film Rogue One,[35] has a cameo appearance as a Resistance Soldier, as does Gary Barlow.[36] Edgar Wright and Joe Cornish also cameo in the film. Hermione Corfield appears as Tallissan \"Tallie\" Lintra, a Resistance A-Wing pilot and squadron leader. Noah Segan and Jamie Christopher appear as Resistance pilots Starck and Tubbs.[37] Hamill's children, Griffin, Nathan, and Chelsea, cameo as Resistance soldiers. Prince William, Duke of Cambridge and Prince Harry filmed cameo appearances as stormtroopers.[38] Tom Hardy also filmed an appearance as a stormtrooper, but his cameo was dropped from the final cut.[39] Hugh Skinner cameos as a Resistance Officer.[40]\n\nProduction\n\nDevelopment\n\nIn October 2012, Star Wars creator George Lucas sold his production company Lucasfilm, and with it the Star Wars franchise, to The Walt Disney Company. Disney announced a new trilogy of Star Wars films.[41] J. J. Abrams was named director of the first episode in the trilogy, The Force Awakens, in January 2013.[42][43] In June 2014, director Rian Johnson was reported to be in talks to write and direct its sequel, Episode VIII, and to write a treatment for the third film, Episode IX, with Ram Bergman producing both films.[44][45] Johnson confirmed in August 2014 that he would direct Episode VIII.[46] In September, filmmaker Terry Gilliam asked Johnson about what it felt like to take over something made famous by another filmmaker. Johnson responded:\n\nI'm just starting into it, but so far, honestly, it's the most fun I've ever had writing. It's just joyous. But also for me personally, I grew up not just watching those movies but playing with those toys, so as a little kid, the first movies I was making in my head were set in this world. A big part of it is that direct connection, almost like an automatic jacking back into childhood in a weird way. But I don't know, ask me again in a few years and we'll be able to talk about that.[47]\n\nThe story begins immediately after the last scene of The Force Awakens.[35] Johnson had his story group watch films such as Twelve O'Clock High, The Bridge on the River Kwai, Gunga Din, Three Outlaw Samurai, Sahara, and Letter Never Sent for inspiration while developing ideas.[35][48] He felt it was difficult to work on the film while The Force Awakens was being finished.[35]\n\nIn December 2015, Lucasfilm president Kathleen Kennedy said, \"we haven't mapped out every single detail [of the sequel trilogy] yet\", and that Abrams was collaborating with Johnson and that Johnson would in turn work with (then) Episode IX director Colin Trevorrow to ensure a smooth transition.[49] Abrams is an executive producer along with Jason McGatlin and Tom Karnowski.[50] Lucasfilm announced the film's title, Star Wars: The Last Jedi, on January 23, 2017.[51]\n\nDuring production, Hamill expressed disagreement with the direction his character was taken, finding the character's more disillusioned status to be contradictory to his previous optimism.[52] Hamill later said that he regretted making his initial misgivings public and compared his disagreements to clashes he had with George Lucas during the filming of Return of the Jedi.[52]\n\nCasting\n\nIn September 2015, Disney shortlisted the female cast members to Gina Rodriguez, Tatiana Maslany, and Olivia Cooke.[53] Later that month, Benicio del Toro confirmed that he would play a villain in the film,[54] and Mark Hamill was also confirmed.[10] In October 2015, Gugu Mbatha-Raw was rumored to have been cast in the film.[55] In November, Jimmy Vee was cast as R2-D2.[29] In November, Kennedy announced at the London premiere of The Force Awakens that the entire cast would return for Episode VIII, along with \"a handful\" of new cast members.[11] In February 2016, at the start of filming, it was confirmed that Laura Dern and Kelly Marie Tran had been cast in unspecified roles.[21] In April 2017, at Star Wars Celebration Orlando, Lucasfilm announced that Tran plays Resistance maintenance worker Rose Tico, which Johnson described as the film's largest new role.[18][19] To keep Frank Oz's return as Yoda a secret, producers excluded Oz's name in the billing for the film's pre-release marketing and ensured that Oz stayed on set during filming.[22]\n\nFilming\n\nSecond unit photography began during pre-production at Skellig Michael in Ireland on September 14, 2015, due to the difficulties of filming at that location during other seasons. It would have lasted four days,[56][57][58] but filming was canceled for the first day due to poor weather and rough conditions.[59] In November 2014, Ivan Dunleavy, chief executive of Pinewood Studios, confirmed that the film would be shot at Pinewood,[60] with additional filming in Mexico.[15] In September 2015, del Toro revealed that principal photography would begin in March 2016;[54] Kennedy later said filming would begin in January 2016.[11] The production began work on the 007 Stage at Pinewood Studios on November 15, 2015.[61] Rick Heinrichs served as production designer.[62]\n\nIn January 2016, production of Episode VIII was delayed until February due to script rewrites.[63] Filming was in danger of being delayed further due to an upcoming strike between the Producers Alliance for Cinema and Television and the Broadcasting, Entertainment, Cinematograph and Theatre Union.[64] On February 10, 2016, Disney CEO Bob Iger confirmed that principal photography had begun[65] under the working title Space Bear.[35] Additional filming took place in Dubrovnik, Croatia from March 9 to 16,[66][67] as well as in Ireland in May.[68] Malin Head in County Donegal and a mountain headland, Ceann Sibeal in County Kerry, served as additional filming locations.[69] To increase the scenes' intimacy Driver and Ridley were both present when filming Kylo and Rey's Force visions.[70] Location filming for the battle scenes on the planet Crait took place in July at the Salar de Uyuni salt flats in Bolivia.[71]\n\nPrincipal photography wrapped on July 22, 2016,[72] though as of early September, Nyong'o had not filmed her scenes.[73] In February 2017, it was announced that sequences from the film were shot in IMAX.[74] Production designer Rick Heinrichs said the original screenplay called for 160 sets, double what might be expected, but that Johnson did some \"trimming and cutting\". Ultimately 125 sets were created on 14 sound stages at Pinewood Studios.[75]\n\nAccording to creature designer Neal Scanlan, The Last Jedi uses more practical effects than any Star Wars film, with 180 to 200 creatures created with practical effects, some cut from the final edit.[76] For Yoda's appearance in the film as a Force ghost, the character was created using puppetry, as was done in the original Star Wars trilogy (as opposed to computer-generated imagery, which was used to create Yoda in most of the prequel trilogy).[77]\n\nThe film's Canto Bight sequence contains a reference to the 1985 Terry Gilliam film Brazil, in which Finn and Rose are arrested for committing parking violation 27B/6.[78]\n\nMusic\n\nIn July 2013, Kennedy announced at Star Wars Celebration Europe that John Williams would return to score the Star Wars sequel trilogy.[79][80] Williams confirmed his assignment for The Last Jedi at a Tanglewood concert in August 2016,[81] stating he would begin recording the score \"off and on\" in December 2016 until March or April 2017.[82] On February 21, 2017, it was confirmed that recording was underway, with both Williams and William Ross conducting the sessions.[83][84]\n\nIn lieu of a traditional spotting session with Johnson, Williams was provided a temp track of music from his previous film scores as a reference for scoring The Last Jedi.[85] The score briefly quotes \"Aquarela do Brasil\" by Ary Barroso in its \"Canto Bight\" track as another reference to the film Brazil. It also contains a brief quote of Williams performing[86] his own theme for The Long Goodbye (co-composed by Johnny Mercer) during Finn and Rose's escape, but this is not in the official soundtrack release.[87]\n\nThe official soundtrack album was released by Walt Disney Records on December 15, 2017 in digipak CD, digital formats, and streaming services.[88]\n\nRelease\n\nIn January 2015, Disney CEO Bob Iger stated that Episode VIII would be released in 2017,[89] and in March, Lucasfilm announced a release date of May 26, 2017.[90][91] In January 2016, The Last Jedi was rescheduled for December 15, 2017 in 3D and IMAX 3D.[50][92] On January 23, 2017, the film's title was announced as Star Wars: The Last Jedi.[51] Similarly to The Empire Strikes Back, Return of the Jedi and The Force Awakens, \"Episode VIII\" was included in the film's opening crawl.[93]\n\nThe Last Jedi had its world premiere at the Shrine Auditorium in Los Angeles on December 9, 2017.[94] The European premiere was held at the Royal Albert Hall in London on December 12, 2017, with a red carpet event.[95]\n\nIt was reported that Disney had placed notable conditions on U.S. cinemas screening The Last Jedi, which some operators described as onerous. Disney required that the film be screened in a cinema's largest auditorium for a four-week period (other Disney releases have had similar clauses, but only for two weeks), and was given a 65% cut of ticket sales (a percentage higher than the 55–60% average of other major films, and cited as the highest split ever demanded by a Hollywood film behind the 64% split of The Force Awakens). The agreement, which was required to be kept confidential, also contained regulations on promotions and restrictions on removing any scheduled screening. Violations were to be penalized with an additional 5% cut of ticket sales. Because of this, some cinemas declined to screen the film, particularly smaller or one-screen cinemas that would otherwise be barred from screening any other film during the commitment period. Industry representatives considered this policy reasonable, citing the performance of Disney releases and the Star Wars franchise, and that the guaranteed business attracted by the film, and concession sales, would make up for the larger cut of ticket sales.[96][97][98][99]\n\nMarketing\n\nA set of eight promotional postage stamps were released on October 12, 2017, in the UK by the Royal Mail with artwork by Malcolm Tween.[100] On September 19, 2017, Australia Post released a set of stamp packs.[101] Tie-in promotional campaigns were done with Nissan Motors and Bell Media, among others. Two main trailers were released, followed by numerous television spots. Figurines of many of the characters were released in October, and advance tickets for Last Jedi went on sale in October.\n\nSeveral tie-in books were released on the same day of the North American release of the movie, including The Last Jedi: Visual Dictionary, and various children's reading and activity books. Related novelizations included the prequel book Cobalt Squadron, and the Canto Bight, a collection of novellas about the Canto Bight Casino.\n\nAs with The Force Awakens, there is no official tie-in game for The Last Jedi, in favor of integrating content from the film into other Star Wars video games,[102] including Star Wars Battlefront II, which introduced various content from the film, during the second week of the game's first \"season\".[103] An update to the MOBA mobile game Star Wars: Force Arena added new content from the sequel era, including some characters as they appeared in The Last Jedi. Characters from the film also appeared in the mobile RPG Star Wars: Galaxy of Heroes.\n\nHome video releases\n\nWalt Disney Studios Home Entertainment released Star Wars: The Last Jedi digitally in HD and 4K via digital download and Movies Anywhere on March 13, 2018, with an Ultra HD Blu-ray, Blu-ray, and DVD physical release on March 27. It was the first Star Wars film to be released on the Ultra HD Blu-ray format.[104]\n\nTie-in literature and merchandise\n\nThe official novelization is by Jason Fry, with an audiobook version narrated by Marc Thompson. There is a \"junior novel\" by Michael Kogge (2018 Lucasfilm Press), and an audiobook version narrated by Jessica Almasy.\n\nReception\n\nBox office\n\nStar Wars: The Last Jedi grossed $620.2 million in the United States and Canada, and $712.6 million in other territories, for a worldwide total of $1.333 billion.[4] It had a worldwide opening of $450.8 million, the seventh-biggest of all time, including $40.6 million that was attributed to IMAX screenings, the second biggest for IMAX.[105][106] It was estimated that the film would need to gross $800 million worldwide to break even;[107] Deadline Hollywood calculated the net profit of the film to be $417.5 million, when factoring together all expenses and revenues, making it the most profitable release of 2017.[2]\n\nOn December 31, 2017, its 17th day of release, it passed the $1 billion threshold, becoming the fourth film of 2017, the fifteenth Disney film, the fourth Star Wars film and the thirty-second film overall to pass the mark.[108][109] The film was the highest-grossing film of 2017, the second highest-grossing film in the franchise (behind The Force Awakens), the fourth highest-grossing film released by Walt Disney Studios, the sixth highest-grossing film in North America and the ninth-highest-grossing film of all time.[110][111][112][113]\n\nUnited States and Canada\n\nPre-sale tickets went on sale in the United States on October 9, 2017, and as with The Force Awakens and Rogue One, ticket service sites such as Fandango had their servers crash due to heavy traffic and demand.[114] In the United States and Canada, industry tracking had The Last Jedi grossing around $200 million from 4,232 theaters in its opening weekend.[115] The film made $45 million from Thursday night previews, the second-highest amount ever (behind The Force Awakens' $57 million).[116] It went on to make $104.8 million on its first day (including previews) and $220 million over the weekend, both the second-highest amounts of all time.[117] The opening weekend figure included an IMAX opening-weekend of $25 million, the biggest IMAX opening of the year and the second biggest ever behind The Force Awakens.[118]\n\nAfter dropping by 76% on its second Friday, the worst Friday-to-Friday drop in the series, the film fell by a total of 67.5% in its second weekend, grossing $71.6 million. It was the largest second-weekend drop of the franchise, although it remained atop the box office.[119] The three day total was the 14th biggest second weekend of all time.[120] It grossed an additional $27.5 million on Christmas Day, the second biggest Christmas Day gross of all time behind The Force Awakens ($49.3 million), for a four-day weekend total of $99 million.[121] It made $52.4 million in its third weekend, again topping the box office. It also brought its domestic total to $517.1 million, overtaking fellow Disney vehicle Beauty and the Beast as the highest of 2017.[122] It was the sixth biggest third weekend of all time.[123] It had the seventh biggest New Year's Day gross of all time with $14.3 million, bringing the four day total to $66.8 million.[124][125] It grossed $23.7 million and was surpassed the following weekend by Jumanji: Welcome to the Jungle (which was in its third week) and Insidious: The Last Key.[126]\n\nOther countries\n\nIn its first two days of release the film made $60.8 million from 48 markets. The top countries were the United Kingdom ($10.2 million), Germany ($6.1 million), France ($6 million), Australia ($5.6 million) and Brazil ($2.5 million).[127] By the end of the weekend, the film made $230.8 million outside the US and Canada, the ninth-highest of all time. This included $36.7 million in the UK (third-highest), $23.6 million in Germany (second-highest), $18.1 million in France, $15.9 million in Australia (second-highest), $14.4 million in Japan, $8.5 million in Russia, $8.3 million in Spain, $7.2 million in Brazil, $7 million in Italy and Mexico, $6.0 million in Sweden and $5.1 million in South Korea.[128] On its second weekend, it grossed $76.1 million overseas and became the fourth-highest-grossing film of the year in Europe.[129] As of January 21, the largest markets outside of the United States and Canada are the United Kingdom ($109.3 million), Germany ($79.8 million), France ($63.5 million), Japan ($60.8 million) and Australia ($43.5 million).[130]\n\nThe film had a $28.7 million opening weekend in China, the lowest for a Star Wars film in that country since 2005. Star Wars: The Force Awakens opened to $52 million two years prior and Rogue One, which featured Chinese stars Donnie Yen and Jiang Wen, opened to $30 million in 2016. The Last Jedi added only $7 million during the week, to reach a total of $34.2 million in its first seven days. A week after its debut, China's movie exhibitors dropped the film's showtimes by 92 percent, from its 34.5% percent share of the territory's total screenings.[131][132][133][134] The film grossed $910,000 in its third weekend, dropping to ninth place at the Chinese box office, overshadowed by new releases including Bollywood film Secret Superstar, Hollywood films Ferdinand and Wonder, and Chinese film A Better Tomorrow 2018. The Last Jedi grossed $41 million in China, as of January 21, 2018.[135]\n\nCritical response\n\nThe review aggregator website Rotten Tomatoes reported that 91% of critics have given the film a positive review based on 443 reviews, with an average rating of 8.08/10. The website's critics consensus reads, \"Star Wars: The Last Jedi honors the saga's rich legacy while adding some surprising twists — and delivering all the emotion-rich action fans could hope for.\"[136] At Metacritic, the film has a weighted average score of 85 out of 100 based on 56 critics, indicating \"universal acclaim\".[137]\n\nMatt Zoller Seitz of RogerEbert.com gave the film four out of four stars, praising the surprises and risks that it took, writing that \"The movie works equally well as an earnest adventure full of passionate heroes and villains and a meditation on sequels and franchise properties ... [The film] is preoccupied with questions of legacy, legitimacy and succession, and includes multiple debates over whether one should replicate or reject the stories and symbols of the past.\"[138] Writing for Rolling Stone, Peter Travers gave the film 3.5 out of 4 stars, praising the cast and the direction: \"You're in hyper-skilled hands with Johnson who makes sure you leave the multiplex feeling euphoric. The middle part of the current trilogy, The Last Jedi ranks with the very best Star Wars epics (even the pinnacle that is The Empire Strikes Back) by pointing the way ahead to a next generation of skywalkers – and, thrillingly, to a new hope.\"[139]\n\nRichard Roeper of the Chicago Sun-Times gave the film 3.5/4 stars, saying, \"Star Wars: The Last Jedi ... doesn't pack quite the same emotional punch [as The Force Awakens] and it lags a bit in the second half, [but] this is still a worthy chapter in the Star Wars franchise, popping with exciting action sequences, sprinkled with good humor and containing more than a few nifty 'callbacks' to previous characters and iconic moments.\"[140] For The Hollywood Reporter, Todd McCarthy said, \"Loaded with action and satisfying in the ways its loyal audience wants it to be, writer-director Rian Johnson's plunge into George Lucas' universe is generally pleasing even as it sometimes strains to find useful and/or interesting things for some of its characters to do.\"[141]\n\nWill Gompertz, arts editor of BBC News, gave the film 4/5 stars, writing \"Rian Johnson ... has not ruined your Christmas with a turkey. His gift to you is a cracker, a blockbuster movie packed with invention, wit, and action galore.\"[142] Mark Kermode, British film critic, gave the film 4/5 stars saying Johnson \"proves himself the master of the balancing act, keeping the warring forces of this intergalactic franchise in near-perfect harmony.\"[143] The unpredictability of the plot was appreciated by reviewers such as Alex Leadbeater of Screen Rant, who commented specifically that the death of Snoke was \"the best movie twist in years\".[144] Creator of the franchise George Lucas, who wasn't involved with the film's production, described The Last Jedi as \"beautifully made\" shortly after its release.[145][146] His reaction to Star Wars: The Force Awakens was generally more negative.[147][148]\n\nConversely, Richard Brody of The New Yorker wrote, \"Despite a few stunning decorative touches (most of which involve the color red) and that brief central sequence of multiple Reys, the movie comes off as a work that's ironed out, flattened down, appallingly purified. Above all, it delivers a terrifyingly calculated consensus storytelling, an artificial universality that is achieved, in part, through express religious references.\"[149] Kate Taylor of The Globe and Mail gave the film 2/4 stars, saying the film suffered from too many new additions and writing, \"Nifty new animals, a maturing villain, a flagging heroine, muffled humour – as it seeks to uphold a giant cultural legacy, this unfolding trilogy struggles to maintain a balance that often seems just out of reach.\"[150] Owen Gleiberman of Variety criticized the film for being too derivative of the past movies by saying that \"it's now repeating things that have already been repeated. The rebels-up-against-it plot, with our heroes worn down to the nub of their fighting spirit, feels like a rehash of what we went through a year ago in Rogue One, and the attempts to echo the look and mood and darkening design of 'The Empire Strikes Back' now make clear that the new trilogy is an official monument to nostalgia.\"[151]\n\nAudience reception\n\nAudience reception measured by scientific polling methods was highly positive.[152][153][154] Audiences randomly polled by CinemaScore on opening day gave the film an average grade of \"A\" on an A+ to F scale.[117][153] Surveys from SurveyMonkey and comScore's PostTrak found that 89% of audience members graded the film positively, including a rare five-star rating.[115][155][156]\n\nUser-generated scores at Rotten Tomatoes and Metacritic were more negative. At Rotten Tomatoes, 44% of users rated the film 3.5 stars or higher,[136] while at Metacritic, the average user score is 4.4.[157] Several reviewers speculated that coordinated vote brigading from internet groups and bots contributed to the low scores.[158][159][160] Audience scores found on sites like Rotten Tomatoes and Metacritic require only registration and do not ensure that contributing voters have seen the film.[161] Quartz noted that some new accounts gave negative ratings to both The Last Jedi and Thor: Ragnarok, while Bleeding Cool stated that reviews for the latter film had tapered off but then \"skyrocketed\".[162][163] In response to tampering claims, Rotten Tomatoes released a statement that they detected no unusual activity on The Last Jedi aside from a noticeable \"uptick in the number of written user reviews\".[164] In 2019, a Rotten Tomatoes spokesperson stated that the film had been \"seriously targeted\" with a review-bombing campaign.[165]\n\nReviewers characterized The Last Jedi as divisive among audiences.[166] Todd VanDerWerff of Vox found that dissatisfied fans saw the film as too progressive, disliked its humor, plot, or character arcs, or felt betrayed that it ignored fan theories.[158] Other reviewers made similar observations.[167][168][169] Particularly divisive was the reveal that Rey's parents are insignificant;[158][167][169] many fans had expected her to be Luke's daughter or to share a lineage with another character from the original trilogy.[170][171][172] There was also sentiment that Snoke's character was underdeveloped and that Luke's actions contradicted his previous heroic portrayal.[169][173][174] Reviewers stated that fan theories were held so strongly among some viewers that it was difficult for them to accept different stories,[167][169][174] but that other viewers appreciated the film's action, tone, and deviation from Star Wars tradition.[167][169]\n\nAccolades\n\nSequel\n\nStar Wars: The Rise of Skywalker, the final installment of the sequel trilogy, is scheduled for release on December 20, 2019.[9] Principal photography began on August 1, 2018.[184] Colin Trevorrow was expected to direct the film, but on September 5, 2017, Lucasfilm announced that he had stepped down.[185] A week later, Lucasfilm announced that J. J. Abrams would return to direct The Rise of Skywalker and co-write it with Chris Terrio.[186]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/0/02/Dubrovnik_%2836%29.JPG/200px-Dubrovnik_%2836%29.JPG", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/32/Benicio_Del_Toro_-_Guardians_of_the_Galaxy_premiere_-_July_2014_%28cropped%29.jpg/125px-Benicio_Del_Toro_-_Guardians_of_the_Galaxy_premiere_-_July_2014_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Blue_pencil.svg/10px-Blue_pencil.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Carrie_Fisher_2013-a_straightened.jpg/125px-Carrie_Fisher_2013-a_straightened.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Rian_Johnson_by_Gage_Skidmore.jpg/150px-Rian_Johnson_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/f/fd/Portal-puzzle.svg/16px-Portal-puzzle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Lightsaber_blue.svg/24px-Lightsaber_blue.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/77/United_States_film_clapperboard.svg/24px-United_States_film_clapperboard.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/Salar_de_Uyuni%2C_Volcan_Thunupa.jpg/200px-Salar_de_Uyuni%2C_Volcan_Thunupa.jpg", "https://upload.wikimedia.org/wikipedia/en/7/7f/Star_Wars_The_Last_Jedi.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Laura_Dern_Deauville_2017.jpg/125px-Laura_Dern_Deauville_2017.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bf/Skellig_Michael_by_Maureen_%281%29.jpg/200px-Skellig_Michael_by_Maureen_%281%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Mark_Hamill_%282017%29.jpg/125px-Mark_Hamill_%282017%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/Magic_Kingdom_castle.jpg/17px-Magic_Kingdom_castle.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/7/7f/Star_Wars_The_Last_Jedi.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Star_Wars:_The_Last_Jedi", "title": "Star Wars: The Last Jedi", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.13", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/7/7f/Star_Wars_The_Last_Jedi.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}