{"url": "https://ew.com/tv/2017/05/13/lili-reinhart-depression-riverdale/", "text": "Image zoom Steve Zak Photography/FilmMagic\n\nRiverdale type TV Show Network The CW Genre Drama\n\nUPDATE: When Riverdale‘s Lili Reinhart first discussed her struggles in dealing with depression in a Saturday Twitter thread, she was called out for minimizing the mood disorder. But a few hours later, she clapped back at her critics with another brief thread.\n\n“I in no way meant that depressed people should ‘stop being sad,'” Reinhart said. “I’ve dealt with depression my whole f—ing life, so obviously I know that. I’m saying find yourself some help. And don’t wait for things to change. You have to go out and get that for yourself.”\n\nShe also touched upon the steps she had to take to find happiness: “That’s what I did when I moved to L.A. for the second time trying to follow my dream. I was proactive about changing my life.”\n\nYou can read her tweets below.\n\nApparently everything I say is going to be taken the wrong way from this point on in my life. Which is disheartening that people want — Lili Reinhart (@lilireinhart) May 14, 2017\n\nTo make me a villain. So no… I in no way meant that depressed people should just \"stop being sad.\" — Lili Reinhart (@lilireinhart) May 14, 2017\n\nI've dealt with depression my whole fucking life so obviously I know that. I'm saying find yourself some help. And don't wait for things — Lili Reinhart (@lilireinhart) May 14, 2017\n\nTo change. You have to go out and get that for yourself. You have to find your own happiness and be willing to get better — Lili Reinhart (@lilireinhart) May 14, 2017\n\nTo change. You have to go out and get that for yourself. You have to find your own happiness and be willing to get better — Lili Reinhart (@lilireinhart) May 14, 2017\n\nAnd that's what I did when I moved to LA for the second time, trying to follow my dream. I was proactive about changing my life. — Lili Reinhart (@lilireinhart) May 14, 2017\n\nAnd if people want to twist my words around or say that I'm an idiot or have bad intentions, then okay. Fine. But I'm not going to — Lili Reinhart (@lilireinhart) May 14, 2017\n\nDon't like what I have to say? I don't fucking care. I'm going to talk about mental health and my own experience with depression whether — Lili Reinhart (@lilireinhart) May 14, 2017\n\nI have your permission or not. — Lili Reinhart (@lilireinhart) May 14, 2017\n\nEARLIER: Betty Cooper may be investigating a murder onscreen, but actress Lili Reinhart has faced her own share of darkness off of it.\n\nThe actress opened up about her depression in what she called a “Twitter rant” for Mental Health Awareness Month. Marking the one year anniversary of The CW ordering Riverdale to series, Reinhart said the show saved her life.\n\n“I cried tears of joy. In that moment I became a working actress with a steady job. Something I had been working towards for 7 years,” she wrote. “And now here we are, gearing up to film season 2. And I could not be more grateful. Riverdale came into my life when I was going through the worst depression I had ever experienced. And in the end it completely saved me.”\n\nReinhart credits hard work with getting where she is. “And when I’m feeling depressed or sad, I remind myself how far I’ve come. And how I didn’t let my depression consume me,” she continued. “To anyone out there who feels depressed or hopeless… do not f—ing give up on yourself. You’re all you’ve got. And you deserve the world. Your mental health should be your priority. Don’t forget that. This is your life.. and you’ve only got one. So don’t waste it by being sad.”\n\n“You will get through whatever you’re going through now. And you’ll be so much stronger at the end of it. You’re stronger than you know,” she concludes. “I felt the need to put some love out into the world today. I encourage you to do the same.”\n\nExactly one year ago today, we found out that Riverdale was getting picked up for an entire season. I remember how I felt when I found out.. — Lili Reinhart (@lilireinhart) May 13, 2017\n\nI cried tears of joy. In that moment I became a working actress with a steady job. Something I had been working towards for 7 years… — Lili Reinhart (@lilireinhart) May 13, 2017\n\nAnd now here we are, gearing up to film season 2. And I could not be more grateful. — Lili Reinhart (@lilireinhart) May 13, 2017\n\nRiverdale came into my life when I was going through the worst depression I had ever experienced. And in the end it completely saved me. — Lili Reinhart (@lilireinhart) May 13, 2017\n\nSince it's mental health awareness month, I figured it would be good to share that. I worked my ass off to make a living out of what I love — Lili Reinhart (@lilireinhart) May 13, 2017\n\nAnd when I'm feeling depressed or sad, I remind myself how far I've come. And how I didn't let my depression consume me… — Lili Reinhart (@lilireinhart) May 13, 2017\n\nTo anyone out there who feels depressed or hopeless… do not fucking give up on yourself. You're all you've got. And you deserve the world — Lili Reinhart (@lilireinhart) May 13, 2017\n\nYour mental health should be your priority. Don't forget that. This is your life.. and you've only got one. So don't waste it by being sad — Lili Reinhart (@lilireinhart) May 13, 2017\n\nYou will get through whatever you're going through now. And you'll be so much stronger at the end of it. You're stronger than you know. — Lili Reinhart (@lilireinhart) May 13, 2017\n\nI guess that ends my little rant. But I felt the need to put some love out into the world today. I encourage you to do the same ❤️ — Lili Reinhart (@lilireinhart) May 13, 2017\n\nEW recently declared Reinhart a “Twitter Queen” for her hilarious and empowering feed, which includes her own self-created memes while live-tweeting her show, and a pitch-perfect takedown of body shamers. Her message about mental health is just her latest inspiring social media triumph.\n\nThe season finale of Riverdale aired May 11 on The CW, which gave the show an early season 2 renewal for a second season in March.", "images": ["https://ew.com/img/streaming/netflix.png", "https://ewedit.files.wordpress.com/2019/06/stranger-things.jpg", "https://ewedit.files.wordpress.com/2019/02/big-little-lies2.jpg?crop=0px%2C113px%2C2700px%2C1419px&resize=1200%2C630", "https://ewedit.files.wordpress.com/2019/05/the-loudest-voice.jpg", "https://ewedit.files.wordpress.com/2019/06/oliver.jpg?crop=0px%2C0px%2C3000px%2C1575px&resize=1200%2C630", "https://ewedit.files.wordpress.com/2019/06/1568-angel_1200x6282.jpg", "https://ewedit.files.wordpress.com/2017/01/mascara-tears.jpg", "https://ewedit.files.wordpress.com/2017/05/gettyimages-532741728.jpg", "https://ewedit.files.wordpress.com/2017/09/lennykravitz.jpg?w=768", "https://secure.gravatar.com/avatar/2e8796fac4d868172fac0ab0310aeefe?s=300&d=blank&r=g", "https://ewedit.files.wordpress.com/2019/06/angel2.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630", "https://ewedit.files.wordpress.com/2019/06/the-hills-1-2000.jpg?crop=0px%2C61px%2C2000px%2C1050px&resize=1200%2C630", "https://ewedit.files.wordpress.com/2017/05/gettyimages-532741728.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630", "https://ew.com/img/icons/generic-image.svg", "https://ewedit.files.wordpress.com/2018/10/celebrity-binge.jpg?w=768", "https://ewedit.files.wordpress.com/2019/06/remini.jpg?crop=0px%2C0px%2C3000px%2C1575px&resize=1200%2C630", "https://ewedit.files.wordpress.com/2017/11/rolestout.jpg?w=768", "https://ewedit.files.wordpress.com/2019/07/black-lady-sketch-comedy.jpg?crop=0px%2C282px%2C2700px%2C1419px&resize=1200%2C630", "https://ewedit.files.wordpress.com/2019/06/big-little-lies-1.jpg", "https://ewedit.files.wordpress.com/2019/07/b002_c013_1107fg_001.1675300r.jpg", "https://ewedit.files.wordpress.com/2019/06/a27_promo_stills_022519.0041_r.jpg", "https://ewedit.files.wordpress.com/2019/06/i-will-remember-you-1.jpg?crop=0px%2C0px%2C3000px%2C1575px&resize=1200%2C630", "https://ewedit.files.wordpress.com/2017/06/rvd113a_0172b.jpg?crop=450px%2C0px%2C1800px%2C1800px&resize=150%2C150", "https://ewedit.files.wordpress.com/2019/07/2000x1320_2862_ewk_strangerthings.jpg", "https://ewedit.files.wordpress.com/2019/06/spanish-princess-e.jpg", "https://ewedit.files.wordpress.com/2019/06/bll-1.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630", "https://ewedit.files.wordpress.com/2019/07/sn2-1680r-1.jpg?crop=0px%2C316px%2C2700px%2C1419px&resize=1200%2C630", "https://ewedit.files.wordpress.com/2019/07/finn-noah.jpg?crop=156px%2C0px%2C1678px%2C881px&resize=1200%2C630"], "top_img": "https://ewedit.files.wordpress.com/2017/05/gettyimages-532741728.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630", "keywords": [], "authors": ["Maureen Lee Lenker"], "canonical_link": "https://ew.com/tv/2017/05/13/lili-reinhart-depression-riverdale/", "title": "Riverdale star Lili Reinhart responds to critics of mental health tweets: 'I'm not going to keep my mouth shut'", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "Lili Reinhart, Riverdale, depression, mental health awareness month,", "news_keywords": "Lili Reinhart, Riverdale, depression, mental health awareness month,", "description": "The actress posted a heartfelt message to her Twitter account in honor of mental health awareness month", "og": {"title": "'Riverdale' Star Lili Reinhart Responds to Critics of Mental Health Tweets: 'I'm Not Going to Keep My Mouth Shut'", "type": "article", "site_name": "EW.com", "url": "https://ew.com/tv/2017/05/13/lili-reinhart-depression-riverdale/", "description": "UPDATE: When Riverdale's Lili Reinhart first discussed her struggles in dealing with depression in a Saturday Twitter thread, she was called out…", "image": {"identifier": "https://ewedit.files.wordpress.com/2017/05/gettyimages-532741728.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630", "width": 1200, "height": 630}}, "pinterest": {"url": "https://ew.com/tv/2017/05/13/lili-reinhart-depression-riverdale/", "description": "The actress posted a heartfelt message to her Twitter account in honor of mental health awareness month", "media": "https://ewedit.files.wordpress.com/2017/05/gettyimages-532741728.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630"}, "twitter": {"card": "summary_large_image", "url": "https://ew.com/tv/2017/05/13/lili-reinhart-depression-riverdale/", "title": "'Riverdale' Star Lili Reinhart Responds to Critics of Mental Health Tweets: 'I'm Not Going to Keep My Mouth Shut'", "description": "The actress posted a heartfelt message to her Twitter account in honor of mental health awareness month", "site": "@ew", "image": "https://ewedit.files.wordpress.com/2017/05/gettyimages-532741728.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630"}, "fb": {"pages": 52150999700}}, "movies": [], "publish_date": 1494648000.0, "source": "https://ew.com", "summary": ""}