{"url": "https://www.aad.org/public/skin-hair-nails/skin-care/dry-skin", "text": "Simple changes can soothe dry skin\n\nFollowing the same skin care routine year round may not work so well when the humidity drops. Without a change in your skin care, dry air can make fine lines and wrinkles more noticeable. Dry skin can itch, flake, crack, and even bleed.\n\nTo help heal dry skin and prevent its return, dermatologists recommend the following.\n\nPrevent baths and showers from making dry skin worse. When your skin is dry, be sure to:\n\nClose the bathroom door\n\nLimit your time in the shower or bath to 5 or 10 minutes\n\nUse warm rather than hot water\n\nWash with a gentle, fragrance-free cleanser\n\nApply enough cleanser to remove dirt and oil, but avoid using so much that you see a thick lather\n\nBlot your skin gently dry with a towel\n\nSlather on the moisturizer immediately after drying your skin\n\nApply moisturizer immediately after washing. Ointments, creams, and lotions (moisturizers) work by trapping existing moisture in your skin. To trap this much-needed moisture, you need to apply a moisturizer within few minutes of:\n\nDrying off after a shower or bath\n\nWashing your face or hands\n\nUse an ointment or cream rather than a lotion. Ointments and creams are more effective and less irritating than lotions. Look for a cream or ointment that contains an oil such as olive oil or jojoba oil. Shea butter also works well. Other ingredients that help to soothe dry skin include lactic acid, urea, hyaluronic acid, dimethicone, glycerin, lanolin, mineral oil, and petrolatum.\n\nTip: Carry a non-greasy hand cream with you, and apply it after each hand washing. This will greatly help relieve dry skin.\n\nWear lip balm. Choose a lip balm that feels good on your lips. Some healing lip balms can irritate your lips. If your lips sting or tingle after you apply the lip balm, switch to one that does not cause this reaction.\n\nUse only gentle, unscented skin care products. Some skin care products are too harsh for dry, sensitive skin. When your skin is dry, stop using:\n\nDeodorant soaps\n\nSkin care products that contain alcohol, fragrance, retinoids, or alpha-hydroxy acid (AHA)\n\nAvoiding these products will help your skin retain its natural oils.\n\nWear gloves. Our hands are often the first place we notice dry skin. You can reduce dry, raw skin by wearing gloves. Be sure to put gloves on before you:\n\nGo outdoors in winter\n\nPerform tasks that require you to get your hands wet\n\nGet chemicals, greases, and other substances on your hands\n\nChoose non-irritating clothes and laundry detergent. When our skin is dry and raw even clothes and laundry detergent can be irritating. To avoid this:\n\nWear cotton or silk under your clothing made of wool or another material that feels rough\n\nUse laundry detergent labeled “hypoallergenic”\n\nStay warm without cozying up to a fireplace or other heat source. Sitting in front of an open flame or other heat source can dry your skin.\n\nAdd moisture to the air. Plug in a humidifier. If you can check your home heating system, find out if you have a humidifier on the system — and whether it’s working.\n\nWhen to see a dermatologist\n\nYour skin should start to feel better quickly. If these changes do not bring relief, you may want to see a dermatologist. Very dry skin can require a prescription ointment or cream. Dry skin also can be a sign of a skin condition that needs treatment. A dermatologist can examine your skin and explain what can help reduce your discomfort.\n\nAdditional related content", "images": ["https://www.aad.org/apple-icon-57x57.png", "https://www.aad.org/Image Library/Main navigation/Public and patients/Diseases and treatments/Dry sweaty skin/bathing-tips-for-dry-skin-infographic-thumbnail.jpg"], "top_img": "https://www.aad.org/apple-icon-57x57.png", "keywords": [], "authors": [], "canonical_link": "", "title": "Dermatologists' top tips for relieving dry skin", "meta_data": {"description": "Learn more about Dermatologists&#39; top tips for relieving dry skin at aad.org", "keywords": "Dry skin,moisturizer", "viewport": "width=device-width, initial-scale=1", "apple-mobile-web-app-title": "American Academy of Dermatology", "msapplication-TileColor": "#ffffff", "msapplication-TileImage": "/ms-icon-144x144.png", "theme-color": "#ffffff"}, "movies": [], "publish_date": null, "source": "https://www.aad.org", "summary": ""}