{"url": "https://www.bridesmagazine.co.uk/gallery/iconic-wedding-dress-pictures", "text": "Even though we exhaustively cover the latest bridal market runways , seasonal dress trends and, of course, all the celebrity (and royal ) nuptials that are blowing up your Twitter feed, we stand by the principle that wedding gowns are classic and, most of all, timeless. The most iconic gowns of the century—think: Grace Kelly’s high-neck lace, Kate Middleton’s modern long sleeves, Solange’s minimalist cape and Bianca Jagger’s bridal suiting—will forever stand the test of time and, like in life, there’s much to glean from history.\n\nOf course, the experts at the most renowned bridal salons in the country know a bit about that subject as they’ve spent years working with the most innovative and talented designers—and the most discerning brides to decide on their dream wedding day look. So whether you are searching for inspiration for your own upcoming wedding, happen to be a fashion merchandising history buff, or just love gazing at the most gorgeous dresses ever, you’ll be interested to discover which designs top the best selling dresses of all time list. So we sought out the expert of experts: Mark Ingram, owner of the prestigious Mark Ingram Atelier in Manhattan’s Upper East Side; Dorothy Silver, Director of Merchandising, at the legendary Kleinfeld , a New York icon since 1941; and Elle Warren, Co-Owner of the tony Warren Barrón in Dallas.\n\nThese three have been on the front lines and have much to say about their most coveted gowns and why these dresses mean to much to their brides—and themselves.\n\nMark Ingram, Owner, Mark Ingram Atelier, founded in 2002, New York\n\nPinterest ©DAN AND CORINA LECCA\n\nAnne Barge, style # 617\n\n“We named it ‘Deliza’ and we sold 46. We sold the first one in March 2011. It was an all-lace strapless mermaid dress that actually Anne Barge had been perfecting for years. It had a lot of style, a lot of shape. Lace was gaining in its popularity again in bridal then. Also, it was one of the first gowns with ivory lace and nude lining and it became a trend.”\n\nPinterest Courtesy of Mira Zwillinger\n\nMira Zwillinger x Mark Ingram Beatrice Dress\n\n“Mira Zwillinger is relatively new on the scene and I was the first to have her in the United States. We met years ago when she was doing only ready-to-wear and we collaborated on a dress called the Beatrice. We sold 48 of this dress since 2013 and we are still selling it. We sold two last month. It’s stunning. First of all, it’s so featherweight and Mira Zwillinger is very unique in how she constructs her bodices—almost like a pressed tulle that’s molded to your body. It gives every bride a small waistline and the skirt is a perfect A-line shape. There’s A-lines and there’s A-lines. This is the A-line shape.”\n\nDorothy Silver, Director of Merchandising, Kleinfeld, New York, founded in 1941\n\nPinterest Courtesy of Lazaro\n\nLazaro style #3108\n\n“This sherbert colored tulle ball gown with a beaded belt debuted in 2010. Lazaro introduced sherbert and pastel colors into bridal. We carried it in a plus size and regular size and we sold it to brides of all kinds of shapes and sizes. Brides loved it because of the simplicity of the ruched bodice and natural waist.”\n\nPinterest Courtesy of Sottero and Midgley\n\nPinterest Courtesy of Sottero and Midgley\n\nSottero and Midgley, Adorae and Stella dresses\n\n“Kleinfeld has sold hundreds of these dresses from Sottero and Midgely by Maggie Sottero. The shape and form of these fit-and-flare dresses, plus the price point are key factors in the success of this dress.”\n\nElle Warren, Co-Owner, Warren Barron, Dallas, founded in 2006\n\nPinterest Kevin Sturman / Courtesy of Vera Wang\n\nVera Wang, Gemma\n\n“For the past 10 years, Vera Wang has been the standard in the bridal industry and her Gemma gown did not disappoint. The gown features the famous ‘Vera’ mermaid fit, along with a thoughtfully draped raw-edge tulle detail—bringing in a hint of that modern flare making it the perfect blend of classic and contemporary.”\n\nPinterest Courtesy of Monique Lhuillier\n\nMonique Lhuillier, Severine\n\n“This is also another favorite amongst our brides. Monique is known for capturing everything feminine and romantic about bridal and Severine is no exception. The gown is a ballerina-inspired bodice covered in Alençon lace paired with a soft blush A-line tulle skirt—making it the perfect choice for all our classic brides who want that romantic look with a touch of whimsy.”\n\nSee more : The Most Beautiful Celebrity Brides of All Time\n\nPinterest Courtesy of Romona Keveza\n\nPinterest Courtesy of Romona Keveza\n\n2 Romona Keveza 5-ply crepe gowns: style #RK7402 and RK6463\n\n“The new 5-ply crepe gowns by Romona Keveza come in an array of silhouettes and styles which make them appealing to many brides, while the signature 5-ply crepe gives them a rich texture—taking them from simple to extraordinary. These gowns are clean with all the detail focused on the immaculate tailoring. Think: modern day Carolyn Bessette-Kennedy. The underlying trait that makes brides say ‘yes’ to these dresses is that all of them complement a wide variety of body types . Tall or short, curvy or straight, all of these gowns really complement the bride to make her feel her most beautiful on her big day. After all, that’s what it really is about!”", "images": ["https://media.brides.com/photos/5a2ee7a25511b04fe230f074/master/pass/beatrice-mira.jpg", "https://media.brides.com/photos/5b200c6b370262506378e6e5/1:1/w_125/ally-hilfiger-and-steve-hash-wedding03.jpg", "https://media.brides.com/photos/5a2ee7a25511b04fe230f074/1:1/w_767/beatrice-mira.jpg", "https://www.bridesmagazine.co.uk/images/brides-logo.svg", "https://media.brides.com/photos/5c17eb589abd092cf4bd38b7/1:1/w_125/Glitzy-Wedding-Dresses-Isabelle-Armstrong-Genevieve%2520Gown-Price-Upon-Request.jpg", "https://media.brides.com/photos/5cb5ef9be94df4e677088653/1:1/w_125/Greenberg_BFW_Amsale_041219-523.jpg"], "top_img": "https://media.brides.com/photos/5a2ee7a25511b04fe230f074/master/pass/beatrice-mira.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.brides.com/story/best-selling-wedding-dresses", "title": "The 9 Best Selling Wedding Dresses of All Time", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=no, width=device-width, initial-scale=1, maximum-scale=1", "description": "Top bridal salons have seen these popular gowns become a bride's dream wedding dress over and over again.", "og": {"description": "These are the popular dresses top bridal salons sell like crazy.", "image": "https://media.brides.com/photos/5a2ee7a25511b04fe230f074/master/pass/beatrice-mira.jpg", "title": "The 9 Best Selling Wedding Dresses of All Time", "url": "https://www.brides.com/story/best-selling-wedding-dresses", "site_name": "brides", "type": "article"}, "twitter": {"description": "These are the popular dresses top bridal salons sell like crazy.", "image": "https://media.brides.com/photos/5a2ee7a25511b04fe230f074/master/pass/beatrice-mira.jpg?mbid=social_retweet", "title": "The 9 Best Selling Wedding Dresses of All Time", "url": "https://www.brides.com/story/best-selling-wedding-dresses", "card": "summary_large_image", "creator": "@brides", "site": "brides"}, "fb": {"page_id": 50416192591, "admins": "648235154,789168297,688620285"}, "keywords": "Wedding Dresses,fashion", "news_keywords": "Fashion & Beauty,Wedding Dresses,Wedding Dresses,fashion"}, "movies": [], "publish_date": null, "source": "https://www.bridesmagazine.co.uk", "summary": ""}