{"url": "https://www.inquisitr.com/4509613/salma-hayek-donates-100k-to-earthquake-victims-in-mexico-urges-fans-to-help-as-death-toll-rises-to-over-200/", "text": "Salma Hayek donated $100,000 for the victims of the destructive Mexico earthquake that killed over 200 people on Wednesday and asked her fans to do the same.\n\nHelping has been an innate trait in the Latina actress, so it is not surprising that she has shared a hefty amount for victims of a catastrophe. This time, however, the calamity struck home as the 51-year-old actress hails from Coatzacoalcos, Mexico.\n\nAfter announcing her donation to the United Nations Children’s Fund (UNICEF) to aid in their rescue and rehabilitation operations in the earthquake-struck country, she implored her fans and Instagram followers to do anything to help.\n\n“The people of my country have now suffered three natural disasters in a row. Many children and families are hurt and in terrible need,” Salma Hayek wrote in the Instagram post.\n\nShe also launched a crowd-sourcing campaign through Crowd Rise to raise money to aid in the aftermath of the devastating calamities that hit her home country.\n\n“Please join me and contribute what you can and thank you,” she added.\n\nRecalling the 1985 earthquake that struck Mexico where she was evacuated from her building, Salma said many of her friends and relatives perished during that time, emphasizing the horrifying nightmare the victims of Wednesday’s tremblor may be in.\n\n“I have lived through the aftermath of a disaster of this magnitude and its horrific,” she said.\n\nNow, she is asking her friends, followers, and fans to donate via a crowdfunding website to help her bring to the families, especially the children, who became victims of Mother Nature’s wrath.\n\n“I implore to you… to the goodness of your hearts, to your compassion to help. Anything that you can give will make a big difference.”\n\nSalma Hayek also revealed that she will match the first $100,000 that will be donated via the crowdfunding site.\n\nAccording to latest updates on the quake from The Guardian, confirmed deaths have reached a total of 230, with over 40 buildings demolished by the earth’s tremors from the 7.1 magnitude earthquake.\n\nCiting a report from the Mexico City mayor, the outlet revealed that at least 52 people have been successfully rescued from rubble left from the collapsed structures while search and rescue operations continue, as Salma Hayek have said.\n\nnull\n\nOne young boy who survived the shaker recalled the nightmarish experience he had while escaping his collapsed school, via a report from NBC.\n\n“I was in my English class and the ground started to vibrate,” Luis Carlos Tome explained to the outlet, shaking and crying while speaking.\n\nAccording to Luis Carlos, no alarm sounded when the ground started to shake as he noted out loud the obvious earthquake that has been happening. After that, everyone in his class left the room immediately. He also described the difficult escape he and his friends had to go through.\n\n“There were many [people on the stairs] but all of a sudden I didn’t see them anymore,” he said, noting that people he was with started to fall while trying to escape.\n\n“Everything happened so fast, I did not see [my teacher]. In about thirty seconds my school was down and I don’t even know how I saved myself.”\n\nAs of the writing of this article, Salma Hayek’s crowdfunding campaign for the earthquake victims in Mexico has reached $189,462 from nearly 2,000 people in one day.\n\nTo donate, you may proceed to this link.\n\n[Featured Image by Matt Winkelmeyer/Getty Images]", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2017/09/Salma-Hayek-Helps-Her-Fellow-Mexicans.jpg", "https://secure.gravatar.com/avatar/408a7e4769d130cb16bb1c27f3d52e1d?s=250&d=mm&r=g", "https://www.inquisitr.com/wp-content/uploads/2019/07/Rita-Ora-3-300x170.jpg", "https://cdn.inquisitr.com/assets/ee54ce/dist/images/logos/favicon.png", "https://www.facebook.com/tr?id=1472001486461948&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=478801082325642&ev=PageView&noscript=1", "https://cdn.inquisitr.com/assets/ee54ce/dist/images/logos/logo_header_no_tagline.png"], "top_img": "https://cdn.inquisitr.com/assets/ee54ce/dist/images/logos/favicon.png", "keywords": [], "authors": ["Erika Miranda"], "canonical_link": "https://www.inquisitr.com/4509613/salma-hayek-donates-100k-to-earthquake-victims-in-mexico-urges-fans-to-help-as-death-toll-rises-to-over-200/", "title": "Salma Hayek Donates $100K To Earthquake Victims In Mexico, Urges Fans To Help As Death Toll Rises To Over 200", "meta_data": {"msapplication-TileImage": "//cdn.inquisitr.com/assets/ee54ce/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "https://www.inquisitr.com", "summary": ""}