{"url": "https://en.wikipedia.org/wiki/Bianca_Lawson", "text": "Bianca Jasmine Lawson (born March 20, 1979) is an American film and television actress. She is perhaps best known for her regular roles in the television series Saved by the Bell: The New Class, Goode Behavior, Pretty Little Liars, and Rogue. She has also had recurring roles in the series Sister, Sister, Buffy the Vampire Slayer, The Steve Harvey Show, Dawson's Creek, The Secret Life of the American Teenager, The Vampire Diaries, Teen Wolf, and Witches of East End. In 2016, Lawson began starring in the Oprah Winfrey Network drama series, Queen Sugar.\n\nEarly life\n\nLawson was born in Los Angeles, California. She is the daughter of Denise (née Gordy) and actor Richard Lawson, making her the step-daughter to Lawson's second wife Tina Knowles, and step-sister to singers Beyoncé and Solange Knowles.[1] Lawson is also the great-niece of Motown founder Berry Gordy.[2] She attended the Stella Adler Studio of Acting and graduated from Marymount High School, a Catholic school in Los Angeles. She then went on to study film and psychology at University of Southern California.[3] Lawson's parents are both African-American, and she also has Italian, Native American, Portuguese, and Creole ancestry.[4]\n\nCareer\n\nLawson began acting at the age of nine, having appeared in commercials for Barbie and Revlon. In 1993, she was cast in the television series Saved by the Bell: The New Class as series regular Megan Jones. She appeared in multiple episodes of The WB sitcoms Sister, Sister as Rhonda Coley and The Steve Harvey Show as Rosalind. In 1996, she co-starred in the UPN sitcom Goode Behavior—which lasted for just one season—as Bianca Goode, the teenage daughter of the titular family. In 1997, she appeared in Buffy the Vampire Slayer as vampire slayer Kendra Young. In 1999, she appeared in The WB's Dawson's Creek as rival character Nikki Green.\n\nIn 2009, Lawson was cast as Shawna in The Secret Life of the American Teenager. That same year, she was cast in the CW television series The Vampire Diaries, as witch Emily Bennett. In December 2009, she was cast as Maya St. Germain in the ABC Family series Pretty Little Liars, based on the book series by Sara Shepard.[5] She appeared in that show from June 2010 through August 2012. Since 2012, she has had a recurring role as Ms. Morell in the MTV television series Teen Wolf, based on the original film from 1985. In 2014, Lawson had a recurring role as Eva in Witches of East End. In 2015, she was cast as series regular Talia Freeman in season three of Rogue.\n\nLawson has made appearances in two different television miniseries. In 1998, she appeared in The Temptations as Diana Ross (whom Lawson is related to through Ross's daughter Rhonda Ross Kendrick); and in 2001, she was cast as Anna Bella Monroe in Anne Rice's The Feast of All Saints.\n\nSome of Lawson's film credits to date include Primary Colors (1998), Save the Last Dance (2001), Bones (2001) and Breakin' All the Rules (2004).\n\nAside from film and television, Lawson provided her voice to the 2011 video game Star Wars: The Old Republic.\n\nIn 2016, Lawson was cast in the Oprah Winfrey Network drama series, Queen Sugar created by Ava DuVernay.[6]\n\nFilmography\n\nFilm\n\nTelevision\n\nVideo games\n\nYear Title Role Notes 2011 Star Wars: The Old Republic (voice) Provided additional voices", "images": ["https://upload.wikimedia.org/wikipedia/commons/5/55/Bianca_Lawson_publicity_shot.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/5/55/Bianca_Lawson_publicity_shot.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Bianca_Lawson", "title": "Bianca Lawson", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.13", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/5/55/Bianca_Lawson_publicity_shot.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}