{"url": "http://www.vgxlk.co/asiah-collins-and-crystal-smiths-screaming-match-on-the-platinum-life-makes-for-an-awkward-plane-ride-in-premiere-sneak-peek-on-the-platinum-life.htm", "text": "Asiah Collins and Crystal Smith’s Screaming Match on …\n\nAsiah Collins and Crystal Smith’s Screaming Match on The Platinum Life Makes for an Awkward Plane Ride in Premiere Sneak Peek\n\nThe Platinum Life News | E! News\n\nThe Platinum Life’s Crystal Smith Is Dragging Alycia Bella for Asiah Collins and Crystal Smith’s Screaming Match on The Platinum Life Makes for an Awkward Plane Ride in Premiere Sneak Peek. 1 2.\n\nAsiah Collins’ Nasty Fight With Crystal Smith’s Friends\n\nNov 29, 2017 · Asiah Collins’ Nasty Fight With Crystal Smith’s Friends Brings Platinum Life Filming to a Halt: ”I’m About to Bop This Bitch!” Things in Cancún are going from bad to worse for the ladies of The Platinum Life.\n\nAsiah Collins & Crystal Smith Get Into a Shouting Match\n\nClick to view on Bing1:30\n\nOct 12, 2017 · ”The Platinum Life” stars get in each other’s faces on a cramped private jet and Nazanin Mandi is caught right in the middle of it all! Asiah Collins & Crystal Smith Get Into a Shouting Match\n\nAuthor: E! Entertainment\n\nAsiah Collins’ Nasty Fight With Crystal Smith’s Friends\n\nThings in Cancún are going from bad to worse for the ladies of The Platinum Life.. What started out as a flawless photo shoot for Asiah Collins quickly turned into a shouting match between Asiah, Shantel Jackson and Crystal Smith‘s friends.. In this clip from Thursday’s all-new The Platinum Life, Crystal’s friends can be heard screaming at …\n\nShantel Jackson – News – IMDb\n\nIn this sneak peek from Sunday night’s series premiere of The Platinum Life, Asiah Collins and Crystal Smith’s feud takes flight as the ladies head to Las Vegas. After having to reschedule her brunch for the last-minute trip, Asiah, who’s married to rapper Kid Ink , isn’t pleased about the accommodations in the private jet Crystal organized for the group.\n\nAsiah Collins & Crystal Smith Get Into a Shouting Match\n\nHome \\ Worldwide Most Popular \\ Asiah Collins & Crystal Smith Get Into a Shouting Match | The Platinum Life | E! More Asiah Collins & Crystal Smith Get Into a Shouting Match | The Platinum Life | E!\n\nAsiah Azante – Bio, Facts, Family | Famous Birthdays\n\nFamily Life. She was born Asiah Saifullahzadeh Collins. She married Kid Ink in 2015. In early 2016 they welcomed their daughter Aislin Parvaneh Collins. They have two dogs named Scooby Lou and Roxie. Associated With. Her husband Kid Ink collaborated on the song ”Throw It Up” with Kanye West.\n\nBorn: Sep 28, 1988\n\nWill Smith’s hilariously awkward date you – news.com.au\n\ncelebrity life; hook ups break ups THEY might’ve just celebrated being married for 20 years — but the Smiths proved they can still go on some pretty awkward …\n\nEntertainment News – 15minutenews.com\n\nPaul Walker‘s 18-year-old daughter has settled her wrongful death lawsuit with Porsche after claiming the car company was responsible for her father’s death. Meadow Walker and", "images": ["http://www.vgxlk.co/image/gif;base64,R0lGODlhAQABAIAAAAAAAP/yH5BAEAAAEALAAAAAABAAEAAAIBTAA7"], "top_img": "", "keywords": [], "authors": [], "canonical_link": "http://www.vgxlk.co/asiah-collins-and-crystal-smiths-screaming-match-on-the-platinum-life-makes-for-an-awkward-plane-ride-in-premiere-sneak-peek-on-the-platinum-life.htm", "title": "Asiah Collins and Crystal Smith’s Screaming Match on The Platinum Life Makes for an Awkward Plane Ride in Premiere Sneak Peek on The Platinum Life – VGX", "meta_data": {"viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": null, "source": "http://www.vgxlk.co", "summary": ""}