{"url": "wikivividly.com/wiki/Jack_Nicholson", "text": "20th and 21st-century American actor, film director, producer, and writer\n\nFor the Australian rules footballer, see Jack Nicholson (footballer)\n\nJohn Joseph Nicholson (born April 22, 1937) is an American actor and filmmaker who has performed for over sixty years. He is known for playing a wide range of starring or supporting roles, including satirical comedy, romance, and dark portrayals of anti-heroes and villainous characters. In many of his films, he has played the \"eternal outsider, the sardonic drifter\", someone who rebels against the social structure.[1]\n\nHis most known and celebrated films include the famous road drama Easy Rider (1969); the dramas Five Easy Pieces (1970) and One Flew Over the Cuckoo's Nest (1975); the comedy-dramas The Last Detail (1973), Terms of Endearment (1983), As Good as It Gets (1997), About Schmidt (2002), and The Bucket List (2007); the neo-noir mystery Chinatown (1974); the horror film The Shining (1980); the biopic Reds (1981); the fantasy comedy The Witches of Eastwick (1987); the superhero film Batman (1989) as the Joker; the legal drama A Few Good Men (1992); the romantic horror film Wolf (1994); the science fiction comedy Mars Attacks! (1996); the comedy Anger Management (2003); the romantic comedy Something's Gotta Give (2003); and the crime drama The Departed (2006). Nicholson has not acted in a film since How Do You Know in 2010, but does not consider himself to be retired. He has also directed three films, including The Two Jakes (1990), the sequel to Chinatown.\n\nNicholson's twelve Academy Award nominations make him the most nominated male actor in the Academy's history. Nicholson has won the Academy Award for Best Actor twice – one for the drama One Flew Over the Cuckoo's Nest (1975), and the other for the romantic comedy As Good as It Gets (1997). He also won the Academy Award for Best Supporting Actor for the comedy-drama Terms of Endearment (1983). Nicholson is one of three male actors to win three Academy Awards. Nicholson is one of only two actors to be nominated for an Academy Award for acting in every decade from the 1960s to the 2000s; the other is Michael Caine. He has won six Golden Globe Awards and received the Kennedy Center Honor in 2001. In 1994, at 57, he became one of the youngest actors to be awarded the American Film Institute's Life Achievement Award.\n\nHe had a number of very high-profile relationships, most notably with Anjelica Huston and with LRR Rebecca Broussard, and was married to Sandra Knight from 1962 until their divorce in 1968. Nicholson has five children – one with Knight, two with Broussard (including Lorraine Nicholson), and one each with Susan Anspach and Winnie Hollman.\n\nEarly life [ edit ]\n\nNicholson was born on April 22, 1937, in Neptune City, New Jersey,[2][3][4] the son of a showgirl, June Frances Nicholson (stage name June Nilson).[5][6] Nicholson's mother was of Irish, English, and German descent. She married Italian-American showman Donald Furcillo (stage name Donald Rose) in 1936, before realizing that he was already married.[7]:8[8] Biographer Patrick McGilligan stated in his book Jack's Life that Latvian-born Eddie King (originally Edgar A. Kirschfeld),[9] June's manager, may have been Nicholson's biological father, rather than Furcillo. Other sources suggest June Nicholson was unsure of who the father was.[5] As June was only seventeen years old and unmarried, her parents[note 1] agreed to raise Nicholson as their own child without revealing his true parentage, and June would act as his sister.[10]\n\nIn 1974, Time magazine researchers learned, and informed Nicholson, that his \"sister\", June, was actually his mother, and his other \"sister\", Lorraine, was really his aunt.[11] By this time, both his mother and grandmother had died (in 1963 and 1970, respectively). On finding out, Nicholson said it was \"a pretty dramatic event, but it wasn't what I'd call traumatizing ... I was pretty well psychologically formed\".[10]\n\nNicholson grew up in Neptune City, New Jersey.[7]:7 He was raised in his mother's Roman Catholic religion.[12][13] Before starting high school, his family moved to an apartment in Spring Lake, New Jersey.[7]:16 \"When Jack was ready for high school, the family moved once more—this time two miles (three kilometers) farther south to old-money Spring Lake, New Jersey's so-called Irish Riviera, where Ethel May set up her beauty parlor in a rambling duplex at 505 Mercer Avenue.\"[14] \"Nick\", as he was known to his high school friends, attended nearby Manasquan High School, where he was voted \"Class Clown\" by the Class of 1954. He was in detention every day for a whole school year.[4] A theatre and a drama award at the school are named in his honor. In 2004, Nicholson attended his 50-year high school reunion accompanied by his aunt Lorraine.[7]\n\nMilitary service [ edit ]\n\nIn 1957, Nicholson joined the California Air National Guard,[15] a move he sometimes characterized as an effort to \"dodge the draft\";[16] the Korean War-era's Military Selective Service Act was still in force, and draftees were required to perform up to two years of active duty. After completing the Air Force's basic training at Lackland Air Force Base,[16] Nicholson performed weekend drills and two-week annual training as a fire fighter assigned to the unit based at the Van Nuys Airport.[16] During the Berlin Crisis of 1961, Nicholson was called up for several months of extended active duty,[16] and he was discharged at the end of his enlistment in 1962.\n\nCareer [ edit ]\n\nEarly work [ edit ]\n\nNicholson first came to Hollywood in 1954, when he was seventeen, to visit his sister. He took a job as an office worker for animators William Hanna and Joseph Barbera at the MGM cartoon studio. They offered him a starting-level job as an animator, but he declined, citing his desire to become an actor.[16]\n\nHe trained to be an actor with a group called the Players Ring Theater, after which time he found small parts performing on the stage and in TV soap operas.[1] He made his film debut in a low-budget teen drama The Cry Baby Killer (1958), playing the title role. For the following decade, Nicholson was a frequent collaborator with the film's producer, Roger Corman. Corman directed Nicholson on several occasions, most notably in The Little Shop of Horrors, as masochistic dental patient and undertaker Wilbur Force, and also in The Raven, The Terror where he plays a French officer seduced by an evil ghost, and The St. Valentine's Day Massacre.\n\nNicholson also frequently worked with director Monte Hellman on low-budget westerns, though two in particular, Ride in the Whirlwind and The Shooting, initially failed to find interest from any US film distributors but gained cult success on the art-house circuit in France and were later sold to television. Nicholson also appeared in two episodes of The Andy Griffith Show.\n\n1960s [ edit ]\n\nWith his acting career heading nowhere, Nicholson seemed resigned to a career behind the camera as a writer/director. His first real taste of writing success was the screenplay for the 1967 counterculture film The Trip (directed by Corman), which starred Peter Fonda and Dennis Hopper. After first reading the script, Fonda told Nicholson he was totally impressed by the writing and felt it could become a great film. However, he was disappointed with how the film turned out and blamed the editing which turned it into a \"predictable\" film and said so publicly. \"I was livid\", he recalls.[18] Nicholson also co-wrote, with Bob Rafelson, the movie Head, which starred The Monkees. He also arranged the movie's soundtrack.\n\nAfter a spot opened up in Fonda and Hopper's Easy Rider (1969), it led to his first big acting break. Nicholson played hard-drinking lawyer George Hanson, for which he received his first Oscar nomination. The film cost only $400,000 to make, and became a blockbuster, grossing $40 million.[19] Biographer John Parker states that Nicholson's interpretation of his role placed him in the company of earlier \"anti-hero\" actors, such as James Cagney and Humphrey Bogart, while promoting him into an \"overnight number-one hero of the counter-culture movement\".[attribution needed][19]\n\nThe part was a lucky break for Nicholson—the role had been written for the actor Rip Torn, who withdrew from the project after an argument with Hopper.[20] In interviews, Nicholson later acknowledged the importance of being cast in Easy Rider: \"All I could see in the early films, before Easy Rider, was this desperate young actor trying to vault out of the screen and create a movie career.\"[21]\n\nNicholson was cast by Stanley Kubrick, who was impressed with his role in Easy Rider, in the part of Napoleon in a film about his life, and although production on the film commenced, the project fizzled out, partly due to a change in ownership at MGM, and other issues.\n\n1970s [ edit ]\n\nNicholson in 1976\n\nNicholson starred in Five Easy Pieces alongside Karen Black in 1970 in what became his persona-defining role. Nicholson and Black were nominated for Academy Awards for their performances. Nicholson played Bobby Dupea, an oil rig worker, and Black was his waitress girlfriend. During an interview about the film, Black noted that Nicholson's character in the film was very subdued, and was very different from Nicholson's real-life personality. She says that the now-famous restaurant scene was partly improvised by Nicholson, and was out of character for Bobby, who wouldn't have cared enough to argue with a waitress.[23] \"I think that Jack really has very little in common with Bobby. I think Bobby has given up looking for love. But Jack hasn't, he's very interested in love, in finding out things. Jack is a very curious, alive human being. Always ready for a new idea.\"[24]:37 Nicholson himself said as much, telling an interviewer, \"I like listening to everybody. This to me is the elixir of life.\"[25]\n\nBlack later admitted that she had a crush on Nicholson from the time they met, although they only dated briefly. \"He was very beautiful. He just looked right at you ... I liked him a lot ... He really sort of wanted to date me but I didn't think of him that way because I was going with Peter Kastner ... Then I went to do Easy Rider, but didn't see him because we didn't have any scenes together ... At the premiere, I saw him out in the lobby afterward and I started crying ... He didn't understand that, but what it was was that I really loved him a lot, and I didn't know it until I saw him again, because it all welled up.\"[24]:36\n\nWithin a month after the film's release that September, the movie became a blockbuster, making Nicholson a leading man and the \"new American anti-hero\", according to McDougal.[7]:130 Critics began speculating whether he might become another Marlon Brando or James Dean. His career and income skyrocketed. He said, \"I have much sought after. Your name becomes a brand image like a product. You become Campbell's soup, with thirty-one different varieties of roles you can play.\"[7]:130 He told his new agent, Sandy Bresler, to find him unusual roles so he could stretch his acting skill: \"I like to play people that haven't existed yet, a 'cusp character'\", he said:\n\nI have that creative yearning. Much in the way Chagall flies figures into the air: once it becomes part of the conventional wisdom, it doesn't seem particularly adventurous or weird or wild.[7]:130\n\nThere is James Cagney, Spencer Tracy, Humphrey Bogart, and Henry Fonda. After that, who is there but Jack Nicholson? —Mike Nichols, director[26]\n\nAlso in 1970, he appeared in the movie adaptation of On a Clear Day You Can See Forever, although most of his performance was left on the cutting room floor. His agent turned down a starring role in Deliverance when the film's producer and director, John Boorman, refused to pay what Nicholson's agent wanted.[7]:130\n\nNicholson starred in Carnal Knowledge in 1971, a comedy-drama directed by Mike Nichols, which co-starred Art Garfunkel, Ann-Margret, and Candice Bergen. He was nominated for a Golden Globe Award for Best Actor. As a director, Mike Nichols was limited in the actors who he felt could handle the role, saying, \"There is James Cagney, Spencer Tracy, Humphrey Bogart, and Henry Fonda. After that, who is there but Jack Nicholson?\"[26] During the filming, Nicholson struck up what became a lifelong friendship with co-star Garfunkel. When he visited Los Angeles, Garfunkel would stay at Nicholson's home in a room Nicholson jokingly called \"the Arthur Garfunkel Suite\".[7]:127\n\nOther Nicholson roles included Hal Ashby's The Last Detail (1973), with Randy Quaid, for which Nicholson won for Best Actor at the Cannes Film Festival, and he was nominated for his third Oscar and a Golden Globe. Television journalist David Gilmour writes that one of his favorite Nicholson scenes from all his films was in this one when Nicholson slaps his gun on the bar yelling he was the Shore Patrol.[27][28] Critic Roger Ebert called it a very good movie, but credited Nicholson's acting as the main reason: \"He creates a character so complete and so complex that we stop thinking about the movie and just watch to see what he'll do next.\"[29]\n\nIn 1974, Nicholson starred in Roman Polanski's noir thriller Chinatown, and was again nominated for Academy Award for Best Actor for his role as Jake Gittes, a private detective. The film co-starred Faye Dunaway and John Huston, and included a cameo role with Polanski. Roger Ebert described Nicholson's portrayal as sharp-edged, menacing, and aggressive, a character who knew \"how to go over the top\", as he did in One Flew Over the Cuckoo's Nest. It is that edge that kept Chinatown from becoming a typical genre crime film.[30] Ebert also notes the importance of the role for Nicholson's career, seeing it as a major transition from the exploitation films of the previous decade. \"As Jake Gittes, he stepped into Bogart's shoes\", says Ebert. \"As a man attractive to audiences because he suggests both comfort and danger ... From Gittes forward, Nicholson created the persona of a man who had seen it all and was still capable of being wickedly amused.\"[31]\n\nNicholson had been friends with the director Roman Polanski long before the murder of Polanski's wife, Sharon Tate, at the hands of the Manson Family, and supported him in the days following the deaths.[7]:109–110[32] After Tate's death, Nicholson began sleeping with a hammer under his pillow,[7] and took breaks from work to attend the Manson trial.[16]\n\nIn 1977, three years after Chinatown, Polanski was arrested at Nicholson's home for the sexual assault of 13-year-old Samantha Geimer, who was modeling for Polanski during a magazine photo shoot around the pool. At the time of the incident, Nicholson was out of town making a film, but his steady girlfriend, actress Anjelica Huston, had dropped by unannounced to pick up some items. She heard Polanski in the other room say, \"We'll be right out.\"[33] Polanski then came out with Geimer, and he introduced her to Huston, and they chatted about Nicholson's two large dogs, which were sitting nearby. Huston recalled Geimer was wearing platform heels and appeared quite tall.[33] After a few minutes of talking, Polanski had packed up his camera gear, and Huston saw them drive off in his car. Huston told police the next day, after Polanski was arrested, that she \"had witnessed nothing untoward\" and never saw them together in the other room.[33]\n\nGeimer learned afterward that Huston herself wasn't supposed to be at Nicholson's house that day, since they had recently broken up, but stopped over to pick up some belongings. Geimer described Nicholson's house as \"definitely\" a guy's house, with lots of wood and shelves crowded with photos and mementos.[34]\n\nOne of Nicholson's greatest successes came in 1975, with his role as Randle P. McMurphy in One Flew Over the Cuckoo's Nest. The movie was an adaptation of Ken Kesey's novel, and was directed by Miloš Forman and co-produced by Michael Douglas. Nicholson plays an anti-authoritarian patient at a mental hospital where he becomes an inspiring leader for the other patients. Playing one of the patients was Danny DeVito in an early role. Nicholson learned afterward that DeVito grew up in the same area of New Jersey, and they knew many of the same people.[35] The film swept the Academy Awards with nine nominations, and won the top five, including Nicholson's first for Best Actor.\n\nThe role seemed perfect for Nicholson, with biographer Ken Burke noting that his \"smartass demeanor balances his genuine concern for the treatment of his fellow patients with his independent spirit too free to exist in a repressive social structure\".[36][37] Forman allowed Nicholson to improvise throughout the film, including most of the group therapy sequences.[16]:273 Reviewer Marie Brenner notes that his bravura performance \"transcends the screen\" and continually inspires the other actors by lightening their mental illnesses with his comic dialogue. She describes his performance:\n\nNicholson is everywhere; his energy propels the ward of loonies and makes of them an ensemble, a chorus of people caught in a bummer with nowhere else to go, but still fighting for some frail sense of themselves. ... There are scenes in Cuckoo's Nest that are as intimate—and in their language, twice as rough—as the best moments in The Godfather ... [and] far above the general run of Hollywood performances.[38]\n\nAlso in 1975, Nicholson starred in Michelangelo Antonioni's The Passenger (1975), which co-starred Maria Schneider. Nicholson plays the role of a journalist, David Locke, who during an assignment in North Africa decides to quit being a journalist and simply disappear by taking on a new hidden identity. Unfortunately, the dead person whose identity he takes on turns out to have been a weapons smuggler on the run. Antonioni's unusual plot included convincing dialogue and fine acting, states film critic Seymour Chatman.[39] It was shot in Algeria, Spain, Germany, and England.\n\nThe film received good reviews and revived Antonioni's reputation as one of cinema's great directors.[39] He says he wanted the film to have more of a \"spy feeling [and] be more political\".[39] Nicholson began shooting the film from an unfinished script, notes Judith Crist,[40] yet upon its completion he thought so highly of the film that he bought the world rights and recorded a reminiscence of working with Antonioni.[39] Critic and screenwriter Penelope Gilliatt provides an overview of Nicholson's role:\n\nThe Passenger is an unidealized portrait of a drained man whose one remaining stimulus is to push his luck. Again and again, in the movie, we watch him court danger. It interests him to walk the edge of risk. He does it with passivity as if he were taking part in an expressionless game of double-dare with life. Jack Nicholson's performance is a wonder of insight. How to animate a personality that is barely there.[16]:443\n\nHe continued to take more unusual roles. He took a small role in The Last Tycoon, opposite Robert De Niro. He took a less sympathetic role in Arthur Penn's western The Missouri Breaks (1976), specifically to work with Marlon Brando. Nicholson was especially inspired by Brando's acting ability, recalling that in his youth, as an assistant manager at a theater, he watched On the Waterfront about forty times.[41] \"I'm part of the first generation that idolized Marlon Brando\", he said.[42]\n\nMarlon Brando influenced me strongly. Today, it's hard for people who weren't there to realize the impact that Brando had on an audience. ... He's always been the patron saint of actors.[26]\n\nNicholson has observed that while both De Niro and Brando were noted for their skill as method actors, he himself has seldom been described as a method actor, a fact which he sees as an accomplishment: \"I'm still fooling them\", he told Sean Penn during a phone conversation. \"I consider it an accomplishment because there's probably no one who understands Method acting better academically than I do—or actually uses it more in his work. But it's funny, nobody really sees that. It's perception versus reality, I guess.\"[25]\n\n1980s [ edit ]\n\nHis work is always interesting, clearly conceived, and has the X-factor, magic. Jack is particularly suited for roles which require intelligence. He is an intelligent and literate man, and these are almost impossible to act. In The Shining you believe he's a writer, failed or otherwise. —Stanley Kubrick[43]\n\nAlthough he garnered no Academy Award for Stanley Kubrick's adaptation of Stephen King's The Shining (1980), it remains one of his more significant roles. He was Kubrick's first choice to play the lead role, although the book's author, Stephen King, wanted the part played by more of an \"everyman\". However, Kubrick as a director won the argument, and described Nicholson's acting quality as being \"on a par with the greatest stars of the past, like Spencer Tracy and Jimmy Cagney\".[43]\n\nOn the set, Nicholson always appeared in character, and if Kubrick felt confident that he knew his lines well enough, he encouraged him to improvise and go beyond the script.[43]:434 For example, Nicholson improvised his now famous \"Here's Johnny!\" line,[43]:433 along with the scene in which he's sitting at the typewriter and unleashes his anger upon his wife after she discovers he has gone insane when she looks at his writing (\"all work and no play makes Jack a dull boy\" typed endlessly).[43]:445 There were also extensive takes of scenes, due to Kubrick's perfectionism. Nicholson shot a scene with the ghostly bartender thirty-six times.[44] Nicholson states that \"Stanley's demanding. He'll do a scene fifty times, and you have to be good to do that.\"[45]:38\n\nIn 1982, he starred as an immigration enforcement agent in The Border, directed by Tony Richardson. It co-starred Warren Oates, who played a corrupt border official.[46] Richardson wanted Nicholson to play his role less expressively than he had in his earlier roles. \"Less is more\", he told him, and wanted him to wear reflecting sunglasses to portray what patrolmen wore.[16]:318 Richardson recalled that Nicholson worked hard on the set:\n\nHe's what the Thirties and Forties stars were like. He can come on the set and deliver, without any fuss, without taking a long time walking around getting into it. \"What do you want? Okay.\" And he just does it straight off. And then if you want him to do it another way on the next take, he can adapt to that too.[16]:318\n\nNicholson won his second Oscar, an Academy Award for Best Supporting Actor, for his role of retired astronaut Garrett Breedlove in Terms of Endearment (1983), directed by James L. Brooks. It starred Shirley MacLaine and Debra Winger. McGilligan claims it was one of Nicholson's most complex and unforgettable characters. He and MacLaine played many of their scenes in different ways, constantly testing and making adjustments. Their scenes together gave the film its \"buoyant edge\", states McGilligan, and describes Nicholson's acting as \"Jack floating like a butterfly\".[16]:330\n\nNicholson continued to work prolifically in the 1980s, starring in such films as The Postman Always Rings Twice (1981), Reds (1981), where Nicholson portrays the writer Eugene O'Neill with a quiet intensity, Prizzi's Honor (1985), The Witches of Eastwick (1987), Broadcast News (1987), and Ironweed (1987). Three Oscar nominations also followed (Reds, Prizzi's Honor, and Ironweed).[47][48][49] John Huston, who directed Prizzi's Honor, said of Nicholson's acting, \"He just illuminates the book. He impressed me in one scene after another; the movie is composed largely of first takes with him.\"[50]\n\nIn the 1989 Batman movie, Nicholson played the psychotic murderer and villain, the Joker. The film was an international smash hit, and a lucrative percentage deal earned him a percentage of the box office gross estimated at $60 million to $90 million.[51] Nicholson said that he was \"particularly proud\" of his performance as the Joker: \"I considered it a piece of pop art\", he said.[25]\n\n1990s [ edit ]\n\nFor his role as hot-headed Col. Nathan R. Jessup in A Few Good Men (1992), a movie about a murder in a U.S. Marine Corps unit, Nicholson received yet another Academy Award nomination for Best Supporting Actor.[52][53] One review describes his performance as \"spellbinding\", adding that he portrayed \"the essence of the quintessential military mindset\".[54] Critic David Thomson notes that Nicholson's character \"blazed and roared\".[55]\n\nThe film's director, Rob Reiner, recalls how Nicholson's level of acting experience affected the other actors during rehearsals: \"I had the luck of having Jack Nicholson there. He knows what he's doing, and he comes to play, every time out, full-out performance! And what it says to a lot of the other actors is, 'Oooooh, I better get on my game here because this guy's coming to play! So I can't hold back; I've got to come up to him.' He sets the tone.\"[56]\n\nIn 1996, Nicholson collaborated once more with Batman director Tim Burton on Mars Attacks!, pulling double duty as two contrasting characters, President James Dale and Las Vegas property developer Art Land. At first, studio executives at Warner Bros. disliked the idea of killing off Nicholson's character, so Burton created two characters and killed them both off.[citation needed]\n\nNot all of Nicholson's performances have been well received. He was nominated for Razzie Awards as worst actor for Man Trouble (1992) and Hoffa (1992). However, Nicholson's performance in Hoffa also earned him a Golden Globe nomination.[57][58] While David Thomson states that the film was terribly neglected, since Nicholson portrayed one of his best screen characters, someone who is \"snarly, dumb, smart, noble, rascally—all the parts of 'Jack'\"[55]\n\nNicholson went on to win his next Academy Award for Best Actor in the romantic comedy, As Good as It Gets (1997), his third film directed by James L. Brooks. He played Melvin Udall, a \"wickedly funny\",[59] mean-spirited, obsessive-compulsive novelist. \"I'm a studio Method actor\", he said. \"So I was prone to give some kind of clinical presentation of the disorder.\"[60] His Oscar was matched with the Academy Award for Best Actress for Helen Hunt, who played a Manhattan wisecracking, single-mother waitress drawn into a love/hate friendship with Udall, a frequent diner in the restaurant. The film was a tremendous box office success, grossing $314 million, which made it Nicholson's second-best-grossing film of his career, after Batman.[26]\n\nNicholson admits he initially didn't like playing the role of a middle-aged man alongside much younger Hunt, seeing it as a movie cliché. \"But Helen disarmed that at the first meeting\", he says, \"and I stopped thinking about it.\" They got along well during the filming, with Hunt saying that he \"treated me like a queen\", and they connected immediately: \"It wasn't even what we said\", she adds. \"It was just some frequency we both could tune into that was very, very compatible.\"[59]\n\nCritic Jack Mathews of Newsday described Nicholson as being \"in rare form\", adding that \"it's one of those performances that make you aware how much fun the actor is having\".[59] Author and screenwriter Andrew Horton describes their on-screen relationship as being like \"fire and ice, oil and water— seemingly complete opposites\".[61] Nonetheless, Hunt was Nicholson's perfect counterpart and delivered \"a simply stunning performance\", wrote critic Louise Keller.[62]\n\nIn 2001, Nicholson was the first actor to receive the Stanislavsky Award at the 23rd Moscow International Film Festival for \"conquering the heights of acting and faithfulness\".[63]\n\n2000s [ edit ]\n\nNicholson in 2008\n\nIn About Schmidt (2002), Nicholson portrayed a retired Omaha, Nebraska, actuary who questions his own life following his wife's death. His quietly restrained performance earned him an Academy Award Nomination for Best Actor. In Anger Management (2003), he played an aggressive therapist assigned to help an over pacifist man (Adam Sandler). In 2003, Nicholson also starred in Something's Gotta Give, as an aging playboy who falls for the mother (Diane Keaton) of his young girlfriend. In late 2006, Nicholson marked his return to the dark side as Frank Costello, a nefarious Boston Irish Mob boss, based on Whitey Bulger who was still on the run at that time, presiding over Matt Damon and Leonardo DiCaprio in Martin Scorsese's Oscar-winning film The Departed, a remake of Andrew Lau's Infernal Affairs. The role earned Nicholson worldwide critical praise, along with various award wins and nominations, including a Golden Globe nomination for best supporting actor.\n\nIn 2007, Nicholson co-starred with Morgan Freeman in Rob Reiner's The Bucket List.[64] Nicholson and Freeman portrayed dying men who fulfill their list of goals. In researching the role, Nicholson visited a Los Angeles hospital to see how cancer patients coped with their illnesses.\n\n2010s [ edit ]\n\nNicholson's next film role saw him reunite with James L. Brooks, director of Terms of Endearment, Broadcast News, and As Good as It Gets, for a supporting role as Paul Rudd's character's father in the 2010 film How Do You Know.\n\nIt has been widely reported in subsequent years that Nicholson has retired from acting because of memory loss,[65] but in a September 2013 Vanity Fair article, Nicholson clarified that he did not consider himself retired, merely that he was now less driven to \"be out there any more\".[66]\n\nOn February 15, 2015, Nicholson made a special appearance as a presenter on SNL 40, the 40th anniversary special of Saturday Night Live.[67] After the death of boxer Muhammad Ali on June 3, 2016, Nicholson appeared on HBO's The Fight Game with Jim Lampley for an exclusive interview about his friendship with Ali.[68]\n\nIn February 2017, it was reported that Nicholson would be starring in an English-language remake of Toni Erdmann opposite Kristen Wiig, his first feature film role since How Do You Know.[69] On August 20, 2018, Nicholson dropped out of the project.[70]\n\nIn June 2019, it was confirmed that Nicholson has a role in Quentin Tarantino's 9th film Once Upon a Time in Hollywood.[71]\n\nPersonal life [ edit ]\n\nRelationships and children [ edit ]\n\nNicholson is the Hollywood celebrity who is almost like a character in some ongoing novel of our times. He is also the most beloved of stars—not even his huge wealth, his reckless aging, and the public disasters of his private life can detract from this ... For he is still a touchstone, someone we value for the way he helps us see ourselves. —David Thomson, a film critic.[55]\n\nChildren of Jack Nicholson By Sandra Knight Jennifer (born 1963)\n\nBy Susan Anspach Caleb (born 1970)\n\nBy Winnie Hollman Honey (born 1981)\n\nBy Rebecca Broussard Lorraine (born 1990) Raymond (born 1992)\n\n\n\nNicholson's only marriage was to Sandra Knight from June 17, 1962, to August 8, 1968; they had been separated for two years prior to the divorce. They had one daughter together, Jennifer (born September 16, 1963).\n\nActress Susan Anspach contended that her son, Caleb Goddard (born September 26, 1970), was fathered by Nicholson. In 1984, Nicholson stated that he was not convinced he is Caleb's father;[72] however, in 1996, Caleb stated that Nicholson had acknowledged him as his son.[73] At some point between 1988 and 1994, Nicholson provided financial assistance to put Caleb through college,[74] and Anspach's New York Times obituary referred to Caleb as \"her son, whose father is Jack Nicholson\".[75]\n\nBetween April 1973 and January 1990, Nicholson had an on-again, off-again relationship with actress Anjelica Huston that included periods of overlap with other women, including Danish model Winnie Hollman, by whom he fathered a daughter, Honey Hollman (born 1981).[76]\n\nFrom 1989 to 1994, Nicholson had a relationship with actress Rebecca Broussard. They had two children together: daughter Lorraine (born April 16, 1990), and son Raymond (born February 20, 1992).[76][77]\n\nFor over a year, from 1999 to 2000, Nicholson dated actress Lara Flynn Boyle; they later reunited, before splitting permanently in 2004.[78]\n\nNicholson has stated that children \"give your life a resonance that it can't have without them ... As a father, I'm there all the time. I give unconditional love.\"[25] However, he has also lamented that he \"didn't see enough of my eldest daughter because I was trying to make a career\".[79]\n\nAssault charge [ edit ]\n\nIn a criminal complaint filed on February 8, 1994, Robert Blank stated that Nicholson, then 56, approached Blank's Mercedes-Benz while he was stopped at a red light in North Hollywood. After accusing the other man of cutting him off in traffic, Nicholson used a golf club to bash the roof and windshield of Blank's car. A witness confirmed Blank's account of the incident, and misdemeanor charges of assault and vandalism were filed against Nicholson. Charges were dropped after Nicholson apologized to Blank, and the two reached an undisclosed settlement, which included a reported $500,000 check from Nicholson.[80]\n\nCelebrity friendships [ edit ]\n\nNicholson lived next door to Marlon Brando for a number of years on Mulholland Drive in Beverly Hills. Warren Beatty also lived nearby, earning the road the nickname \"Bad Boy Drive\". After Brando's death in 2004, Nicholson purchased his bungalow for $6.1 million, with the purpose of having it demolished. Nicholson stated that it was done out of respect to Brando's legacy, as it had become too expensive to renovate the \"derelict\" building which was plagued by mold.[81]\n\nNicholson's friendship with author-journalist Hunter S. Thompson is described in Thompson's autobiography Kingdom of Fear.[82] Following Thompson's death in 2005, Nicholson and fellow actors Johnny Depp, John Cusack, and Sean Penn attended the private memorial service in Colorado.[83]\n\nNicholson was also a close friend of Robert Evans, the producer of Chinatown, and after Evans lost Woodland, his home, as the result of a 1980s drug bust, Nicholson and other friends of the producer purchased Woodland to give it back to Evans.[84]\n\nHobbies [ edit ]\n\nNicholson is a fan of the New York Yankees and Los Angeles Lakers. He has been a Laker season ticket holder since 1970, and has held courtside season tickets for the past 25 years next to the opponent's benches both at The Forum and Staples Center, missing very few games. In a few instances, Nicholson has engaged in arguments with game officials and opposing players, and even walked onto the court.[85] He was almost ejected from a Lakers playoff game in May 2003 after he yelled at the game's referee.[86]\n\nNicholson is a collector of 20th-century and contemporary art, including the work of Henri Matisse, Tamara de Lempicka,[87] Andy Warhol and Jack Vettriano.[88] In 1995, artist Ed Ruscha was quoted saying that Nicholson has \"one of the best collections out here\".[89]\n\nPolitical views [ edit ]\n\nNicholson described himself as a \"life-long Irish Democrat\".[90] Although he is personally against abortion, he is pro-choice. He has said, \"I'm pro-choice but against abortion because I'm an illegitimate child myself, and it would be hypocritical to take any other position. I'd be dead. I wouldn't exist.\" He has also said that he has \"nothing but total admiration, gratitude, and respect for the strength of the women who made the decision they made in my individual case\".[91]\n\nReligious views [ edit ]\n\nDuring a 1992 Vanity Fair interview, Nicholson stated, \"I don't believe in God now. I can still work up an envy for someone who has faith. I can see how that could be a deeply soothing experience.\"[92]\n\nHonors [ edit ]\n\nIn May 2008, then-California Governor Arnold Schwarzenegger and First Lady Maria Shriver announced that Nicholson would be inducted into the California Hall of Fame, located at The California Museum for History, Women and the Arts. The induction ceremony took place on December 15, 2008, where he was inducted alongside 11 other Californians.[93][94]\n\nIn 2010, Nicholson was inducted into the New Jersey Hall of Fame.[95]\n\nIn 2011, Nicholson received an honorary Doctor of Fine Arts degree from Brown University at its 243rd commencement. At the ceremony, Ruth Simmons, Brown University's president, called him, \"the most skilled actor of our lifetime\".[96]\n\nAwards and nominations [ edit ]\n\nWith 12 Academy Award nominations (eight for Best Actor and four for Best Supporting Actor), Nicholson is the most nominated male actor in Academy Awards history. Only Nicholson (1960s–2000s), Michael Caine (1960s–2000s), Meryl Streep (1970s–2010s), Paul Newman (1950s–1960s, 1980s–2000s), Katharine Hepburn (1930s–1960s, 1980s), and Laurence Olivier (1930s–1970s) have been nominated for an acting (lead or supporting) Academy Award in five different decades.\n\nWith three Oscar wins, he also ties with Walter Brennan, Daniel Day-Lewis, Ingrid Bergman, and Meryl Streep for the second-most Oscar wins in acting categories. Only Katharine Hepburn, with four Oscars, won more.\n\nIn 2013, Nicholson co-presented the Academy Award for Best Picture with First Lady Michelle Obama. This ceremony marked the eighth time he has presented the Academy Award for Best Picture (1972, 1977, 1978, 1990, 1993, 2006, 2007, and 2013). Nicholson is an active and voting member of the Academy.\n\nFilmography [ edit ]\n\nNicholson's acting career spans over sixty years. He has won three Academy Awards, and with twelve nominations, he is the most nominated male actor in the Academy's history.\n\nAmong his most notable films are Easy Rider (1969), Five Easy Pieces (1970), The Last Detail (1973), Chinatown (1974), The Passenger (1975), One Flew Over the Cuckoo's Nest (1975), The Shining (1980), Terms of Endearment (1983), Batman (1989), A Few Good Men (1992), As Good as It Gets (1997), About Schmidt (2002), Something's Gotta Give (2003), The Departed (2006), and The Bucket List (2007).\n\nSee also [ edit ]\n\nNotes [ edit ]\n\n^ John Joseph Nicholson (a department store window dresser in Manasquan, New Jersey ) and Ethel May (née Rhoads, a hairdresser, beautician and amateur artist in Manasquan)\n\nReferences [ edit ]\n\nBibliography [ edit ]", "images": ["http://wikivividly.com/assets/art.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/3/38/Chinatownposter1.jpg/218px-Chinatownposter1.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/Elia_Kazan.JPG/253px-Elia_Kazan.JPG", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/Marlon_Brando_53.jpg/310px-Marlon_Brando_53.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/07/George_C._Scott_-_publicity.JPG/258px-George_C._Scott_-_publicity.JPG", "https://upload.wikimedia.org/wikipedia/commons/e/ec/Jack_Nicholson_2001.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/56/Little_Shop_of_Horrors_Nicholson.JPG/220px-Little_Shop_of_Horrors_Nicholson.JPG", "https://upload.wikimedia.org/wikipedia/en/thumb/7/7c/Fat_City_DVD_cover.jpg/210px-Fat_City_DVD_cover.jpg", "http://wikivividly.com/assets/science.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/25/Jack_Nicholson_-_1976.jpg/220px-Jack_Nicholson_-_1976.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/Mug_shot_of_Roman_Polanski.png/293px-Mug_shot_of_Roman_Polanski.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Al_Pacino.jpg/223px-Al_Pacino.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f9/The_Shining_%281997_mini-series_poster%29.jpg/220px-The_Shining_%281997_mini-series_poster%29.jpg", "http://wikivividly.com/assets/history.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/d/d3/Five_easy_pieces.jpg/204px-Five_easy_pieces.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/16/Prizzis_honor.jpg/207px-Prizzis_honor.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/e/ec/Jack_Nicholson_2001.jpg/220px-Jack_Nicholson_2001.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/c/c3/Ironweed_%28movie_poster%29.jpg/217px-Ironweed_%28movie_poster%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/12/Treasuremadre.jpg/206px-Treasuremadre.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9e/Martin_Landau-Mission-1968.jpg/267px-Martin_Landau-Mission-1968.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/80/John_Huston_-_publicity.JPG/253px-John_Huston_-_publicity.JPG", "http://upload.wikimedia.org/wikipedia/en/thumb/f/fd/Portal-puzzle.svg/16px-Portal-puzzle.svg.png", "http://wikivividly.com/assets/people.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Jack_Nicholson.0920.jpg/170px-Jack_Nicholson.0920.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/12/Roman_Polanski_at_Cannes_in_2013_cropped_and_brightened.jpg/228px-Roman_Polanski_at_Cannes_in_2013_cropped_and_brightened.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/c/c3/Drive_he_said.jpg/210px-Drive_he_said.jpg", "http://wikivividly.com/assets/places.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/e/ea/The_Shining_%281980%29.png/206px-The_Shining_%281980%29.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/Anjelica_Huston_March_21%2C_2014_%28cropped%29.jpg/236px-Anjelica_Huston_March_21%2C_2014_%28cropped%29.jpg", "http://wikivividly.com/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f5/Harvey_Keitel_Cannes_2015.jpg/226px-Harvey_Keitel_Cannes_2015.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/52/DennisHopperJackNicholson.jpg/170px-DennisHopperJackNicholson.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/KubrickForLook_%28cropped%29.jpg/213px-KubrickForLook_%28cropped%29.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/e/ec/Jack_Nicholson_2001.jpg", "keywords": [], "authors": [], "canonical_link": "https://wikivividly.com/wiki/Jack_Nicholson", "title": "Jack Nicholson", "meta_data": {"description": "John Joseph Nicholson (born April 22, 1937) is an American actor and filmmaker who has performed for over sixty years. He is known for playing a wide range of starring or supporting roles, including satirical comedy, romance, and dark portrayals of anti-heroes and villainous characters. In many of his films, he has played the", "keywords": "WikiVividly, WikiVividly.com, Wiki, Wikipedia, article, photo gallery, images, photos, photographs, pictures, pics, youtube, bio, biography, history", "og": {"description": "John Joseph Nicholson (born April 22, 1937) is an American actor and filmmaker who has performed for over sixty years. He is known for playing a wide range of starring or supporting roles, including satirical comedy, romance, and dark portrayals of anti-heroes and villainous characters. In many of his films, he has played the", "image": "https://upload.wikimedia.org/wikipedia/commons/e/ec/Jack_Nicholson_2001.jpg", "title": "Jack Nicholson - WikiVividly.com", "type": "website", "url": "https://wikivividly.com/wiki/Jack_Nicholson"}, "viewport": "width=device-width, initial-scale=1", "format-detection": "telephone=no"}, "movies": [], "publish_date": null, "source": "http://wikivividly.com", "summary": ""}