{"url": "https://en.wikipedia.org/wiki/Lena_Waithe", "text": "American actress, producer, and screenwriter\n\nLena Waithe (born May 17, 1984)[1] is an American screenwriter, producer, and actress. She is known for co-writing and acting in the Netflix comedy-drama series Master of None.[2][3][4] Waithe made history becoming the first Black-American woman to win the Primetime Emmy Award for Outstanding Writing for a Comedy Series in 2017 for her work on Master of None.[5] The \"Thanksgiving\" episode for which she won the Emmy was loosely based on her personal experience coming out to her mother.[6] She is the creator of the Showtime drama series The Chi.[7]\n\nEarly life and education [ edit ]\n\nWaithe was born in Chicago, Illinois.[8][9] Though acting was not originally among Waithe's ambitions,[10][11] she knew from the age of seven that she wanted to be a television writer, and received strong family support for her writing from her single mother and grandmother:[2] Her parents had divorced when she was three; Waithe's father died when she was fourteen.[12] Waithe and her sister grew up on the South Side of Chicago until Waithe was age twelve, and attended a local, mostly African-American elementary magnet school, Turner-Drew[7] but moved to Evanston and finished middle school at Chute Middle School.[13] She graduated from Evanston Township High School and earned a degree in Cinema and Television Arts[14] from Columbia College Chicago in 2006,[3][11][15] praising faculty playwright Michael Fry for his teaching and encouragement.[15][16] Finding more ways to involve herself in the television and film industry, she also worked at a movie theater as well as the media department of a Blockbuster.[17] She moved to Los Angeles in 2006, supported by a locational transfer of her aforementioned Blockbuster job, to begin pursuing her true ambitions.[17]\n\nCareer [ edit ]\n\nHaving arrived in Los Angeles, Waithe secured a job as an assistant to the executive producer of Girlfriends, a long running sitcom.[17] Soon after, she landed a minor role in Lisa Kudrow's The Comeback.[17] She later became a writer for the Fox television series Bones,[10] a writer for the 2012 Nickelodeon sitcom How to Rock, and a producer on the 2014 satirical comedy film Dear White People.[18] Waithe wrote and appeared in the YouTube series \"Twenties\" which was produced by Flavor Unit Entertainment and optioned in 2014 by BET.[19][20] In addition to writing and directing the short film \"Save Me\", which was shown at several independent film festivals,[21] Waithe wrote the 2013 web series \"Hello Cupid\" and the 2011 viral video Shit Black Girls Say.[18]\n\nIn 2014, Variety named Waithe as one of its \"10 Comedians to Watch\".[19] In August 2015, Showtime network commissioned a pilot for an upcoming series, The Chi, written by Waithe and produced by Common, which tells a young urban Black-American man's coming-of-age story.[22] As the show's creator, Waithe's goal was to bring her experience growing up on the South Side and experiencing its diversity to craft a story that paints a more nuanced portrait of her hometown than is typically shown.[23] Similarly, Waithe continues to extend her influence to support the Black-American community in the entertainment industry through her role as co-chair of the Committee of Black Writers at the Writers Guild.[13] Waithe was cast in the Netflix series Master of None after meeting creator and lead actor Aziz Ansari who, with Alan Yang, had originally written Denise as a straight, white woman with the potential, according to Waithe, to evolve into one of the main character's love interests: \"For some reason, [casting director] Allison Jones thought about me for it, a black gay woman.\"[2] Ansari and Yang rewrote the script to make the character more like Waithe: \"All of us actors play heightened versions of ourselves.\"[2] She said, \"I don't know if we've seen a sly, harem pants-wearing, cool Topshop sweatshirt-wearing, snapback hat-rocking lesbian on TV.\"[10] She also said, \"I know how many women I see out in the world who are very much like myself. We exist. To me, the visibility of it was what was going to be so important and so exciting.\"[10]\n\nIn 2017, Waithe and Ansari won the Primetime Emmy Award for Outstanding Writing for a Comedy Series for the season 2 episode \"Thanksgiving\".[24] She became the first Black-American woman to win an Emmy in that category.[24][25][26] Waithe described the episode as based on her coming out experience as a lesbian.[27] During her Emmy speech, she sent a special message to her LGBTQIA (Lesbian, Gay, Bisexual, Transgender, Queer, Intersex, and Asexual)[28] family discussing how \"The things that make us different—those are our superpowers.\"[29] She ended her speech by recognizing her journey as a Black woman saying \"Thank you for embracing a little Indian boy from South Carolina and a little queer black girl from the South Side of Chicago.\"[30] Waithe also developed an autobiographical drama series called The Chi.[31][32] Out Magazine named Waithe the Out100: Artist of the Year on November 8, 2017.[33]\n\nWaithe has written and will produce Queen & Slim, starring Jodie Turner-Smith and Daniel Kaluuya, directed by Melina Matsoukas. It is scheduled to be released on November 27, 2019, by Universal Pictures.[34]\n\nWhen Waithe is not actively working on writing, acting, or producing, she works to recruit more people of color and queer artists for her film and television projects.[35]\n\nPersonal life [ edit ]\n\nWaithe is openly lesbian.[36] She has been in a relationship with Alana Mayo, a content executive,[37] for three years.[38] They became engaged on Thanksgiving Day 2017.[39]\n\nWaithe described her family as \"lazy Christians\" and said in 2018, \"I'm a huge believer in God, and Jesus Christ, and that God made me and all those things. And I try to just be a good person. I think that is the base of my religion, is to be good, is to be honest.\"[40]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nAwards [ edit ]\n\nAwards [ edit ]\n\nYear Nominated Work Organization Category Result 2017 Master of None (Episode: \"Thanksgiving\")\n\n(with Aziz Ansari) Emmy Outstanding Writing for a Comedy Series Won 2018 N/A MTV Trailblazer Award Won 2015 Dear White People Black Reel Outstanding Motion Picture Nominated 2018 The Chi Black Reel Outstanding Drama Series Nominated 2017 Master of None Gold Derby Comedy Episode of the Year Won 2014 Dear White People Gotham Audience Award Nominated 2018 Ready Player One MTV Best on Screen Team Nominated 2018 Master of None Writers Guild of America Comedy Series Nominated 2015 Dear White People Film Independent Spirit Best First Feature Nominated 2017 N/A Out Artist of the Year Won 2017 N/A The Advocate Person of the Year Nominated", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Lena_Waithe_by_Gage_Skidmore.jpg/220px-Lena_Waithe_by_Gage_Skidmore.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Lena_Waithe_by_Gage_Skidmore.jpg/1200px-Lena_Waithe_by_Gage_Skidmore.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Lena_Waithe_by_Gage_Skidmore.jpg/1200px-Lena_Waithe_by_Gage_Skidmore.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Lena_Waithe", "title": "Lena Waithe", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.13", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Lena_Waithe_by_Gage_Skidmore.jpg/1200px-Lena_Waithe_by_Gage_Skidmore.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}