{"url": "https://en.wikipedia.org/wiki/Angelina_Pivarnick", "text": "American television personality\n\nAngelina Marie Pivarnick[7] (born June 26, 1986) is an American television personality who is best known for starring in the first two seasons of the MTV's reality show Jersey Shore and the VH1 show Couples Therapy. Pivarnick made her return to television as a supporting cast member for Jersey Shore: Family Vacation.\n\nCareer [ edit ]\n\nJersey Shore premiered on December 4, 2009. Pivarnick was evicted from the shore house in the third episode of season one, after refusing to work her shift at the T-shirt shop.[8][9] She then was on Jersey Shore season two In Miami Beach, Florida and Pivarnick again departed the house during season two after violent confrontations with fellow cast-members Michael Sorrentino and Nicole \"Snooki\" Polizzi. She did not return for season three. She also appeared with Total Nonstop Action Wrestling.\n\nIn 2010, Pivarnick released the song \"I'm Hot\".[10] She and her boyfriend appeared in Season 1 of the VH1 reality show Couples Therapy, which premiered March 25, 2012.\n\nIn 2011, Pivarnick made a brief appearance in the music video for rap group Dacav5's song \"Dirty Style\".[11] She also appeared as a contestant on the reality dating series Excused. She made it to the final round and was chosen by Sergio to try dating each other. She later released a new song titled \"Gotta Go Out\" under the name Miss AP in August 2011 featuring Tony Hanson \"Fenix\". The song charted at #37 in the United States on the Billboard Dance/Club Play Songs list.[12]\n\nIn September 2012, she engaged in a debate with recording artist Adam Barta on the topic of gay marriage, which she said she opposed. She later reversed her position after Jersey Shore costar JWoww criticized her on Twitter.[13] She issued a public apology via TMZ.[14] In December, she announced a single release called \"Serendipity\" with Barta, in the hopes of making amends with the LGBT community.[15]\n\nIn 2018, Pivarnick and her fiancé Chris appeared on the show How Far Is Tattoo Far?[16]", "images": ["https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Angelina_Pivarnick", "title": "Angelina Pivarnick", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.13", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}