{"url": "https://www.thisisinsider.com/chrissy-teigen-fears-postpartum-depression-again-2018-2", "text": "From body-shaming to Beyoncé fan-girling, no topic is off-limits for Chrissy Teigen. Last year, the former model even opened up about her struggles with postpartum depression following the birth of her daughter, Luna.\n\nAlthough Teigen wrote that she overcame the condition with a combination of medication, therapy, and support from her friends and family, she also acknowledged that mental illness \"does not discriminate.\" Now pregnant with her second child, the social media darling said she's scared of experiencing another round of postpartum once her son is born in June.\n\n\"Do I worry about it with this little boy? I do. But I also know that when it does happen — if it does — I'm so ready for it,\" she said at the Create & Cultivate Conference on Saturday. \"I have the perfect people around me for it. That's why I stand for a real core group of people around me.\"\n\nTeigen has said that it was difficult to admit to herself that she was depressed. Vivien Killilea/Getty Images\n\nThe soon-to-be mom of two chatted with friend and celebrity hairstylist Jen Atkin about demystifying the common condition.\n\n\"I had just had Luna. I knew I had an incredible life, and husband, and family, and all the resources necessary. I knew that I was personally unhappy, but I didn't think that anything was wrong with it because I just assumed that that's the way it goes,\" Teigen said. \"I do wish that more people had spoken up around me. I encourage anyone who sees something around them to point it out.\"\n\nThere is a stigma surrounding postpartum depression\n\n\"For some women, admitting they are experiencing depression may feel like a weakness. Or, they may worry that it somehow means they're not excited to be a parent or that they won't be a good mother,\" psychotherapist Amy Morin told INSIDER.\n\nTeigen is certainly not alone in her struggles. Many new moms experience early symptoms so subtle, they assume it's par for the course of new motherhood. But postpartum depression is a clinical mood disorder that affects one in seven women, according to the American Psychological Association. It's usually caused by the scrambled hormones after a woman gives birth, and symptoms include extreme sadness, anxiety, mood swings, and exhaustion.\n\n\"It's normal to be weepy and to experience some mild ups and downs after giving birth,\" Morin said. \"But, if the emotions are intense or they don't go away after two weeks, it could be postpartum depression. And it's important to seek help.\"\n\nIf you experienced postpartum depression with your first child, you'll be at a higher risk of experiencing it again after the second\n\nAccording to the APA, previous experiences with depression or anxiety — or a family history of mental illness — may increase a woman's chances of postpartum depression. This includes prior experience with postpartum depression.\n\n\"It's not guaranteed that a mother will experience postpartum depression with all of her pregnancies if she experienced it with one, but a previous bout of postpartum depression is a risk factor,\" Morin told INSIDER.\n\nShe noted that speaking with your doctor and seeking a therapist may help mitigate that risk — or, at least, manage the fear of relapse.\n\n\"Discuss your concerns and talk about steps you can take to prevent postpartum depression,\" Morin said. \"Establishing a routine, like an exercise program, could help or identify people who can support you and help you after you give birth. Talking to a therapist could help you identify strategies that could help reduce your risk.\"\n\nBeing aware of the signs of postpartum depression is key\n\nIf a mother is on the defensive and familiar with the symptoms, she can seek help sooner. As Morin said, \"early intervention is often key to successful treatment.\"\n\n\"Getting proactive can help reduce some of the fear that you might relapse,\" Morin told INSIDER. \"When you have a clear plan in place and supportive people working on your team, you'll feel more confident that you can handle postpartum depression if it happens again.\"", "images": ["https://amp.insider.com/images/5a941cc2c1699519008b4697-1334-667.jpg", "https://amp.insider.com/images/5cd97fa393a15206cb247ca4-750-563.jpg"], "top_img": "https://amp.insider.com/images/5a941cc2c1699519008b4697-1334-667.jpg", "keywords": [], "authors": ["Callie Ahlgrim"], "canonical_link": "https://www.insider.com/chrissy-teigen-fears-postpartum-depression-again-2018-2", "title": "Chrissy Teigen worries she'll suffer postpartum depression again after her son is born — and there's a good chance she will", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "ii-ab-test": {"hpi4": "control"}, "msapplication-config": "//media.insider.com/public/assets/INSIDER/US/favicons/browserconfig.xml", "theme-color": "#111111", "date": "2018-02-26", "sailthru.date": "2018-02-26", "news_keywords": "Chrissy Teigen, Pregnancy, Parenting, Mental Health, Women, Depression, Callie Ahlgrim", "sailthru.tags": "Chrissy Teigen, Pregnancy, Parenting, Mental Health, Women, Depression, Callie Ahlgrim", "description": "Chrissy Teigen says she suffered from postpartum depression after giving birth to her daughter Luna in 2016. A doctor explains why she may suffer again.", "sailthru.description": "Chrissy Teigen says she suffered from postpartum depression after giving birth to her daughter Luna in 2016. A doctor explains why she may suffer again.", "title": "Chrissy Teigen worries she'll suffer postpartum depression again after her son is born — and there's a good chance she will", "sailthru.verticals": "entertainment, health", "sailthru.title": "Chrissy Teigen worries she'll suffer postpartum depression again after her son is born — and there's a good chance she will", "linkedin": {"owner": "mid:1d5f7b"}, "tbi-image": "https://amp.insider.com/images/5a941cc2c1699519008b4697-1334-667.jpg", "sailthru.image.full": "https://amp.insider.com/images/5a947d64c16995cb008b47cb-960-720.jpg", "sailthru.image.thumb": "https://amp.insider.com/images/5a947d64c16995cb008b47cb-160-120.jpg", "tbi-vertical": "Entertainment", "sailthru.author": "Callie Ahlgrim", "og": {"title": "Chrissy Teigen worries she'll suffer postpartum depression again after her son is born — and there's a good chance she will", "description": "Chrissy Teigen says she suffered from postpartum depression after giving birth to her daughter Luna in 2016. A doctor explains why she may suffer again.", "type": "article", "url": "https://www.thisisinsider.com/chrissy-teigen-fears-postpartum-depression-again-2018-2", "image": "https://amp.insider.com/images/5a941cc2c1699519008b4697-1334-667.jpg", "site_name": "INSIDER"}, "author": "Callie Ahlgrim", "twitter": {"url": "https://www.insider.com/chrissy-teigen-fears-postpartum-depression-again-2018-2", "title": "Chrissy Teigen worries she'll suffer postpartum depression again after her son is born — and there's a good chance she will", "description": "Chrissy Teigen says she suffered from postpartum depression after giving birth to her daughter Luna in 2016. A doctor explains why she may suffer again.", "card": "summary_large_image", "image": "https://amp.insider.com/images/5a941cc2c1699519008b4697-1334-667.jpg", "creator": "@callieahlgrim", "site": "@"}, "INSIDER": "Snapchat", "Chrissy Teigen worries she'll suffer postpartum depression again after her son is born — and there's a good chance she will": "The Fastest Way to Share a Moment!", "fb": {"pages": 20446254070}}, "movies": [], "publish_date": 1519621200.0, "source": "https://www.thisisinsider.com", "summary": ""}