{"url": "https://www.cnn.com/2018/06/08/us/anthony-bourdain-obit/index.html", "text": "New York (CNN) In death, as in life, Anthony Bourdain brought us closer together.\n\nOn his award-winning series, \"Parts Unknown,\" Bourdain brought the world home to CNN viewers. Through the simple act of sharing meals, he showcased both the extraordinary diversity of cultures and cuisines, yet how much we all have in common.\n\nTragically, he proved this again on Friday. Bourdain's death shook television viewers around the world . The most common sentiment: \"I feel like I've lost a friend.\"\n\nThe lines are staffed by a mix of paid professionals and unpaid volunteers trained in crisis and suicide intervention. The confidential environment, the 24-hour accessibility, a caller's ability to hang up at any time and the person-centered care have helped its success, advocates say. The International Association for Suicide Prevention and Befrienders Worldwide also provide contact information for crisis centers around the world.\n\nThere is also a crisis text line . For crisis support in Spanish, call 1-888-628-9454.\n\nThe suicide rate in the United States has seen sharp increases in recent years. Studies have shown that the risk of suicide declines sharply when people call the national suicide hotline: 1-800-273-TALK.\n\nBourdain was a larger-than-life figure -- a gifted chef and storyteller who used his books and shows to explore culture, cuisine and the human condition.\n\n\"Tony was a symphony,\" his friend and fellow chef Andrew Zimmern said Friday.\n\nThe news of Bourdain's death was met by profound sadness within CNN, where \"Parts Unknown\" has aired for the past five years. In an email to employees, the network's president, Jeff Zucker, remembered him as an \"exceptional talent.\"\n\n\"Tony will be greatly missed not only for his work but also for the passion with which he did it,\" Zucker wrote.\n\nCNN said Bourdain was in France working on an upcoming episode of his award-winning CNN series, \"Parts Unknown.\" His close friend Eric Ripert, the French chef, found Bourdain unresponsive in his hotel room Friday morning. He was 61 and took his own life.\n\n\"Anthony was my best friend,\" Ripert tweeted. \"An exceptional human being, so inspiring & generous. One of the great storytellers who connected w so many. I pray he is at peace from the bottom of my heart. My love and prayers are also w his family, friends and loved ones.\"\n\nAnthony was my best friend. An exceptional human being, so inspiring & generous. One of the great storytellers who connected w so many. I pray he is at peace from the bottom of my heart. My love & prayers are also w his family, friends and loved ones. pic.twitter.com/LbIeZK14ia — Eric Ripert (@ericripert) June 8, 2018\n\nViewers felt connected to Bourdain through his fearless travels, his restless spirit and his magical way with words.\n\n\"His talents never ceased to amaze us and we will miss him very much,\" CNN said in a statement. \"Our thoughts and prayers are with his daughter and family at this incredibly difficult time.\"\n\nCNN's chief international correspondent, Christiane Amanpour, called Bourdain a \"giant talent.\"\n\n\"My heart breaks for Tony Bourdain,\" she wrote on Twitter. \"May he rest in peace now.\"\n\nMy heart breaks for Tony Bourdain. May he rest in peace now. He was a friend, a collaborator, and family. A huge personality, a giant talent, a unique voice, and deeply, deeply human. My heart goes out to his daughter and family, and his longtime partners and friends at ZPZ. — Christiane Amanpour (@camanpour) June 8, 2018\n\nPresident Donald Trump extended his condolences to Bourdain's family on Friday morning. \"I enjoyed his show,\" Trump said. \"He was quite a character.\"\n\nFormer President Barack Obama recalled a mea l he shared with Bourdain in Vietnam while Obama was on a trip through Asia in 2016 -- an encounter captured in a \"Parts Unknown\" episode that year.\n\n\"'Low plastic stool, cheap but delicious noodles, cold Hanoi beer.' This is how I'll remember Tony,\" Obama posted to Twitter on Friday. \"He taught us about food -- but more importantly, about its ability to bring us together. To make us a little less afraid of the unknown. We'll miss him.\"\n\n\"Low plastic stool, cheap but delicious noodles, cold Hanoi beer.\" This is how I'll remember Tony. He taught us about food — but more importantly, about its ability to bring us together. To make us a little less afraid of the unknown. We'll miss him. pic.twitter.com/orEXIaEMZM — Barack Obama (@BarackObama) June 8, 2018\n\nFor the past year, Bourdain had been dating Italian actress Asia Argento. She remembered Bourdain as someone who \"gave all of himself in everything that he did.\"\n\nLast year, he advocated for Argento as she went public with accusations against disgraced Hollywood producer Harvey Weinstein. \"He was my love, my rock, my protector. I am beyond devastated.\"\n\nPhotos: Anthony Bourdain's life in pictures Photos: Anthony Bourdain's life in pictures Anthony Bourdain shoots an episode of his CNN show \"Parts Unknown\" in Salvador, Brazil, in 2014. Hide Caption 1 of 22 Photos: Anthony Bourdain's life in pictures A young Bourdain, right, takes a photo with his dad, Pierre, and his brother, Christopher, on New Jersey's Long Beach Island in 1970. Pierre Bourdain was a music executive with Columbia Records. His wife, Gladys, was an editor for The New York Times. Hide Caption 2 of 22 Photos: Anthony Bourdain's life in pictures Bourdain, left, is seen in the 1970s with fellow chefs in Provincetown, Massachusetts. He later went to culinary school before working at various restaurants in New York City. Hide Caption 3 of 22 Photos: Anthony Bourdain's life in pictures Bourdain poses for a portrait in his New York apartment in 1997. Three years later, he published his best-selling book \"Kitchen Confidential: Adventures in the Culinary Underbelly.\" Hide Caption 4 of 22 Photos: Anthony Bourdain's life in pictures Bourdain sits at his New York City restaurant Brasserie Les Halles in 2001. The Smithsonian once called Bourdain \"the original rock star\" of the culinary world. Hide Caption 5 of 22 Photos: Anthony Bourdain's life in pictures Bourdain poses in a Sydney kitchen in 2005. He got his first TV show in 2002 when he hosted \"A Cook's Tour\" on the Food Network. Hide Caption 6 of 22 Photos: Anthony Bourdain's life in pictures His breakout show, \"Anthony Bourdain: No Reservations,\" aired on the Travel Channel from 2005-2012. Bourdain would take viewers around the world to show how different cultures enjoy their food. Hide Caption 7 of 22 Photos: Anthony Bourdain's life in pictures Bourdain joins another celebrity chef, Gordon Ramsay, in the kitchen of \"The London,\" Ramsay's former restaurant in New York, in 2006. \"Stunned and saddened by the loss of Anthony Bourdain,\" Ramsay said on Friday. \"He brought the world into our homes and inspired so many people to explore cultures and cities through their food.\" Hide Caption 8 of 22 Photos: Anthony Bourdain's life in pictures Bourdain holds his daughter, Ariane, in 2008. Ariane was his only child. Hide Caption 9 of 22 Photos: Anthony Bourdain's life in pictures Bourdain and his second wife, Ottavia, get matching snake tattoos in South Beach, Florida, in 2011. The two divorced in 2016. Hide Caption 10 of 22 Photos: Anthony Bourdain's life in pictures Bourdain rides an all-terrain vehicle in Colombia while filming \"Parts Unknown.\" The CNN show premiered in 2013. Hide Caption 11 of 22 Photos: Anthony Bourdain's life in pictures Bourdain was also one of the judges on the reality show \"The Taste,\" a cooking competition that ran from 2013-2015. Hide Caption 12 of 22 Photos: Anthony Bourdain's life in pictures Bourdain enjoys a bite of food while on location in Vietnam. While accepting a Peabody Award for \"Parts Unknown\" in 2013, Bourdain said: \"We ask very simple questions: What makes you happy? What do you eat? What do you like to cook? And everywhere in the world we go and ask these very simple questions. We tend to get some really astonishing answers.\" Hide Caption 13 of 22 Photos: Anthony Bourdain's life in pictures Bourdain visits the Serengeti plain in Tanzania in 2014. Hide Caption 14 of 22 Photos: Anthony Bourdain's life in pictures Bourdain accepts an Emmy Award for \"Parts Unknown\" in 2014. Hide Caption 15 of 22 Photos: Anthony Bourdain's life in pictures Bourdain films in Beirut, Lebanon, in 2015. Hide Caption 16 of 22 Photos: Anthony Bourdain's life in pictures Bourdain and chef Eric Ripert have lunch in Marseille, France, in 2015. Ripert was the person who found Bourdain unresponsive in his hotel room in 2018. Hide Caption 17 of 22 Photos: Anthony Bourdain's life in pictures Bourdain enjoys a \"hangover cure\" breakfast that chef Nigella Lawson made for him at her home in London in 2016. Hide Caption 18 of 22 Photos: Anthony Bourdain's life in pictures Bourdain sits down with US President Barack Obama during a \"Parts Unknown\" episode in Hanoi, Vietnam, in 2016. Over a dish of bun cha, Obama shared personal stories and reflected on his own international travels. Hide Caption 19 of 22 Photos: Anthony Bourdain's life in pictures Bourdain sits down for lunch with Hausa people in Lagos, Nigeria, in 2017. \"People open up to him and, in doing so, often reveal more about their hometowns or homelands than a traditional reporter could hope to document,\" said judges for the Peabody Award, who honored Bourdain in 2013. Hide Caption 20 of 22 Photos: Anthony Bourdain's life in pictures While appearing on \"The Tonight Show\" with Jimmy Fallon in 2017, Bourdain plays a \"Secret Ingredient\" game with Fallon and actress Sienna Miller. Hide Caption 21 of 22 Photos: Anthony Bourdain's life in pictures Bourdain rides a train in Sri Lanka in 2017. Tributes poured in from all over the world after his death. \"Tony Bourdain made the world a smarter, better place, and nobody will forget him,\" tweeted \"Chopped\" host Ted Allen. Hide Caption 22 of 22\n\nBourdain's death came days after fashion designer Kate Spade died in a suicide at her Manhattan apartment.\n\nSuicide is a growing problem in the United States. The US Centers for Disease Control and Prevention published a survey Thursday showing suicide rates increased by 25% across the country over nearly two decades ending in 2016. Twenty-five states experienced a rise in suicides by more than 30%, the government report finds.\n\n'The Elvis of bad boy chefs'\n\nBourdain was a master of his crafts -- first in the kitchen and then in the media. Through his TV shows and books , he helped audiences think differently about food, travel and themselves. He advocated for marginalized populations and campaigned for safer working conditions for restaurant staffs.\n\nAlong the way, he received practically every award the industry has to offer.\n\nIn 2013, Peabody Award judges honored Bourdain and \"Parts Unknown\" for \"expanding our palates and horizons in equal measure.\"\n\n\"He's irreverent, honest, curious, never condescending, never obsequious,\" the judges said. \"People open up to him and, in doing so, often reveal more about their hometowns or homelands than a traditional reporter could hope to document.\"\n\nThe Smithsonian once called him \"the original rock star\" of the culinary world, \"the Elvis of bad boy chefs.\" His shows took him to more than 100 countries and three networks.\n\nWhile accepting the Peabody award in 2013, Bourdain described how he approached his work.\n\n\"We ask very simple questions: What makes you happy? What do you eat? What do you like to cook? And everywhere in the world we go and ask these very simple questions,\" he said. \"We tend to get some really astonishing answers.\"\n\nFriends and acquaintances remembered Bourdain's curiosity for the world's variety of cultures and cuisine rubbing off on them.\n\nHis good friend Michael Ruhlman said he was stunned by news of the suicide.\n\n\"The last I knew, he was in love. He was happy,\" Ruhlman told CNN's \"Anderson Cooper 360.\" \"He said, 'Love abounds' -- some of the last words he said to me.\"\n\nRuhlman said Bourdain was much more sensitive than people realized, but that sensitivity coupled with Bourdain's bravado made him a great storyteller.\n\nRuhlman and chef James Syhabout both said that when people found out they knew Bourdain, they would ask what he really was like.\n\nExactly like he was on camera, they said.\n\n\"And that's the beauty of him,\" Syhabout told CNN's \"Erin Burnett OutFront.\" \"He's unapologetically honest. ... It all gives us courage to be ourselves and be individuals and that's what really radiates from him.\"\n\nChef and writer Edward Lee, who hosted a season of a show produced by Bourdain, looked back at their time working together and wrote that \"Tony gave us a world that we didn't know we needed.\"\n\nOthers who fondly recalled their interactions with Bourdain included chef Gordon Ramsay, who said Bourdain \"brought the world into our homes and inspired so many people to explore cultures and cities through their food.\"\n\nFrom 'happy dishwasher' to addiction to fame\n\nBourdain grew up in Leonia, New Jersey, and started working in kitchens in his teens -- including on Massachusetts' Cape Cod during the summer.\n\n\"I was a happy dishwasher,\" he said in a 2016 interview on NPR's \"Fresh Air.\" \"I jokingly say that I learned every important lesson, all the most important lessons of my life, as a dishwasher.\"\n\nIt was during those early jobs, he said, that he began using drugs, eventually developing a heroin addiction and other problems that he later said should have killed him in his 20s. He often talked of his addiction later in life.\n\n\"Somebody who wakes up in the morning and their first order of business is (to) get heroin -- I know what that's like,\" Bourdain said in a 2014 \"Parts Unknown\" episode highlighting an opioid crisis in Massachusetts.\n\nAfter spending two years at New York's Vassar College, he dropped out and enrolled in culinary school. He spent years as a line cook and sous chef at restaurants in the Northeast before becoming executive chef at Manhattan's Brasserie Les Halles.\n\nA different passion -- his writing -- helped put him on the map by his early 40s.\n\n\"In America, the professional kitchen is the last refuge of the misfit. It's a place for people with bad pasts to find a new family,\" he wrote.\n\nJUST WATCHED Anthony Bourdain on pushing boundaries Replay More Videos ... MUST WATCH Anthony Bourdain on pushing boundaries 00:36\n\nThe article morphed into a best-selling book in 2000, \"Kitchen Confidential: Adventures in the Culinary Underbelly,\" which was translated into more than two dozen languages.\n\n\"When the book came out, it very quickly transformed my life -- I mean, changed everything,\" he told NPR.\n\nBourdain found himself on a path to international stardom. First, he hosted \"A Cook's Tour\" on the Food Network, then moved to the Travel Channel with \"Anthony Bourdain: No Reservations,\" a breakout hit that earned two Emmy Awards and more than a dozen nominations.\n\nIn 2013, both Bourdain and CNN took a risk by bringing him to a network still best known for breaking news and headlines. Bourdain quickly became one of its principal faces and a linchpin of its prime-time schedule.\n\nSeason 11 of \"Parts Unknown\" premiered last month on CNN, with destinations including Uruguay, Armenia and West Virginia. The series has been honored with five Emmys.\n\nJUST WATCHED The 'insanely good' food of Hong Kong Replay More Videos ... MUST WATCH The 'insanely good' food of Hong Kong 01:09\n\nIn his final weeks, Bourdain said he was especially looking forward to an episode about Hong Kong, which aired Sunday.\n\nHe called it a \"dream show\" in which he linked up with longtime Hong Kong resident and cinematographer Christopher Doyle.\n\n\"The idea was just to interview him and maybe get him to hold a camera. He ended up being director of photography for the entire episode,\" Bourdain told CNN in April. \"For me it was like asking Joe DiMaggio to, you know, sign my baseball and instead he joined my Little League team for the whole season.\"\n\nThe show's website on Friday posted an homage to Bourdain featuring one of his many oft-repeated quotations -- one that seemed to embody his philosophy: \"If I'm an advocate for anything, it's to move. As far as you can, as much as you can. Across the ocean, or simply across the river. Walk in someone else's shoes or at least eat their food.\"\n\n--", "images": ["https://cdn.cnn.com/cnnnext/dam/assets/180608151235-02-bourdain-unfurled-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608151806-06-bourdain-unfurled-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608124842-21-bourdain-unfurled-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608110443-18-bourdain-unfurled-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608151925-07-bourdain-unfurled-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608151458-03-bourdain-unfurled-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608104552-13-bourdain-unfurled-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608103749-12-bourdain-unfurled-large-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608105059-14-bourdain-unfurled-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608110138-17-bourdain-unfurled-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608151925-07-bourdain-unfurled-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/160914120051-bourdain-looking-at-camera-with-plate-of-food-large-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608153849-22-bourdain-unfurled-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608105339-15-bourdain-unfurled-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608105734-16-bourdain-unfurled-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608111210-20-bourdain-unfurled-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608152835-10-bourdain-unfurled-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608152032-08-bourdain-unfurled-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608125526-01-anthony-bourdain-gordon-ramsay-file-restricted-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/150414121932-bourdain-beirut-large-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608125526-01-anthony-bourdain-gordon-ramsay-file-restricted-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608111210-20-bourdain-unfurled-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608095620-01-bourdain-unfurled-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608091639-anthony-bourdain-new-york-exlarge-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608110138-17-bourdain-unfurled-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608151536-04-bourdain-unfurled-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608152835-10-bourdain-unfurled-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608102240-11-bourdain-unfurled-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608152032-08-bourdain-unfurled-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608111047-19-bourdain-unfurled-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180529164740-bourdain-hk-pic-2-large-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608110443-18-bourdain-unfurled-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608152143-09-bourdain-unfurled-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608081729-anthony-bourdain-parts-unknown-brazil-large-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608104552-13-bourdain-unfurled-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608103749-12-bourdain-unfurled-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608151235-02-bourdain-unfurled-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608151458-03-bourdain-unfurled-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608153849-22-bourdain-unfurled-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170905122613-anthony-bourdain-parts-unknown-trinidad-large-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608152143-09-bourdain-unfurled-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608105734-16-bourdain-unfurled-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608102240-11-bourdain-unfurled-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608095620-01-bourdain-unfurled-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608115711-anthony-bourdain-parts-unknown-pushing-boundaries-orig-nws-00001019-large-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608124842-21-bourdain-unfurled-small-11.jpg", "data:image/gif;base64,R0lGODlhEAAJAJEAAAAAAP///////wAAACH5BAEAAAIALAAAAAAQAAkAAAIKlI+py+0Po5yUFQA7", "https://cdn.cnn.com/cnnnext/dam/assets/180608151536-04-bourdain-unfurled-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608084542-02-parts-unknown-bourdain-beirut-super-tease.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180424172245-01-depression-stock-large-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608105339-15-bourdain-unfurled-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608111047-19-bourdain-unfurled-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608151806-06-bourdain-unfurled-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608105059-14-bourdain-unfurled-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180608103749-12-bourdain-unfurled-small-11.jpg"], "top_img": "https://cdn.cnn.com/cnnnext/dam/assets/180608084542-02-parts-unknown-bourdain-beirut-super-tease.jpg", "keywords": [], "authors": ["Brian Stelter"], "canonical_link": "https://www.cnn.com/2018/06/08/us/anthony-bourdain-obit/index.html", "title": "CNN's Anthony Bourdain dead at 61", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0", "section": "us", "referrer": "unsafe-url", "og": {"pubdate": "2018-06-08T11:20:13Z", "url": "https://www.cnn.com/2018/06/08/us/anthony-bourdain-obit/index.html", "title": "CNN's Anthony Bourdain dead at 61", "description": "Anthony Bourdain, the gifted chef, storyteller and writer who took TV viewers around the world to explore culture, cuisine and the human condition for nearly two decades, has died. He was 61.", "site_name": "CNN", "type": "article", "image": {"identifier": "https://cdn.cnn.com/cnnnext/dam/assets/180608084542-02-parts-unknown-bourdain-beirut-super-tease.jpg", "width": 1100, "height": 619}}, "pubdate": "2018-06-08T11:20:13Z", "lastmod": "2018-06-09T00:49:41Z", "author": "Brian Stelter, CNN", "article": {"author": "https://www.facebook.com/brianstelter"}, "twitter": {"title": "CNN's Anthony Bourdain dead at 61", "description": "Anthony Bourdain, the gifted chef, storyteller and writer who took TV viewers around the world to explore culture, cuisine and the human condition for nearly two decades, has died. He was 61.", "card": "summary_large_image", "image": "https://cdn.cnn.com/cnnnext/dam/assets/180608084542-02-parts-unknown-bourdain-beirut-super-tease.jpg"}, "description": "Anthony Bourdain, the gifted chef, storyteller and writer who took TV viewers around the world to explore culture, cuisine and the human condition for nearly two decades, has died. He was 61.", "keywords": "us, CNN's Anthony Bourdain dead at 61 - CNN", "thumbnail": "https://cdn.cnn.com/cnnnext/dam/assets/180608084542-02-parts-unknown-bourdain-beirut-super-tease.jpg", "vr": {"canonical": "https://www.cnn.com/2018/06/08/us/anthony-bourdain-obit/index.html"}, "fb": {"app_id": 80401312489, "pages": "5550296508,18793419640"}, "template-top": "us,news,art-vid"}, "movies": [], "publish_date": 1528430400.0, "source": "https://www.cnn.com", "summary": ""}