{"url": "https://www.tvinsider.com/659459/riverdale-gossip-girl-similarities/", "text": "When Riverdale premiered in spring 2017, it quickly drew comparisons to Gossip Girl, its big city-set predecessor and fellow CW hit.\n\nThe newer show's small town teens may be more concerned with solving crimes than spending their way through Manhattan, but both are glossy soaps with big cultural followings, and as Riverdale's pressed on, the connections have only deepened.\n\nBelow, see just how much the breakout dramas have in common.\n\n1. Betty & Veronica Mirror Serena & Blair\n\n\n\nBetty (Lili Reinhart) and Veronica (Camila Mendes)'s friendship might not have the same baked-in rivalry, but it nonetheless bears close resemblance to Serena (Blake Lively) and Blair (Leighton Meester)'s yin-yang bond.\n\nBlair and Veronica are both mouthy, well-to-do brunettes with a knack for scheming. Betty and Serena are untethered blondes nursing some darker impulses—Serena with her struggles with drugs and alcohol, and Betty with... well, whatever is going on with Betty. She might be taking a little longer to fall into a full Serena spiral, but we've already begun to see her prudence wane: remember that Serpent striptease?\n\n2. There's a Distinct Upstairs, Downstairs Culture\n\nThe battle between the Northside and Southside is a good stand-in for the divide between Blair's Upper East Side kingdom and Dan's Brooklyn sanctuary.\n\n3. Cheryl Parallels Georgina\n\nIt might initially be tempting to liken Cheryl (Madelaine Petsch) to Blair, but she most closely parallels Georgina (Michelle Trachtenberg). They're both supporting characters whose main function is to stir the pot. Plus, both serve as foils for the series' brunette leads (Veronica and Blair, respectively).\n\n4. Dan and Jughead Are Essentially the Same Character\n\nTwo outsiders quietly chronicling the salacious details of their towns? Sure, Jughead (Cole Sprouse)'s novel may not be the spectacle that is Gossip Girl's blog, but the connection stands.\n\n5. Archie and Nate Are Also Pretty Darn Close\n\n\n\nArchie (K.J. Apa) and Nate (Chace Crawford) are both slightly naive, but they're still stand-up guys trying to do the right thing while navigating various romantic entanglements. In fact, they're literally both called 'Archibald,' and end up in love triangles between their series' main female characters (Veronica and Betty, Serena and Blair).\n\n6. And While We're at It, so Are Nick and Chuck\n\n\n\nLet's not forget that Chuck (Ed Westwick) also started off as a pretty deplorable rich dude who tried to take advantage of women at parties—in his case, Jenny Humphrey (Taylor Momsen). In Nick (Graham Phillips)'s case, it was Veronica and Cheryl.\n\n7. And Eric and Kevin...\n\nTwo white, gay men who are just kind of there. Eric (Connor Paolo) is Serena's brother, and Kevin (Casey Cott) is Betty's best friend.\n\n8. Plus, There's an Incest Storyline\n\n\n\nPolly (Tiera Skovbye) and Jason (Trevor Stines) start up a passionate romance on Riverdale, only for Polly to later discover they're actually third cousins. On Gossip Girl, Dan eventually marries Serena, his one-time step sister with whom he shares a half brother.\n\n9. And Let's Not Even Get Started on the Parents\n\n\n\nMuch like Nate's dad, Howard (Sam Robards), Hiram (Mark Consuelos) is a once-successful businessman sent to prison for his criminal dealings. Meanwhile, high school sweethearts Hermione (Marisol Nichols) and Fred (Luke Perry) are fighting some still lingering feelings just as their kids are falling in love. Rufus (Matthew Settle) and Lily (Kelly Rutherford), anyone?\n\nSo, there you have it. Riverdale is basically a suburban Gossip Girl dressed up with some neo-noir mystery. XOXO.\n\nRiverdale, Wednesdays, 8/7c, The CW", "images": ["https://www.tvinsider.com/wp-content/uploads/2018/01/tumblr_inline_oxezqhXsIe1t25mpb_400.gif", "https://www.tvinsider.com/wp-content/uploads/2017/01/partner4.png", "https://googleads.g.doubleclick.net/pagead/viewthroughconversion/946102885/?value=1.00&currency_code=USD&label=fOb8CPqJwGYQ5cSRwwM&guid=ON&script=0", "https://www.tvinsider.com/wp-content/uploads/2017/02/logo-tvinsider.png", "https://www.tvinsider.com/wp-content/uploads/2017/01/partner3.png", "https://pixel.quantserve.com/pixel/p-sRxQ0qKU4hQu4.gif", "http://b.scorecardresearch.com/p?c1=2&c2=19587797&cv=2.0&cj=1", "https://www.tvinsider.com/wp-content/uploads/2017/10/RVD202b_0107b-1014x570.jpg", "https://www.tvinsider.com/wp-content/uploads/2017/08/OnDISH_Mini-Logo.png", "https://www.tvinsider.com/wp-content/uploads/2017/01/partner6.png", "https://www.tvinsider.com/wp-content/uploads/2017/01/logo-footer.png", "https://ad.doubleclick.net/ddm/activity/src=9413168;type=invmedia;cat=retar0;dc_lat=;dc_rdid=;tag_for_child_directed_treatment=;tfua=;npa=;ord=1;num=1", "https://www.tvinsider.com/wp-content/uploads/2018/01/riverdale-gossip-girl-2-1014x570.jpg", "https://www.tvinsider.com/wp-content/uploads/2017/01/partner1-38x32.png", "https://www.tvinsider.com/wp-content/uploads/2017/01/partner2.png", "https://www.tvinsider.com/wp-content/uploads/2017/01/logo-white.png"], "top_img": "https://www.tvinsider.com/wp-content/uploads/2018/01/riverdale-gossip-girl-2-1014x570.jpg", "keywords": [], "authors": ["Dana Getz"], "canonical_link": "https://www.tvinsider.com/659459/riverdale-gossip-girl-similarities/", "title": "9 Ways 'Riverdale' and 'Gossip Girl' Are Essentially the Same Show", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "google-site-verification": "it2r-MRipevefeCYWkPlW540pNwHDj9JpbST3-LAA-o", "fb": {"pages": 112199118797264, "app_id": 2128917200700396}, "og": {"site_name": "TV Insider", "description": "Betty and Veronica are the new Serena and Blair.", "url": "https://www.tvinsider.com/659459/riverdale-gossip-girl-similarities/", "title": "9 Ways 'Riverdale' and 'Gossip Girl' Are Essentially the Same Show", "type": "article", "image": {"identifier": "https://www.tvinsider.com/wp-content/uploads/2018/01/riverdale-gossip-girl-2-1014x570.jpg", "width": 1014, "height": 570}}, "title": "9 Ways 'Riverdale' and 'Gossip Girl' Are Essentially the Same Show", "description": "Betty and Veronica are the new Serena and Blair.", "twitter": {"site": "@tvinsider", "url": "https://www.tvinsider.com/659459/riverdale-gossip-girl-similarities/", "title": "9 Ways 'Riverdale' and 'Gossip Girl' Are Essentially the Same Show", "creator": "@tvinsider", "description": "Betty and Veronica are the new Serena and Blair.", "image": "https://www.tvinsider.com/wp-content/uploads/2018/01/riverdale-gossip-girl-2-1014x570.jpg?230", "card": "summary_large_image"}}, "movies": [], "publish_date": null, "source": "https://www.tvinsider.com", "summary": ""}