{"url": "https://www.harpersbazaar.com/celebrity/latest/a19703814/who-is-kate-hudson-boyfriend-danny-fujikawa/", "text": "Kate Hudson announced Wednesday she and her boyfriend, Danny Fujikawa, welcomed their first child together, a daughter named Rani Rose Hudson Fujikawa, on October 2. \"We have decided to name our daughter Rani (pronounced Ronnie) after her grandfather, Ron Fujikawa,\" she wrote on Instagram. \"Ron was the most special man who we all miss dearly. To name her after him is an honor.\"\n\n\"Everyone is doing well and happy as can be,\" she added. \"Our family thanks you for all the love and blessings that have been sent our way and we send ours right back.\"\n\nBack in April, Hudson announced she and Fujikawa were having a baby with an Instagram video of their exciting gender reveal party.\n\n\"My kids, Danny, myself and the entire family are crazy excited!,\" Hudson captioned the post, adding that they have \"a little girl on the way.\"\n\nHudson has two children, Ryder Russell Robinson, 14, and Bingham Hawn Bellamy, 6, from two previous relationships with Chris Robinson and Matt Bellamy, respectively. She and Fujikawa began dating a little over a year ago, and this will be the couple's first child together.\n\nHere is everything you need to know about the first-time dad.\n\nHe and Hudson have known each other for over a decade.\n\nCharley Gallay Getty Images\n\nAlthough Fujikawa and Hudson just made their red carpet debut as an official couple last May, the pair has actually known each other for 15 years. Hudson told The Talk hosts that she first met Fujikawa through her best friends, Sara and Erin Foster.\n\n\n\n“We’ve known each other for 15 years. He’s my best friend’s stepbrother,” she said. “We kinda skipped through the part of knowing what the hiccups were. You kinda skip the part of going, ‘Oh, you’re like that?'”\n\n\n\n“In terms of family, I’ve known his family forever,” she added. “To have that connection is really powerful.”\n\n\n\nHe's a musician.\n\nGetty Images\n\nIt's safe to say Hudson has a thing for rockers, after previously being with The Black Crowes' Chris Robinson and Muse's Matthew Bellamy. Fujikawa is the former lead singer and guitarist for the LA-based folk rock band Chief, which he co-founded with his brother Michael. The group is now disbanded, but still remain friendly. Fujikawa posted a photo with his former bandmates on Instagram on April 30, which prompted many fans to wonder whether Chief was getting back together.\n\n\n\nHe founded his own record company.\n\nFujikawa founded Lightwave Records in Los Angeles in 2013, according to his LinkedIn profile.\n\nHe went to NYU.\n\nGetty Images\n\nFujikawa's LinkedIn profile also states that he went to New York University starting in 2004 where he studied music. However, he did not graduate, and dropped out in 2005. His activities while attending the school consisted of \"bartending at Lit lounge, lots of walking, and not going to school.\"\n\nHe has two brothers.\n\nTheir names are Michael and Brady, and they were all raised in Los Angeles. Fujikawa shared the adorable throwback above for one of his brothers' birthdays.\n\nHe is part Japanese.\n\nA discussion on Reddit last year claimed that Hudson's new beau has Japanese roots. The musician has also alluded to his Asian heritage on social media. On July 10, Fujikawa shared an Instagram photo of an Akira video game with the caption, \"I'm a glass is half Japanese kind of guy.\" And back in 2012, he shared a vintage photo of his \"Ojisan and obachan,\" grandfather and grandmother in Japanese.\n\n", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-kate-hudson-danny-fukikawa-index1-1538600555.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-kate-hudson-danny-fukikawa-index1-1538600555.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "keywords": [], "authors": ["Eileen Reslen"], "canonical_link": "https://www.harpersbazaar.com/celebrity/latest/a19703814/who-is-kate-hudson-boyfriend-danny-fujikawa/", "title": "Everything You Need to Know About Kate Hudson's Boyfriend Danny Fujikawa", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#606060", "og": {"type": "article", "site_name": "Harper's BAZAAR", "title": "Everything You Need to Know About Kate Hudson's Boyfriend Danny Fujikawa", "description": "Get to know the new dad.", "url": "https://www.harpersbazaar.com/celebrity/latest/a19703814/who-is-kate-hudson-boyfriend-danny-fujikawa/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-kate-hudson-danny-fukikawa-index1-1538600555.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 227018747326504, "pages": 8327967561}, "article": {"publisher": "https://www.facebook.com/HarpersBazaar", "modified_time": "2018-10-12 02:10:37", "published_time": "2018-10-03 08:50:00", "section": "Celebrity News"}, "twitter": {"site": "@harpersbazaarus", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-kate-hudson-danny-fukikawa-index1-1538600555.jpg?crop=1.00xw:1.00xh;0,0&resize=640:*"}, "google-site-verification": "bNUXKPTEqUVDbaxHrYA-c1kj007Ao4VsMKdoU80EyiU", "title": "Who Is Danny Fujikawa? - Meet Kate Hudson's Boyfriend and Third Child's Father", "description": "Danny Fujikawa is dating Kate Hudson and the couple just had their first child together. Here is everything you need to know about the new father.", "keywords": "Danny Fujikawa, Kate Hudson, Kate Hudson pregnant, Kate Hudson boyfriend, Kate Hudson baby daddy, who is the father of Kate Hudson's child, Kate Hudson father of baby, kate hudson and danny fujikawa, who is Danny Fujikawa", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-kate-hudson-danny-fukikawa-index1-1538600555.jpg?crop=0.502xw:1.00xh;0.250xw,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebrity,celebrity,latest", "sailthru.date": "2018-10-03T20:50:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-kate-hudson-danny-fukikawa-index1-1538600555.jpg?crop=1.00xw:1.00xh;0,0", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-kate-hudson-danny-fukikawa-index1-1538600555.jpg?crop=0.502xw:1.00xh;0.250xw,0", "sailthru.socialtitle": "Everything You Need to Know About Kate Hudson's Boyfriend Danny Fujikawa", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1538571000.0, "source": "https://www.harpersbazaar.com", "summary": ""}