{"url": "https://screenrant.com/star-wars-last-jedi-images-rey-kylo-ren/", "text": "267 Shares Share Tweet Email Copy Link Copied\n\nThe latest batch of Star Wars: The Last Jedi images seemingly show Kylo Ren bringing Rey to Supreme Leader Snoke, among other scenes from the film. With just over three weeks until Episode VIII premieres (as of this writing), Lucasfilm has made sure to crank their marketing efforts up to 11, as a flurry of advertising materials have made their way online recently. Though the studio has done an excellent job keeping the twists and turns of the story under lock and key, new TV spots and posters have given fans plenty to talk about.\n\nStar Wars 8 promotional has essentially been a year-round event. Earlier in 2017, various publications (including EW) posted their own extensive spreads about the movie, revealing new photos and details. As we quickly approach December, EW is at it again, and they've got some fresh pictures to check out as anticipation for The Last Jedi reaches a fever pitch.\n\nToday, the magazine started their rollout of their (presumably) final push of coverage before the movie comes out. First up is a gallery of some exclusive stills, some of which are scenes from previously released trailers and TV spots. However, a number of these are new. See them for yourself in the space below:\n\n[vn_gallery name=\"Star Wars: The Last Jedi EW December 2017 Images\" id=\"1117722\"]\n\nBy far, the most tantalizing of these is the one set in what appears to be Snoke's elaborate throne room, with Kylo Ren lingering in the background as Rey stands in focus in closeup. This could very well be from the scene from the full trailer, in which the young scavenger is being tortured by the Supreme Leader. Daisy Ridley has stated Rey's encounter with Snoke is a test of sorts for Rey, so the context of this sequence will be fascinating to see. Rey has a look of determination on her face as she stares down evil, but it's difficult to tell if she is there under her own will or was captured. Remember, Lucasfilm is teasing the possibility Rey turns to Kylo for guidance, so this could be part of that evolving dynamic. Where Luke Skywalker is during all this is a mystery.\n\nOther standouts from the images include Luke watching over Rey's lightsaber training from afar on Ahch-To and a shot of Finn, Rose Tico, and BB-8 in the Canto Bight casino while on their mission. Though the lovable droid is Poe's companion, BB-8 has been through a lot with Finn, as seen in The Force Awakens. The two have their own history together, and it should be fun to watch them in action again. Perhaps BB-8, who is the Buster Keaton of Star Wars, will do something to top his hilarious thumbs up. The Last Jedi is going to be more serious and darker, but levity will be ever present in its 150-minute runtime.\n\nSource: EW\n\nOriginal Power Rangers Star Teasing New Project, Trailer Released [Updated]", "images": ["https://screenrant.com/public/build/images/tg-logo-full-white.fc9e742a.svg", "https://static0.srcdn.com/wordpress/wp-content/uploads/2017/11/Rey-and-Kylo-Ren-In-Snokes-Throne-Room.jpg", "https://screenrant.com/public/build/images/sr-logo-full-white.b0cc2b44.svg", "https://q.quora.com/_/ad/91f52889f6a04390a65ad2591c59986e/pixel?tag=ViewContent&noscript=1", "https://screenrant.com/public/build/images/th-logo-full-white.7684e614.svg", "https://screenrant.com/public/build/images/hc-logo-full-white.5f66cfe4.svg", "https://screenrant.com/public/build/images/tr-logo-full-white.090c581a.svg", "https://screenrant.com/public/build/images/mm-logo-full-white.fe72c74c.svg", "https://screenrant.com/public/build/images/tv-logo-full-white.642d3d01.svg", "https://screenrant.com/public/build/images/tt-logo-full-white.04a6f0d4.svg", "https://screenrant.com/public/build/images/cb-logo-full-white.afca2e29.svg", "https://screenrant.com/public/build/images/bg-logo-full-white.8242bbb9.svg", "https://screenrant.com/public/build/images/tq-logo-full-white.7436bde3.svg", "https://www.facebook.com/tr?id=297467373958238&ev=PageView&noscript=1", "https://screenrant.com/public/build/images/ts-logo-full-white.54beb4cf.svg", "http://b.scorecardresearch.com/p?c1=2&c2=21868715&cv=2.0&cj=1"], "top_img": "https://static0.srcdn.com/wordpress/wp-content/uploads/2017/11/Rey-and-Kylo-Ren-In-Snokes-Throne-Room.jpg", "keywords": [], "authors": ["Ana Dumaraog", "Eric Trigg", "Mike Jones", "Michael Kennedy"], "canonical_link": "https://screenrant.com/star-wars-last-jedi-images-rey-kylo-ren/", "title": "New Last Jedi Images Show Rey With Kylo Ren", "meta_data": {"viewport": "user-scalable=yes, initial-scale=1.0, width=device-width", "description": "The latest wave of Star Wars: The Last Jedi images show Rey with Kylo Ren in Snoke's throne room and a taste of Canto Bight.", "og": {"title": "New Last Jedi Images Show Rey With Kylo Ren", "type": "article", "image": {"identifier": "https://static0.srcdn.com/wordpress/wp-content/uploads/2017/11/Rey-and-Kylo-Ren-In-Snokes-Throne-Room.jpg", "width": 2679, "height": 1340}, "url": "https://screenrant.com/star-wars-last-jedi-images-rey-kylo-ren/", "locale": "en_US", "description": "Are Rey and Kylo really teaming up?", "site_name": "ScreenRant"}, "article": {"published_time": "2017-11-19T09:11:18Z", "section": "Movie News"}, "fb": {"app_id": 822150531210883, "pages": 10765693196}}, "movies": [], "publish_date": 1511082678.0, "source": "https://screenrant.com", "summary": ""}