{"url": "www.brainstain.co.uk/2017/12/13/mike-tyson-hillary-clinton-americas-prolific-serial-killer/", "text": "Mike Tyson is currently testing out his one man live show in Las Vegas called Undisputed Truth 2 to small crowds, since Las Vegas is apparently pretty quiet right now. It doesn’t have anything to do with Tyson, but it may have something to do with that horrendous mass shooting at the Mandalay Bay earlier this year, which has seemingly gone through a massive media cover up, with no CCTV footage being released, along with the other major inconsistencies in the story. As a result, people just aren’t going to Las Vegas so much anymore. Anyway, moving back onto the story at hand.\n\nDuring Mike Tyson’s stand up performance, he said something which many people believe to be alarmingly true: “Hillary is America’s most prolific serial killer – bar none.”\n\nTyson continued: “Manson family ain’t nothing compared to the Clinton family. Ted Bundy? John Wayne Gacy? Please… that’s kiddie stuff.” pointing out that the Manson family had killed five people, and that Ted Bundy and John Wayne Gacy had killed 35 and 33 people respectively in their sickening killing sprees. Apparently this is a number that pales in comparison to the body count created by Hillary Clinton and the Clinton Foundation.\n\n“She murdered her very good friend Mr. Vince Foster. She deliberately on purpose let Ambassador Chris Stevens and three other Americans die in Benghazi. Do you know how many of her personal bodyguards have died deaths of a premature nature?”\n\n“Twelve. Twelve young men in close proximity to the Clinton’s have died premature. This information is all out there. You can look this up yourself. All of these bodyguards are indeed dead and it might all just be a tragic coincidence. Now I don’t know about you but I wouldn’t want to be on their list of associates.”\n\nMike Tyson encouraged members of the audience to Google the Clinton body count, with the term “strange deaths surrounding the Clinton’s” and see what they could find. Tyson elaborated further in his set, “People in a hundred years from now going to look back at us and scratch their heads saying ‘Uhh really guys? Really? You couldn’t see what was right before your eyes?'”\n\nIndeed, Mike Tyson is pointing out the obvious right now (which really needs to be heard), and with any luck, perhaps this Clinton bit is going to be part of his Undisputed Truth 2 tour, which will continue in Honolulu on January 20th, 2018.\n\n“How many more witnesses do we need to commit suicide by two bullets to the back of the head just before they about to testify against the Clinton’s before we start to say ‘Hey, something here sure smells fishy?'”\n\nMike Tyson lamented that for power and for hushing up anyone in her way, Hillary Clinton has been able to carry on her killing spree unchallenged, which by his account, that definitely makes her America’s most prolific serial killer. One day, hopefully there will be crime investigation documentaries and National Geographic films about the many mysterious deaths engulfing the Clinton family, because it’s clear that she’s getting away with murder.\n\nTyson finalised on this point: “Sad but true thing is we will never get justice for her. We the people will never see justice served. She’s above the law of the land.”\n\nThis is why people love Mike Tyson, aside from him being the most prolific knock out artist that the world has even seen in the sport of boxing. In case it wasn’t clear enough, he also supports Donald Trump, which is a greatly logical thing to do in these seriously crazy times. In saying that, Mike Tyson did leave a lot of names out of the Clinton serial killing spree, but with a bit of research, we are sure you’ll find some further suspicious links yourself. As we all know, DNC staffer Seth Rich was shot in the back outside a bar, and John F. Kennedy Jr’s suspicious plane crash death could possibly also be added to that list.\n\nThat brings us to this most recent and mysterious suicide case. It’s claimed that a prominent surgeon from New York, Dr. Dean Lorich, killed himself by stabbing himself in the chest, although missing his own heart in the process. That alone would make some people suspicious. What’s more revealing is that Dr. Dean Lorich had an association with the Clinton Foundation down in Haiti.\n\nDon’t believe us? Just look into this new story a bit further, then tell us how this isn’t another suspicious suicide from someone associated with the Clinton’s. Read the recent Dr. Dean Lorich story here for more information about his link to the Clinton Foundation down in Haiti. Maybe the Clinton’s just have that lethal depressive effect on people?\n\nBrainstain, over and out!\n\n<Story by The Narrator>\n\nFeatured Photo Credit: YouTube", "images": ["https://www.brainstain.us/wp-content/uploads/2017/04/crop80-50x50.png", "https://www.brainstain.us/wp-content/uploads/2019/07/TMZ1-min-50x50.jpg", "https://secure.gravatar.com/avatar/2c74decb34d15a58992eedd4961aafe9?s=50&d=mm&r=g", "https://thenypost.files.wordpress.com/2017/12/080108motorcycles7db.jpg?quality=90&strip=all", "https://www.brainstain.us/wp-content/uploads/2019/07/Epstein-50x50.png", "https://secure.gravatar.com/avatar/07b628102baa57f45117abf7aee40d61?s=50&d=mm&r=g", "https://secure.gravatar.com/avatar/424799d57a88c6a7843a326902658e3a?s=50&d=mm&r=g", "https://secure.gravatar.com/avatar/1dead20e7b1f933ceaf64bb45a06e755?s=50&d=mm&r=g", "https://secure.gravatar.com/avatar/7de0437357d86acafd2d4f78e6bba059?s=50&d=mm&r=g", "https://www.brainstain.us/wp-content/uploads/2019/07/qvoicenews-min-50x50.jpg", "https://secure.gravatar.com/avatar/cd948e26bce039158bcccf046e8dd0ad?s=50&d=mm&r=g", "https://secure.gravatar.com/avatar/aca35dd1f90579d45f9e0824ef855572?s=50&d=mm&r=g", "https://www.brainstain.us/wp-content/uploads/2019/02/Pitchfork1-50x50.jpg", "https://secure.gravatar.com/avatar/44ac8a9a43a59b1ec58d9536299472ac?s=50&d=mm&r=g", "https://secure.gravatar.com/avatar/12246af99b58c51e31ba373feb9f9197?s=50&d=mm&r=g", "https://secure.gravatar.com/avatar/afadf6d24d926ced3ab32a56e110e61d?s=50&d=mm&r=g", "https://secure.gravatar.com/avatar/eae74bc15767c558fa55d5a5e4145f4b?s=50&d=mm&r=g", "https://www.brainstain.us/wp-content/uploads/2019/03/Entertainment-News-by-Brainstain-1.jpg", "https://www.brainstain.us/wp-content/uploads/2017/04/crop54-50x50.png", "https://i.ytimg.com/vi/VRHcR4Jhb10/maxresdefault.jpg", "https://secure.gravatar.com/avatar/9c54097a5f4d1b1f0f3df350145d57c2?s=50&d=mm&r=g", "https://www.brainstain.us/wp-content/uploads/2017/12/crop221.png", "https://secure.gravatar.com/avatar/ede5eb9f2d4fab547481f32271b53c46?s=50&d=mm&r=g", "https://secure.gravatar.com/avatar/bd0238ce09d7b3b13a2197a4e43d7120?s=50&d=mm&r=g", "https://secure.gravatar.com/avatar/6ea4041df3da14d354d3703574bd154a?s=50&d=mm&r=g", "https://secure.gravatar.com/avatar/567dc6b05bc51556b878db2931db1725?s=50&d=mm&r=g", "https://secure.gravatar.com/avatar/50afbcc37ed456b929c480085e94c311?s=50&d=mm&r=g", "https://www.freepngimg.com/thumb/paypal_donate_button/8-2-paypal-donate-button-high-quality-png-thumb.png", "https://www.brainstain.us/wp-content/uploads/2017/06/crop167-50x50.png", "https://secure.gravatar.com/avatar/3033bf0a4b14ddfd3e510ccf319f04c6?s=50&d=mm&r=g", "https://www.brainstain.co.uk/wp-content/uploads/2017/01/amazon_affiliate.png", "https://www.brainstain.us/wp-content/uploads/2019/04/crop85-50x50.png", "https://www.brainstain.us/wp-content/uploads/2019/07/YourNewsWire-min-50x50.jpg", "https://i.ytimg.com/vi/VD9BnwepnJ8/maxresdefault.jpg", "https://www.brainstain.us/wp-content/uploads/2017/12/crop221-50x50.png"], "top_img": "https://www.brainstain.us/wp-content/uploads/2017/12/crop221.png", "keywords": [], "authors": [], "canonical_link": "https://www.brainstain.us/2017/12/13/mike-tyson-hillary-clinton-americas-prolific-serial-killer/", "title": "Mike Tyson: “Hillary Clinton is America’s Most Prolific Serial Killer”", "meta_data": {"viewport": "width=device-width", "description": "Mike Tyson shocked his audience recently as he ranted to them on stage about how Hillary Clinton was \"America's most prolific serial killer\".", "og": {"locale": "en_US", "type": "article", "title": "Mike Tyson: \"Hillary Clinton is America's Most Prolific Serial Killer\" - Brainstain Entertainment News", "description": "Mike Tyson shocked his audience recently as he ranted to them on stage about how Hillary Clinton was \"America's most prolific serial killer\".", "url": "https://www.brainstain.us/2017/12/13/mike-tyson-hillary-clinton-americas-prolific-serial-killer/", "site_name": "Brainstain Entertainment News", "updated_time": "2017-12-16T15:40:50+00:00", "image": {"identifier": "https://www.brainstain.us/wp-content/uploads/2017/12/crop221.png", "secure_url": "https://www.brainstain.us/wp-content/uploads/2017/12/crop221.png", "width": 640, "height": 240}}, "article": {"publisher": "https://www.facebook.com/brainstainnews/", "tag": "Undisputed Truth 2 Hillary Clinton body count", "section": "Celebrity", "published_time": "2017-12-13T12:32:54+00:00", "modified_time": "2017-12-16T15:40:50+00:00"}, "twitter": {"card": "summary", "description": "Mike Tyson is currently testing out his one man live show in Las Vegas called Undisputed Truth 2 to small crowds, since Las Vegas is apparently pretty quiet right now. It doesn't have anything to do with Tyson, but it may have something…", "title": "Mike Tyson: “Hillary Clinton is America’s Most Prolific Serial Killer”", "site": "@BrainstainNews", "image": "https://www.brainstain.us/wp-content/uploads/2017/12/crop221.png", "creator": "@BrainstainNews", "widgets": {"link-color": "#ff94ec", "border-color": "#ff78f5"}, "partner": "tfwp"}, "generator": "WordPress 4.9.10", "msapplication-TileImage": "https://www.brainstain.us/wp-content/uploads/2018/04/cropped-twittericon2-270x270.jpg"}, "movies": [], "publish_date": 1513141200.0, "source": "http://www.brainstain.co.uk", "summary": ""}