{"url": "www.washingtonpost.com/news/morning-mix/wp/2017/04/27/bachelor-chris-soules-arrested-after-deadly-crash-that-killed-iowa-farmer/", "text": "\n\nChris Soules, former star of ABC’s “The Bachelor,” after his arrest. (Buchanan County Sheriff via AP)\n\nIowa farmer Chris Soules, a former star on ABC’s “The Bachelor” who charmed reality TV viewers with his small-town life, was arrested this week after police said he fled a crash that killed a fellow farmer.\n\nSoules, 35, was charged with leaving the scene of a fatal crash, a class D felony, and could face up to five years in prison if he is convicted.\n\nThe case has garnered the attention of Soules’s “Bachelor” fans as well as residents of Arlington, Iowa, where he lives, who had come to appreciate the reality TV star’s work as an unofficial Iowa ambassador and farm industry advocate.\n\n“This story is going to spread like wildfire around here and probably all over because of who he is,” Mary Jo Brown, Arlington’s city clerk, told the Des Moines Register. “Sometimes fame isn’t your friend.”\n\nSoules, who also appeared in “Dancing with the Stars” and “Worst Chefs in America,” called 911 at 8:20 p.m. Monday evening to report that he had rear-ended a tractor on a rural road north of the tiny town of Aurora, about six miles away from his home.\n\nThe tractor veered into a ditch after being struck by his 2008 Chevrolet Silverado, Soules said.\n\nThe tractor driver — later identified as 66-year-old Kenneth Mosher, a Vietnam War veteran — was unconscious and not breathing, Soules told the 911 operator, according to audio obtained by local media. The man had a pulse, but there was blood around his mouth, Soules said.\n\nSoules identified himself on the call, which lasted nearly six minutes, and sounded frantic. Between heavy breathing, he answered the dispatcher’s questions and took instructions. Soules told the 911 operator he did not know how to perform CPR and could be heard asking unidentified people at the scene if they could perform the lifesaving measure.\n\nThe call ended abruptly after the operator told Soules law enforcement and medical first responders were on the way.\n\n“Can I, can I call you back really quick?” Soules asked the dispatcher.\n\n“Yeah, you can call me back,” she says.\n\n“Thank you,” Soules responds.\n\nSoules left the crash site after emergency responders arrived, but before deputies with the Buchanan County Sheriff’s Office were on the scene, according to authorities. Iowa State Patrol Sgt. Scott Bright told the Des Moines Register that Soules fled the scene on foot and later got into a truck. In police audio obtained by local media, a deputy told a dispatcher that Soules “took off” in a red truck.\n\nAuthorities are trying to identify who picked up Soules in the truck, Buchanan County Sheriff Bill Wolfgram told the Associated Press. That person could face charges, he said.\n\nAlcohol was found at the scene and investigators are trying to determine whose it was and whether it or speed were factors in the crash.\n\nSoules was arrested about five hours after the incident and booked into the Buchanan County Jail, the Associated Press reported. He posted a $10,000 bond Tuesday morning and was released on the condition that he surrender his passport and wear an electronic monitor.\n\nDuring his first appearance in court, the Buchanan County assistant attorney told the judge that Soules refused to cooperate with law enforcement after they located him at his home. He “would not come out,” the attorney said, until officials obtained a search warrant, which “took hours.”\n\nChris Soules making his initial court appearance in Buchanan County @KWWL pic.twitter.com/72bvEg0wVR — Elizabeth Amanieh (@AmaniehReports) April 25, 2017\n\nWolfgram told the Associated Press that investigators were “running into some roadblocks when it comes to getting information” but acknowledged Soules was acting within his constitutional rights.\n\nAccording to court documents, Soules had several run-ins with the law in his early 20s. In 2011, he was charged three times with underage alcohol possession and pleaded guilty and paid a fine for an open container violation, reported the Des Moines Register.\n\nThe following year, he received three citations for fighting and noise, unlawful use of a license and leaving the scene, which was amended down to defective brakes, court documents showed.\n\nThen in 2005, Soules was charged with driving while intoxicated and received one year of probation.\n\nA statement from Soules’s publicist earlier this week said he was “devastated” to learn that Mosher had died from the crash and that his “thoughts and prayers” were with the man’s family.\n\nMosher, a lifelong resident of Aurora — population 200 — lived on his family farm near the crash site, reported the Argus Leader. He was married to his high school sweetheart, Nancy, and the couple had two sons and three grandchildren, according to Mosher’s obituary.\n\nAn Army veteran, Mosher served six years, including a tour in Vietnam. He farmed his entire life and was a member of the Aurora American Legion and the Iowa Corn Growers Association.\n\n“Kenny loved playing golf, farming and spending his winters in Florida biking and visiting his mother,” Mosher’s obituary said. “His family was most important to him, especially his grandchildren.”\n\nIn northeast Iowa, where Mosher and Soules both farmed, community members told local media they were heartbroken for the families of both men.\n\n\n\nChris Soules and Whitney Bischoff during the finale of “The Bachelor.” (ABC via AP)\n\nSoules’s three sisters signed him up to be a suitor on “The Bachelorette” in 2014. He was a fan favorite, making it to the final three before bachelorette Andi Dorfman sent him home. Soules — nicknamed “Farmer Chris” — later returned as the star of his own season. He proposed to Whitney Bischoff, a contestant from Chicago, but the two split after a brief engagement.\n\nHe later competed on “Dancing with the Stars” and the Food Network’s “Worst Chefs in America.” Soules has since made guest appearances on various “Bachelor” franchise spin-offs shows and was rumored to be a cast member for this summer’s taping of “Bachelor in Paradise,” where former contestants search for love on a tropical island.\n\nSoules had used his reality TV platform to travel Iowa and the Midwest advocating for agricultural issues, including ethanol and renewable fuels.\n\nMore from Morning Mix\n\nMore lawsuits aimed at Fox News — this time alleging racial discrimination\n\nNordstrom is selling jeans caked in fake dirt for hundreds of dollars\n\nConservationist, author of ‘I Dreamed of Africa’ ambushed and shot at her ranch in Kenya", "images": ["https://www.washingtonpost.com/resizer/SE67Z04uQc-SCbEBO0nnv1I8D-Q=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/IG6BYSODWAZ6ZOMQ5GOLSMNKY4.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=3005617&cv=2.0&cj=1", "https://www.washingtonpost.com/resizer/yAFxThroW-CI5t-yu8Q6FsF7kHI=/1x1/www.washingtonpost.com/pb/resources/img/spacer.gif", "https://www.washingtonpost.com/resizer/TXJKur-cQ3m4AF9lqk_kkjfemkk=/3x2/www.washingtonpost.com/pb/resources/img/spacer.gif", "http://me.effectivemeasure.net/em_image", "https://www.washingtonpost.com/resizer/T-Je0TzH0CjJQdzEFpQbPkq6FvE=/300x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/6CRTOYTMQA6J5NDLDAQPVDDIUY.jpg"], "top_img": "https://www.washingtonpost.com/resizer/SE67Z04uQc-SCbEBO0nnv1I8D-Q=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/IG6BYSODWAZ6ZOMQ5GOLSMNKY4.jpg", "keywords": [], "authors": ["Katie Mettler", "Reporter Covering Breaking News", "April", "Katie Mettler Is A General Assignment Reporter For The Washington Post. She Previously Worked For The Tampa Bay Times In St. Petersburg"], "canonical_link": "https://www.washingtonpost.com/news/morning-mix/wp/2017/04/27/bachelor-chris-soules-arrested-after-deadly-crash-that-killed-iowa-farmer/", "title": "‘Bachelor’ Chris Soules arrested after deadly crash that killed Iowa farmer", "meta_data": {"object-hash": 1556579593, "viewport": "width=device-width, initial-scale=1.0, user-scalable=yes, minimum-scale=0.5, maximum-scale=2.0", "referrer": "unsafe-url", "keywords": "Soules, Bachelor, Farmer, Iowa, arrest, Aurora, Arlington", "news_keywords": "Soules, Bachelor, Farmer, Iowa, arrest, Aurora, Arlington", "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "creator": "@kemettler"}, "og": {"type": "article", "site_name": "Washington Post", "url": "https://www.washingtonpost.com/news/morning-mix/wp/2017/04/27/bachelor-chris-soules-arrested-after-deadly-crash-that-killed-iowa-farmer/", "image": "https://www.washingtonpost.com/resizer/SE67Z04uQc-SCbEBO0nnv1I8D-Q=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/IG6BYSODWAZ6ZOMQ5GOLSMNKY4.jpg", "title": "‘Bachelor’ Chris Soules arrested after deadly crash that killed Iowa farmer", "description": "The “Bachelor” star, nicknamed Farmer Chris, charmed reality TV viewers with tales of his rural lifestyle in small town Iowa."}, "article": {"publisher": "https://www.facebook.com/washingtonpost", "content_tier": "metered"}, "fb": {"app_id": 41245586762, "admins": 500835072}, "description": "The “Bachelor” star, nicknamed Farmer Chris, charmed reality TV viewers with tales of his rural lifestyle in small town Iowa.", "robots": "index,follow", "theme": "normal"}, "movies": [], "publish_date": 1493265600.0, "source": "http://www.washingtonpost.com", "summary": ""}