{"url": "en.wikipedia.org/wiki/Sofia_Richie", "text": "Sofia Richie (born August 24, 1998)[1] is an American model. She has been featured in campaigns by a number of major brands including Tommy Hilfiger, Michael Kors and Chanel. She is the younger daughter of singer and songwriter Lionel Richie and adoptive sister to fashion designer and television personality Nicole Richie.\n\nEarly life [ edit ]\n\nSofia Richie was born in Los Angeles, California to parents Lionel Richie and his second wife Diane Alexander. She is the younger sister of Nicole Richie (who was adopted) and the biological sister of Miles Richie.[1] Sofia Richie's godfather was Michael Jackson. She reported that the visits to Jackson's Neverland Ranch were some of her favorite memories as a child, and she became close friends with his daughter, Paris.[2]\n\nRichie grew up with an affinity for music like her father. She learned to sing at age 5 and play the piano at age 7.[3] She made occasional appearances at her father's shows[2] and took vocal lessons from Beyonce's vocal coach, Tim Carter, when she was 14, as well.[3] She also worked in the studio with her brother-in-law (and Good Charlotte lead vocalist) Joel Madden.[4][3] She decided to move away from a music career, however, because of the pressure of living up to her father's stature in the music industry.[5]\n\nRichie spent some time at Oaks Christian School—nicknamed \"Celebrity High\"—before being educated at home for several years while her father was on tour. She played soccer until age 16 when she broke her hip in a Segway accident.[5]\n\nCareer [ edit ]\n\nModeling career [ edit ]\n\nRichie began modeling at age 14 with a feature in Teen Vogue[4] and at 15 she got her first fashion contract with Los Angeles-based swimwear company Mary Grace Swim.[6] The next year, Richie signed with London-based modeling agency Select Model Management.[7]\n\nRichie has featured in advertising campaigns for a number of brands including DL1961,[8] Madonna's Material Girl line,[2] Chanel,[9] Dolce & Gabbana,[9] Adidas, Michael Kors,[11] and Tommy Hilfiger.[9] She has done photoshoots for Elle and Vanity Fair[5] and has recently appeared on the cover of Complex[5] and Billboard magazine's style issue.[3] Richie has graced the covers of numerous international fashion magazines, including US' Sweets! Magazine, Manifesto, Dujour and Es Magazine; UK's Tatler and Asos Magazine;[12] Japan's Vogue and Popular;[13] and Singapore's L'Officiel.[14]\n\nPersonal life [ edit ]\n\nSofia has been dating television personality Scott Disick, since May 2017.[15][16]\n\nFilmography [ edit ]\n\nTelevision roles Year Title Role Notes 2014 Candidly Nicole Herself 3 episodes 2016 Red, White and Bootsy Herself TV movie\n\nFilm roles Year Title Role Notes 2018 Ocean's 8 Herself", "images": ["http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/5/5d/Sofia_Richie_by_Eric_Longden_1.jpg", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Sofia_Richie_by_Eric_Longden_1.jpg/220px-Sofia_Richie_by_Eric_Longden_1.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/5/5d/Sofia_Richie_by_Eric_Longden_1.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Sofia_Richie", "title": "Sofia Richie", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.13", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/5/5d/Sofia_Richie_by_Eric_Longden_1.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}