{"url": "https://www.washingtonpost.com/news/morning-mix/wp/2018/09/07/actor-terry-crews-settles-his-lawsuit-against-the-powerful-hollywood-agent-who-allegedly-groped-him/", "text": "\n\nTerry Crews arrives at an event in Beverly Hills, Calif., in November 2017. (Jordan Strauss/Invision/AP)\n\nLast October, as the #MeToo earthquake was beginning to rip through the Hollywood power structure following abuse allegations connected to producer Harvey Weinstein, actor Terry Crews significantly readjusted the national conversation.\n\nIn tweets, the “Brooklyn Nine-Nine” star laid out his own claims of experiencing sexual harassment. At a party in 2016, a “high-level Hollywood executive” came up to Crews and “groped my privates,” the actor wrote. Crews later publicly identified the executive as Adam Venit, a longtime industry power-player who represented marquee names such as Adam Sandler, Sylvester Stallone, Eddie Murphy and Vince Vaughn. Crews went on to file a police report about the incident, as well as a lawsuit against Venit and his agency, William Morris Endeavor.\n\nBut Crews’s revelation reverberated well beyond his own case. His public stand detonated stereotypes by showing a 240-pound former NFL player could also be the victim of sexual assault, thus widening the lens of the #MeToo movement. Time included Crews among the “the silence breakers” named in the magazine’s person of the year feature.\n\nNow, Crews’s legal case has come to an end. On Thursday, William Morris Endeavor announced the lawsuit has been settled.\n\n“Terry Crews, Adam Venit and WME have settled the lawsuit Mr. Crews filed last year,” the agency said in a statement, according to the Hollywood Reporter. “It will be dismissed.”\n\nAccording to Deadline, Venit is also planning to retire from WME on Monday. He had previously been suspended and demoted following Crews’s allegation.\n\nAfter news of the settlement and Venit’s exit, Crews responded on Twitter with a single word: “ACCOUNTABILITY,” he wrote.\n\nThat was the theme Crews has continually hit on since speaking out.\n\n“People need to be held accountable,” the actor told “Good Morning America” last November. “This is the deal about Hollywood. It is an abuse of power. This guy, again, he’s one of the most powerful [men] in Hollywood, and he looked at me at the end as if, ‘Who is going to believe you?’”\n\n“The assault lasted only minutes, but what he was effectively telling me while he held my genitals in his hand was that he held the power. That he was in control,” Crews told the Senate Judiciary Committee this summer. “As I shared my story, I was told over and over that this was not abuse. This was just a joke. This was just horseplay. But I can say one man’s horseplay is another man’s humiliation.”\n\nIn his lawsuit, filed last December, Crews recounted his alleged encounter with the star agent. “Venit, upon his first meeting Crews, viciously grabbed Crews’s penis and testicles so hard that it caused Crews immediate pain in a blatant and unprovoked sexual assault,” the lawsuit stated.\n\nCrews, who was not Venit’s client, reportedly told his own WME agent about the assault the next day. But the agency did nothing, his lawsuit claimed, as part of “corporate culture that fosters environments in which WME agents are knowingly permitted and encouraged to engage in misconduct, including sexually predatory conduct.”\n\nIn court filings, Venit denied the allegations, the Associated Press reported.\n\nAccording to the Reporter, a criminal investigation into the assault spearheaded by the Los Angeles Police Department commenced last November. In March, the prosecutors announced they were declining criminal charges because of “the lapse in statute of limitations for misdemeanor cases.”\n\nBut the allegations also triggered an internal review at WME. The Reporter wrote that the agency’s internal review determined that Crews’s allegation about Venit was “indicative of a pattern, rather than an isolated event.” The agent was bumped down from his position as the head of the agency’s motion picture group.\n\nVenit’s demotion — and now exit — from the industry represented a significant nose dive for a man who was a considerable force within Hollywood for more than three decades. According to Deadline, the agent started out working in the mailroom at Creative Artists Agency in 1986 after dropping out of law school. He later went on to represent some of the biggest movie stars in the business.", "images": ["https://www.washingtonpost.com/resizer/lxt_2ptb10egwP2f7RouvboggUU=/1024x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/77DWNWMRXQ7E5BCCYIGYEZQJAY.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=3005617&cv=2.0&cj=1", "https://www.washingtonpost.com/resizer/yAFxThroW-CI5t-yu8Q6FsF7kHI=/1x1/www.washingtonpost.com/pb/resources/img/spacer.gif", "https://me.effectivemeasure.net/em_image", "https://www.washingtonpost.com/resizer/t-pdnncyMdjzfpKalnpRV5Oln9s=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ROYQ5T4PHA4FPDT62ZPYO5NABY.jpg"], "top_img": "https://www.washingtonpost.com/resizer/t-pdnncyMdjzfpKalnpRV5Oln9s=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ROYQ5T4PHA4FPDT62ZPYO5NABY.jpg", "keywords": [], "authors": ["Kyle Swenson", "Reporter For Morning Mix", "September", "Kyle Swenson Is A Reporter With The Washington Post'S Morning Mix Team. He Previously Worked At The New Times Broward-Palm Beach", "Cleveland Scene."], "canonical_link": "https://www.washingtonpost.com/news/morning-mix/wp/2018/09/07/actor-terry-crews-settles-his-lawsuit-against-the-powerful-hollywood-agent-who-allegedly-groped-him/", "title": "Actor Terry Crews settles his lawsuit against the powerful Hollywood agent who allegedly groped him", "meta_data": {"object-hash": 1553896057, "viewport": "width=device-width, initial-scale=1.0, user-scalable=yes, minimum-scale=0.5, maximum-scale=2.0", "referrer": "unsafe-url", "keywords": "Terry Crews, Adam Venit, William Morris Endeavor, MeToo movement, sexual abuse", "news_keywords": "Terry Crews, Adam Venit, William Morris Endeavor, MeToo movement, sexual abuse", "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "creator": "@kyletalking"}, "og": {"type": "article", "site_name": "Washington Post", "url": "https://www.washingtonpost.com/news/morning-mix/wp/2018/09/07/actor-terry-crews-settles-his-lawsuit-against-the-powerful-hollywood-agent-who-allegedly-groped-him/", "image": "https://www.washingtonpost.com/resizer/t-pdnncyMdjzfpKalnpRV5Oln9s=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ROYQ5T4PHA4FPDT62ZPYO5NABY.jpg", "title": "Actor Terry Crews settles his lawsuit against the powerful Hollywood agent who allegedly groped him", "description": "The “Brooklyn Nine-Nine” star's allegations significantly readjusted the national conversation on sexual harassment."}, "article": {"publisher": "https://www.facebook.com/washingtonpost", "content_tier": "metered"}, "fb": {"app_id": 41245586762, "admins": 500835072}, "description": "The “Brooklyn Nine-Nine” star's allegations significantly readjusted the national conversation on sexual harassment.", "robots": "index,follow", "theme": "normal"}, "movies": ["https://www.youtube.com/embed/ZtI4eH1U2rY?feature=oembed"], "publish_date": 1536292800.0, "source": "https://www.washingtonpost.com", "summary": ""}