{"url": "https://www.thesun.co.uk/tvandshowbiz/4508999/laura-gallacher-russell-brand-wife-mabel-baby-kirsty-gallacher/", "text": "LAURA Gallacher is best known for being the wife of Russell Brand and the sister of TV star Kirsty.\n\nThe mum of Russell's daughter Mabel gave birth to her second daughter with the comedian in July 2018- here's everything you need to know about her...\n\n3 Laura has a very famous sister, TV presenter and anchor Kirsty Gallacher Credit: Getty - Contributor\n\nWho is Laura Gallacher?\n\nGallacher is the daughter of golfer Bernard and sister of TV presenter Kirsty.\n\nThey grew up on the Wentworth Estate in Surrey, where they were lucky enough to share a neighbourhood with the late legend Bruce Forsyth.\n\nThe plush area has also been the home of Elton John and Cliff Richard.\n\nIn the past, Laura has worked in the restaurant industry.\n\nShe appeared to be employed at the Moral Fox restaurant, where she regularly tweeted updates.\n\nGallacher also helped with the opening of Electric Diner, a posh restaurant for the Soho House Group.\n\n3 Laura and Russell regularly look loved-up as they walk together in public Credit: Flynet Pictures\n\nEntrepreneur Laura also has her own fashion brand, where she sells dungarees.\n\nOn her official website, she writes: “The Joy Journal is about creativity, colour, individuality and fun.\n\n\"These dungarees are an expression of that spirit. Craft, not couture, comfortable cool, not catwalk. These dungarees are the first Joy Journal Project.”\n\n\n\nHow long have Laura Gallacher and Russell Brand been together?\n\nHis marriage to Katy Perry only lasted 14 months – but this didn't put Russell off getting hitched for a second time.\n\nThe serial womaniser and former Bizarre Shagger of the Year popped the question to long-term girlfriend Laura Gallacher in June 2016.\n\nIn August 2017, the pair tied the knot in an intimate service at Remenham Church near their home in Henley-on-Thames, Oxon.\n\nMost Read in TV & Showbiz Exclusive TV STAR DEAD TV host Emily Hartridge, 35, killed in electric scooter crash near her home Exclusive WON'T CONTROL HIS FURY Tommy Fury's ex warns Molly-Mae he's ‘aggressive & will cheat' Exclusive FLACK ATTACKED Love Island's Francesca called Caroline Flack a ‘dirty paedo’ to her face BLUE'S THAT GIRL Christine McGuinness looks sensational in blue bikini poolside in Spain ISLE BE DAMNED Peter Andre horrified as daughter Princess, 12, wants to go on Love Island hooker for harvey Katie Price tells Loose Women she is considering hiring a prostitute for disabled son Harvey when he turns 18 so he can experience sex – before show cuts out due to ‘technical difficulties’\n\n3 Laura attends a charity event at Holland Park, raising heart awareness for Bernard Gallacher's 'Play Golf Help Save Lives' campaign Credit: Getty - Contributor\n\nHow many children do Laura Gallacher and Russell Brand have?\n\nThe couple has two daughters, Mabel born in November 2016 and their second baby daughter who arrived in July 2018.\n\nThe parents like to keep their family private, and he announced their happy news of Mabel's birth during his gig at the Nottingham Playhouse.\n\nDoting parents Russell and Laura are regularly spotted on day-trips with the tot, and have even taken her to New York.\n\nIn June 2018 it was revealed that the pair were expecting their second child after Laura was pictured with a baby bump.", "images": ["https://www.facebook.com/tr?id=752905198150451&ev=PageView&noscript=1", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.6 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.7 1\"%3E%3C/svg%3E", "https://www.thesun.co.uk/wp-content/uploads/2019/04/sunmasthead_mobile_site_of_the_year.png", "https://www.thesun.co.uk/wp-content/uploads/2018/12/NINTCHDBPICT000463330298-e1551821309889.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 2.7 1\"%3E%3C/svg%3E", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.thesun.co.uk/wp-content/uploads/2019/04/sunmasthead_desktop_0404.jpg"], "top_img": "https://www.thesun.co.uk/wp-content/uploads/2018/12/NINTCHDBPICT000463330298-e1551821309889.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "keywords": [], "authors": ["Sophie Roberts"], "canonical_link": "https://www.thesun.co.uk/tvandshowbiz/4508999/laura-gallacher-russell-brand-wife-mabel-baby-kirsty-gallacher/", "title": "Who is Laura Gallacher? Russell Brand's wife, mother to Mabel and their new baby daughter and Kirsy Gallacher’s sister", "meta_data": {"viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no, width=device-width", "google-site-verification": "a576LGe3E0YA5QjAMY268jcuKWwPLIORxwlTMrjnfnE", "msvalidate.01": "E4359034FA254151A3AB2EFAC6D20D80", "p": {"domain_verify": "c061a8052bd9e93315b7f01447fa4124"}, "og": {"type": "article", "title": "Get the lowdown on Laura Gallacher, Russell Brand's wife and mum to baby Mabel", "url": "https://www.thesun.co.uk/tvandshowbiz/4508999/laura-gallacher-russell-brand-wife-mabel-baby-kirsty-gallacher/", "description": "LAURA Gallacher is best known for being the wife of Russell Brand and the sister of TV star Kirsty. The mum of Russell’s daughter Mabel gave birth to her second daughter with the comedian in …", "site_name": "The Sun", "image": {"identifier": "https://www.thesun.co.uk/wp-content/uploads/2018/12/NINTCHDBPICT000463330298-e1551821309889.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "width": 1200, "height": 800}, "locale": "en_GB"}, "article": {"published_time": "2019-03-05T21:23:33+00:00", "modified_time": "2019-03-05T21:28:55+00:00", "publisher": 161385360554578, "tag": "Russell Brand, Celebrity relationships and break ups, Explainers", "author": "https://www.facebook.com/thesunshowbiz/"}, "fb": {"app_id": 144647118961553, "pages": 161385360554578}, "description": "Laura Gallacher is Russell Brand's wife. The loved-up pair have tied the knot, so here's more information on the woman that stole Lothario Russell's heart and is the mother to his two daughters.", "keywords": "Laura Gallacher, russell brand, baby, Mabel, daughters,Kirsty Gallacher sister", "news_keywords": "Laura Gallacher, russell brand, baby, Mabel, daughters,Kirsty Gallacher sister", "twitter": {"text": {"title": "Who is Laura Gallacher? Russell Brand’s wife and Kirsy Gallacher’s sister"}, "card": "summary_large_image", "site": "@thesun"}, "robots": "noarchive,noodp", "taboola": {"kicker": "MRS BRAND", "headline": "The lowdown on Laura Gallacher, Russell Brand's wife and mum to his two daughters", "image": {"medium": "https://i1.wp.com/www.thesun.co.uk/wp-content/uploads/2017/09/nintchdbpict000354616846-e1551819085596.jpg?crop=0px%2C49px%2C677px%2C451px&resize=300%2C192&ssl=1", "large": "https://i1.wp.com/www.thesun.co.uk/wp-content/uploads/2017/09/nintchdbpict000354616846-e1551819085596.jpg?crop=0px%2C49px%2C677px%2C451px&resize=620%2C413&ssl=1"}}, "parsely-post-id": 4508999, "msapplication-TileImage": "https://www.thesun.co.uk/wp-content/uploads/2016/04/icon-e1459786005667.png?strip=all&w=270"}, "movies": [], "publish_date": 1551821013.0, "source": "https://www.thesun.co.uk", "summary": ""}