{"url": "http://feedbox.com/2017/06/tom-holland-spills-how-he-got-in-shape-for-iconic-spider-man-homecoming-role/", "text": "Author: Meg Swertlow / Source: E! Online\n\nTom Holland, the English actor who’s about to become a household name for his turn in Spider-Man: Homecoming, caught up with E! News over the weekend and talked about what it was like taking on the iconic role of the famed web-slinger.\n\nIn the sit-down, which was also with his co-stars Zendaya, Jacob Batalon and Laura Harrier, Holland admits that the fellow actors’ reaction to his putting on the iconic Spider-Man suit for the very first time wasn’t exactly what you’d expect.\n\n“The first time they saw me in it, it was funny because all they would do was touch me,” said the 21-year-old, who added that the young stars couldn’t keep their hands off of him. During the interview, they all chimed in about the Spidey suit, “It feels like a basketball!”\n\nSpider-Man: Homecoming, Tom Holland\n\nHolland admitted that although the suit looked and felt cool, there were some big issues with its construction—namely that he couldn’t see or hear out of it!\n\n“The first time I put on the suit it was really cool, but you couldn’t see anything out of it…so we had to…\n\nClick here to read more\n\nMore from Around the Web", "images": ["https://feedbox.com/wp-content/uploads/2017/06/tom-holland-spills-how-he-got-in-shape-for-iconic-spider-man-homecoming-role.jpg", "https://feedbox.com/wp-content/uploads/2016/11/Feed-Box-logo_PNG-400px.png", "http://media.fraud.net/shield/shield_lt.png", "https://feedbox.com/wp-content/uploads/2016/11/Feed-Box-logo_PNG-200px-w.png", "http://feedbox.com/image-proxy/imageurl=http://akns-images.eonline.com/eol_images/Entire_Site/2017424/rs_1024x683-170524043934-1024.spider-man-homecoming-1.52417.jpg", "http://feedbox.com/image-proxy/imageurl=http://akns-images.eonline.com/eol_images/Entire_Site/2017416/rs_600x600-170516113916-600-ferrera-tamblyn-lively-bledel-traveling-pants.jpg", "https://feedbox.com/wp-content/uploads/gravatar/sashah.jpg", "https://feedbox.com/wp-content/uploads/2017/06/logo-sm-2.png"], "top_img": "https://feedbox.com/wp-content/uploads/2017/06/tom-holland-spills-how-he-got-in-shape-for-iconic-spider-man-homecoming-role.jpg", "keywords": [], "authors": ["Sasha Harriet"], "canonical_link": "https://feedbox.com/2017/06/tom-holland-spills-how-he-got-in-shape-for-iconic-spider-man-homecoming-role/", "title": "Tom Holland Spills How He Got in Shape for Iconic Spider-Man: Homecoming Role", "meta_data": {"og": {"locale": "en_US", "type": "article", "title": "Tom Holland Spills How He Got in Shape for Iconic Spider-Man: Homecoming Role - FeedBox", "description": "Tom Holland Spills How He Got in Shape for Iconic Spider-Man: Homecoming Role. \"The first time they saw me in it, it was funny because all they would do was touch me,\" said the 21-year-old, who added that the young stars couldn't keep their hands off of him.\nDuring the interview, they all chimed in about the Spidey suit, \"It feels like a basketball!\" \"The first time I put on the suit it was really cool, but you couldn't see anything out of it...so we had to change the eyes,\" he said.\nAs for whether or not he felt pressure to get in shape for the weighty role, Holland admitted that before filming one particular revealing scene where his suit falls off, he actually kept weights off to the side to prep his body. \"I just went to the gym every day,\" he confessed.\nBack when news hit in 2015 that Holland was cast in the role, Tom Rothman, Sony Pictures Motion Pictures Group Chairman, said in a statement, \"It's a big day here at Sony….I've worked with a number of up-and-coming directors who have gone on to be superstars and believe that Jon is just such an outstanding talent.\nFor Spidey himself, we saw many terrific young actors, but Tom's screen tests were special.\nAll in all, we are off to a roaring start.\"\nAmy Pascal, who launched the franchise in 1999 with Tobey Maguire in the titular role, echoed Rothman's sentiments by stating, \"[We] all knew that for Peter Parker, we had to find a vibrant, talented young actor capable of embodying one of the most well-known characters in the world.", "url": "https://feedbox.com/2017/06/tom-holland-spills-how-he-got-in-shape-for-iconic-spider-man-homecoming-role/", "site_name": "FeedBox", "image": {"identifier": "https://feedbox.com/wp-content/uploads/2017/06/tom-holland-spills-how-he-got-in-shape-for-iconic-spider-man-homecoming-role.jpg", "secure_url": "https://feedbox.com/wp-content/uploads/2017/06/tom-holland-spills-how-he-got-in-shape-for-iconic-spider-man-homecoming-role.jpg", "width": 600, "height": 600}}, "article": {"tag": "Tom Holland (actor)", "section": "Entertainment", "published_time": "2017-06-27T10:10:59+00:00"}, "twitter": {"card": "summary", "description": "Tom Holland Spills How He Got in Shape for Iconic Spider-Man: Homecoming Role. \"The first time they saw me in it, it was funny because all they would do was touch me,\" said the 21-year-old, who added that the young stars couldn't keep their hands off of him. During the interview, they all chimed in about the Spidey suit, \"It feels like a basketball!\" \"The first time I put on the suit it was really cool, but you couldn't see anything out of it...so we had to change the eyes,\" he said. As for whether or not he felt pressure to get in shape for the weighty role, Holland admitted that before filming one particular revealing scene where his suit falls off, he actually kept weights off to the side to prep his body. \"I just went to the gym every day,\" he confessed. Back when news hit in 2015 that Holland was cast in the role, Tom Rothman, Sony Pictures Motion Pictures Group Chairman, said in a statement, \"It's a big day here at Sony….I've worked with a number of up-and-coming directors who have gone on to be superstars and believe that Jon is just such an outstanding talent. For Spidey himself, we saw many terrific young actors, but Tom's screen tests were special. All in all, we are off to a roaring start.\" Amy Pascal, who launched the franchise in 1999 with Tobey Maguire in the titular role, echoed Rothman's sentiments by stating, \"[We] all knew that for Peter Parker, we had to find a vibrant, talented young actor capable of embodying one of the most well-known characters in the world.", "title": "Tom Holland Spills How He Got in Shape for Iconic Spider-Man: Homecoming Role - FeedBox", "image": "https://feedbox.com/wp-content/uploads/2017/06/tom-holland-spills-how-he-got-in-shape-for-iconic-spider-man-homecoming-role.jpg"}, "generator": "WordPress 5.2.2", "viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0", "msapplication-TileImage": "https://feedbox.com/wp-content/uploads/2016/11/cropped-Feed-Box-logo_PNG-400px-270x270.png"}, "movies": [], "publish_date": 1498558259.0, "source": "http://feedbox.com", "summary": ""}