{"url": "https://www.fame10.com/entertainment/real-housewives-ranking-the-12-shadiest-significant-others/", "text": "Bravo’s most successful franchise is undeniably the Real Housewives reality series. What fans love the most about this show is that many of the women completely open up their lives to viewers, including their sometimes tumultuous love lives. We’ve watched many relationships come and go over the years as the women have dated (or even married) some pretty interesting characters! From infidelity to incarceration, here are 12 of the shadiest significant others who’ve appeared on the show!\n\n12. John Mahdessian\n\nWe put John Mahdessian in the last spot on this list because he’s never really did anything too terrible to Real Housewives of New York City star Dorinda, aside from getting into a tiff with her and her friends on camera. To be fair, he tried to make up with Bethenny and does seem to treat Dorinda well, but the fighting with the women and showing up drunk at girls’ nights isn’t cool. We’ll give him the benefit of the doubt though because we know Dorinda is not exactly the kind of woman who’d put up with shady business!\n\nADVERTISEMENT\n\n2\n\n11. Paul ‘PK’ Kemsley\n\nPaul Kemsley, better known as ‘PK’ on The Real Housewives of Beverly Hills, joined the show alongside his wife, Dorit, in season 7 and he didn’t exactly leave a good impression. Remember Pantygate? It dragged on all season long and caused a ton of drama, but no one in the situation looked worse than PK when he admitted to his wife that he was staring up Erika’s skirt! Even worse, he made a creepy comment that he “didn’t mind the view” — gross! While he seems to have learned his lesson and is keeping a lower profile this season, it’ll take a while for him to get back in the audience’s good graces.\n\n3\n\n10. James Marchese\n\nThis New Jersey husband goes down in history as one of the most hated. Not only was he disliked by viewers during their time on the show after he constantly inserted himself in the women’s drama and spoke rudely about other women on the show, but since their departure from the show, he made headlines after he was arrested on an alleged domestic abuse allegation! The charges were later dropped, but the damage to his already suffering reputation was done.\n\n4\n\n9. Slade Smiley\n\nEven his name sounds a little bit slimy. For years Slade was deemed a serial Housewife dater after he engaged in relationships with former RHOC cast members Jo De La Rosa, Lauri Peterson, and now Gretchen Rossi. When he first appeared on the show as Jo’s boyfriend their relationship seemed pretty normal, but after he got laid off from his job (and never really found another one) and started dating Gretchen, the other women began to question his intentions. Tamra and Vicki both alleged that he wasn’t paying child support and he was a mooching money off Gretchen. In addition to all his financial debt, many people alleged he was only dating her to be on TV. Even though we all questioned their relationship at one point or another, these two are still going strong to this day.\n\n5\n\n8. Frank Curtin\n\nIt was pretty devastating to watch former Real Housewives of Orange County stars Frank and Lynne Curtin’s life essentially fall apart on camera, but we also wanted to shake some sense into Frank! While he’s not necessarily a bad person, what he did to Lynne and his family was pretty shady. He lied about some serious financial problems and allowed them to continue living a lifestyle they could not afford until they were literally broke and homeless. He used the excuse that he felt a lot of pressure to provide them with a certain lifestyle, but he also never gave them a chance to change! Not cool, Frank. Not cool.\n\n6\n\n7. Josh Taekman\n\nEntrepreneur Josh Taekman made his RHONY debut in season 6 when his wife Kristen joined the show as a regular cast member. Their first season on the show consisted of a lot of bickering, so when they returned in season 7, they seemed to make a conscious decision to work on their relationship. Sadly, after season 7 wrapped up, Josh’s named showed up in the Ashley Madison leak. After vehemently denying his involvement, Josh eventually admitted guilt, although he continued to maintain it was only created as a “joke.” Yeah, right. He’d accessed the account on several different occasions over a three year period, spent more than $1,500 on a membership annually, and even accessed the account while his wife was pregnant!\n\n7\n\n6. Mario Singer\n\nFor six seasons on The Real Housewives of New York City, Ramona and Mario Singer seemed like they had the perfect marriage and Ramona never missed a chance to brag about her husband. Little did she know he had been carrying on an affair behind her back! Talk about being shady! Ramona even dished that after she’d taken him back, she caught him once again with his mistress at their house in the Hamptons. Thinking back, Mario was always a little bit shady. He was constantly inserting himself into the women’s drama which is a definite red flag.\n\n8\n\n5. David Beador\n\nWhere do we begin with this Real Housewives of Orange County husband? When David and his wife Shannon first appeared on the show back in season 9 their marriage was clearly strained. We soon found out it was because they were secretly fighting to keep their marriage together after David’s infidelity. Not only is David shady for cheating on his wife, but apparently he did it with someone Shannon knew! After trying to work through their problems, David resorted back to his old ways of treating Shannon poorly. At the season 12 reunion, Shannon announced they were getting divorced and dished on some details about the events leading up to their divorce including when David told Shannon their 17-year marriage only consisted of a “couple good months.” What a jerk!\n\n9\n\n4. Joe Guidice\n\nUnlike some of the other significant others on this list, Joe Guidice hasn’t cheated on his wife…that we know of. It’s certainly been alluded to on numerous times on the show, but there’s never been any proof of it and both he and Teresa have vehemently denied these rumors. What’s shady about Joe is that according to Teresa, he lied about their financial troubles for years. While we’ve seen this happen before (remember Lynne and Frank Curtin?), the Giudice’s financial problems were so bad it landed them both in jail! In the most recent season of The Real Housewives of New Jersey, Teresa opens up about how she’s still grappling with how to forgive her husband’s actions.\n\n10\n\n3. Tom D’Agostino\n\nMany fans of Real Housewives of New York City might not remember this but Tom D’Agostino has been lurking around ever since season 1 when he was filmed flirting with Ramona Singer. Tom made a reappearance in season 8 when he struck up a relationship with LuAnn de Lesseps. Their romance moved extremely fast and before we knew it these two were engaged and planning a wedding! Tom was creepy from the get-go. He was caught making sly remarks about his relationship and other women on camera, but the worst was when he was photographed making out with another woman! Despite all this, LuAnn went through with their marriage. Not surprisingly, they got divorced after less than a year.\n\n11\n\n2. Apollo Nida\n\nThere’s no denying Real Housewives of Atlanta star Phaedra Parks knew what she was getting into when she married Apollo Nida; after all, he’d recently been released from prison! Of course, when she first married him she thought his criminal behavior was behind him. While starring on the show, Apollo flirted with other women, got in a physical altercation with someone, threatened Phaedra verbally and even once by approaching her with a drill in his hand, and to top it all off, he was sentenced to another eight years in prison for bank fraud.\n\n12\n\n1. Brooks Ayers\n\nBrooks Ayers lands in the number one spot on this list because he told lie after lie after lie. Unlike the other men on this list who were sometimes pretty forward with their flaws, Vicki Gunvalson’s ex-boyfriend pretended to be this sweet Southern gentleman when really he was a total con-artist. Brooks falsified medical documents to make people believe he was suffering from cancer when really he was perfectly healthy! He was also accused of using Vicki for her money, not having a job and not paying child support. After so many ups and downs over several years, Vicki finally dumped him when she learned he lied about having cancer. That’s definitely a deal breaker.", "images": ["https://www.fame10.com/wp-content/themes/fametenV2/images/logo-white.png", "https://www.fame10.com/wp-content/themes/fametenV2/images/trending_up.png", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_100,$w_100/f10/2017/02/RHOT-400x400.jpg", "https://www.fame10.com/wp-content/themes/fametenV2/images/qool-logo-white.png", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_74,$w_115/f10/2017/05/Eric-Martsolf-620x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_140,$w_140/f10/2016/10/Joe-Gorga-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_140,$w_140/f10/2015/12/Ramona-Singer-and-Sonja-Morgan-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_170,$w_170/f10/2017/06/Phaedra-Parks-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_74,$w_115/f10/2018/08/19598558-620x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_100,$w_100/f10/2016/11/Vicki-Gunvalson-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_170,$w_170/f10/2017/09/Lisa-Vanderpump-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_100,$w_100/f10/2017/02/The-Real-Housewives-of-Beverly-HIlls-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_170,$w_170/f10/2017/07/Jill-Zarin-and-Bethenny-Frankel-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_170,$w_170/f10/2017/05/13636659-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_170,$w_170/f10/2017/09/Lisa-Vanderpump-and-Ken-Todd-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_100,$w_100/f10/2015/12/Ramona-Singer-and-Sonja-Morgan-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_74,$w_115/f10/2016/01/Anthony-Geary-620x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_170,$w_170/f10/2017/01/Joe-Gorga-400x400.jpg", "https://www.fame10.com/wp-content/themes/fametenV2/images/logo.png", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_170,$w_170/f10/2017/06/shutterstock_380327458-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_100,$w_100/f10/2016/10/Joe-Gorga-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_170,$w_170/f10/2017/06/Ramona-Singer-and-Sonja-Morgan-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_100,$w_100/f10/2016/11/The-Real-Housewives-of-Melbourne-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_170,$w_170/f10/2017/04/RHOBH-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_100,$w_100/f10/2017/02/Ramona-and-Mario-Singer-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_170,$w_170/f10/2017/06/Caroline-Manzo-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_80,$w_125/f10/2017/12/Tamra-and-Eddie-Judge-.jpg", "https://www.fame10.com/wp-content/themes/fametenV2/images/concourse-logo-white.png", "https://www.fame10.com/wp-content/uploads/2016/03/Brooks-Ayers-620x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_170,$w_170/f10/2017/03/Kelly-Dodd-RHOC-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_170,$w_170/f10/2016/10/Kelly-Dodd-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_170,$w_170/f10/2017/04/Jill-and-Bobby-Zarin-400x400.jpg"], "top_img": "https://www.fame10.com/wp-content/uploads/2016/03/Brooks-Ayers-620x400.jpg", "keywords": [], "authors": ["Katherine G"], "canonical_link": "https://www.fame10.com/entertainment/real-housewives-ranking-the-12-shadiest-significant-others/", "title": "Real Housewives: Ranking The 12 Shadiest Significant Others", "meta_data": {"viewport": "width=1130, maximum-scale=1.0", "description": "Bravo’s most successful franchise is undeniably the Real Housewives reality series. What fans love the most about this show is that many of the women completely open up their lives to viewers, including their sometimes tumultuous love lives. We’ve watched many relationships come and go over the years as the women have dated (or even […]", "fb": {"pages": 412887198817411}, "og": {"url": "https://www.fame10.com/entertainment/real-housewives-ranking-the-12-shadiest-significant-others/", "title": "Real Housewives: Ranking The 12 Shadiest Significant Others", "description": "Bravo’s most successful franchise is undeniably the Real Housewives reality series. What fans love the most about this show is that many of the women completely open up their lives to viewers, including their sometimes tumultuous love lives. We’ve watched many relationships come and go over the years as the women have dated (or even […]", "type": "article", "image": "https://www.fame10.com/wp-content/uploads/2016/03/Brooks-Ayers-620x400.jpg"}, "ob": {"image": "https://www.fame10.com/wp-content/uploads/2016/03/Brooks-Ayers-620x400.jpg"}}, "movies": [], "publish_date": null, "source": "https://www.fame10.com", "summary": ""}