{"url": "https://www.newbeauty.com/blog/dailybeauty/11524-dancing-with-the-stars-jenna-johnson-fitness-tips/", "text": "By Brittany Burhop Fallon, Beauty Director | November 01, 2017\n\nA pro dancer on Dancing With the Stars and So You Think You Can Dance, Jenna Johnson is at the top of her game at just 23 years old. You'd think all she has to do is go to dance practice every day to maintain her incredibly fit physique (have you seen her abs?), but Johnson relies on a strict diet and gym regimen, too, which doesn't come easy. Here, the dancer gets candid with us about her daily routine, her personal struggles and what motivates her to push harder.\n\nYou May Also Like: Pro Dancer Emma Slater Spills Behind-the-Scenes Beauty Secrets From DWTS\n\nMaintain your routine.\n\n\"I know that if I don’t work out in the mornings before my day gets started, I won’t get to the gym at all that day. For me, I have to do it right after I wake up! It gets my day started and helps me to stay motivated for the rest of the day. I typically work out six days a week and give myself Sundays off to rest and recover. I incline walk/run on the treadmill for 40 minutes and then walk the stair master on level 10 for another 10 minutes. My body needs cardio, so I try to sweat as much as possible. After my cardio, I do three sets of 20 push-ups and then 100 crunches on a medicine ball. I don’t like to use weights (I use my own body weight instead) because I don’t want to bulk! But that’s my own body's routine and mentality. Find out what works for you and stick to it so it eventually becomes habit!\"\n\nMy daily workout routine is up on the blog! Go check it out 🏃🏽‍♀️www.getrealwithjen.com #nikewomen #lululemon A post shared by Jenna Johnson (@dance10jenna) on Jan 23, 2017 at 7:30am PST\n\nKnow your weaknesses.\n\n\"I had a hard time admitting to myself that I was addicted to sweets. Once I finally realized that was my vice, I completely cut it out for 30 days to try and clean myself of all processed sugar. After that I slowly incorporated moderate amounts of sugar into my everyday lifestyle. I will definitely treat myself to a sweet treat or dessert, but I am aware that excessive amounts of it are not good for my body. I don’t drink coffee or mounds of caffeine. I’ve learned that my body needs to sip on something throughout the day and I’ve found kombucha is my life saver—it's insanely loaded with probiotics and benefits for my body. Obviously everything in moderation, but try substituting your caffeine intake so you don’t find yourself shutting down during your day.\"\n\nYou May Also Like: I Did the 7-Day Sugar Challenge and It Taught Me Some Surprising Things\n\nDoing a 30 Day No Sugar Challenge! Go check out the blog to follow along 💪🏽 getrealwithjen.com #strongisbeautiful A post shared by Jenna Johnson (@dance10jenna) on Apr 25, 2017 at 7:45am PDT\n\nCompliment yourself!\n\n\"If you’ve been working really hard to stay strict with your nutrition and been hitting the gym often, reward yourself with positivity. It’s hard not to judge yourself if you don’t see results immediately. It’s a process, but a process that is worth the wait.\"\n\nA post shared by Jenna Johnson (@dance10jenna) on Oct 5, 2017 at 6:06pm PDT\n\n\n\nBe conscious of what you eat.\n\n\"I am very conscious of my diet. I am definitely NOT perfect with my nutrition, but I strive to be aware of what I put in my body. For a long time, I would avoiding eating all day and then end up binge eating treats and sugar at night, which is basically the worst thing you can do to your body. This is a period where I ended up gaining a lot of weight. I was completely punishing my body throughout the day by not giving it enough nutrients and substance, and it backfired. This also affected my mental health and made me super depressed and upset with myself. When I hit my most unhealthy point, I reached out to some nutritionists and they helped me balance out a more realistic and healthy diet.\n\nI try to stick to REAL food. What I mean by REAL food is anything that has been grown and not majorly processed. Meats, vegetables (lots of greens), less sugary fruits, good starches and nuts. Believe me, any time chocolate is in a 50-foot radius, I am the first one to grab a piece and eat it! But now I eat everything in moderation, and when I deserve a sweet treat, I allow myself to have it. It’s amazing how when you feel healthy from the inside out, you show it! Once I started getting back on track with my eating routine, everything else started to fall into place! I went from a size 8 to a 4.\"\n\nYou May Also Like: 8 Healthy Snacks With Big Beauty Benefits\n\n\n\n\n\n\n\nKnow and understand your body.\n\n\"Everyone is a different shape and size. I will never be a supermodel. I’m 5’ 4” and have curves...and I love it!! Do NOT compare yourself to others because you are your own person with a unique way of being your best self!\"", "images": ["https://d53l9d6fqlxs2.cloudfront.net/photos/71522-LookYounger2.png.256x195_q80_crop-smart.png", "https://d53l9d6fqlxs2.cloudfront.net/photos/79202-thinhairmainpng.png.204x150_q80_crop-smart.png", "https://d53l9d6fqlxs2.cloudfront.net/photos/21099-beauty2019png.png.204x150_q80_crop-smart.png", "https://d53l9d6fqlxs2.cloudfront.net/photos/14407-birthcontrolherojpg.jpg.204x150_q80_crop-smart.jpg", "https://d53l9d6fqlxs2.cloudfront.net/photos/38347-juliannehoughboxingpng.png.383x305_q80_crop-smart_upscale.png", "https://d53l9d6fqlxs2.cloudfront.net/photos/77225-Screen Shot 2015-08-21 at 2.24.23 PM.png.256x195_q80_crop-smart.png", "https://s3.amazonaws.com/static.newbeauty.com/tt-banner-left-v10.jpg", "https://d53l9d6fqlxs2.cloudfront.net/photos/32264-jennagif.gif.660x0_q80_crop-scale_upscale.jpg", "https://d53l9d6fqlxs2.cloudfront.net/photos/13703-SmootherBlowout.jpg.256x195_q80_crop-smart.jpg", "https://s3.amazonaws.com/static.newbeauty.com/tt-banner-right-v10.jpg", "https://d53l9d6fqlxs2.cloudfront.net/photos/11524-screen-shot-2017-11-01-at-103149-pmpng.png", "https://d53l9d6fqlxs2.cloudfront.net/photos/22436-pcos-1png.png.383x305_q80_crop-smart_upscale.png", "https://d53l9d6fqlxs2.cloudfront.net/photos/97556-heropng.png.204x150_q80_crop-smart.png", "https://d53l9d6fqlxs2.cloudfront.net/photos/32177-78027-katehudson2-1pngpng.png.383x305_q80_crop-smart_upscale.png", "http://b.scorecardresearch.com/p?c1=2&c2=21004701&cv=2.0&cj=1", "https://www.facebook.com/tr?id=1572440699746061&ev=PageView&noscript=1", "https://d53l9d6fqlxs2.cloudfront.net/photos/54779-thumb almonds.jpg.256x195_q80_crop-smart.jpg", "https://d53l9d6fqlxs2.cloudfront.net/photos/70895-hero2png.png.204x150_q80_crop-smart.png"], "top_img": "https://d53l9d6fqlxs2.cloudfront.net/photos/11524-screen-shot-2017-11-01-at-103149-pmpng.png", "keywords": [], "authors": ["Brittany Burhop Fallon"], "canonical_link": "https://www.newbeauty.com/blog/dailybeauty/11524-dancing-with-the-stars-jenna-johnson-fitness-tips/", "title": "DWTS Jenna Johnson Fitness Tips", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "Dancing With the Stars and So You Think You Can Dance, Jenna Johnson shares her fitness and diet tips.", "og": {"title": "How DWTS Pro Dancer Jenna Johnson Dropped 4 Sizes and Maintains Her Fit Physique", "site_name": "NewBeauty", "image": "https://d53l9d6fqlxs2.cloudfront.net/photos/11524-screen-shot-2017-11-01-at-103149-pmpng.png", "url": "https://www.newbeauty.com/blog/dailybeauty/11524-dancing-with-the-stars-jenna-johnson-fitness-tips/", "description": "Have you seen her abs?", "locale": "en_US", "type": "article"}, "fb": {"app_id": 957932114216881}, "twitter": {"card": "summary_large_image", "site": "@NewBeauty", "creator": "@NewBeauty", "title": "5 Things DWTS Pro Dancer Jenna Johnson Does to Maintain Her Fit Physique", "description": "<p>Have you seen her abs?</p>", "image": {"src": "https://d53l9d6fqlxs2.cloudfront.net/photos/32264-jennagif.gif"}}}, "movies": [], "publish_date": 1509508800.0, "source": "https://www.newbeauty.com", "summary": ""}