{"url": "https://www.brides.com/story/pippa-middleton-wedding-dress-details-revealed", "text": "On Saturday, Pippa Middleton will be saying \"I do\" to hedge-fund manager James Matthews , and we will be glued to our phones, TVs, and computer screens, waiting for our first glimpse of the socialite bride-to-be in her gorgeous gown. I mean, obviously it's gotta be gorgeous, right? It just has to be. In fact, we already have a few ideas of just how gorgeous it'll be...\n\nClearly, after watching Middleton take on bridesmaid duties at 2011's Royal Wedding and rock that Alexander McQueen bridesmaids' dress , girlfriend has gotten this whole walking-down-the-aisle thing down pat. But finding a wedding dress that could compete with her older sister's famous Sarah Burton for Alexander McQueen gown definitely sounds like a challenge. But according to the details that have since been revealed about Pippa's wedding dress , this bride has totally conquered it, smartly opting for a frock that's wholly unlike the one the elder Middleton sister chose.\n\nIt's been rumored for some time now that British designer Giles Deacon is the one crafting the bride-to-be's still-top-secret wedding dress, and recently, a source close to the designer's team has let it slip to E! News that the custom gown is \"very simple, elegant, and it's all handmade.\" OMG. You guys, this dress is real! This is all really happening!\n\nSee More: Pippa Middleton Allegedly Wants Wedding Guests to Bring a Second Outfit for the Reception\n\nThe words \"very simple\" are certainly not ones we'd use to describe the Duchess of Cambridge's 2011 wedding dress and its staggering train, but clean elegance definitely sounds like Pippa—and we can't wait to see her rock it.\n\nBut apparently, this dress will remain under lock and key until the big day. \"Very few people have seen the finished thing,\" the source also revealed. Luckily, we won't have to wait too much longer to see this \"simple, elegant\" wedding dress. (The wedding is less than a week away, you guys!)\n\nBut until then, thanks to these dress details, we do have a few predications when it comes to Pippa Middleton's bridal gown. After studying the previous collection of her rumored dress designer Giles Deacon, observing this bride-to-be's sport-chic and classic style, and stalking the latest bridal runway shows, we've rounded up our favorite picks for what Pippa will be wearing come Saturday.\n\nPlace your bets, people!\n\nPinterest Photo by Getty Images\n\nPippa has rocked bateau necklines like this in the past and the simple and sleek bodice on this Giles Deacon SS2013 dress seems to check off all the must-haves of her future wedding dress. Her royal wedding guests might be little scandalized by the bold horse print on the skirt, though... Although we hear polo is very big over there across the pond!\n\nPinterest Photo by Edward James/Indigital.tv\n\nWe think the marathon-running, tennis-playing Pippa would love the sporty short sleeves on this Ines Di Santo Spring 2018 wedding dress. However, the sculpted sheath silhouette, box pleats, and train are classic enough to get even the Queen's stamp of approval.\n\nPinterest Photo by Getty Images\n\nWould Pippa dare to rock a tea-length wedding dress like this Giles Deacon frock? It would definitely set her apart from her famous sis, and it's undeniably sporty-chic—just like the bride-to-be!\n\nPinterest Photo by Getty Images\n\nElegant Pippa would definitely ditch the leopard-print accent on this Giles Deacon runway dress. But the sleek silhouette and neckline are so Pippa. An added cape adds a dash of chicness.\n\nPinterest John Guerrero\n\nIt's hard to resist stealing some style tips from your big sis—especially when she's both fashion and IRL royalty! Although Pippa's dress is said to be fair simpler than that of the Duchess of Cambridge, Middleton could still take a cue from that infamous Sarah Burton for Alexander McQueen gown by combining allover lace and a high neckline with a cleaner, more fitted silhouette like this number from Vera Wang's Spring 2018 collection.\n\nThis Maggie Sottero wedding dress also plays up a trend-setting detail of the Duchess of Cambridge's wedding dress—those long lace sleeves. However, this frock totes a far less stuffy and stiff vibe, by slicing the sleeves into a three-quarter length cut. It seems just up the younger Middleton sis's alley!\n\nPinterest Photo by Getty Images\n\nAnother Giles Deacon -designed dress, this frock has a looser, more bohemian silhouette than our other predications but still totes an elegant effortlessness about that we think Pippa could totally dig. Also, who would be expecting it?!\n\nPinterest Edward James/Indigital.tv\n\nClean simplicity with a royalty formality, this Ines Di Santo wedding dress features a high bateau neckline and a classic sleekness that we think Pippa could definitely say \"I do\" to!", "images": ["https://media.brides.com/photos/5b54b58bf917246158ee8347/1:1/w_125/pusha-t-virginia-ceremony-2.jpg", "https://media.brides.com/photos/5d179c696bc0270009e7347e/1:1/w_125/GettyImages-1141025208.jpg", "https://media.brides.com/photos/58fa4f161fc7a71d2920398f/master/pass/ines-di-santo-wedding-dresses-spring-2018-006.jpg", "https://www.brides.com/images/brides-logo.svg", "https://media.brides.com/photos/5d08dbafa244063ae236ab32/1:1/w_125/GettyImages-1054705592.jpg"], "top_img": "https://media.brides.com/photos/58fa4f161fc7a71d2920398f/master/pass/ines-di-santo-wedding-dresses-spring-2018-006.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.brides.com/story/pippa-middleton-wedding-dress-details-revealed", "title": "Pippa Middleton's Wedding-Dress Details Revealed", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=no, width=device-width, initial-scale=1, maximum-scale=1", "description": "With only about a week to go until the big day, more details about Pippa Middleton's super-secret wedding dress are being revealed.", "og": {"description": "We're less than a three days away, people!", "image": "https://media.brides.com/photos/58fa4f161fc7a71d2920398f/master/pass/ines-di-santo-wedding-dresses-spring-2018-006.jpg", "title": "THIS Is What Pippa Middleton's Wedding Dress Will Look Like", "url": "https://www.brides.com/story/pippa-middleton-wedding-dress-details-revealed", "site_name": "brides", "type": "article"}, "twitter": {"description": "We're less than a three days away, people!", "image": "https://media.brides.com/photos/58fa4f161fc7a71d2920398f/master/pass/ines-di-santo-wedding-dresses-spring-2018-006.jpg?mbid=social_retweet", "title": "THIS Is What Pippa Middleton's Wedding Dress Will Look Like", "url": "https://www.brides.com/story/pippa-middleton-wedding-dress-details-revealed", "card": "summary_large_image", "creator": "@brides", "site": "brides"}, "fb": {"page_id": 50416192591, "admins": "648235154,789168297,688620285"}, "keywords": "Royal Wedding,News,Celebrity Weddings,pippa middleton", "news_keywords": "News & Advice,News & Celebrity,Royal Wedding,News,Celebrity Weddings,pippa middleton"}, "movies": [], "publish_date": null, "source": "https://www.brides.com", "summary": ""}