{"url": "https://www.mother.ly/news/jessica-alba-life-with-3-kids", "text": "When your youngest is almost seven, bringing home a new baby definitely shakes things up. Suddenly you're not only dealing with backpacks and after school schedules, but bottles and sleepless nights, too.\n\n\n\nMom of three Jessica Alba has both school age children and a baby at home these days, and she tells Motherly the decision to add a third child to the family changed her family's dynamics in ways that are sometimes challenging, but mostly amazing.\n\n\"We didn't plan the first two, they were more surprise and delight. The third one was the only one where we were actually like 'let's do this',\" says the 37-year-old actress and Honest Company founder, who shares her three children, 10-year-old Honor, Haven (who will be 7 this month) and baby Hayes with her husband of 10 years, Cash Warren.\n\nJessica Alba on Instagram: “This guy is #6months old -I know I’m like really late posting this gem but... #betterlatethannever #hayesalbawarren #mybigboy ... and…” \"We just love having a family, we love our kids, and we felt like if we wanted to have one more, I was getting to an age where I was like, 'We're either doing this now or we're not going to do it,'\" she tells Motherly, adding that experiencing motherhood for the third time has been a beautiful journey not just for her and Warren, but their daughters, too. \"It's actually been really neat because he's brought us all together in a really sweet way. We all like gush over him as a family a lot,\" Alba explains. The girls spend a lot of time loving on their baby brother, but at their ages they've also got a lot going on outside the family, which is why Alba says the age gap worked out so nicely. \"You know, when they're kids and they're like 7 and 10 they're pretty independent and they have sleepovers and they do their own thing, so it's nice to have a little baby that needs us,\" she says. Adding a third child to the mix obviously means that Alba and Warren's time is even more precious these days than it was before Hayes' arrival, and the couple has taken steps to make sure that each of their daughters gets a share of each parent's time. \"Since we've had him Cash and I have made it a point to spend more one on one time with the girls, so I'll take one and he'll take one for an afternoon and we'll do a little lunch or go on a hike or have a picnic,\" Alba tells Motherly. \"Basically our daughter, whichever one we have, they get to choose whatever they want and they have our undivided attention for that three hours. It's been really special bonding time. We don't do it every weekend but we try to do it at least once a month. And that's been something the kids have really looked forward to and really liked.\"\n\nJessica Alba on Instagram: “Motherhood: it’s a doozy, isn’t it? Your world gets turned completely upside down. Everything you thought you knew about what was important…” Special time with mom and dad is the antidote to a busy bedtime routine, which Alba says has been the most challenging part of moving from two kids to three. \"The baby, I cuddle him to sleep and then each girl wants to be cuddled to go to sleep and then they get jealous if I spend more time with one than the other one, and then they need water always, and then they need more water,\" she explains, \"It's just like this endless cycle nightly.\" Some things (like dealing with the unquenchable thirst that so often affects children only at bedtime) don't get any easier the more kids you have, but other parts of parenting—like figuring out how to balance work schedules and baby schedules—have become a little easier for Alba over the years. She recalls that when the girls were babies she would just bring them to set with her when she was on acting jobs and they would hang in the trailer. The Honest Company was just getting going when her younger daughter, Haven, was a baby, so she joined Alba there, too. Now, it's Hayes' turn to be the office baby at the Honest Company. \"I just cart them along and bring them along with me. It's kind of my way of doing it. I don't know if it's the right way, but it's kind of how I figured it out to try and get those moments in and still feel like I have a presence in their lives,\" she explains. \"I get to bring him to work, and I have in my office a little playmat and a Pack N' Play. He can nap here, and we have a portable high chair.\" Owning your own baby-centric company certainly has its perks, not the least of which is having access to all your own products. The Honest Company is just launching a new, more absorbent diaper with new fall prints, and of course Hayes was the first baby to rock them. \"I have been trying the diapers really since Hayes was born because we had them,\" says Alba, who says that, like her kids, the company has really grown over the last six years and the experience is noticeable in the new diaper designs. \"They're awesome, when it comes to the softness you can really feel the difference.\"\n\nYou might also like:\n\n", "images": ["https://motherly-img.rbl.ms/simage/https%3A%2F%2Fassets.rbl.ms%2F18254861%2F1200x600.jpg/2000%2C2000/hPSORY%2FvcoGKpPbX/img.jpg", "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8xOTYyMDgxNy85ODB4LmpwZyIsImV4cGlyZXNfYXQiOjE1NjM1ODE2MDl9.kixH0fjqpvp1weDMzeBCE3LPLuN_Vqq5TotBaOLHJQM/img.jpg", "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8xOTYyMDgyMi85ODB4LmpwZyIsImV4cGlyZXNfYXQiOjE1NjMzNTg4Mjh9.J2QoMDCq-9KdQ3mAyeGLq6UdI3RrSLajtGwHIhuErnI/img.jpg", "https://s3.amazonaws.com/roar-assets-auto.rbl.ms/motherly/menu.svg", "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8xOTg5MTkzNi85ODB4LnBuZyIsImV4cGlyZXNfYXQiOjE1NjM0OTUwMDV9.sEWQ0GWxN1Mqbw1EDHbBFG-nr89ETShRXekhrQbBp9E/img.png", "http://b.scorecardresearch.com/p?cv=2.0&cj=1&c1=2&c2=24634445&c6=News&c8=Real+talk+with+Jessica+Alba%3A+Bedtime+might+be+the+most+challenging+part+of+having+3+kids", "https://assets.rbl.ms/17529091/2000x.png", "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8xOTYyMDgxNi85ODB4LmpwZyIsImV4cGlyZXNfYXQiOjE1NjMxNzI3NTl9.udRkahJCxoHUVWbbUAzJV0xNNciTrcq2Voqn3-tSV9g/img.jpg", "https://assets.rbl.ms/19247731/2000x.png", "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8xOTYyMDgyNS85ODB4LmpwZyIsImV4cGlyZXNfYXQiOjE1NjMwNDE0Mjl9.3Gc1eZLfVCcHXcmExPUhA5HZkM3P_aQrStY3dMI-Myg/img.jpg", "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8xOTYyMDgyMy85ODB4LmpwZyIsImV4cGlyZXNfYXQiOjE1NjM0NTMzOTR9.wT_JsqIhIqUQSApQTBfXp4TT_af188Q2Nn67wxhTBws/img.jpg", "https://s3.amazonaws.com/roar-assets-auto.rbl.ms/motherly/search.svg"], "top_img": "https://motherly-img.rbl.ms/simage/https%3A%2F%2Fassets.rbl.ms%2F18254861%2F1200x600.jpg/2000%2C2000/hPSORY%2FvcoGKpPbX/img.jpg", "keywords": [], "authors": ["Heather Marcoux", "Motherly", "Primal Kitchen", "Zara", "Emily Glover"], "canonical_link": "https://www.mother.ly/news/jessica-alba-life-with-3-kids-", "title": "Real talk with Jessica Alba: Bedtime might be the most challenging part of having 3 kids", "meta_data": {"twitter": {"card": "summary_large_image", "site": "@", "image": "https://assets.rbl.ms/18254861/1200x600.jpg?1562988050"}, "fb": {"app_id": 886242898213128, "pages": 1595847887360603}, "og": {"type": "article", "url": "https://www.mother.ly/news/jessica-alba-life-with-3-kids-", "site_name": "Motherly", "image": {"identifier": "https://motherly-img.rbl.ms/simage/https%3A%2F%2Fassets.rbl.ms%2F18254861%2F1200x600.jpg/2000%2C2000/hPSORY%2FvcoGKpPbX/img.jpg", "width": 2000, "height": 1000}, "title": "Real talk with Jessica Alba: Bedtime might be the most challenging part of having 3 kids", "description": "She also opens up about the perks of her kids' age gap and what she and husband Cash Warren do to help each child feel special."}, "article": {"section": "News", "publisher": 1595847887360603, "published_time": "2018-08-03T20:43:33+00:00", "modified_time": "2019-02-07T00:00:08+00:00", "author": "https://www.facebook.com/1595847887360603"}, "referrer": "always", "theme-color": "#647187", "viewport": "width=device-width,initial-scale=1,minimum-scale=1.0,maximum-scale=1.0,user-scalable=no", "google-site-verification": "ByQ8lKfVM69ScbQwlIkeZHl2DxxSmRRfTY4gcHmzACE", "keywords": "jessica alba baby, jessica alba diapers, honest company, jessica alba three kids", "description": "Motherly: A lifestyle brand redefining motherhood"}, "movies": [], "publish_date": 1533329013.0, "source": "https://www.mother.ly", "summary": ""}