{"url": "https://www.elitedaily.com/entertainment/celebrity/sarah-hyland-dominic-sherwood-broke-up/2048595", "text": "Another day, another celebrity breakup. According to reports, Sarah Hyland and Dominic Sherwood reportedly broke up after two years of dating. Hyland is one of the stars of ABC's Modern Family and Sherwood is one of the stars of Freeform's Shadowhunters. Fans are wondering: Why did Sarah Hyland and Dominic Sherwood break up? Elite Daily reached out to both Hyland and Sherwood's teams for comment, but did not hear back by time of publication.\n\nAccording to Entertainment Tonight, Hyland and Sherwood's relationship had just run its course. And hey, I get that. Things are good for a while, and then you just realize you're not right for each other. It doesn't mean it was a bad relationship, it's just one that's over. The pair first met when they co-starred in Vampire Academy back in 2014. (Hyland has also had a recurring role on Sherwood's Shadowhunters recently.)\n\nHyland and Sherwood went public with their relationship in March 2015 when they were seen kissing at a Lakers game in Los Angeles. They used to post pictures of each other on their respective Instagrams all the time, but Hyland hasn't posted anything about Sherwood since April 15, and Sherwood hasn't posted anything about Hyland since April 22.\n\nOf course, Instagram posts realistically have nothing to do with the status of any given relationship. But that's just about the only indication we've had that these two were going to call it quits (albeit a very, very small indication). They celebrated their two-year anniversary in Feb. 2017. Hyland posted about the anniversary on Instagram with a caption that read, \"Happy 2 year to my #1 @domsherwood.\"\n\nSherwood talked about his love for Hyland in an interview with ET in Feb. 2017. In the interview, he said,\n\nSarah makes me want to be a better version of myself. That's what I love most about her. She inspires me to be the best version of me.\n\nWhen she joined the cast of Shadowhunters, Sherwood said,\n\nEveryone fell in love with her on set. It was a real joy ... She's been coming in since season one, coming to visit me. Having her on set as an actress was just phenomenal.\n\nAt this point it's unclear why Hyland and Sherwood broke up, but it was wonderful while it lasted!", "images": ["https://imgix.bustle.com/elite-daily/2017/08/18122446/sarah-hyland-dominic-sherwood.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/elite-daily/2017/08/18122446/sarah-hyland-dominic-sherwood.jpg?w=1020&h=574&fit=crop&crop=faces&auto=format&q=70", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif"], "top_img": "https://imgix.bustle.com/elite-daily/2017/08/18122446/sarah-hyland-dominic-sherwood.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/entertainment/celebrity/sarah-hyland-dominic-sherwood-broke-up/2048595", "title": "Why Did Sarah Hyland & Dominic Sherwood Break Up? Couple Reportedly Splits After Two Years", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/entertainment/celebrity/sarah-hyland-dominic-sherwood-broke-up/2048595", "type": "article", "title": "Sarah Hyland And Dominic Sherwood Reportedly Broke Up, So Love Is Dead", "description": "Another day, another celebrity breakup. According to reports, Sarah Hyland and Dominic Sherwood reportedly broke up after two years of dating. Hyland is one of the stars of ABC's Modern Family and Sherwood is one of the stars of Freeform's…", "image": {"identifier": "https://imgix.bustle.com/elite-daily/2017/08/18122446/sarah-hyland-dominic-sherwood.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "Another day, another celebrity breakup. According to reports, Sarah Hyland and Dominic Sherwood reportedly broke up after two years of dating. Hyland is one of the stars of ABC's Modern Family and Sherwood is one of the stars of Freeform's…"}, "movies": [], "publish_date": null, "source": "https://www.elitedaily.com", "summary": ""}