{"url": "https://en.wikipedia.org/wiki/Sara_Haines", "text": "Sara Hilary Haines[1] (born September 18, 1977) is an American television host and journalist, known for her work as a correspondent on Today, ABC News, and Good Morning America. Haines was a co-host of The View for seasons 20 and 21. Haines is the co-anchor of the third hour of Good Morning America, Strahan and Sara, alongside Michael Strahan.\n\nEarly life and education [ edit ]\n\nHaines was born in Newton, Iowa, where she grew up with her parents and three siblings.[1] She attended Smith College in Northampton, Massachusetts, where she received a Bachelor of Arts degree in Government in 2000.[2] At Smith, Haines played basketball and volleyball.[3][4]\n\nCareer [ edit ]\n\nHaines began her career in the NBC Page Program.[2] After nine months in the program,[4] Haines became the production coordinator for NBC's Today at Rockefeller Center in 2002.[1][5] In 2009, Haines became the show's fourth-hour contributing correspondent until she departed in 2013.[5]\n\nIn 2013, Haines became an ABC News correspondent as well as the pop news anchor for the weekend editions of Good Morning America. She left the weekend show in 2016.[6]\n\nAfter multiple appearances as a guest co-host, Haines joined The View as a permanent co-host in the show's twentieth season, which premiered on September 6, 2016.[7] On July 23, 2018, ABC announced that she would be joining GMA with Michael Strahan from September 10, 2018.[8][9][10]\n\nOn the March 18, 2019 episode of the Strahan & Sara Show, Haines characterized St. Patrick's Day as an Irish celebration of \"drinking and public urination\". The comment prompted a backlash from the Irish American community including a statement from the Ancient Order of Hibernians which called for an apology.[11]\n\nPersonal life [ edit ]\n\nOn November 22, 2014, she married Max Shifrin in The Bahamas. The couple resides in Brooklyn.[12] They have two chihuahuas as pets.[13] Their son, Alec Richard Shifrin, was born March 5, 2016.[14] In June 2017, on an episode of The View, Haines announced that the couple was expecting their second child, a daughter,[15] who was born in December of the same year.[16] On January 3, 2019, Sara Haines announced she and her husband are expecting their third child. Her second son was born in June 2019.[17]\n\nHaines is a Christian,[18] but she has not disclosed a specific denomination.\n\nAwards and nominations [ edit ]\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/Sara_Haines_at_Charleston_Air_Force_Base.jpg/1200px-Sara_Haines_at_Charleston_Air_Force_Base.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/Sara_Haines_at_Charleston_Air_Force_Base.jpg/220px-Sara_Haines_at_Charleston_Air_Force_Base.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/Sara_Haines_at_Charleston_Air_Force_Base.jpg/1200px-Sara_Haines_at_Charleston_Air_Force_Base.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Sara_Haines", "title": "Sara Haines", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.11", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/Sara_Haines_at_Charleston_Air_Force_Base.jpg/1200px-Sara_Haines_at_Charleston_Air_Force_Base.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}