{"url": "http://toofab.com/2018/05/02/everything-michael-jackson-said-to-tyler-henry-during-hollywood-medium-reading-with-la-toya-jackson/", "text": "For the season finale of \"Hollywood Medium,\" psychic Tyler Henry connected with the granddaddy of all spirits: Michael Jackson.\n\nThe medium met with La Toya Jackson for the reading, where the musician's untimely death in 2009 was the main topic of conversation for all parties involved.\n\n\"I have had a reading before, and I'm not always a believer,\" Jackson admitted before the reading. \"Because you don't know if they're reading you form information the know or not. I cannot wait to see what he tells me.\"\n\nEven before Henry learned who he'd be doing a reading for, he was getting vibes from the other side, with references to a furry bird sitting on someone's shoulder and someone's premature passing on his way to La Toya's home. Once he found out she was his client for the day, Henry admitted, \"I'm in shock. Today, I was so starstruck, I had to consciously calm myself down, which is normally something I don't have to do.\"\n\nBefore getting to Michael, Henry told La Toya he could sense tension in her neck and throat area, something she confirmed. \"You're right, sometimes my mouth get locked and I can't close it and the tension is always here,\" she explained.\n\n\"There's a lot there. I don't even know where to start. There was a funny joke about someone having a cockatoo,\" Henry said as the reading went on. \"We had one growing up,\" she confirmed. Henry then said he felt someone come through on his drive over, before admitted his did know, \"to some extent,\" how La Toya's brother died.\n\n\"When he came through, I had to focus on every message exactly as he was delivering it. I couldn't make any guesses, I couldn't have any assumptions, I had to make sure that I was communicating exactly what he was showing me so I wasn't biased with what I already knew about the case,\" he explained in a confessional.\n\n\"He's having me acknowledge that when it came to his passing and anyone around right before or right after, there's a feeling of someone's story changing. Someone saying I saw him go through this, this happened and then their story changes abruptly after. There's a very strong emphasis on this,\" Henry told La Toya. \"He's acknowledging that he should not have been left alone at a time when he was left alone. And that's coming in and that's what he's putting a lot of emphasis on. The person who should have been there to monitor wasn't monitoring and it's like, I trusted you to be there, I trusted the role that you were supposed to have to help me and you left. Of all times, you should be right here.\"\n\n\"Did something happen when he was abandoned?\" asked La Toya.\n\n\"It's interesting thing with this. I feel like, when he was abandoned, that would have been an ideal time for him to reach 911, to call for help, to try to get help,\" he continued. \"At this time he realized something was wrong while he was alone and that's when he was conscious and realizing something's wrong here. I just don't feel like he had someone to say hey, I'm having a medical emergency, something's happening. So after I realize, ok there's something wrong going on in here, there's this feeling of oh this medication kicks in. I suddenly become affected by this medicine. And this happens very fast.\"\n\n\"I think what hurts more than anything else is that not only was there a need for someone to be there for him, but there was a trusted person, a person that he trusted, a person that was in that inner circle and that person wasn't there,\" La Toya said after hearing this. \"To hear that, it tears you apart. I wanted to just cry.\"\n\nMichael Jackson passed away at the age of 50 in 2009 after an overdose of propofol. Murray's lawyers tried to argue that Jackson self-administered the drug when Murray was out of the room, but a jury found him negligible and guilty of involuntary manslaughter. Murray spent two years behind bars.\n\n\"Do you know if his story changed? Did he say one thing and then say something different?\" Henry asked La Toya. \"Yeah, stories changed. They change all the time.\" When Henry asked if she knew whether his doctor left the room, she added, \"He did admit that at one point, that he did.\"\n\n\"I don't see anyone coming into his room while he was alone,\" Tyler added.\n\n\"You definitely gave me validation there. I think everyone wants to know really, what truly happened, because none of us knew, there were different stories,\" La Toya responded. \"The stories changed and we wanted to know what the truth is and you've brought closure. We all have the same question, even his children. Thank you for that, I appreciate that.\"\n\n\"There has been so much confusion with that really took place and what happened,\" she continued. \"Whether someone else had come into the room or not was one of the major questions, because that was something that was always spoken. Every member in my family wants to know ... he clarified that.\"\n\nShe then asked if our loved ones are \"our guardian angels sometimes,\" with Henry saying Michael came through as the type of spirit who would totally flicker the lights to let you know he's there. \"I do know that after he passed, the lights were flickering off and on and I would say, Michael, 'Is that you? Mike, is that you?'\"", "images": ["http://secure-us.imrworldwide.com/cgi-bin/m?ci=us-404979h&cg=0&cc=1&ts=noscript", "https://assets.toofab.com/toofab.com/main/default/img/skeleton.svg", "https://toofab.akamaized.net/2018/12/19/newsletter-logo-v2-1.png", "https://ssl-cdn-media.tmz.com/2013/04/26/partner-rss-fox-b-w.png", "http://warnerbros.112.2o7.net/b/ss/wbrostoofab/1/JS-1.5.1--NS/s1563033188?AQB=1&ce=UTF-8&ns=warnerbros&pageName=articles%3Aarticle%3A%3Aeverything-michael-jackson-said-to-tyler-henry-during-hollywood-medium-reading-with-la-toya-jackson&c1=Toofab.us&v1=Toofab.us&c2=article&v2=article&c3=articles&v3=articles&events=event6&AQE=1", "https://ssl-cdn-media.tmz.com/2013/04/26/partner-rss-thestir-logo-cut-v2-1.png", "https://toofab.akamaized.net/2019/04/06/cdl-260x30-for-tmz3-1.png", "https://ll-media.tmz.com/2013/04/26/partner-rsss-justjared-logo-cut-v2.gif", "https://ssl-cdn-assets.tmz.com/www.tmz.com/main/default/cache/images/feedlogo2.v2014_05_09_134122.gif", "https://toofab.akamaized.net/2018/05/02/tyler-henry-1200x630.jpg", "https://toofab.akamaized.net/2017/05/24/tmz-tour-300x250-r01-1.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=3000013&cv=2.0&cj=1", "https://toofab.akamaized.net/2019/04/06/elite-daily-logo-1.png", "https://assets.toofab.com/toofab.com/main/default/img/toofab-logo-white.svg"], "top_img": "https://toofab.akamaized.net/2018/05/02/tyler-henry-1200x630.jpg", "keywords": [], "authors": ["Toofab Staff"], "canonical_link": "https://toofab.com/2018/05/02/everything-michael-jackson-said-to-tyler-henry-during-hollywood-medium-reading-with-la-toya-jackson/", "title": "Everything Michael Jackson Said to Tyler Henry During 'Hollywood Medium' Reading with La Toya Jackson", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "twitter": {"toofab": 116547240, "card": "summary_large_image", "site": "@toofab", "title": "Everything Michael Jackson Said to Tyler Henry During 'Hollywood Medium' Reading with La Toya Jackson", "description": "\"You've brought closure. We all have the same question, even his children,\" says La Toya.", "image": "https://toofab.akamaized.net/2018/05/02/tyler-henry-1200x630.jpg"}, "verify-v1": "Wtpd0N6FufoE2XqopQJoTjWV6Co/Mny9BTaswPJbPPA=", "msvalidate.01": "AFEB17971BCF30779AEA662782EF26F4", "y_key": "14cb04e4656b0c58", "description": "\"You've brought closure. We all have the same question, even his children,\" says La Toya.", "robots": "index,follow", "referrer": "unsafe-url", "og": {"url": "https://toofab.com/2018/05/02/everything-michael-jackson-said-to-tyler-henry-during-hollywood-medium-reading-with-la-toya-jackson/", "site_name": "toofab", "type": "article", "title": "Everything Michael Jackson Said to Tyler Henry During 'Hollywood Medium' Reading with La Toya Jackson", "description": "\"You've brought closure. We all have the same question, even his children,\" says La Toya.", "image": "https://toofab.akamaized.net/2018/05/02/tyler-henry-480x360.jpg"}, "fb": {"app_id": 116046798441464, "pages": 324392354652}, "article": {"publisher": "https://www.facebook.com/TooFab"}}, "movies": [], "publish_date": 1525233600.0, "source": "http://toofab.com", "summary": ""}