{"url": "https://en.wikipedia.org/wiki/Me_Too_movement", "text": "Not to be confused with MeTwo movement\n\n#MeToo does not redirect here due to technical restrictions\n\nA movement against sexual harassment and assault\n\nThe Me Too movement (or #MeToo movement), with a large variety of local and international alternative names, is a movement against sexual harassment and sexual assault.[1][2][3] The movement began to spread virally in October 2017 as a hashtag on social media in an attempt to demonstrate the widespread prevalence of sexual assault and harassment, especially in the workplace.[4][5][6] It followed sexual-abuse allegations against Harvey Weinstein.[7][8] Tarana Burke, an American social activist and community organizer, began using the phrase \"Me Too\" as early as 2006, and the phrase was later popularized by American actress Alyssa Milano on Twitter in 2017. Milano encouraged victims of sexual harassment to tweet about it and \"give people a sense of the magnitude of the problem\".[9][10] A number of high-profile posts and responses from American celebrities Gwyneth Paltrow,[11] Ashley Judd,[12] Jennifer Lawrence,[13] and Uma Thurman, among others, soon followed.[14]\n\nOrigins\n\n2006 (Tarana Burke)\n\nTarana Burke, a social activist and community organizer, began using the phrase \"Me Too\" in 2006, on the Myspace social network[15] in order to promote \"empowerment through empathy\" among women of color who have been sexually abused.[10][16][17] Burke, who is creating a documentary titled Me Too, has said she was inspired to use the phrase after being unable to respond to a 13-year-old girl who confided to her that she had been sexually assaulted. Burke said she later wished she had simply told the girl, \"Me too\".[15]\n\n2016: Russia and Ukraine (Anastasia Melnichenko)\n\nIn July 2016, a social media post by Ukrainian journalist Anastasia Melnichenko went viral. Thousands of women, and some men, in Russia and Ukraine began posting their personal stories of sexual harassment and assault on social media using the hashtag #IAmNotAfraidToSpeak (‪#‎яНеБоюсьСказати‬ in Ukrainian; #‎яНеБоюсьСказать in Russian).[18][19][20][21]\n\n2017 (Alyssa Milano)\n\nFollowing widespread exposure of accusations of predatory behavior by Harvey Weinstein, and her own blog post on the subject, on October 15, 2017, actress Alyssa Milano encouraged spreading the hashtag #MeToo, to attempt to draw attention to sexual assault and harassment.[10][22] Milano later acknowledged earlier use of the phrase by Burke.[15] Milano credits her identification with the Me Too movement to being personally affected by sexual harassment during a concert when she was 19.[23]\n\nSeveral hashtags related to sharing stories of workplace sexual harassment were in use before #MeToo, including #MyHarveyWeinstein, #YouOkSis, #WhatWereYouWearing and #SurvivorPrivilege.[24][25][26]\n\nImpact\n\nUS media and fashion industries\n\nThe phrase \"Me too\" was tweeted by Milano around noon on October 15, 2017, and had been used more than 200,000 times by the end of the day,[27] and tweeted more than 500,000 times by October 16.[28] On Facebook, the hashtag was used by more than 4.7 million people in 12 million posts during the first 24 hours.[29] The platform reported that 45% of users in the United States had a friend who had posted using the term.[30]\n\nTens of thousands of people, including hundreds of celebrities, replied with #MeToo stories.[31] Some men, such as actors Terry Crews[32] and James Van Der Beek,[33] have responded to the hashtag with their own experiences of harassment and abuse. Others have responded by acknowledging past behaviors against women, spawning the hashtag #HowIWillChange.[34]\n\nIn addition to Hollywood, \"Me Too\" declarations elicited discussion of sexual harassment and abuse in the music industry,[35] sciences,[36] academia,[37] and politics.[38]\n\nFeminist author Gloria Feldt stated in Time that many employers are being forced to make changes in response to #MeToo, for example examining gender-based pay differences and improving sexual harassment policies.[39] Others have noted there has been pressure on companies, specifically in the financial industry, to disclose diversity statistics.[40]\n\nIn January 2019, actress Emma Thompson pulled out of the production \"Luck\" based on the production company's decision to hire former Disney Chief Creative Officer John Lasseter. Lasseter had been accused of harassing women while at Disney.[41] Thompson wrote a letter in February 2019 to the American production company Skydance, to explain her reasons for leaving \"Luck\". Among others, Thompson stated: \"If a man has been touching women inappropriately for decades, why would a woman want to work for him if the only reason he’s not touching them inappropriately now is that it says in his contract that he must behave “professionally”?.[42]\n\nThe 2019 rerelease of Toy Story 2 had a blooper scene during the credits removed due to sexual misconduct concerns.[43]\n\nChurches\n\nIn November 2017, the hashtag #ChurchToo was started by Emily Joy and Hannah Paasch on Twitter and began trending in response to #MeToo as a way to try to highlight and stop sexual abuse that happens in a church.[44][45] In early January 2018, about a hundred evangelical women also launched #SilenceIsNotSpiritual to call for changes to how sexual misconduct is dealt within the church.[46][47] #ChurchToo started spreading again virally later in January 2018 in response to a live-streamed video admission by Pastor Andy Savage to his church that he sexually assaulted a 17-year-old girl twenty years before as a youth pastor while driving her home, but then received applause by his church for admitting to the incident and asking for forgiveness. Pastor Andy Savage then resigned from his staff position at Highpoint Church and stepped away from ministry.[48][49][50] Many have argued that one of the biggest crises in the history of the Catholic Church is the current child sexual abuse that is being reported, according to Tom Inglis in his book Are the Irish Different?.[51]\n\nEducation\n\nThe University of California has been no stranger to sexual harassment, with substantial accusations reported yearly in the hundreds at all nine UC campuses, notably UC Berkeley, Davis, Irvine, Los Angeles, and San Diego.[52] However, a landmark event at the University of California, Irvine spearheaded the removal and reprimand of several campus officials and professors accused of sexual harassment and discrimination. In early July 2018, UC Irvine removed millionaire benefactor Francisco J. Ayala's name from its biology school, central science library, graduate fellowships, scholar programs, and endowed chairs after an internal investigation substantiated a number of sexual harassment claims. The results from the investigation were compiled in a 97-page report, which included testimony from victims enduring Ayala's harassment for 15 years.[53][54][55][56][57][58][59] His removal promptly sparked the removal of Professor Ron Carlson in August 2018, who had led the creative writing program at UC Irvine. He resigned after substantiated reports of sexual misconduct with an underage student were unearthed.[60] UC Irvine upon learning about the report accepted Professor Carlson's immediate resignation.[61] Additionally, four additional professors in the School of Biological Sciences at UC Irvine between June and August 2018 were put under sanctions or terminated for violating the UC Policy on Sexual Harassment including Thomas A. Parham, former vice chancellor at UC Irvine and former president of the Association of Black Psychologists.[62]\n\nTo address harassment within scientific settings, BethAnn McLaughlin started the #MeTooSTEM movement and hashtag.[63] She called for the National Institutes of Health to cut funding to anyone who has been found guilty of harassment charges.[63][64] McLaughlin shared the MIT Media Lab Disobedience Award with Tarana Burke and Sherry Marts for her work on Me Too in STEM.[65][66]\n\nThere are still many places of education such as high schools, however, where legal intervention is not readily enforced for situations where sexual assault takes place. Pamela Y. Price in her book Directions in Sexual Harassment Law describes how \"a major argument for why [laws against] sexual harassment won't work in education is that issues of sexuality can't be regulated (similar to the debate in employment) or that adolescent behavior is too unpredictable to be legally controlled\" (Price 62).[67]\n\nFinance\n\nIt has been noted that, although the financial industry is known to have a wide prevalence of sexual harassment,[68] as of January 2018, there were no high-profile financial executives stepping down as the result of #MeToo allegations.[69] The first widely covered example of concrete consequences in finance was when two reporters, including Madison Marriage of the Financial Times, went undercover at a men-only Presidents Club event meant to raise money for children. Because women were not allowed to attend except as \"hostesses\" in tight, short black dresses with black underwear, Financial Times reporter Madison Marriage and another reporter got jobs as hostesses and documented widespread sexual misconduct. As a result, The Presidents Club was shut down.[69]\n\nIn March 2018, Morgan Stanley broker Douglas E. Greenberg was put on administrative leave after a New York Times story outlined harassment allegations by four women, including multiple arrests for the violation of restraining orders, and a threat to burn down an ex-girlfriend's house. It has been called the #MeToo moment of Portland's financial service industry.[70]\n\nIt has been noted in discussion of #MeToo in finance that only about a quarter of top positions are held by women at several major banks, and there is evidence there may be wide disparities in some financial institutions between how much men and women are paid on average.[40]\n\nThe authors of a December 2018 Bloomberg News article on this topic interviewed more than thirty senior Wall Street executives and found that many are now more cautious about mentoring up and coming female executives because of the perceived risks involved. One said, \"If men avoid working or traveling with women alone, or stop mentoring women for fear of being accused of sexual harassment, those men are going to back out of a sexual harassment complaint and right into a sex discrimination complaint.\"[71]\n\nPolitics and government\n\nStatehouses in California, Illinois, Oregon, and Rhode Island responded to allegations of sexual harassment surfaced by the campaign,[72] and several women in politics spoke out about their experiences of sexual harassment, including United States Senators Heidi Heitkamp, Mazie Hirono, Claire McCaskill and Elizabeth Warren.[38] Congresswoman Jackie Speier has introduced a bill aimed at making sexual harassment complaints easier to report on Capitol Hill.[73] The accusations in the world of Spanish politics have also been published in the media,[74] and a series of allegations and research on MPs and political figures of (all major British political parties) regarding sexual impropriety became a nationwide scandal in 2017; this research was undertaken in the aftermath of the Weinstein scandal and the Me Too movement.[75][76][77]\n\nDetective Leslie Branch-Wise of the Denver Police Department spoke publicly for the first time in 2018 about experiencing sexual harassment by Denver Mayor Michael B. Hancock. The detective provided sexually suggestive text messages from Hancock sent to her while working for Hancock's security detail in 2012. After six years of keeping the secret, Detective Branch-Wise credited the Me Too movement as an inspiration to share her experience.[78]\n\nCongressman John Conyers was the first sitting United States politician brought down in the wake of #metoo.[79][80][81]\n\nME TOO bill in the US Congress\n\nJackie Speier proposed the Member and Employee Training and Oversight on Congress Act (ME TOO Congress Act) on November 15, 2017.[82] The full language of the bipartisan bill was revealed by the House on January 18, 2018 as an amendment to the Congressional Accountability Act of 1995.[83] The purpose of the bill is to change how the legislative branch of the U.S. federal government treats sexual harassment complaints. Under the old system, complaints regarding the legislative branch were channeled through the Office of Compliance, which required complete confidentially through the process and took months of counseling and mediation before a complaint could actually be filed. Any settlement payments were paid using federal taxes, and it was reported that within a decade, $15 million of tax money had been spent settling harassment and discrimination complaints. The bill would ensure future complaints could only take up to 180 days to be filed. The bill would also allow the staffers to transfer to a different department or otherwise work away from the presence of the alleged harasser without losing their jobs if they requested it. The bill would require Representatives and Senators to pay for their own harassment settlements. The Office of Compliance would no longer be allowed to keep settlements secret, and would be required to publicly publish the settlement amounts and the associated employing offices. For the first time, the same protections would also apply to unpaid workers, including pages, fellows and interns.[84][85][86]\n\nSports\n\nSoon after #MeToo started spreading in late 2017, several allegations from a 2016 Indianapolis Star article resurfaced in the gymnastic industry against former U.S. Gymnastics doctor Larry Nassar of Michigan State University. Nassar was called out via #MeToo for sexually assaulting gymnasts as young as 6 years old during \"treatments\".[87] Rachael Denhollander was the first to call him out.[88] Though nothing was done after the initial allegations came out in 2016, after more than 150 women came forward, Nassar was effectively sentenced to life in prison. The president of Michigan State University, Lou Anna Simon, resigned in the wake of the scandal.[87]\n\nAt around the same time, WNBA star Breanna Stewart publicly revealed that she had been a victim of child sexual abuse from age 9 to 11.[89]\n\nIn late November 2017, Lui Lai Yiu, a hurdler from Hong Kong, recounted in a Facebook post instances of having been sexually assaulted by her male coach when she was 14, sparking off mass controversy in Hong Kong.[90] Her coach was arrested in late January 2018,[91] but acquitted in mid-November 2018.[92]\n\nIn 1996, while attending the University of Tennessee, former American football player Peyton Manning was accused of sexual assault by trainer Jamie Ann Naughright after he pressed his genitals against Naughright's face during a foot examination. Manning claims that he was just pulling a prank by \"mooning\" another athlete in the room as Naughright bent over to examine him. Both Naughright and the other athlete deny Manning's story. Naughright settled with the university for $300,000 for its alleged failure in four incidents, and resigned from the school. She had initially made a list of 33 complaints about the school.[93] Naughright filed a defamation lawsuit against Peyton Manning and three other parties in 2002. Manning defamed her in a book he wrote with his father and author John Underwood. The lawsuit was settled after the court ruled there was sufficient evidence for it to be heard by a jury. Terms of the settlement were not disclosed due to confidentiality terms.[94][95]\n\nMedicine\n\nMeToo has encouraged discussion about sexual harassment in the medical field.[96][97][98] Research had indicated that among U.S. academic medical faculty members, about 30% of women and 4% of men have reported experiencing sexual harassment, and it has been noted that medical staff who complain often receive negative consequences to their careers.[99][98] Other evidence has indicated 60% of medical trainees and students experienced harassment or discrimination during training, though most do not report the incidents.[96]\n\nMusic\n\nIn 2017, before the Me Too Movement, Jessie Reyez released a song called “Gatekeeper,” recounting her real-life experience of sexual harassment by a famous producer. This song has inspired many female artists in the music industry to speak up against sexual harassment, contributing to the start of the Me Too movement.[100] \"Gatekeeper\" depicts a dialogue of a man abusing his power on a young woman working hard in the music industry, reacting Jessie Reyez's harassing incident in her early career.[101]\n\nActress Alyssa Milano was personally affected by sexual harassment when she was young during a concert. Ever since this experience, Alyssa has become a spokesperson of bringing awareness towards the MeToo movement.[102] In 2017, the actress had also contributed by starting a twitter thread that stated \"If any women who have been sexually harassed..wrote 'Me Too.' as a status, we might give people a sense of magnitude of the problem.\" This twitter thread instantly went viral, with multiple people around the world sharing their stories and retweeting along with musicians such as Sheryl Crow, Lady Gaga, who contributed their own personal experiences. By creating a twitter thread that allowed victims of sexual harassment share their stories, people are able to recognize that this issue should not be taken lightly.[103]\n\nJasmine Power along with Amanda Palmer have composed the song \"Mr.Weinstein Will See You Now\". \"With this song, Power and Palmer both hope that this personal topic will bring awareness towards MeToo. Listeners are able to connect with this song on a personal level through the power of the lyrics as well as the musician's powerful emotions. \" that walks listeners through a story of a woman being \"invited to the office of a man in power.\" The musicians were inspired by the scandal that happened in 2017 where Harvey Wienstein was reported for sexual assault. The music video included a all woman cast, and revenue made from the music video was donated to #TimesUp, a movement against sexual harassment.[104] With this song, Power and Palmer both hope that this personal topic will bring awareness towards MeToo. Listeners are able to connect with this song on a personal level through the power of the lyrics as well as the musician's powerful emotions. [105]\n\nIn the music industry, the band Veruca Salt used the #MeToo hashtag to air allegations of sexual harassment against James Toback,[106] and Alice Glass used the hashtag to share a history of alleged sexual assault and other abuses by former Crystal Castles bandmate Ethan Kath.[107][108]\n\nHalsey's poem \"A Story Like Mine,\" in which she told personal stories of sexual assault and violence throughout her life included accompanying her best friend to Planned Parenthood after she had been raped, her personal account of sexual assault by neighbors and boyfriends, and women sexually assaulted by Olympic doctor Larry Nassar.[109][110]\n\nIn November 2018, Cleveland, Ohio radio station WDOK Star 102 announced that it had removed the song Baby, It's Cold Outside from its playlist due to its lyric content, based on listener input, \"amid the #MeToo movement.\"[111]\n\nRemoval of Music\n\nAfter gaining momentum in these various songs and tweets made by celebrities, the Me Too movement has gained recognition in radio stations ad streaming services. Like an Ohio radio station's removal of the song \"Baby it's Cold Outside\", a song alleged to be in support of sexual abuse, other streaming services have started to remove music created by alleged or convicted sexual abusers, such a Spotify's temporary ban on music by XXXTentacion and R. Kelly. Though Spotify did reverse this ban in June, the #MuteRKelly movement was already established with the intent of boycotting R. Kelly's music, so the ban actually did have an impact and helped raise awareness about alleged sexual abusers and the MeToo Movement.[100]\n\nOngoing Allegations Against Figures in the Music Industry\n\nEarly January 2019, the Lifetime documentary Surviving R. Kelly aired, broadcasting several women's accusations of sexual, emotional, mental, and physical abuse by singer R. Kelly. The documentary increased awareness of predatory figures in the music industry and questioned the leniency given to prominent musicians and producers.[112] In February 2019, Kelly was arrested for 10 counts of sexual abuse with 4 women, 3 of which were minors at the time of the incidents.[113] His former wife Andrea Kelly has also accused him of domestic violence and filed a restraining order against him in 2005.[114]\n\nIn the lawsuit of Kesha v. Dr. Luke, Kesha accused Dr. Luke for sexually, physically, and emotionally abuse her since the beginning of her music career. Although the allegations were denied, many Kesha's supporters and fellow artists demanded her release from the contract on social media, leading to the #FreeKesha movement. At the 2018 Grammys, Kesha performed her song “Praying” to encourage sexual assault survivors that the world can improve, responding to the Me Too Movement.[115]\n\nA documentary was also instrumental in publicizing accusations in the case of late singer Michael Jackson. Child sexual abuse allegations against Jackson were renewed after the airing of the documentary Leaving Neverland in 2019. The documentary focuses on Wade Robson and James Safechuck and their interactions with Jackson, especially the sexual interactions they claim to have endured for years during their childhood.[116] Both had previously testified in Jackson's defense — Safechuck as a child during the 1993 investigation, Robson both as a child in 1993 and as a young adult in 2005.[117][118] In 2015, Robson's case against Jackson's estate was dismissed on the grounds of being filed too late. [119][120][121]The documentary resulted in a backlash against Jackson and a reassessment of his legacy in some quarters, while some viewers dismissed it as one-sided, questioned the veracity and viewed it as unconvincing due to conflicting facts between the film and Jackson's 1993 and 2005 allegations, trial and acquittal.[122]\n\nSocial Justice and Journalism\n\nEventually, the Me Too Movement became analyzed under a journalistic viewpoint, as writers and editors began to push the movement into larger news networks and labor sectors. Particularly, Sarah Lyons, who wrote “Hands Off Pants On,” illustrated the importance of allowing an open space for victims of sexual assault in the work place to heal.[123] Further, the article also revealed the creation of the campaign, “UNITE HERE,” which has a driving goal to protect women who felt threatened by sharing their stories and creating devices to stop assault before it happens.\n\nAnother scope that is critical to understand in order to lift up survivors of sexual violence is that of the legal system. In Sarah Jaffe's article, she analyzed victims thought the extent to which they are forced to follow through with police departments, and they (possibly) the court systems.[124] This path is currently struggling, and was constructed to fail those who need assistance the most.\n\nMilitary\n\nIn the wake of #MeToo, #MeTooMilitary came to be used by service men and women who were sexually assaulted or harassed while in the military,[125] appearing on social media in January 2018 the day after remarks by Oprah Winfrey at the Golden Globe Awards honoring female soldiers in the military \"whose names we'll never know\" who have suffered sexual assault and abuse in order to make things better for women today.[126]\n\nA report from the Pentagon indicated that 15,000 members of the military reported being sexually assaulted in the year 2016 and only 1 out of 3 people assaulted actually made a report.[127] Veteran Nichole Bowen-Crawford has said the rates have improved over the last decade, but the military still has a long way to go, and recommends that women veterans connect privately on social media to discuss sexual abuse in a safe environment.[126][128]\n\nThere was a \"#MeTooMilitary Stand Down\" protest, organized by Service Women's Action Network, which gathered at the Pentagon on January 8, 2018. The protest was endorsed by the U.S. Department of Defense, who stated that current service members were welcome to attend as long as they did not wear their uniform.[129][130][131] The protest supported the Military Justice Improvement Act, sponsored by Senator Kirsten Gillibrand, which would move \"the decision over whether to prosecute serious [sex] crimes to independent, trained, professional military prosecutors, while leaving uniquely military crimes within the chain of command\".[130]\n\nPornography\n\nThere have been discussions about how pornography is related to the emergence of the #MeToo movement, and what changes, if any, should be made to the porn industry in response.[132][133] The deaths of five female porn actresses during the first three months of 2018 inspired demands that workers in the industry be included as part of the #MeToo movement.[134] It has been pointed out that many women and men have been sexually assaulted on set.[135] Some high-profile pornographic performers have been accused of assault since the emergence of #MeToo, including James Deen and Ron Jeremy.[134][136][137] The porn industry has overall been supportive of #MeToo, with the topics of harassment and bodily autonomy being addressed at the 2018 AVN Awards.[138] There have been calls for the industry to police itself better in the wake of #MeToo.[135] However, when gay actor Tegan Zayne accused fellow actor Topher DiMaggio of rape in a #MeToo post, and four other men came forward with their own allegations of sexual misconduct against DiMaggio, very little happened and there was no official investigation.[139]\n\nSeveral groups of Christians, conservative women, and radical feminists have argued that #MeToo demonstrates pornography causes women to be viewed as sexual objects and contributes to the prevalence of sexual harassment. As a result, these groups believe the production and consumption of pornography should be greatly restricted or made illegal.[132]\n\nOther social advocates and feminists have responded by pointing out that attempts to suppress pornography in the U.S. have historically never been effective at reducing consumption. They note that porn consumption in the U.S. is currently at what is likely the highest levels in history, but overall levels of sexual violence and rape are far lower today than when the anti-pornography movement in the U.S. first emerged during the 1960s. Additionally, many feminists argue that laws which make pornography illegal only further restrict women as far what they are and are not allowed to do with their bodies.[132]\n\nMany feminists have stated that pornography can be empowering or enjoyable for women and depicting female sexuality is not always objectification.[132][140] Others point out that a lot of porn is made by women and for women.[141] Award-winning porn actress and director Angela White says there is a \"large positive shift within the industry\" to more women directing and producing their own content and \"to represent women as powerful sexual beings.\"[134] Anti-porn activist Melissa Farley has said this ignores the \"choicelessness\" faced by many actresses in porn.[132] Liberal advocates argue that anti-pornography movements in the U.S. have historically never tried to increase choices for vulnerable adult performers, and taking away a person's right to act in porn may hurt them economically by reducing their choices. Many adult performers have stated that the social stigma surrounding their type of work is already a major barrier when they're seeking help, and making porn illegal would leave them few options if they are suffering from sexual abuse.[134]\n\nAs a result of #MeToo, many adult performers, sex worker advocates and feminists have called for greater protections for pornographic actresses, for example reducing social stigmas, mandating training courses that teach performers their rights, and providing access to independent hotlines where performers can report abuse. They argue that making porn illegal would only cause the production of porn to go underground where there are even fewer options for help. Some liberal activists have argued to compromise by raising the legal age of entry into adult entertainment from 18 to 21, which would prevent some of the most vulnerable women from being taken advantage of, while allowing adult women to still do what they want with their own bodies.[134]\n\nSome have pointed out that many young people who do not receive a sex education adopt ideas about sex and sexual roles from pornography, whose fantasy depictions of those behaviors are not accurate to life, as they are designed for purposes of adult entertainment, and not educating the public on the reality of sexual behavior.[142] Some areas of the United States teach birth-control methods only by abstinence from sex. In a 2015 article for the American Journal of Nursing David Carter noted that a study found that abstinence based education was \"correlated with increases in teenage pregnancies and births\". Multiple people have voiced support for comprehensive sex education programs that encompass a wide range topics, which they state leave children more informed.[143] Several feminists have argued it is crucial to provide children with basic sex education before they are inevitably exposed to porn. Sex education can also effectively prepare children to identify and say no to unwanted sexual contact before it occurs, and gives parents an opportunity to teach children about consent.[144]\n\nAstronomy\n\nThe #astroSH twitter tag was used to discuss sexual harassment in the field of Astronomy, and several scientists and professors resigned or were fired.[145][146][147][148]\n\nPurpose\n\nThe original purpose of \"Me Too\" as used by Tarana Burke in 2006 was to empower women through empathy, especially young and vulnerable women. In October 2017, Alyssa Milano encouraged using the phrase as a hashtag to help reveal the extent of problems with sexual harassment and assault by showing how many people have experienced these events themselves.[15][22]\n\nAfter millions of people started using the phrase, and it spread to dozens of other languages, the purpose changed and expanded, and as a result, it has come to mean different things to different people. Tarana Burke accepts the title of \"leader\" of the movement, but has stated that she considers herself more of a \"worker.\" Burke has stated that this movement has grown to include both men and women of all colors and ages, as it continues to support marginalized people in marginalized communities.[149][150] There have also been movements by men aimed at changing the culture through personal reflection and future action, including #IDidThat, #IHave, and #IWill.[151]\n\nAwareness and empathy\n\nAnalyses of the movement often point to the prevalence of sexual violence, which has been estimated by the World Health Organization to affect one-third of all women worldwide. A 2017 poll by ABC News and The Washington Post also found that 54% of American women report receiving \"unwanted and inappropriate\" sexual advances with 95% saying that such behavior usually goes unpunished. Others state that #MeToo underscores the need for men to intervene when they witness demeaning behavior.[152][153][154]\n\nBurke said that #MeToo declares sexual violence sufferers are not alone and should not be ashamed.[155] Burke says sexual violence is usually caused by someone the woman knows, so people should be educated from a young age that they have the right to say no to sexual contact from any person, even after repeat solicitations from an authority or spouse, and to report predatory behavior.[156] Burke advises men to talk to each other about consent, call out demeaning behavior when they see it and try to listen to victims when they tell their stories.[156]\n\nAlyssa Milano described the reach of #MeToo as helping society understand the \"magnitude of the problem\" and said, \"it's a standing in solidarity to all those who have been hurt.\"[157][158] She stated that the success of #MeToo will require men to take a stand against behavior that objectifies women.[159]\n\nPolicies and laws\n\nBurke has stated the current purpose of the movement is to give people the resources to have access to healing, and to advocate for changes to laws and policies. Burke has highlighted goals such as processing all untested rape kits, re-examining local school policies, improving the vetting of teachers, and updating sexual harassment policies.[160] She has called for all professionals who work with children to be fingerprinted and subjected to a background check before being cleared to start work. She advocates for sex education that teaches kids to report predatory behavior immediately.[156] Burke supports the #MeToo bill in the US Congress, which would remove the requirement that staffers of the federal government go through months of \"cooling off\" before being allowed to file a complaint against a Congressperson.[160]\n\nMilano states that a priority for #MeToo is changing the laws surrounding sexual harassment and assault, for example instituting protocols that give sufferers in all industries the ability to file complaints without retaliation. She supports legislation making it difficult for publicly traded companies to hide cover-up payments from their stockholders and would like to make it illegal for employers to require new workers to sign non-disclosure agreements as a condition of employment.[159] Gender analysts such as Anna North have stated that #MeToo should be addressed as a labor issue due to the economic disadvantages to reporting harassment. North suggested combating underlying power imbalances in some workplaces, for example by raising the tipped minimum wage, and embraces innovations like the \"portable panic buttons\" that are mandated for hotel employees in Seattle.[161]\n\nOthers have suggested that barriers to employment must be removed, such as the job requirement by some employers to sign non-disclosure agreements or other agreements that prevent an employee from talking about their employment publicly, or taking disputes (including sexual harassment claims) to arbitration rather than to legal proceedings. It's been suggested that legislation should be passed that bans these types of mandatory pre-employment agreements.[1]\n\nSome policy-based changes that have been suggested include increasing managerial oversight; creating clear internal reporting mechanisms; more effective and proactive disciplinary measures; creating a culture that encourages employees to be open about serious problems;[1] imposing financial penalties for companies that allow workers to remain in their position when they have repeatedly sexually harassed others; and forcing companies to pay huge fines or lose tax breaks if they decide to retain workers who are sexual harassers.[162]\n\nMedia coverage\n\nIn the coverage of #MeToo, there has been widespread discussion about the best way for sufferers of sexual abuse or harassment to stop what is happening to them at work. There is general agreement that a lack of effective reporting options is a major factor that drives unchecked sexual misconduct in the workplace.[163]\n\nFalse reports of sexual assault are rare but when they happen, they are put in the spotlight for the public to see. The media does this to portray the image that the majority of the reported sexual assaults are falsely reported by women. However, falsely reported sexual assaults only make up 2%–10% of the total number that are reported. This does not even take into account the number of women that still do not report their stories. This is yet another reason why women are scared to report their experiences with sexual assault because they are afraid that no one will ever believe their story and in the process they will have embarrassed and humiliated themselves.[164][165]\n\nIn France, a person who makes a sexual harassment complaint at work is reprimanded or fired 40% of the time, while the accused person is typically not investigated or punished.[166] In the United States, a 2016 report from the Equal Employment Opportunity Commission states that although 25–85% of women say they experience sexual harassment at work, few ever report the incidents, most commonly due to fear of reprisal.[163] There is evidence that in Japan, as few as 4% of rape victims report the crime, and the charges are dropped about half the time.[167][168]\n\nThere is a discussion on the best ways to handle whisper networks, or private lists of \"people to avoid\" that are shared unofficially in nearly every major institution or industry where sexual harassment is common due to power imbalances, including government, media, news, and academia. These lists have the stated purpose of warning other workers in the industry and are shared from person-to-person, on forums, in private social media groups, and via spreadsheets. However, these lists can become \"weaponized\" and used to spread unsubstantiated gossip, which has been discussed widely in the media.[169]\n\nDefenders say the lists provide a way to warn other people in the industry if worried about punishment, or if complaints have already been ignored, and also helps victims identify each other so they can speak out together.[169][170] Sometimes these lists are kept for other reasons, for example, a spreadsheet from the United Kingdom called \"High Libido MPs\" and dubbed \"the spreadsheet of shame\" was created by a group of male and female parliamentary researchers, and contained a list of allegations against nearly 40 Conservative MPs in the British Parliament. It is also rumored that party whips (who are in charge of getting members of Parliament to commit to votes) maintain a \"black book\" that contains allegations against several lawmakers that can be used for blackmail.[171][172][173] When it is claimed a well-known person's sexual misconduct was an \"open secret\", these lists are often the source.[169] In the wake of #MeToo, several private whisper network lists have been leaked to the public.[169][170]\n\nIn India, a student gave her friends a list containing names of professors and academics in the Indian university system to be avoided. The list went viral after it was posted on social media.[174] In response to criticism in the media, the authors defended themselves by saying they were only trying to warn their friends, had confirmed every case, and several victims from the list were poor students who had already been punished or ignored when trying to come forward.[175][176] Moira Donegan, a New York City-based journalist, privately shared a crowd-sourced Shitty Media Men list of people to avoid in publishing and journalism. When it was shared outside her private network, Donegan lost her job. Donegan stated it was unfair so few people had access to the list before it went public; for example, very few women of color received access (and therefore protection) from it. She pointed to her \"whiteness, health, education, and class\" that allowed her to take the risk of sharing the list and getting fired.[170]\n\nThe main problem with trying to protect more potential victims by publishing whisper networks is determining the best mechanism to verify allegations in a way that is fair to all parties.[177][178] Some suggestions have included strengthening labor unions in vulnerable industries so workers can report harassment directly to the union instead of to an employer. Another suggestion is to maintain industry hotlines which have the power to trigger third-party investigations.[177] Several apps have been developed which offer various ways to report sexual misconduct, and some of these apps also have the ability to connect victims who have reported the same person.[179]\n\nIssues with social norms\n\nIn the wake of #MeToo, many countries such as the U.S.,[180] India,[181] France,[182] China,[183] Japan,[167] and Italy,[184] have seen discussion in the media on whether cultural norms need to be changed for sexual harassment to be eradicated in the workplace.\n\nDr. John Launer of Health Education England stated leaders must be made aware of common \"mismatches of perceptions\" at work to reduce incidents where one person thinks they are flirting while the other person feels like they're being demeaned or harassed.[96] Reporter Anna North from Vox states one way to address #MeToo is teach children the basics of sex. North states the cultural notion that women do not enjoy sex leads men \"to believe that a lukewarm yes is all they're ever going to get\", referring to a 2017 study which found that men who believe women enjoy being forced into sex are \"more likely to perceive women as consenting\".[185] Alyssa Rosenberg of The Washington Post called for society to be careful of overreaching by \"being clear about what behavior is criminal, what behavior is legal but intolerable in a workplace, and what private intimate behavior is worthy of condemnation\" but not part of the workplace discussion. She says \"preserving the nuances\" is more inclusive and realistic.[186]\n\nProfessor Daniel Drezner stated that #MeToo laid the groundwork for two major cultural shifts. One is the acceptance that sexual harassment (not just sexual assault) is unacceptable in the workplace. The other is that when a powerful person is accused of sexual harassment, the reaction should be a presumption that the less powerful accuser is \"likely telling the truth, because the risks of going public are great.\" However, he states society is struggling with the speed at which change is being demanded.[187]\n\nReform and implementation\n\nAlthough #MeToo initially focused on adults, the message spread to students in K–12 schools where sexual abuse is common both in person and online.[188] MeTooK12 is a spin-off of #MeToo created in January 2018 by the group Stop Sexual Assault in Schools, founded by Joel Levin and Esther Warkov, aimed at stopping sexual abuse in education from kindergarten to high school.[189][190] #MeTooK12 was inspired in part by the removal of certain federal Title IX sexual misconduct guidelines.[191] There is evidence that sexual misconduct in K–12 education is dramatically underreported by both schools and students, because nearly 80% of public schools never report any incidents of harassment. A 2011 survey found 40% of boys and 56% of girls in grades 7–12 reported had experienced some type of negative sexual comment or sexual harassment in their lives.[189][191] Approximately 5% of K–12 sexual misconduct reports involved 5 or 6-year-old students. #MeTooK12 is meant to demonstrate the widespread prevalence of sexual misconduct towards children in school, and the need for increased training on Title IX policies, as only 18 states require people in education to receive training about what to do when a student or teacher is sexually abused.[190]\n\nRole of men\n\nThere has been discussion about what possible roles men may have in the #MeToo movement.[192][193][99] It has been noted that 1 in 6 men have experienced sexual abuse of some sort during their lives and often feel unable to talk about it.[194] Creator Tarana Burke and others have asked men to call out bad behavior when they see it,[193][99] or just spend time quietly listening.[150][195] Some men have expressed the desire to keep a greater distance from women since #MeToo went viral because they do not fully understand what actions might be considered inappropriate.[196][197] For the first few months after #MeToo started trending, many men expressed difficulty in participating in the conversation due to fear of negative consequences, citing examples of men who have been treated negatively after sharing their thoughts about #MeToo.[198]\n\nAuthor and former pick-up artist Michael Ellsberg encourages men to reflect on past behavior and examples of questionable sexual behavior, such as the viral story Cat Person, which is written from the perspective of a twenty-year-old woman who goes on a date with a much older man and ends up having an unpleasant sexual experience that was consensual but unwanted. Ellsberg has asked men to pledge to ensure women are mutually interested in initiating a sexual encounter and to slow down if there is ever doubt a woman wants to continue.[199][200]\n\nRelationship instructor Kasia Urbaniak said the movement is creating its own crisis around masculinity. \"There's a reflective questioning about whether they’re going to be next and if they’ve ever hurt a woman. There's a level of anger and frustration. If you’ve been doing something wrong but haven't been told, there's an incredible sense of betrayal and it’ll provoke a backlash. I think silence on both sides is incredibly dangerous.\" Urbaniak says she would like women to be allies of men and to be curious about their experience. \"In that alliance there's a lot more power and possibility than there is in men stepping aside and starting to stew.\"[201]\n\nIn August 2018, The New York Times detailed allegations that leading #MeToo figure Asia Argento sexually assaulted actor Jimmy Bennett.[202] The sexual assault allegedly took place in a California hotel room in 2013 when he was only two months past his 17th birthday and she was 37; the age of consent in that state is 18.[202] Bennett said when Argento came out against Harvey Weinstein, it stirred memories of his own experience. He imparted he had sought to resolve the matter privately, and had not spoken out sooner, \"because I was ashamed and afraid to be part of the public narrative.\"[203] In a statement provided to The Times, he said: \"I was underage when the event took place, and I tried to seek justice in a way that made sense to me at the time because I was not ready to deal with the ramifications of my story becoming public. At the time I believed there was still a stigma to being in the situation as a male in our society. I didn't think that people would understand the event that took place from the eyes of a teenage boy.\" Bennett said he would like to \"move past this event in my life,\" adding, \"today I choose to move forward, no longer in silence.\"[203] Argento, who quietly arranged a $380,000 nondisclosure settlement with Bennett in the months following her revelations regarding Weinstein, has denied the allegations.[204] Rose McGowan initially expressed support for Argento on and implored others to show restraint, tweeting, \"None of us know the truth of the situation and I'm sure more will be revealed. Be gentle.\" As one of the most vocal advocates of the Me Too movement, McGowan faced criticism on social media for her comments, which conflicted with the movement's message of believing survivors.[205] MeToo founder Tarana Burke responded the Asia Argento report, stating \"I’ve said repeatedly that the #metooMVMT is for all of us, including these brave young men who are now coming forward. Sexual violence is about power and privilege. That doesn't change if the perpetrator is your favorite actress, activist or professor of any gender.\"[3]\n\n#HimToo\n\nThe related hashtag #HimToo emerged in popularity with the #MeToo movement. Although dating back to at least 2015, and initially associated with politics or casual communication, #HimToo took on new meanings associated with #MeToo in 2017, with some using it to emphasize male victims of sexual harassment and abuse, and others using it to emphasize male perpetrators. In September and October 2018, during the sexual assault allegations raised during Brett Kavanaugh's nomination to the U.S. Supreme Court, #HimToo became used by supporters of Kavanaugh and to highlight male victims of false accusations.[206][207]\n\nIn January 2019, a tertiary institution's lecturer from Hong Kong also came out in the spotlight to announce his establishment of a support group aimed at \"gathering all men who have suffered from false allegations of sexual crimes to speak out\" in an interview by a local newspaper. He claimed that he was a victim of this movement, which he considered as \"encouraging unethical females to frame males they hate, who, under conventional stereotypes, are usually assumed to hold indecent urge for women\".\n\nHe did add that he \"was not opposed to this movement\", but was concerned about its abuses that could ruin the life of many innocent men\".[208]\n\nCriticism\n\nUndefined purpose\n\nSome feminists and women have criticized the movement.[209][210] Some media outlets have argued that the Me Too movement has increased the level of androphobia in society.[211][212]\n\nThere has been discussion about whether the movement is meant to inspire change in all men or just a percentage of them, and what specific actions are the end goal of the movement.[213] Other women have stated #MeToo should examine only the worst types of abuse in order to prevent casting all men as perpetrators, or causing people to become numb to the problem.[213][214]\n\nCreator Tarana Burke has laid out specific goals for the #MeToo movement, including: processing all untested rape kits in the United States, investigating the vetting of teachers, better protecting children at school, updating sexual harassment policies, and improving training in workplaces, places of worship, and schools. She has stated that everyone in a community, including men and women, must take action in order to make the #MeToo movement a success. She also supports the #MeToo Congress bill and hopes it will inspire similar legal changes in other parts of the country.[149]\n\nOvercorrection\n\nRichard Ackland, a lawyer and award-winning journalist, described the response to defamation cases \"an asphyxiating vortex of litigation\".[215]\n\nThere has been discussion on whether harsh consequences are warranted for particular examples of alleged misconduct.[214][216][217] An especially divisive story broke on Babe.net on January 13, 2018, when an anonymous accuser detailed the events of her date with Aziz Ansari and referred to what transpired as \"sexual assault\". Jill Filipovic wrote for The Guardian that \"it was only a matter of time before a publication did us the disservice of publishing a sensational story of a badly behaved man who was nonetheless not a sexual assailant\".[218][219][220] While James Hamblin wrote for The Atlantic that these \"stories of gray areas are exactly what [...] need to be told and discussed.\"[221]\n\nSome actors have admonished proponents of the movement for not distinguishing between different degrees of sexual misconduct. Matt Damon commented on the phenomenon in an interview, and later apologized, saying \"the clearer signal to men and to younger people is, deny it. Because if you take responsibility for what you did, your life's going to get ruined.\"[222] Subsequently, Liam Neeson opined that some accused men, including Garrison Keillor and Dustin Hoffman, were being treated unfairly.[223]\n\nTarana Burke said in January 2018, \"Those of us who do this work know that backlash is inevitable.\" While describing the backlash as carrying an underlying sentiment of fairness, she defended her movement as \"not a witch hunt as people try to paint it\". She stated that engaging with the cultural critique in #MeToo was more productive than calling for it to end or focusing on accused men who \"haven't actually touched anybody\".[150] Ronan Farrow, who published the Weinstein exposé in the New Yorker that helped start the #MeToo resurgence (alongside New York Times reporters Megan Twohey and Jodi Kantor), was asked in late December 2017 whether he thought the movement had \"gone too far\". Farrow called for a careful examination of each story to guard against false accusations but also recalled the alleged sexual abuse his sister Dylan Farrow claims she went through at the hands of his father Woody Allen. He stated that after decades of silence, \"My feeling is that this is a net benefit to society and that all of the people, men, and women, pouring forward and saying 'me too' deserve this moment. I think you're right to say that we all have to be conscious of the risk of the pendulum swinging too far, but in general this is a very positive step.\"[224]\n\nIjeoma Oluo spoke about how some Democrats have expressed regret over the resignation of Senator Al Franken due to allegations of sexual misconduct. She sympathized with them but stressed the importance of punishing misconduct regardless of whether the perpetrator is viewed as \"a bad guy\" overall. She wrote that \"most abusers are more like Al Franken than Harvey Weinstein\".[225] The New York Times has called this discussion the \"Louis C.K. Conundrum\", referring to the admission by comedian Louis C.K. that he committed sexual misconduct with five women, and the subsequent debate over whether any guilt should be associated with enjoyment of his work.[226][227][228] Jennifer Wright of Harper's Bazaar has said that public fears of an overcorrection reflect the difficulty of accepting that \"likeable men can abuse women too\".[229]\n\nA 2019 LeanIn.Org/SurveyMonkey survey showed that 60% of male managers reported being \"too nervous\" of being accused of harassment when mentoring, socializing, or having one-on-one meetings with women in the workplace.[230]\n\nPossible trauma to victims\n\nThe hashtag has been criticized for putting the responsibility of publicizing sexual harassment and abuse on those who experienced it, which could be re-traumatizing.[231][232][233] The hashtag has been criticized as inspiring fatigue and outrage, rather than emotionally dense communication.[234][235]\n\nTony Robbins said he was \"knocking victimhood\" from the movement.[236] The motivational speaker was also scrutinized for comments he made criticizing the movement, implying that women are victimizing themselves to gain significance. He later apologized adding, \"I need to get connected to the brave women of #MeToo.\"[237]\n\nExclusion of sex workers\n\nThere have been many calls for the #MeToo movement to include sex workers and sex trafficking victims.[238][239][240][241][242] Although these women experience a higher rate of sexual harassment and assault than any other group of people, they are often seen in society as legitimate targets that deserve such acts against them.[243] Autumn Burris stated that prostitution is like \"#MeToo on steroids\" because the sexual harassment and assault described in #MeToo stories are frequent for women in prostitution.[238] Melissa Farley argues that prostitution, even when consensual, can be a form of sexual assault, as it can be for money for food or similar items, thus, at least according to Farley, making prostitution a forced lifestyle relying on coercions for food.[243] Many sex workers disagree with her stance, saying that she stigmatizes prostitution.[244]\n\nAmerican journalist Steven Thrasher noted that, \"There has been worry that the #MeToo movement could lead to a sex panic. But the real sex panic is not due to feminism run amok, but due to the patriarchal, homophobic, transantagonistic, theocratic desire of the US Congress to control sex workers.\" He points to 2018 Stop Enabling Sex Traffickers Act (SESTA), which many experts say will only put sex workers at further risk by causing them to go underground, does not offer sex workers any help or protections, and as a side effect prevents most people from using online personal ads regardless of their intentions.[245]\n\nFalse accusations\n\nThere has been discussion about the extent to which accusers should be believed before fact-checking. Some have questioned whether the accused are being punished without due process confirming their guilt.[214][216][217]\n\nMany commentators have responded that the number of false reports is expected to be low, citing figures obtained by the U.S. Department of Justice and other organizations which estimate the number of false rape accusations to be around 2–10%. However, the 2–10% figure refers to rape reports which are found to be false, and does not include cases in which it cannot be established if the accused is innocent or guilty.[246][247]\n\nA February 2005 study by the UK Home Office on reported rape cases[248] found that from a set of 216 rape cases later found to be false, only six led to arrests and only two involved charges being filed.[249][250] Elle writer Sady Doyle commented that another hashtag, #BelieveWomen, was not a threat to due process but a commitment to \"recognize that false allegations are less common than real ones\".[250] Jennifer Wright of Harper's Bazaar proposed a similar definition of #BelieveWomen and pointed out The Washington Post's ability to quickly identify a false accusation set up by Project Veritas. She also stated that only 52 rape convictions being overturned in the United States since 1989, as opposed to 790 for murder, was strong evidence that at least 90% of rape allegations are true.[229][249] Michelle Malkin challenged this claim, citing the book False Allegations by Brent Turvey, John Savino and Aurelio Coronado Mares, which states that published research about false rape accusations indicate that the percentage ranges from 8–41%. She expressed a suspicion that many stories in the #MeToo movement would be exaggerated and accused news outlets of focusing on \"hashtag trends spread by celebrities, anonymous claimants and bots\".[251]\n\nOn November 30, 2017, Ijeoma Oluo revealed the contents of a request she received from USA Today, asking her to write a piece arguing that due process is unnecessary for sexual harassment allegations. She refused, saying \"of course I believe in due process\" and wrote that it was disingenuous for the paper to ask her \"to be their strawman\".[252]\n\nOn September 21, 2018, President Donald Trump accused Dr. Christine Blasey Ford of making up her accusations against now Associate Justice of the Supreme Court, Brett Kavanaugh, saying that if her story was true she would have filed a report against him when it had happened. This is a common argument against the MeToo movement and alleged sexual assault victims alike.[253]\n\nOn October 11, 2018, Melania Trump, wife of US President Donald Trump, said that women who make accusations of sexual abuse against men should back their claims with solid evidence.[254]\n\nNot addressing police misconduct\n\nDespite the prevalence[where?] of sexual misconduct, some have pointed out the lack of discussion in the #MeToo movement regarding law-enforcement misconduct.[255][256][257][258] Police sexual misconduct disproportionately affects women of color, though women from all walks of life are affected.[258] The Cato Institute reported that in 2010, more than 9% of police misconduct reports in 2010 involved sexual abuse, and there are multiple indications that \"sexual assault rates are significantly higher for police when compared to the general population.\"[256] Fear of retribution is considered[by whom?] one reason some law-enforcement officers are not subjected to significant consequences for known misconduct.[255] Police-reform activist Roger Goldman stated that an officer who is fired for sexual misconduct from one police department often gets rehired by a different department, where they can continue the misconduct in a new environment.[255] Some states (such as Florida and Georgia) have licensing laws that can decertify a law-enforcement officer who has committed major misconduct, which prevents decertified officers from being hired again in that state.[255] Some have called for sexual misconduct allegations against police to be investigated by third parties to reduce bias (as opposed to the common practice of investigations being led by fellow law-enforcement officers or colleagues in the same department).[258]\n\nLack of representation of minority women\n\nMany have pointed to a lack of representation of minority women in the #MeToo movement or its leadership.[259][260][261][262][263][264] Most historical feminist movements have contained active elements of racism, and have typically ignored the needs of non-white women despite the fact that minority women are more likely to be targets of sexual harassment.[259][260][261][262][263]\n\nMinority women are overrepresented in industries with the greatest number of sexual harassment claims, for example hotels, health, food services, and retail.[261] It has been pointed out that undocumented minority women often have no recourse if they're experiencing sexual violence.[265] Activist Charlene Carruthers said, \"If wealthy, highly visible women in news and entertainment are sexually harassed, assaulted and raped—what do we think is happening to women in retail, food service and domestic work?\"[261]\n\nFormer victim Farah Tanis stated there are also additional barriers for black women who want to participate in the #MeToo movement. She pointed out that there is often social pressure not to report allegations against black men, especially from church and family, because many would view that as a betrayal against their \"brothers.\"[265] Additionally, black women are less likely to be believed if they do speak out.[265][266]\n\nSome have argued that the American judicial system acknowledges the term \"sexual harassment\" only because of successful sexual harassment lawsuits by three black women: Diane Williams and Paulette Barnes against the US government, and Mechelle Vinson against a bank.[267] Vinson's case of Meritor Savings Bank v. Vinson eventually leading to the unanimous 1986 Supreme Court decision that sexual harassment violates the Civil Rights Act.[260][261] Black law professor Anita Hill again brought sexual harassment to public discourse in 1991 with her testimony against Supreme Court nominee Clarence Thomas.[260][261][268]\n\nTarana Burke initially criticized the movement for ignoring the work of black women in creating dialogue addressing sexual assault. However, she did salute those who partook in the movement and credited Milano for acknowledging Burke's own similar movement.[269] As well as this, she pleaded to black women not to drop out of the movement just because the media isn't listening saying \"This is your movement, too.\"[270]\n\nAmerican feminist and journalist Gloria Steinem said there is a blind spot surrounding intersectionality between race and gender, and a major problem with today's feminists is they are not acknowledging \"that women of color in general—and especially black women—have always been more likely to be feminist than white women.\"[259] Steinem argues that #MeToo could never have happened without the work of these women, and women in the #MeToo movement have a responsibility: “If you have more power, remember to listen as much as you talk. And if you have less power, remember to talk as much as you listen.\"[260]\n\nOveremphasis on specific cases\n\nThe #MeToo movement has been criticized for putting too much public focus on the consequences of specific individuals who have been accused of sexual misconduct, as opposed to discussing policies and changes to institutional norms that would help people who are currently experiencing sexual abuse.[271] It's been noted that although allegations surrounding high-profile public figures tends to attract the most attention, the stories of regular workers often go unacknowledged.[1] Yet to ensure meaningful change, these workers’ experiences must be at the center of any policy solutions that lawmakers pursue. Tarana Burke has voiced similar misgivings, pointing out one problematic aspect of #MeToo is \"All of this media attention is on the perpetrator. All of the conversation about fairness and due process is focused on the perpetrator.\" She states the movement should focus on specific steps to help current and future sufferers.[272] Activist and writer Jaclyn Friedman said, \"We’ve got to stop treating each case that comes to light like a self-contained soap opera that ends when the villain is defeated, and start addressing the systems that have enabled workplace sexual abuse for so long.\"[273] Writer Jia Tolentino has stated that it is natural to focus on the individual stories because they are \"gripping and horrible\", but determining the best workplace changes \"doesn't have a ton to do with the specific investigation and adjudication of men that have already done this\".[274]\n\nDisregard for incarcerated women\n\nPrisoners' rights are significantly limited, The power imbalance between female inmates and male officers allows and promotes prison rape and other forms of abuse.[275][276][277] In addition, most women who are incarcerated for the murder of their intimate partners acted in protection of themselves.[276][277] Many people have criticized the prison system for punishing women who act in self defense.[278] Others criticize the main outreach of the Me Too movement for failing to address the systemic imprisonment of abused women and men.[278][279][280]\n\nFinancial support\n\nIn May 2018, The New York Women's Foundation announced their Fund to Support the Me Too Movement and Allies, a $25M commitment over the next five years to provide funding and support survivors of sexual violence.[281]\n\nIn September 2018, CBS announced that it would be donating $20 million of former Chairman Les Moonves' severance to #MeToo. Moonves was forced to step down after numerous sexual misconduct accusations.[282][283]\n\nInternational response\n\nThe hashtag has trended in at least 85 countries,[284] including India, Pakistan, and the United Kingdom. Direct translations of #MeToo have been shared by Spanish speakers in South America and Europe and by Arabic speakers in Africa and the Middle East, while activists in France and Italy have developed hashtags to express the attitudes of the movement.[285] Communicating similar experiences and \"sharing feelings in some form of togetherness\" connects people and can lead to \"formation of a process of collective action\" (Castells).[286][287] The campaign has prompted survivors from around the world to share their stories, and name their perpetrators. The European Parliament convened a session directly in response to the Me Too campaign, after it gave rise to allegations of abuse in Parliament and in the European Union's offices in Brussels. Cecilia Malmström, the European Commissioner for Trade, specifically cited the hashtag as the reason the meeting had been convened.[288]\n\nAfghanistan\n\nThe #MeToo hashtag initially spread in Afghanistan where it is estimated about 90% of women experience sexual harassment in public, at school, or at work, but was quickly silenced when those who shared their stories started fearing for their life.[295][296] Less than 1% of police officers or military members are women, and sexual assault is often ignored by law enforcement and the military.[297] Rape threats and other types of harassment are common on Facebook and other social media in Afghanistan. Sharing stories of sexual abuse against higher-ranking men is especially dangerous for women in the country, and may result in the killing of the victim or her family members.[296] Some women are also punished or killed to by their own family for speaking out, to redeem their \"honor\" after being tarnished by rape.[296] Despite the risks, some notable people such as Sarienews journalist Maryam Mehtar, and presidential advisor Shaharzad Akbar have shared their own #MeToo stories on social media. Mehtar experienced extreme abuse and several death threats for sharing her story about being sexually harassed in public on a daily basis, and was publicly called a \"whore\" in an interview with The New York Times by Afghan writer Jalil Junbish. He also called the NYT reporter a whore in the same interview. He later denied making the comments.[297] Other women only share their first name or a fake name, and typically describe the story without naming the perpetrator for fear of reprisal.[297] Sexual harassment was first defined in Afghanistan in 2016, though there has been little effort made to enforce laws against it.[295] Rod Nordland and Fatima Faizi of The New York Times reported that a colonel in the Afghan Air Force was secretly and clearly videotaped sexually assaulting a subordinate in November 2017, and the video quickly went viral, but despite an alleged investigation, the colonel has not been formally accused of misconduct.[297] The Ministries of Interior and Communications set up a phone hotline to for women to call to report sexual misconduct from law enforcement officials, but a call to the line revealed the hotline will offer advice only about phone harassment, and stated if a person harasses you in person, to \"slap them\".[297]\n\nAustralia\n\nIn October 2017 reporter and journalist Tracey Spicer announced on Twitter that she was launching an investigation into reports of sexual harassment by powerful Australian men in the media in the wake of the Harvey Weinstein sexual abuse allegations and the rise in public awareness of the #MeToo movement. Earlier that same year, Spicer had released a memoir, The Good Girl Stripped Bare, where she wrote about her own experiences of sexual harassment in the work place.[298] Spicer later reported that she had received responses from 470 people about people in the industry, including Australian television presenter and producer Don Burke.[299] The extent of the claims against Burke were published by the Australian Broadcasting Corporation and The Sydney Morning Herald in a joint investigative piece on November 26, 2017, where it was reported that \"One name kept recurring – Don Burke.\"[300][301] Spicer, along with Kate McClymont, Lorna Knowles and Alison Branley, won the 2018 Walkley Awards in the print/text journalism and Television/Video Current Affairs Short (less than 20 minutes) categories for their investigation and on Australia Day in 2018, Spicer was appointed as a Member of the Order of Australia \"for significant service to the broadcast media as a journalist and television presenter, and as an ambassador for social welfare and charitable groups\".[302][303] Later that same year, Spicer and Melinda Schneider launched NOW Australia, a campaign aimed at helping connect people with legal support and counselling.[304]\n\nSince then the #MeToo movement has now expanded beyond Australian media and the Australian Human Rights Commission has launched an independent search into workplace sexual harassment that is the first of its kind in the world.[305]\n\nIt has been hypothesised by The Age that Australia's strict defamation laws make it difficult for more victims to come forward.[306] Yael Stone made an accusation against Geoffrey Rush[307][308] who then successfully sued her for defamation; this may have a chilling effect on the #MeToo movement due to the lack of protection for freedom of speech.[309]\n\nThe #MeToo movement was announced the winner of the 2019 Sydney Peace Prize. The award will be presented to Tarana Burke and Tracey Spicer on 14 November 2019.[310]\n\nBelgium\n\nIn May 2019, Julie Van Espen was the victim of a homicide in Antwerp. Her death has led to political protests against sexual violence. That month, over 15,000 people walked a 'silent march' in Antwerp for Van Espen. The hashtags '#enough', '#MeToo' and '#JulieVanEspen' were used by people on social media to command attention to the case, to raise awareness on sexual violence, and to address that the suspect of her murder had been convicted of rape twice before.[311]\n\nCanada\n\nÉric Salvail, accused of sexual harassment\n\nIn French-speaking parts of Canada, the campaign is done under the hashtag #MoiAussi.[312] A minister of Quebec, Hélène David, said she believed a global movement was in the works and we should salute this change.[313] It was reported that calls to rape and women's crisis centers have increased dramatically, up to 553% above normal levels,[314] since #MoiAussi started trending in October 2017, causing problems with staffing and budgeting.[315] Quebec has contributed $1 million to help support these crisis hotlines.[314] Hundreds of people marched to promote #MoiAussi at an event in Toronto in December 2017.[316] In the wake of #MoiAussi, a candidate for mayor of Plateau-Mont-Royal dropped out of the race in response to allegations of sexual misconduct from several women.[317] Montreal police set up a phone hotline for people who have been raped or harassed to call.[313] Radio and TV presenter Éric Salvail was accused by 11 people of either being sexually harassed, or witnessing harassment from Salvail.[313] He lost several endorsements and was suspended from most projects he was involved with.[318] Humorist Gilbert Rozon resigned from all his positions and tried to sell his company in the wake of several sexual misconduct allegations, including one from producer Julie Snyder, a class action lawsuit from several women, and a sexual assault report filed with the police.\n\nA newly popular hashtag, #EtMaintenant (#AndNow or Now What?) has started spreading as the \"second part\" to #MoiAussi to discuss what to do now that the magnitude of the problem with sexual misconduct in the workplace has been exposed. #EtMaintenant is represented by a yellow heart. It was unveiled on the show Tout le monde en parle in January 2018, with the stated purpose of determining which attitudes related to society, politics, institutions, and media need to be changed to ensure equity between all people.[319]\n\nCanadian Prime Minister Justin Trudeau has been a vocal advocate and supporter of the #MeToo movement. In a speech at the World Economic Forum in January 2018, Trudeau called for critical discussion on issues brought up by the #MeToo, Time's Up, and Women's March movements.[320] Trudeau has also advocated and acted upon a high standard set for himself and members of his government. Trudeau stated that he holds a \"zero tolerance for sexual assault, harassment or other forms of misconduct by his employees or caucus colleagues\".[321] As leader of the Liberal party, Trudeau initiated investigations on several members of parliament resulting in the dismissal of cabinet minister Kent Hehr, the resignation of MP Darshan Kang, and the suspension and later expulsion of MPs Scott Andrews and Massimo Pacetti.[322] In an interview, Trudeau explained that the zero tolerance standard applied to himself as well and stated, \"I've been very, very careful all my life to be thoughtful, to be respectful of people's space and people's headspace as well.\"[323]\n\nHowever, an editorial written in August 2000 resurfaced during his premiership regarding an alleged incident where an author accused Trudeau of groping a reporter and in July 2018 Trudeau publicly rejected the accusations.[324][325] The piece stated Trudeau provided a \"day-late\" apology to the reporter, saying, \"If I had known you were reporting for a national paper, I never would have been so forward.\"[326] On July 6 Trudeau stated there was no need to conduct an investigation into the allegations against him.[327]\n\nChile\n\nIn April–June 2018, female students marched around Chile and occupied universities in protest against sexual harassment.[328] Multiple actresses levelled accusations of Weinstein-like behaviour at telenovela director Herval Abreu in April and film director Nicolás López in June; both men have denied any wrongdoing.[329]\n\nChina\n\nOn Chinese social networks, hashtags #WoYeShi or #metoo are sometimes used to denote the #Metoo hashtag. Mi tu pronounced in Mandarin, meaning \"rice bunny\", is also used with a hashtag of #RiceBunny.[330]\n\nIn mainland China, the Chinese internet censorship service has slowed down the Chinese MeToo posts via censorship.[331] So far, the #MeToo debate appears to be limited to universities.[332]\n\nAn article appearing on the state-run China Daily newspaper states that sexual misconduct is rare in China due to superior education and culture has caused considerable Internet outrages.[333]\n\nA recent study from a pair of professors from City University of Hong Kong indicated that about 80% of working women in China have experienced sexual harassment at some point in their career,[291] and there were strong reactions of anger online following the report. The article has since been taken down.[334] Activist Feng Yuan points out that China does not have national laws prohibiting sexual harassment, and uses state media to encourage women to focus on family and stay home. New laws recently made it illegal for television programming to contain images of a women's cleavage, sexual acts outside of marriage, or any topics that present \"Western lifestyles\" in a positive light. #MeToo has received extreme governmental censorship online.[183][334]\n\nSophie Richardson, the Human Rights Watch director for China, stated the Chinese government regularly suppresses discussion of women's rights, for example an incident in 2015 where Li Tingting and four other activists were arrested when the government learned they planned to hand out stickers about preventing sexual harassment on public transportation.[334]\n\nIn Hong Kong, track and field athlete Vera Lui Lai-Yiu posted her case of sex abuse alongside #metoo on her Facebook fanpage on her 23rd birthday. She posted in response to a similar action by gymnast McKayla Maroney. Lui posted a picture of herself holding a piece of paper with the handwritten words \"#metoo lly\" (her initials).[335][336][337][338][339] In January 2018, student Zheng Xi publicly started a campaign against sexual harassment in response to #MeToo.[291]\n\nDr. Luo Xixi, an academic, revealed being sexually assaulted by a professor at Beihang University when she was in her 20s. Luo gathered extensive evidence from many women, including recordings, and presented it to the institution. She waited until the professor was already suspended before going public with the story. Her post was viewed over 3 million times within 24 hours. She said that #metoo gave her the courage to speak up. She is currently living in the US.[183]\n\nZhou Xiaoxuan, a 25-year-old screenwriter in Beijing, stated that Zhu Jun (host) assaulted her in his dressing room. Zhou Xiaoxuan was assaulted as an intern by Zhu Jun, a famous anchor for Central China Television, in 2014. When she went to the police, she was urged her to drop her report, telling her that her parents, who both work for government institutions, could lose their jobs. So for years, Ms. Zhou kept what had happened a secret, only known by herself, her parents, and some close friends. That was until one day, where she saw a \"#MeToo\" post, and decided to share her own story. Her intentions were to share with her friends that this happens to people close to themselves, but instead her post was shared rapidly over the Chinese internet, until the Chinese government intervened and banned state-run media from covering the story.[340]\n\nYue Xin, a undergraduate of Peking University in Beijing, led a campaign to uncover information regarding the alleged assault and subsequent suicide of Gao Yan, a student who was allegedly assaulted by former professor Shang Yang.[341] Peking University took measures to attempt to dissuade Yue from pursuing her investigation.[342][343] Yue Xin would eventually participate in the Jasic Incident.\n\nEthiopia\n\nAlyssa Milano specifically called for supporting the victims in Ethiopia in an interview with Rolling Stone.[159] In Ethiopia, up to 40% of students may have experienced sexual violence.[344] In November 2017, nine middle-school aged girls organized together and spoke out about an abusive teacher in their school, saying they got the idea from the \"Me Too\" movement. The teacher was dismissed and referred to law enforcement. UNICEF's Amanda Westfall said the teacher likely would have gotten away with it just a few years ago.[344]\n\nFrance\n\nVariants of the phrase trended in France,[27] especially #BalanceTonPorc (#DenounceYourPig),[312] which encouraged users to share the names of their alleged abusers.[345][346] #BalanceTonPorc was first used by Sandra Muller. She was requested to take down her tweet by two lawyers.[347] In France, 93% of complaints against criminal sexual harassment are dropped or never followed up on by law enforcement.[348] Prosecutions are extremely rare, and only 65 of 1,048 sexual harassment lawsuits from 2014 actually led to a conviction.[347] In 40% of workplace sexual violence cases, the person who makes the complaint is reprimanded or fired, while the accused person is typically not investigated or punished.[348] There is no French equivalent to U.S. Equal Employment Opportunity Commission, which gives victims a place to report workplace sexual violence if the employer and/or law enforcement refuses to address the complaint.[348] Brigitte Macron, wife of French President Emmanuel Macron, expressed support for the #MeToo movement.[347][349]\n\nInitially the hashtag went viral, but there was an almost immediate media backlash.[350] Soon after, 100 high-profile French women, including actress Catherine Deneuve, former pornographic actress and radio host Brigitte Lahaie, art critic and author Catherine Millet, signed an open letter by Abnousse Shalmani which criticized the #MeToo / #BalanceTonPorc campaign. It was noted the letter is poorly edited with several typos and unclear or clumsy passages.[182][351]\n\nThe people who signed the letter, especially Deneuve and Millet, were criticized for saying men should have the \"right to pester\" women.[352] The letter also told people not to be bothered by small amounts of sexual harassment, for example men who rub against women on public transportation. The letter states women should \"consider it as the expression of a great sexual misery, or even as a nonevent\".[351] French politician Marlène Schiappa said some aspects of the letter were \"profoundly shocking\" and \"we have immense difficulty convincing young women that when a man rubs his genitals against a woman in the Métro without her consent, it is an act of sexual assault that can lead to three years in prison and a 75,000 euro fine.\"[347][351]\n\nA week after its publication, Deneuve issued a letter of clarification, and said although she still agrees with the spirit of the original letter, she wants to clarify that she does believe sexual harassment and assault are real problems, and apologized to all victims of unpleasant sexual acts who read the letter and felt hurt by it.[353][354]\n\nPolitical commentator Anastasia Colosimo said the movement to prevent sexual misconduct at work is more accepted by younger women in France because they take sexual freedom as a given, while older feminists are afraid #MeToo may hurt the sexual revolution.[182] Legal professional Marilyn Baldeck noted that when people are given \"concrete examples\" of sexual misconduct, they often \"change their minds and acknowledge how harmful some situations can be\".[351] French politician Sandrine Rousseau said that the #MeToo movement will continue because French women have been silenced for too long.[347] A petition aimed at President Emmanuel Macron demanded sexual harassment to be taken more seriously in France, and received more than 100,000 signatures in three days.[348]\n\nSinger Tom Connan said in an interview published by L'Obs that he had been the victim of sexual harassment and claimed that men (not only women) were also affected by the problem.[355]\n\nNousToutes\n\nIn 2018, 30,000 women marched in Paris with the #NousToutes, dressing in purple.[356][357]\n\nLigue du LOL\n\nIn February 2019 prominent male Parisian journalists were accused of forming a group, called the \"Ligue du LOL\", which – over a 10-year period – ran online harassment campaigns against feminists, female journalists, writers of colour and gay people. The group's founder, Vincent Glad [fr], was suspended by the daily newspaper Libération, whose own fact-checking unit broke the story.\n\nThe NGO SOS Racisme called for a judicial investigation.[358][359]\n\nGermany\n\nMeToo was not particularly popular in Germany until January 11, 2018, when it started trending after the Die Zeit weekly newspaper published reports about three German former actresses who alleged that award-winning TV director Dieter Wedel had committed sexual assault.[360][361] There have been official concerns about the alleged long-time coverup of Wedel's actions because most of his work was done through public broadcasting and received government money.[361] The report detailed a months-long investigation into the three allegations, and included 50 interviews.[360] Wedel has not responded to the allegations in Die Zeit, stating through a spokesperson he is in the hospital and having heart trouble.[361] Another high-profile German case concerned the former president of the Munich Academy of Music, Siegfried Mauser.[362] In a study of 2000 Germans conducted after the initial spread of #MeToo, it was found that 43% of women and 12% of men have experienced sexual harassment or abuse, most commonly inappropriate touching.[363]\n\nIran\n\nIn the Islamic Republic of Iran, Grand Ayatollah Ali Khamenei issued a message stating the \"disaster of countless sexual assaults on Western women – including incidents leading to #Metoo campaign\" can be solved with the Islamic solution of hijab.[364][365]\n\nIndia\n\nThe use of the #MeToo hashtag on social media spread quickly in India,[366][367] where sexual harassment is commonly referred to by the word 'eve-teasing', a term described as misleading, tame, and diluting the seriousness of the crime.[368] In response to #MeToo, there have been attempts to teach Indian women about workplace rights and safe reporting, as well as educate men about the scope of the problem.[366][369] Some have likened #MeToo to a 2012 social movement which followed a violent gang rape in New Delhi that later resulted in a woman's death, which caused the Indian government to institute harsher punishments for rape.[367][370][371] Others have suggested there was underlying public anger over a Delhi rape conviction that was overturned by Judge Ashutosh Kumar a month before against filmmaker and writer Mahmood Farooqui, ruling that a \"feeble\" no was not enough to revoke consent because it was typical for one partner to be less willing. The case is being appealed to the Supreme Court.[370][372] Activist Jasmeen Patheja, head of Blank Noise, stated #MeToo's power is in demonstrating India can no longer ignore the scope of the problem.[367] Kaimini Jaiswal, a lawyer at the Supreme Court of India, stressed the importance of teaching women how to read, especially in rural villages, because most women in these areas are illiterate and completely financially and emotionally dependent on a male relative.[371]\n\nBlogger Sheena Dabholkar's viral #MeToo tweet resulted in the boycott of Khodu Irani's popular Pune pub, High Spirits, by several well-known performers.[366][373][374] Several women mentioned Mahesh Murthy, which initiated a police case in January 2018.[289][375] The Trends Desk of The Indian Express wrote many Indian men are speaking up as a part of #MeToo, including discussions about consent and how some men are also abused.[376][377] Rina Chandran of Reuters said that #MeToo is ignoring the 600,000 women in India who are currently involuntary sex workers, and are typically poor, uneducated or lack a family.[378]\n\nThere were reports of mass sexual assaults during the 2018 new year's celebrations in Bangalore, which have been associated with #MeToo. The incidents were initially dismissed by the police until someone uploaded CCTV footage of the assaults to social media.[371] Home Minister G. Parameshwara, Abu Azmi, and other officials came under fire for stating \"western\" women's clothing and values were the cause of the rapes and that women's families should not allow them to go to parties or major celebrations.[371]\n\nSeveral lists of alleged rapists and harassers started spreading on social media in India, including \"The List\" which initially included the names of about sixty highly respected academic men. The List of Sexual Harassers in Academia (\"LoSHA\") was posted on October 24, 2017, by activist Inji Pennu and an Indian student in California named Raya Sarkar, who alleged they personally confirmed every incident.[379][380] This list has resulted in criticism against #MeToo because the allegations were unverified before they started spreading on social media. Some of the victims from the list have come forward to explain they were ignored, mistreated or retaliated against when they tried to pursue action.[381] Sarkar has defended The List, saying that she posted it only to warn her friends about professors and academics to avoid (mostly upper caste men), and had no idea it could become so popular.[380] A second list came out a week later that was made by women from a lower caste background and included more names, raising the total to around 70.[379]\n\nTwelve prominent Indian feminists dismissed The List in a formal letter, saying they understand that the justice system is typically tilted against victims, but unverified claims make things harder for the feminist movement.[379][382] Writers Rhea Dangwal and Namrata Gupta responded that most victims from the list were poor students who tried to go through official channels without success or recourse, while every single man on the list has the ability to defend himself socially and legally.[379]\n\nOn September 27, 2018, former actress Tanushree Dutta accused Nana Patekar of sexual harassment,[383] which was the catalyst of the \"Me Too\" movement in India. The accusation by Dutta stirred a row of accusations from many women in industries including media and politics.[384][385][386] In October 2018, the Minister of state for External Affairs, MJ Akbar was accused of sexual harassment by several female colleagues through the 'Me Too' Movement in India.[387]\n\nOn October 21, 2018, former music director Anu Malik was suspended from the jury panel of Indian Idol 2018, after facing multiple allegations of sexual harassment made through the movement.[388]\n\nIsrael\n\nIn Israel, the Hebrew hashtag גםאנחנו# (#UsToo) began trending on October 18, 2017, with a front page spread in the newspaper Yedioth Ahronoth.[312] Asi Levi said at the Ophir Award ceremony that unlike America, in Israel the status of those accused do not change.[389] A hashtag for men, #HowIWillChange, has also become popular.[390]\n\nPalestine\n\n#AnaKaman or وأنا كمان# (#MeToo) has also been used by Palestinian women from refugee camps.[391]\n\nItaly\n\nIn Italy, women posted stories of assault and harassment under the hashtag #QuellaVoltaChe, which translates literally as \"TheTimeThat\".[392][393] The phrase was launched by the journalist Giulia Blasi.[394] Italian journalist Simona Siri wrote in The Washington Post that the initially popular movement quickly died out in Italy. She stated that Italian politician and former Prime Minister Silvio Berlusconi, who is known for his role in wild parties (Bunga Bunga bacchanals) with underage women and prostitutes,[395][396] has contributed to a strong sexist culture with few female politicians in positions of power.[184] Movie directors Fausto Brizzi and Giuseppe Tornatore were accused of harassment by more than a dozen women but did not face any significant consequences or media scrutiny.[397][184]\n\nThe New York Times described the movement in Italy as \"Meh\" due to the lack of discussion. Laura Boldrini, the president of the lower house of Parliament, has declared that the movement cannot touch Italy because although there is much harassment, victims are often silenced and there's also a belief that \"in our country, there are no harassers\".[395] It has been reported that nearly 70% of female university students have been sexually harassed, and it is widely accepted that Italy is behind other countries when it comes to gender rights.[396] In response to #QuellaVoltaChe, one article from Libero was titled, \"First they put out, then they whine and pretend to regret it.\"[396]\n\nItalian Fabrizio Lombardo, an employee and friend of Harvey Weinstein, was widely covered by the media after he was accused of allegations that he aided Weinstein in sexually harassing Italian actress and former model Asia Argento, though he denies all wrongdoing.[398] Argento said of Italy, \"Nothing has changed\", and described her life after going public with the allegations as living a nightmare. She has made plans to leave Italy. Conservative TV news editor Alessandro Sallusti [it] criticized Argento for being an accomplice to Weinstein for not reporting him immediately, and several other public figures and politicians questioned her innocence.[395]\n\nThe Non Una di Meno group (Not One Woman Less), which is dedicated to stopping violence against women, wrote a letter in support of Argento and organised a protest in November 2017 where tens of thousands of people gathered in Rome.[396] Blogger Abbatto i muri (I Break Down Walls), journalist Ida Dominijanni, Cagne sciolte (literally, Loose Bitches), and author Michela Marzano also strongly supported Argento publicly.[396] Italian women's rights activist Lorella Zanardo has stated that it is taken for granted that women must give or sell their body in order to get high-profile positions in politics, film, and media.[395]\n\nMaria Elena Boschi, a politician who has created governmental initiatives aimed at teaching women it's okay to say no to sexual advances, has been targeted in the news and on social media for her support of the #QuellaVoltaChe movement.[394] She has been impersonated in several fake interviews where the actresses portray Boschi in unflattering ways.[395] There are also photoshopped images of Boschi that have been shared widely on social media, including a doctored image with her underwear showing during her swearing-in ceremony, which never occurred.[395][399] Francesca Puglisi, the chair of the Commission of Inquiry into Femicide in Italy, said that one woman is killed every two days on average by male violence, and the problem is severely under-reported, though she credited the #QuellaVoltaChe hashtag and the work by Boschi with making a positive difference.[400]\n\nJapan\n\nAlthough the #MeToo movement started out relatively small in Japan, it appears to be picking up steam.[401] There is evidence that just 4% of rape victims in Japan report the crime, and the charges are dropped about half the time.[167] BuzzFeed Japan has started a #MeToo page featuring articles about the movement in Japan.[402] Journalist and author Shiori Itō published an article in Politico about the state of #MeToo in Japan. She has stated, \"It's not that victims haven't come forward; Japanese society wants them to stay silent.\" Two famous authors, Kyoko Nakajima and Mayumi Mori, have written in Asahi newspaper with criticism of Japan's silence on this matter.[167] Takumi Harimaya wrote about the #MeToo movement in BuzzFeed Japan, stating she believes it could make a difference if the idea spreads, and sharing stories of victims, including what happened to popular blogger Hakuo Au (née Haruka Ito) at the hands of Mr Kishi Yuki.[403] Other writers such as Kirsten King and Akiko Kobayashi have shared their #MeToo stories to Japanese audiences.[404][405]\n\nHarimaya writes how the #MeToo movement has shown several women that they are not alone as they feared, and that many women are experiencing the same sexual violence and harassment.[403] Keiko Kojima of Buzzfeed Japan says that #MeToo is needed in Japan because sexual harassment is baked into Japanese society, and the movement is about the fact that it is okay to say no to sexual violence. She said growing up that she felt getting molested on the train was an unavoidable as mosquito bites in the summer, and she hopes that #MeToo gives more victims the ability to find their voice, including male victims. She says that, despite how it is attacked in Japanese media, that #MeToo is not an \"anti-man\" campaign, it is simply about anti-violence and anti-harassment. She also believes it is extremely important for men to call out behaviors in others such as sexual harassment or having sex with someone who is unconscious. Therefore, every person who is not committing sexual violence is part of the #MeToo movement, whether they are male or female.[406]\n\nShiori Itō notes that the word \"rape\" is taboo in Japan, and is typically described with less threatening words such as saying an underage victim was \"tricked\" or a woman was \"violated\" to describe what happened, which Ito says contributes to the public not understanding the full extent of the problem.[167] The legal age of consent in Japan is 13. She says women in Japan are regularly exposed to harassment from a young age, and recalls being groped by a man at a swimming pool when she was 10 only to be blamed herself for wearing a \"cute bikini\". She states that harassment on public transportation is commonplace, and she remembers dealing with it every day in high school.[167][407]\n\nAs part of the #MeToo movement, Shiori Itō went public alleging that she was raped by Noriyuki Yamaguchi [jp], a prominent TV journalist and acquaintance of Japanese Prime Minister Shinzo Abe,[408] an admission she says was unthinkable for a woman to do in Japan. Yamaguchi rejects her accusations, and says that sex was consensual.[408] She said her experience with Japan's legal system showed her that victims of sex crimes were undermined and ignored. She called for the Japanese parliament to update Japan's laws regarding rape, which were over a century old. She explains how she could not get information on which hospital provides rape kits without going through a preliminary interview in person. When she went to the police, she was discouraged from filing a report, and informed her career would be ruined for no reason if she did this. She was told she did not act like a victim, and had to be interviewed by several officers, including one who made her reenact the rape with a dummy while he took pictures. Although they initially said they would arrest Yamaguchi, the case and charges were unexpectedly dropped. Itō then went to the media, but no one would take her story. When she spoke about the experience at a press conference, she made national news and immediately started receiving a negative backlash, hate mail, and threats.[167][409] She has been unsuccessful in her attempts to have criminal charges brought against Yamaguchi, but as of 2018 she was still pursuing a civil case against him, which he was defending.[408]\n\nIn 2018, Junichi Fukuda, a deputy finance minister in the Abe Administration, resigned after being accused of sexual harassment by his former subordinates.[410] A former member of the Japanese idol group Niji no Conquistador pressed charges against Pixiv representative director, Hiroaki Nagata, for sexual harassment during her time with the group, motivated by the #MeToo movement.[411] Nagata resigned following the lawsuit.[412]\n\nKenya\n\nWhen #MeToo first went viral in October 2017, coverage was overshadowed in Kenya by a presidential election that was occurring the next week.[413] However, the #MeToo movement started slowly spreading in Kenya after the election was over.[413] In January 2018, it became especially popular after several new mothers alleged sexual misconduct at Kenyatta National Hospital, claiming that after giving birth they have been sexually assaulted when they went alone to breastfeed.[414] There were also allegations that children in the hospital have been sexually assaulted.[414] The hospital announced that the women were all lying, but in the future, women should stay together in groups in the hospital to prevent sexual assault. In response, hundreds of people began protesting in the streets of in Nairobi, Kenya, and an investigation was initiated by the health minister.[415]\n\n", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/Flag_of_the_Republic_of_China.svg/23px-Flag_of_the_Republic_of_China.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Flag_of_Israel.svg/21px-Flag_of_Israel.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/29/Jo_Min-gi_from_acrofan_cropped.jpg/170px-Jo_Min-gi_from_acrofan_cropped.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/09/Flag_of_South_Korea.svg/23px-Flag_of_South_Korea.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/Wiki_letter_w_cropped.svg/20px-Wiki_letter_w_cropped.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ef/Sexual_orientation_-_4_symbols.svg/24px-Sexual_orientation_-_4_symbols.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d2/Peace_sign.svg/21px-Peace_sign.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Flag_of_Norway.svg/21px-Flag_of_Norway.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Flag_of_Finland.svg/23px-Flag_of_Finland.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/Flag_of_Vietnam.svg/23px-Flag_of_Vietnam.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ca/Alyssa_Milano_2%2C_2011.jpg/170px-Alyssa_Milano_2%2C_2011.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/0/05/Flag_of_Brazil.svg/22px-Flag_of_Brazil.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/99/Question_book-new.svg/50px-Question_book-new.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/Ambox_contradict.svg/40px-Ambox_contradict.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Flag_of_Canada_%28Pantone%29.svg/23px-Flag_of_Canada_%28Pantone%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2d/Flag_of_the_Basque_Country.svg/23px-Flag_of_the_Basque_Country.svg.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/79/Flag_of_North_Macedonia.svg/23px-Flag_of_North_Macedonia.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/41/Flag_of_India.svg/23px-Flag_of_India.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/12px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2b/Flag_of_the_Arab_League.svg/23px-Flag_of_the_Arab_League.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Crystal_Clear_app_linneighborhood.svg/21px-Crystal_Clear_app_linneighborhood.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f3/Flag_of_Russia.svg/23px-Flag_of_Russia.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/Flag_of_Catalonia.svg/23px-Flag_of_Catalonia.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Woman-power_emblem.svg/13px-Woman-power_emblem.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/0/03/Flag_of_Italy.svg/23px-Flag_of_Italy.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/64/Flag_of_Galicia.svg/23px-Flag_of_Galicia.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/9e/Flag_of_Japan.svg/23px-Flag_of_Japan.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/c/c3/Flag_of_France.svg/23px-Flag_of_France.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cc/%C3%89ric_Salvail.png/170px-%C3%89ric_Salvail.png", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f2/Edit-clear.svg/40px-Edit-clear.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/US_Army_SHARP_Sexual_Harassment_and_Sexual_Assault_Prevention_Poster.jpg/170px-US_Army_SHARP_Sexual_Harassment_and_Sexual_Assault_Prevention_Poster.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/32/Flag_of_Pakistan.svg/23px-Flag_of_Pakistan.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Flag_of_the_People%27s_Republic_of_China.svg/23px-Flag_of_the_People%27s_Republic_of_China.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/9a/Flag_of_Spain.svg/23px-Flag_of_Spain.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/52/Acap.svg/24px-Acap.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/HumanRightsLogo.svg/20px-HumanRightsLogo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ca/Flag_of_Iran.svg/23px-Flag_of_Iran.svg.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Me_Too_movement", "title": "Me Too movement", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.13", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}