{"url": "https://www.vanityfair.com/hollywood/2018/11/house-of-cards-final-season-review", "text": "This post contains plot details for the entirety of House of Cards Season 6.\n\nFor a show built on the premise that people will abandon their values at the slightest hint of personal gain, credit must be given to how swiftly House of Cards, offscreen, handled the growing number of accusations of sexual misconduct against its star Kevin Spacey last year. (Spacey has apologized to actor Anthony Rapp, and sought treatment in the wake of further allegations.) Production was suspended, and a few days later, Spacey was fired. Season 6 was announced to be the show’s last. It was convenient that before Spacey’s firing, Season 5 of House of Cards ended with Robin Wright’s character Claire Underwood wresting control from her husband to become president of the United States, herself. “My turn,” she says directly to the camera, in one of the most successful finale twists the show has pulled off. The flip became a moment of unexpected foreshadowing, both for the direction of the show and for the nationwide conversation on the continued struggle for gender equality. In Season 6, all eight episodes of which debuted today, Claire is the president, and Frank is just a memory—much discussed, but never heard from or spoken to ever again. House of Cards won’t even play his voice, which becomes increasingly obvious as Frank’s old voice memos become a sought-after testament to Claire’s awful character. In the time line, which picks up a couple of months after Claire’s ascension, Frank is dead, but we don’t know how or why.\n\nUnfortunately, though—even with the leg up provided by the Season 5 finale, and the delayed release—the production is unable to wrap up the story. I don’t even mean that House of Cards doesn’t end well, although it doesn’t; I mean, there are multiple story lines that are simply abandoned. Wright is excellent—she’s doing her best work in this season, half-flirting with the audience as she scrambles to consolidate her position. In the sense that House of Cards transports the viewer to a fantasy of absolute, destructive power, Wright offers a window into a female version of it—one that is markedly more elegant, as it is not suffused with Spacey’s over-the-top Southern drawl.\n\nAs the show has reiterated since its debut, the power is still ugly—thrilling, cathartic, and fulfilling a very human desire, yet still ugly. But Wright has inherited an impossible task. The story is trying to wrap up five seasons of action—which includes the death of a half-dozen business-casual flunkies and several layers of Machiavellian manipulation. The story of Season 6 just doesn’t cohere; it barely even tracks well enough to summarize. In a way, the total breakdown is sort of beautiful; it’s like watching the story collapse in upon itself, a deserted building, carefully demolished.\n\nIn exchange for a plot arc, House of Cards relies on what it has always done best: cynical provocation. The most confusing is Claire’s canny exploitation of feminist language for political gain, which in the back half of the season turns into a story about her in-office pregnancy. (It is never made clear how Claire gets pregnant; presumably, it could be her naturally conceived child with Frank, but the careful rollout of her condition suggests a much more calculated method.) Wright puts a lot into the movement of her face, but House of Cards has very little to offer on Claire’s feelings about impending motherhood, or how being pregnant changes the environment of the White House. Midway through the season, Claire announces she’s returning to her maiden name, Hale. She also lectures the Situation Room, during a nuclear crisis, on how no one knows the word for the opposite of misogyny. (Claire, apparently, was not paying much attention to the Internet in, like, 2013.)", "images": ["https://media.vanityfair.com/photos/54fefcd81bb97fd46fe01f11/master/w_1600%2Cc_limit/ss09-robin-wright-fashion.jpg", "https://media.vanityfair.com/photos/54fefdaa3d33425a57fc673f/master/w_1600%2Cc_limit/ss08-robin-wright-fashion.jpg", "https://media.vanityfair.com/photos/5bafaa962b57202d9836fe12/1:1/w_350%2Ch_350%2Cc_limit/kevin-spacey-misconduct.jpg", "https://media.vanityfair.com/photos/54fefccc9689cbfa72bf3a64/master/w_1600%2Cc_limit/ss01-robin-wright-fashion.jpg", "https://media.vanityfair.com/photos/5d03a3b276711f0f057fe6b1/1:1/w_350%2Ch_350%2Cc_limit/euphoria-review-hbo.jpg", "https://media.vanityfair.com/photos/5bad3754e5ae6a094d0018cd/1:1/w_350%2Ch_350%2Cc_limit/house-of-cards-trailer.jpg", "https://www.vanityfair.com/verso/static/hwd/assets/logo-reverse.6ef96ab8686439a35176e2ff8b2c4487e92fbaae.svg", "https://media.vanityfair.com/photos/5bdcb5d6adbbcc502c0039b1/16:9/w_1280,c_limit/HOC_603_01055r.jpg", "https://www.vanityfair.com/verso/static/hwd/assets/logo-header.7b6624f3aa336c67441a33a3e19289ee14eaf5c7.svg", "https://media.vanityfair.com/photos/5bd345e155187a2d9530c8ab/1:1/w_350%2Ch_350%2Cc_limit/HOC_601_Unit_01950rCROP.jpeg", "https://media.vanityfair.com/photos/5bdcb5d6adbbcc502c0039b1/16:9/w_1280%2Cc_limit/HOC_603_01055r.jpg"], "top_img": "https://media.vanityfair.com/photos/5bdcb5d6adbbcc502c0039b1/16:9/w_1280,c_limit/HOC_603_01055r.jpg", "keywords": [], "authors": ["Condé Nast", "Joy Press", "Yohana Desta", "Hilary Weaver", "Sonia Saraiya", "Sonia Saraiy"], "canonical_link": "https://www.vanityfair.com/hollywood/2018/11/house-of-cards-final-season-review", "title": "Review: House of Cards Collapses, Finally", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Condé Nast", "copyright": "Copyright (c) Condé Nast 2019", "description": "Down a star and out of things to say, Season 6 flounders.", "keywords": "kevin spacey,netflix,robin wright,house of cards", "robots": "index, follow", "og": {"description": "Down a star and out of things to say, Season 6 flounders.", "image": "https://media.vanityfair.com/photos/5bdcb5d6adbbcc502c0039b1/16:9/w_1280,c_limit/HOC_603_01055r.jpg", "site_name": "Vanity Fair", "title": "Review: House of Cards Collapses, Finally", "type": "article", "url": "https://www.vanityfair.com/hollywood/2018/11/house-of-cards-final-season-review"}, "twitter": {"card": "summary_large_image", "description": "Down a star and out of things to say, Season 6 flounders.", "domain": "https://www.vanityfair.com", "image": {"src": "https://media.vanityfair.com/photos/5bdcb5d6adbbcc502c0039b1/16:9/w_1280,c_limit/HOC_603_01055r.jpg?mbid=social_retweet"}, "site": "@VanityFair", "title": "Review: House of Cards Collapses, Finally"}, "fb": {"app_id": 305927716147259, "pages": 8810407571}}, "movies": [], "publish_date": null, "source": "https://www.vanityfair.com", "summary": ""}