{"url": "https://kafkasdoor.com/2018/05/16/on-the-new-roseanne-and-queer-spectatorship/", "text": "The Roseanne reboot–which aired on ABC on March 27th to a whopping 18.2 million viewers–has been met with critical acclaim and a flurry of opinion pieces. The crux of the controversy lies in Roseanne Barr’s politics–both from her character and in real life.\n\nThe divided reception among LGBT viewers falls not just along lines of liberal/conservative viewpoints but also asks questions about the way queerness is represented on television. The Connors have added some contemporary updates to their family after 20 years: D.J. (Michael Fishman) is back from the military with a biracial daughter, and Darlene (Sara Gilbert) has a 9-year-old son, Mark (Ames McNamara), who is gender-nonconforming–a fact which becomes the brunt of many jokes between Roseanne and her husband Dan (John Goodman). Roseanne’s treatment of her gender-fluid grandchild makes for some of the more heartwarming moments in a show otherwise fraught with divisive politics. This is due in large part, I imagine, to the presence of GLAAD media consultants and the brilliant lesbian comedian Wanda Sykes in the writers’ room.\n\nThe reboot is undeniably well-written and entertaining, and the appearance of a character on TV who challenges gender stereotypes represents a step in the right direction. However, I would argue the family’s acceptance of Mark serves more as a distraction from the disturbing anti-LGBT policies of Trump–and by extension Roseanne–than as a sign of real social progress. LGBT viewers and our allies should not let Roseanne’s gentle tug at our heartstrings erase her history of spewing hateful rhetoric against the transgender, Muslim, and immigrant communities.\n\nRoxane Gay, commenting on the difficulty in separating the art from the artist, writes in an op-ed for the New York Times: “There are times when we can consume problematic pop culture, but this is not one of those times.” I couldn’t agree more. Like Roxane Gay–who (full disclosure) happens to be one of my idols–I watched the first two episodes and enjoyed them, but I’m choosing not to continue further down the road with the Conner clan.\n\nIf you are a fan and want to keep watching, I don’t think you are a bad person or even any less committed to progressive ideals. I would challenge viewers, however, to remain vigilant about the ways in which the show uses LGBT representation as a clever ruse to normalize policies that are antithetical to both our civil rights and human dignity.\n\nUPDATE: On May 29, 2018, ABC announced that it was canceling the show following a racist tweet from Roseanne Barr.\n\nFor reasons that remain unclear to me, ABC found nothing wrong with Roseanne’s past racist and transphobic remarks and gave her show a reboot anyway. The only thing surprising about this ordeal is that anyone is surprised at all. We knew all along what we were getting when tuning into Roseanne–bigotry masquerading as entertainment.", "images": ["https://secure.gravatar.com/avatar/00047d179f31c3ebb9a5899d12390158?s=48&r=g", "https://secure.gravatar.com/avatar/407dc699e62c260d0951d2480fdd5026?s=48&r=g", "https://secure.gravatar.com/avatar/d7f2fab44feaaa2447a6204de71a36aa?s=48&r=g", "https://kafkasdoor.com/wp-content/plugins/jetpack/modules/sharedaddy/images/loading.gif", "https://i1.wp.com/kafkasdoor.com/wp-content/uploads/2018/04/roseanne-reboot-cast.jpg?resize=640%2C360&ssl=1", "https://kafkasdoor.com/wp-content/uploads/2018/04/roseanne-reboot-cast.jpg", "https://kafkasdoor.files.wordpress.com/2018/03/cropped-cropped-kafkas-door.jpeg"], "top_img": "https://kafkasdoor.com/wp-content/uploads/2018/04/roseanne-reboot-cast.jpg", "keywords": [], "authors": [], "canonical_link": "https://kafkasdoor.com/2018/05/16/on-the-new-roseanne-and-queer-spectatorship/", "title": "On the New Roseanne and Queer Spectatorship", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "The Roseanne reboot--which aired on ABC on March 27th to a whopping 18.2 million viewers--has been met with critical acclaim and a flurry of opinion pieces. The crux of the controversy lies in Roseanne Barr's politics--both from her character and in real life. The divided reception among LGBT viewers falls not just along lines of…", "og": {"type": "article", "title": "On the New Roseanne and Queer Spectatorship", "url": "https://kafkasdoor.com/2018/05/16/on-the-new-roseanne-and-queer-spectatorship/", "description": "The Roseanne reboot–which aired on ABC on March 27th to a whopping 18.2 million viewers–has been met with critical acclaim and a flurry of opinion pieces. The crux of the controversy li…", "site_name": "Kafka's Door", "image": {"identifier": "https://kafkasdoor.com/wp-content/uploads/2018/04/roseanne-reboot-cast.jpg", "width": 1000, "height": 563, "alt": "roseanne-reboot-cast"}, "locale": "en_US"}, "article": {"published_time": "2018-05-16T14:12:14+00:00", "modified_time": "2018-06-06T13:22:19+00:00"}, "twitter": {"creator": "@zach_shultz", "site": "@zach_shultz", "text": {"title": "On the New Roseanne and Queer Spectatorship"}, "card": "summary"}, "msapplication-TileImage": "https://s0.wp.com/i/webclip.png"}, "movies": [], "publish_date": 1526443200.0, "source": "https://kafkasdoor.com", "summary": ""}