{"url": "https://www.drrichardzeff.com/skin-care/prp/", "text": "Platelet Rich Plasma (PRP)\n\nWhat is PRP?\n\nOur experienced plastic surgeon and skilled medical team offer the newest technology using your own blood to stimulate rejuvenation and healing. Platelet Rich Plasma (PRP) refers to specific components of your blood, the platelets and serum. Platelets are critical for healing processes and as such have been recognized for their ability to secrete growth factors and stimulators. PRP has been used for many years in the treatment of injuries to the musculoskeletal system; however, in more recent years, it has been incorporated into aesthetic practices as a tool to stimulate cell growth, including hair follicles and collagen deposition.\n\nOur practice offers the novel Selphyl PRP® System. This system provides the most advanced form of matrix PRP, providing maximum release of growth factors.\n\nWhat can PRP do for me?\n\nPRP can increase collagen production in the skin and subcutaneous tissues resulting in decreased wrinkles and increased facial volume. PRP can also help restore hair growth in areas where there is hair but in declining amounts, specifically the scalp. PRP can also be applied in conjunction with other treatments, such as fat grafting, to increase fat graft survival.\n\nHow is PRP obtained; what is the process?\n\nPRP is obtained through a simple in-office blood draw. The amount of PRP needed depends on the surface area being treated. Typically only one vial of blood is needed; however, at times, two vials may be drawn at the same time. After the blood is drawn, it then undergoes a six-minute centrifugation. The PRP then remains at the top of the vial and can be extracted separately from the remaining blood volume.\n\nDo I need to do anything special for PRP treatment?\n\nFor optimal PRP volume a patient should be well hydrated prior to the procedure. There are no dietary restrictions or precautions that otherwise need to be taken.\n\nHow is PRP delivered?\n\nPRP can be injected directly into the desired area. It can also be delivered through the skin’s surface using a variation of microneedling (see below). There can be up to a week of downtime following an aggressive PRP treatment. This can include bruising or petechiae (pinpoint red marks), all of which are normal and resolve with time.\n\nWhat is skin microneedling with PRP?\n\nThis is the process of micro-needling and administering PRP topically at the same time. The goal of combining micro-needling with PRP is to maximize collagen regeneration of the skin. Micro-needling with or without PRP does not typically achieve a complete response with only one treatment. Therefore, the procedure is typically sold in packages of three treatments.\n\nWhat is a PRP facelift?\n\nA PRP facelift describes the use of PRP for facial filler or volumization. This procedure uses PRP to stimulate deeper tissues of the face to produce collagen and increase in volume. Unlike other fillers, the PRP itself does not actually provide the volume; therefore, the result is dependent on a patient’s ability to respond to cell stimulation. Typically this treatment, like other cell stimulators, must be performed in a series.\n\nIn our practice, PRP with or without microneedling is commonly used to address skin tone and texture. This method, unlike fillers, results in less swelling of the area but may require multiple treatments to obtain the optimal result.\n\nHow much does PRP cost?\n\nFacial PRP Treatments cost $800 for one vial and $1500 for two vials", "images": ["https://www.drrichardzeff.com/wp-content/themes/drz/images/zefflogo.png", "https://www.drrichardzeff.com/wp-content/themes/drz/images/social-fb.png", "https://www.drrichardzeff.com/wp-content/themes/drz/images/social-google.png", "https://www.drrichardzeff.com/wp-content/themes/drz/images/masaps1.png", "https://www.drrichardzeff.com/wp-content/themes/drz/images/skinceuticals.jpg", "https://www.drrichardzeff.com/wp-content/themes/drz/images/footer-decoration.png", "https://www.drrichardzeff.com/wp-content/themes/drz/images/finance-opts.jpg", "https://www.drrichardzeff.com/wp-content/themes/drz/images/social-yt.png", "https://www.drrichardzeff.com/wp-content/themes/drz/images/asps1.png", "https://www.drrichardzeff.com/wp-content/themes/drz/images/social-tw.png", "https://www.drrichardzeff.com//wp-content/uploads/2014/06/dd3-laser.jpg", "https://www.facebook.com/tr?id=629671093862193&ev=PageView&noscript=1", "https://www.drrichardzeff.com//wp-content/uploads/2014/06/dd3-face.jpg", "https://www.drrichardzeff.com/wp-content/uploads/2018/04/logo-drrichardzeff.jpg", "https://www.drrichardzeff.com/wp-content/themes/drz/images/view-gallery.jpg", "https://www.drrichardzeff.com//wp-content/uploads/2014/06/dd3-injectables.jpg", "https://www.drrichardzeff.com/wp-content/themes/drz/images/social-i.png", "https://www.drrichardzeff.com/wp-content/themes/drz/images/logo.jpg", "https://www.drrichardzeff.com/wp-content/uploads/2017/04/Logo-300x55.png", "https://www.drrichardzeff.com/wp-content/themes/drz/images/special-offers.jpg", "https://www.drrichardzeff.com//wp-content/uploads/2014/06/dd3-skincare.jpg", "https://www.drrichardzeff.com/wp-content/themes/drz/images/rm-sig.png", "https://www.drrichardzeff.com/wp-content/themes/drz/images/request-consult.jpg", "https://www.drrichardzeff.com//wp-content/uploads/2014/06/dd3-breast.jpg", "https://www.drrichardzeff.com//wp-content/uploads/2014/06/dd3-body.jpg"], "top_img": "https://www.drrichardzeff.com/wp-content/uploads/2018/04/logo-drrichardzeff.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.drrichardzeff.com/skin-care/prp/", "title": "Platelet Rich Plasma PRP Facial Maine New Hampshire NH", "meta_data": {"viewport": "maximum-scale=1.0, user-scalable=0, width=device-width", "description": "Platelet Rich Plasma, or PRP, from our New England area plastic surgery practice and rejuvenate the skin and help regrow hair using your own blood. Learn more here.", "twitter": {"card": "summary_large_image"}, "og": {"site_name": "Dr. Richard Zeff", "title": "Platelet Rich Plasma PRP Facial Maine New Hampshire NH", "description": "Platelet Rich Plasma, or PRP, from our New England area plastic surgery practice and rejuvenate the skin and help regrow hair using your own blood. Learn more here.", "image": {"identifier": "https://www.drrichardzeff.com/wp-content/uploads/2018/04/logo-drrichardzeff.jpg", "width": 160, "height": 268}, "url": "https://www.drrichardzeff.com/skin-care/prp/", "type": "website"}}, "movies": [], "publish_date": null, "source": "https://www.drrichardzeff.com", "summary": ""}