{"url": "https://www.byrdie.com/kim-kardashian-makeup-looks", "text": "The formidable Kim Kardashian West's 38th birthday is this Sunday, October 21, and in celebration of the reality TV and business mogul's latest trip around the sun, we decided to take a look back on her life in makeup. After all, Kim K. has one of the most recognizable makeup aesthetics in the world. As far as the mainstream beauty consumer is concerned, she basically put contouring on the map. But a sculpted complexion and smoky eye weren't always her signature.\n\nDo a little digging, and you'll find that even though Kim definitely loved makeup from a young age, it took some time (and a legendary partnership with makeup artist Mario Dedivanovic) for her to nail down her look and earn her place as a makeup icon.\n\nWant to see Kim K.'s evolution? Keep scrolling to find 15 memorable Kim Kardashian West makeup looks—from the '90s to today.\n\nIs it weird that our favorite Kim K. beauty vibe is this seventh-grade '90s brownish-red lip? She started off her makeup career with a bang.\n\nAs early as eighth grade, Kim was already living that nude-lip lifestyle. This is a true-to-form Kim K. take on Drew Barrymore makeup—bold brows and brownish-nude lipstick.\n\nThis family photo was taken when Kim was 19 years old in 1999—aka peak skinny-brow-and-lip-liner era.\n\nGetty Images\n\nAh, 2006. Heavy doses of self-tanner, blush, smoky eye shadow, and lip gloss defined Kim during this era.\n\nGetty Images\n\nBy 2007, we were seeing a slightly more toned-down look but with hyper-arched brows and more spider-like lashes. Dark eyes and nude lips are definitely already solidified as her signature at this point. It's the same year Kim started working with her now longtime makeup artist and business partner Mario Dedivanovic.\n\nHere, in 2009, we have evidence of Kim's trademark contouring. We also hit a bit of an awkward phase with her lashes—those extensions are a lot.\n\nGetty Images\n\nEven when Kim K. whips out a special-occasion red lip, her aesthetic is still consistent. It's always matte, contoured skin and either a bold eye or a bold lip, never both. This 2008 look is lovely: subtly bronzy eye, creamy reddish lip, natural feathered brows.\n\nGetty Images\n\nWe saw Kim starting to play with unique eye shadow at the 2009 Maxim Hot 100 celebration. This greenish-gold cut crease is a sign of more colorful eye makeup to come.\n\nOne of history's most internet-breaking makeup pics is no doubt this iconic contouring during-and-after shot Kim posted on Twitter in 2010. Of course, contouring was nothing new to the makeup artistry world, but beauty consumers were so shook by this image, it launched a new generation of contour, highlight, and baking products.\n\nGetty Images\n\nBy 2012, with the help of Instagram's increasing usage, the whole internet had come to recognize Kim's go-to makeup look: cream contour, pale lip, and a sultry smoky eye complete with voluminous falsies.\n\nGetty Images\n\nDuring both of Kim's pregnancies, she seemed to lean toward bold lips as opposed to her signature smoky eyes, at least on red carpets. This berry-lipped look from the 2013 Met Gala is incredibly glowy, feminine, and pretty.\n\nGetty Images\n\nAnother bold lip from pregnancy number two in 2015, this rich plum color harkens back to Kim's seventh-grade look.\n\nThe launch of Kim's makeup line, KKW, in 2017, officially made her contoured look as iconic as her sister Kylie's lips or Paris Hilton's tagline, \"That's hot.\" Kim's user-friendly contour and highlight kits ($48) brought the technique that Mario had been using on her for years to the masses.\n\nThe 1980s makeup revival of the past year has obviously had an influence on Kim, too. In spring 2018, the internet flipped over the release of a new KKW eye shadow, a cobalt blue called Libra, which Kim created as a part of a 10-pan palette in collaboration with Mario.\n\nIn the end, Kim will always return to her classic aesthetic—sculpted and bronzed skin, smoked-out eye makeup, plump nude lip. This last look was created with the KKW Classic Collection in summer 2018.", "images": ["https://www.byrdie.com/thmb/cEYNyXzYqgAjeZmmh1EGEVAc7_E=/700x366/filters:fill(auto,1)/cdn.cliqueinc.com__cache__posts__270330__kim-kardashian-makeup-looks-270330-1539803878436-fb.700x0c-68aed17d16b442f893c51b32ba6b2ac3.jpg", "https://:0"], "top_img": "https://www.byrdie.com/thmb/cEYNyXzYqgAjeZmmh1EGEVAc7_E=/700x366/filters:fill(auto,1)/cdn.cliqueinc.com__cache__posts__270330__kim-kardashian-makeup-looks-270330-1539803878436-fb.700x0c-68aed17d16b442f893c51b32ba6b2ac3.jpg", "keywords": [], "authors": ["Amanda Montell"], "canonical_link": "https://www.byrdie.com/kim-kardashian-makeup-looks", "title": "Kim Kardashian West's Makeup Evolution: You Have to See It to Believe It", "meta_data": {"robots": "NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "Kim Kardashian West's makeup looks from the '90s till now are proof that there's hope for all of us", "sailthru.tags": "byrdie,makeup,makeup-face", "article": {"section": "Byrdie", "author": "https://www.facebook.com/amanda.m.montell"}, "fb": {"app_id": 166036133580911}, "og": {"type": "article", "site_name": "Byrdie", "url": "https://www.byrdie.com/kim-kardashian-makeup-looks", "title": "Kim Kardashian West's Makeup Evolution: You Have to See It to Believe It", "description": "Kim Kardashian West's makeup looks from the '90s till now are proof that there's hope for all of us", "image": "https://www.byrdie.com/thmb/cEYNyXzYqgAjeZmmh1EGEVAc7_E=/700x366/filters:fill(auto,1)/cdn.cliqueinc.com__cache__posts__270330__kim-kardashian-makeup-looks-270330-1539803878436-fb.700x0c-68aed17d16b442f893c51b32ba6b2ac3.jpg"}, "twitter": {"card": "summary", "site": "@ByrdieBeauty", "title": "Kim Kardashian West's Makeup Evolution: You Have to See It to Believe It", "description": "Kim Kardashian West's makeup looks from the '90s till now are proof that there's hope for all of us", "image": "https://www.byrdie.com/thmb/cEYNyXzYqgAjeZmmh1EGEVAc7_E=/700x366/filters:fill(auto,1)/cdn.cliqueinc.com__cache__posts__270330__kim-kardashian-makeup-looks-270330-1539803878436-fb.700x0c-68aed17d16b442f893c51b32ba6b2ac3.jpg"}, "lotame": {"tax2": "byr_makeup-face", "tax1": "byr_makeup", "tax0": "byr"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.13.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.13.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.13.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.13.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.13.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://www.byrdie.com", "summary": ""}