{"url": "https://people.com/movies/ben-affleck-jennifer-garner-three-year-divorce/", "text": "Image zoom Ben Affleck and Jennifer Garner Angela Weiss/FilmMagic\n\nAfter being in limbo for three years after announcing their split in June 2015, Jennifer Garner and Ben Affleck‘s marriage has officially come to an end.\n\nPEOPLE confirmed the two finalized their divorce on Thursday after they met at Garner’s house with lawyers and a private judge.\n\nThe finalization came one day after news broke the actress, 46, had requested a private judge to handle the final details of their divorce, according to court documents obtained by PEOPLE.\n\nThe estranged couple announced their separation after 10 years of marriage and three children together: Violet, 12, Seraphina, 9, and Samuel, 6. Affleck, 46, and Garner began dating in 2004 and married in June 2005 before simultaneously filing for divorce in April 2017.\n\nIn the time between their split announcement and the divorce filing, the former couple presented a largely united front as they went through challenges together — namely, Affleck’s recent rehab stay. Garner showed her support by driving him to the treatment facility.\n\nHere’s an inside look into the former couple’s ups and downs.\n\n“The Love of My Life”\n\nSix months after the former couple announced their split, Affleck was living in the guesthouse of their family home — something that seemed to begin taking a toll.\n\n“It’s obvious many times that they both find it annoying to deal with each other,” an insider told PEOPLE at the time. “Understandably so. It’s a strange situation to live together and yet be separated.”\n\nImage zoom Jennifer Garner and Ben Affleck at the 2013 Academy Awards Jason Merritt/Getty\n\n“They are doing what is working for the kids,” a Garner source noted of the living set-up.\n\nFor Affleck, keeping his mind on work apparently helped ease the pain of the separation. In September 2015, he was focusing on his directorial effort Live By Night and promoting Batman v Superman: Dawn of Justice. “He is happier and a more fulfilled person when he’s busy all day and night working,” a film source told PEOPLE. A source close to the actor added, “He is as happy as he can be in this position. I don’t think it’s that easy, and definitely not that easy to do it in the public eye.”\n\nIn February 2016, Garner opened up about the ongoing divorce in an interview with Vanity Fair. While the actress called Affleck “the love of my life,” she also opened up about their marital struggles, telling the magazine, “I always say, ‘When his sun shines on you, you feel it. But when the sun is shining elsewhere, it’s cold.’ He can cast quite a shadow.”\n\nAffleck later told The New York Times, “She’s allowed to talk about it,” adding, “She felt like she wanted to discuss it and get it out there and get it over with so she could say, ‘Look, I already talked about it – I don’t want to do it again.’ ”\n\nAfter celebrating Easter as a family in Los Angeles that year, Affleck and Garner spent a month in Europe with their kids while he filmed Justice League, including time in London and a family getaway to Paris. “She did have the best time in Europe with Ben and the kids,” a friend of Garner’s told PEOPLE. “She seemed to enjoy spending time with Ben again.”\n\nCo-Parenting After Their Split\n\nGarner and Affleck stayed close as they continued to live and vacation together as well as co-parent their kids — while also stepping out for solo outings. Shortly after announcing the separation, the entire family jetted off to the Bahamas to spend time together.\n\nImage zoom Jennifer Garner with her three children, Seraphina, Violet and Samuel at her Walk of Fame Ceremony in August Vince Flores/Startraksphoto.com\n\nThe family reunited again the following month in Atlanta, Georgia, where Garner was filming Miracles from Heaven. Affleck traveled to the Southern state to celebrate his 43rd birthday with his ex and the kids. “He’s happiest when he’s with his family,” a close friend told PEOPLE at the time.\n\nIn September 2015, the pair were spotted leaving a family counseling center in L.A. This marked their first visit to the center since announcing their divorce. Before their decision to separate, they attended weekly counseling sessions at the center but stopped going in the months leading to their split.\n\nA source said they chose to remain friendly for reasons beyond parenting. “It’s not just for the kids – it’s also for them,” said the source. “They care about each other.” As the family continued to step out as a unit, observers noticed that Affleck and Garner seem to be looking happier after a tumultuous summer. “His family is all [Ben] cares about. This is what makes him happy and it makes sense that he looks happier,” another source told PEOPLE. “He enjoys the time with his family and that includes Jen.”\n\nSince then, the two have worked hard at maintaining a harmonious relationship for the sake of their children. They recently took the kids to see Hello, Dolly! on Broadway in mid-July, starring family friend Victor Garber, and spent Easter together in Hawaii where Affleck was filming.\n\nOn Sunday, the two stepped out at church together with their children after Affleck completed 30 days in rehab. Three days later, Affleck and Garner stepped out with the kids again for a school event on Wednesday.\n\n“He went to church on Sunday with his family,” a source told PEOPLE. The source added Affleck was smiling during the outing because the 30-day milestone means “he has reason to celebrate.”\n\nFrom Coinage: See Where 6 Stars Were Before They Were Famous\n\nMoving On\n\nAffleck began dating Saturday Night Live producer Lindsay Shookus in 2017. The two made their relationship public when they were spotted grabbing dinner in July 2017.\n\nThe couple dated for more than a year, often taking trips together to Hawaii and Puerto Rico, where the actor was working. Affleck was even in attendance at the 2017 Emmy Awards in which Shookus, 38, took to the stage when SNL won for outstanding variety sketch series.\n\nThe two spent time together at Affleck’s home in Los Angeles and were often spotted grabbing dinner around the city.\n\nIn August 2018, a source told PEOPLE the two split because of the long distance between Affleck living in Los Angeles and Shookus being in New York. The two stopped being photographed together in July.\n\nUpon his return to rehab, a source close to Shookus and Affleck told PEOPLE the producer “had been supporting Ben’s sobriety and going to meetings with him.”\n\n“She had him in meditation and they were doing it together,” the source said. “His recovery was something that was very important to both of them.”\n\nImage zoom Ben Affleck and Shauna Sexton Lastarpix/BACKGRID\n\n“It was very hard for her to break up with Ben, but she knew he wasn’t getting better and that it was time for her to step aside,” the source continued. “She was trying to stay as close to him as possible so that he would stay on the right path, but ultimately it just wasn’t possible. She knew she had to let him hit bottom.”\n\nNot long after their split, the actor was spotted with 22-year-old Playboy model Shauna Sexton having dinner at Nobu in Malibu. Shortly after that, the two were seen visiting a Jack in the Box drive-thru together over the weekend.\n\nIn September, a source close to Affleck said he and Sexton were “just getting to know each other.“\n\nThe model has been photographed leaving the actor’s home, driving his SUV and visiting him in rehab. They were photographed together this week leaving his home as he continued rehab treatment.\n\nEntering Rehab\n\nMultiple sources told PEOPLE in August the two were close to finalizing their divorce in the weeks leading up to Affleck’s return to rehab.\n\nA source told PEOPLE the two were still “working on” their divorce: “They’ve spent quite some time figuring out what works best for them and their family.”\n\nAnother source said in the days before Affleck’s trip to rehab, Garner was mostly concerned about their three children.\n\nRELATED VIDEO: Ben Affleck Reveals He Completed 40-Day Rehab Stay: ‘I Am Fighting for Myself and My Family’\n\n“Her number one concern is the kids,” the source said, noting that Garner struggles with questions like, “Is Ben healthy enough to have custody?” Added the source: “What she ultimately cares about is his sobriety and whether she can rely on him to co-parent.”\n\nAffleck released a statement on Thursday addressing his rehab which he posted on Instagram.\n\n“The support I have received from my family, colleagues and fans means more to me than I can say. It’s given me the strength and support to speak about my illness with others,” Affleck wrote. “Battling any addiction is a lifelong and difficult struggle. Because of that, one is never really in or out of treatment. It is a full-time commitment. I am fighting for myself and my family.”\n\nIf you or someone you know is in need of help, please contact the SAMHSA substance abuse helpline at 1-800-662-HELP.", "images": ["https://peopledotcom.files.wordpress.com/2019/06/garner-12.jpg?crop=0px%2C564px%2C1500px%2C788px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2019/05/inset.jpg?crop=0px%2C0px%2C2000px%2C1050px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2018/08/jennifer-garner7.jpg", "https://peopledotcom.files.wordpress.com/2017/04/ben-affleck-jennifer-garner-2.jpg", "https://peopledotcom.files.wordpress.com/2019/07/diane-keaton.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2018/08/awkwafina1.jpg?crop=0px%2C0px%2C1897px%2C995.925px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2019/07/screen-shot-2019-07-12-at-3.30.32-pm.jpg?crop=0px%2C0px%2C1920px%2C1008px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2019/04/jessica-simpson-3.jpg?crop=0px%2C126px%2C1500px%2C788px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2017/05/ben-jen.jpg?crop=0px%2C63px%2C1282px%2C672px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2019/05/channing-tatum-jessie-j-3.jpg?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2019/06/jennifer-garner.jpg?crop=0px%2C0px%2C1800px%2C945px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2019/06/mega454887_062.jpg?crop=0px%2C227px%2C1794px%2C942px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2017/04/ben-affleck-jennifer-garner-1.jpg", "https://peopledotcom.files.wordpress.com/2018/08/ben-affleck2.jpg", "https://peopledotcom.files.wordpress.com/2019/01/editorial-franchise-exclusive.png", "https://peopledotcom.files.wordpress.com/2019/06/matt-amy-roloff.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2019/07/alex-rodriguez-1-1200.jpg?crop=0px%2C0px%2C1200px%2C630px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2019/06/jlo-c-1.jpg?crop=20px%2C333px%2C624px%2C327px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2019/04/jessica-alba-cash-warren-paris-vacation.jpg?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2019/03/john-delaney.jpg?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2019/05/shfeu.jpg?crop=0px%2C0px%2C1800px%2C945px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2017/11/gettyimages-166113249.jpg", "https://peopledotcom.files.wordpress.com/2017/04/ben-affleck-jennifer-garner-2.jpg?crop=0px%2C0px%2C2000px%2C1050px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2019/04/couple-1.jpg?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2018/08/kunis-kutcher-1-2000.jpg?crop=0px%2C0px%2C2000px%2C1050px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2019/06/screen-shot-2019-06-18-at-9.50.02-am.jpg?crop=765px%2C535px%2C1703px%2C894px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2017/02/ben-affleck.jpg", "https://peopledotcom.files.wordpress.com/2018/01/hanks-rita.jpg?crop=0px%2C0px%2C4540px%2C2383.5px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2019/06/gettyimages-1027960602.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2019/04/screen-shot-2019-04-25-at-8.41.31-am.png?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2018/04/mickey-pretzels-1-2000.jpg?&fit=250%2C250"], "top_img": "https://peopledotcom.files.wordpress.com/2017/04/ben-affleck-jennifer-garner-2.jpg?crop=0px%2C0px%2C2000px%2C1050px&resize=1200%2C630", "keywords": [], "authors": ["Alexia Fernandez"], "canonical_link": "https://people.com/movies/ben-affleck-jennifer-garner-three-year-divorce/", "title": "Inside Ben Affleck and Jennifer Garner's Three Year Divorce", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "Ben Affleck,Couples,Divorce,Jennifer Garner,Movie Celebrities,Movie News,News", "news_keywords": "Ben Affleck,Couples,Divorce,Jennifer Garner,Movie Celebrities,Movie News,News", "description": "After hanging in limbo three years after they announced their split in June 2015, Jennifer Garner and Ben Affleck's marriage has officially come to an end", "og": {"title": "Inside Ben Affleck and Jennifer Garner's Three Year Divorce", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/movies/ben-affleck-jennifer-garner-three-year-divorce/", "description": "After hanging in limbo three years after they announced their split in June 2015, Jennifer Garner and Ben Affleck's marriage has officially come to an end", "image": {"identifier": "https://peopledotcom.files.wordpress.com/2017/04/ben-affleck-jennifer-garner-2.jpg?crop=0px%2C0px%2C2000px%2C1050px&resize=1200%2C630", "width": 1200, "height": 630}}, "pinterest": {"url": "https://people.com/movies/ben-affleck-jennifer-garner-three-year-divorce/", "description": "After hanging in limbo three years after they announced their split in June 2015, Jennifer Garner and Ben Affleck's marriage has officially come to an end", "media": "https://peopledotcom.files.wordpress.com/2017/04/ben-affleck-jennifer-garner-2.jpg?crop=0px%2C0px%2C2000px%2C1050px&resize=1200%2C630"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/movies/ben-affleck-jennifer-garner-three-year-divorce/", "title": "Inside Ben Affleck and Jennifer Garner's Three Year Divorce", "description": "After hanging in limbo three years after they announced their split in June 2015, Jennifer Garner and Ben Affleck's marriage has officially come to an end", "site": "@people", "image": "https://peopledotcom.files.wordpress.com/2017/04/ben-affleck-jennifer-garner-2.jpg?crop=0px%2C0px%2C2000px%2C1050px&resize=1200%2C630"}, "fb": {"pages": 95926963131}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}