{"url": "https://www.inquisitr.com/5130404/megyn-kelly-doesnt-understand-why-people-thought-luann-de-lesseps-diana-ross-costume-was-considered-racist/", "text": "Megyn Kelly hosted a shocking segment on an episode of her morning talk show Megyn Kelly Today this week and during the segment, she defended LuAnn de Lesseps’ Diana Ross Halloween costume.\n\nDuring an episode of The Real Housewives of New York City earlier this year, de Lesseps dressed up as the music icon for a party with her co-stars but because she wore a black wig and appeared to have much darker skin, many fans were outraged and accused her of wearing blackface and being “tone deaf.”\n\nMonths later, Kelly defended de Lesseps’ outfit, telling her audience and viewers that she simply didn’t understand how the costume would have been deemed “racist.” After all, she explained, Halloween is all about dressing up to be someone else.\n\n“There was a controversy on The Real Housewives of New York with Luann, and she dressed as Diana Ross, and she made her skin look darker than it really is and people said that that was racist,” Kelly said, via Fox 10 News. “And I don’t know, I felt like who doesn’t love Diana Ross? She wants to look like Diana Ross for one day. I don’t know how, like, that got racist on Halloween.”\n\nAccording to Kelly, it was okay for a white person to wear blackface on Halloween, or for a black person to wear whiteface on Halloween when she was a kid, as long as they were dressing up as a character, which de Lesseps had done.\n\nAfter catching backlash over her Halloween costume, LuAnn de Lesseps released an apology to her fans and followers on Twitter.\n\n“I would like to clear the air, I love and respect Diana Ross, this was my tribute to her I was showing my sincere admiration,” she tweeted.\n\n“I in no way altered my skin color and I did not mean to offend anyone,” de Lesseps added.\n\nMegyn Kelly has also since offered an apology to her colleagues for the offensive things she said during her show this week, explaining that she had changed her mind about her thoughts after listening carefully to a number of different views from others.\n\n“I realize now that such behavior is indeed wrong, and I am sorry,” she said. “The history of blackface in our culture is abhorrent; the wounds too deep.”\n\nOn this morning’s Today show, Kelly’s co-workers, including Al Roker, weighed in on Kelly’s apology, claiming the television host should be saying “I’m sorry” to more than just her colleagues.", "images": ["https://secure.gravatar.com/avatar/34feb98eadd86f8672383a21efe174f9?s=250&d=mm&r=g", "https://www.inquisitr.com/wp-content/uploads/2019/07/Rita-Ora-3-300x170.jpg", "https://cdn.inquisitr.com/assets/ee54ce/dist/images/logos/favicon.png", "https://www.facebook.com/tr?id=1472001486461948&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=478801082325642&ev=PageView&noscript=1", "https://www.inquisitr.com/wp-content/uploads/2018/10/LuAnn-De-Lesseps-Blackface-Not-Racist.jpg", "https://cdn.inquisitr.com/assets/ee54ce/dist/images/logos/logo_header_no_tagline.png"], "top_img": "https://cdn.inquisitr.com/assets/ee54ce/dist/images/logos/favicon.png", "keywords": [], "authors": ["Lindsay Cronin"], "canonical_link": "https://www.inquisitr.com/5130404/megyn-kelly-doesnt-understand-why-people-thought-luann-de-lesseps-diana-ross-costume-was-considered-racist/", "title": "Megyn Kelly Doesn’t Understand Why People Thought LuAnn De Lesseps’ Diana Ross Costume Was Considered ‘Racist’", "meta_data": {"msapplication-TileImage": "//cdn.inquisitr.com/assets/ee54ce/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "https://www.inquisitr.com", "summary": ""}