{"url": "http://figureskatersonline.com/mirainagasu/home/news/", "text": "News, Articles & Videos\n\nMirai will be a guest judge on Season 11, episode 6 (“The Draglympics”) of VH1’s “RuPaul’s Drag Race” to be broadcast on Thursday, April 4, 2019 at 9 pm Eastern/8 pm Central – Mirai’s Instagram shows what she’ll be wearing on the show.\n\nArticle: Who is Mirai Nagasu? Everything you need to know about RuPaul’s guest judge! (RealityTitbit.com, April 3, 2019).\n\nArticle+Video: History-Making Figure Skater Mirai Nagasu Talks Life After the Olympics (Cosmopolitan, March 27, 2019)\n\nPodcast Interview: The tears behind triple axel triumph with Mirai Nagasu (Olympic Channel, February 13, 2019)\n\nMirai will return as a full-time cast member of the 2019 U.S. STARS ON ICE presented by Musselman’s tour [as announced in this Feb. 7th press release]. Visit her Skating page for the full list of 13 tour dates & locations (April 18-May 18,2019).\n\nArticle: Mirai Nagasu makes commentating debut at U.S. Championships (NBC OlympicTalk, January 25, 2019)\n\nBridgestone Ice Desk YouTube videos featuring Mirai: [Ladies Short Program Preview][Ladies Short Wrap-up][Ladies Free Preview][Ladies Free Wrap-up]\n\nUSFS FanZone video: [Wake Up U.S. Championships (Day 2)]\n\nArticle/TV Interview: Olympic skater Mirai Nagasu discusses U.S. Figure Skating Championships in Detroit (WDIV 4 Detroit, January 14, 2019)\n\nPhotos: Mirai Nagasu attends the 6th annual ‘Gold Meets Golden’ Brunch in West Hollywood, CA (Getty Images, January 5, 2019)\n\nArticle [based on Mirai’s Instagram post]: Mirai Nagasu will skip nationals, reveals past surgery (NBC Sports’ Olympic Talk, January 5, 2019)\n\nVideo clip: Mirai’s triple Axel at the Olympics is the final clip in “2018, in 5 minutes” (Vox on YouTube, December 31, 2018)\n\nArticle+photos: Kimmie Meissner and Mirai Nagasu Headline [12/1] Providence Holiday Show (U.S. Figure Skating Fan Zone, published on December 16)\n\nArticle: Olympic figure skater Mirai Nagasu speaks about career and anxiety (North by Northwestern, published on November 12)\n\nArticle: Figure skater Mirai Nagasu talks career, setbacks and landing that historic triple axel (The Daily Northwestern, published on November 11)\n\n“Frank Buckley Interviews” podcast (40 mins.): [Mirai Nagasu, Olympic Figure Skater] (KTLA.com, published on September 26)\n\nEssay by Mirai: Olympian Mirai Nagasu on struggling with self-acceptance as a figure skater (TODAY Style, July 26)\n\nArticle: Mirai Nagasu Opens Up About Denis Ten’s Death: ‘It Really Hurts Deeply’ (Just Jared Jr., July 20)\n\nArticle & Photos: Maia & Alex Shibutani Join Mirai Nagasu on Kids’ Choice Sports Awards 2018 Orange Carpet (Just Jared Jr., July 19)\n\nArticle & Video: Olympic Figure Skater Mirai Nagasu Almost Pursued a Golf Career (E! News, July 19)\n\nArticle & Photos: Adam Rippon & Mirai Nagasu Make a Stylish ESPYs 2018 Red Carpet Arrival (Just Jared Jr., July 18)\n\nArticle & Photos: Adam Rippon & Mirai Nagasu’s Most Embarrassing Style Choices Are All Too Relatable (Elite Daily, July 16)\n\n“The Sit Down” interview (19 mins.): [Video posted on CBS Local News’ YouTube channel] (filmed in New York City; published on June 29)\n\nArticle: Mirai Nagasu to skip Grand Prix this fall (NBC Sports’ Olympic Talk, June 27)\n\nOK! Magazine video (3 mins.): [Mirai Nagasu & Adam Rippon go head-to-head in a game of “A Walk In Their Shoes”] (filmed at the DSW Block Party in NYC on June 27)\n\nArticle & Photos: Adam Rippon & Mirai Nagasu Serve Up Cheeseburgers at DSW’s Block Party Event in New York City (Just Jared Jr., June 27)\n\nArticle and DSW Promotional Photo Shoot: Adam Rippon and Mirai Nagasu Star in DSW’s New Summer Campaign] (People, June 20); Link to DSW’s publicity photo shoot spread on Mirai & Adam (“We spent a foggy L.A. day with Adam and Mirai swapping stories about style icons, taking risks, and how shoes are an essential part of self-expression.”)\n\nArticle & Photos: Mirai Nagasu Attends Radio Disney Music Awards 2018 (Just Jared Jr., June 22)\n\nQ&A Article: Mirai Nagasu Talks Life After The Olympics, “Dancing With The Stars” And Public Speaking (TeamUSA.org, June 3)\n\nOn May 26, 2018, Mirai was honored by Pop Warner with their Female Achievement Award in Orlando, Florida. According to the Pop Warner Little Scholars website, their 58th Annual Pop Warner Scholastic Banquet “recognizes its top scholar-athletes and deserving adults in the sports industry who have contributed to the advancement of academics and/or athletics.” The evening before, at the Professional Skaters Association’s annual ‘EDI’ awards dinner on May 25, Mirai was announced as the winner of the Sonja Henie Award, which is “Presented to a female, professional skater who has brought recognition to the sport in a positive and favorable manner.”\n\nDancing with the Stars & Stars on Ice tour:\n\nMirai participated in the May 21st Dancing with the Stars; Athletes Finale’s All Cast number at the end of the show – the camera focuses on her and Alan dancing together at the 40-second mark of this 1:35-minute video on DWTS’ YouTube channel.\n\nMirai shared a 2-part message about her DWTS experience on her Instagram (May 20): [Post 1] & [Post 2].\n\nWEEK 3 VIDEOS: Mirai and Alan dance a Quickstep to “Bo$$” by Ray Chew Live dedicated to her MVP mom, Ikuko (Official DWTS YouTube channel, May 14)\n\nIn round 2, Mirai & Alan squared off in a Ballroom Battle Dance-Off against Adam Rippon & Jenna Johnson with both teams dancing a Jive to Johnny B. Goode” by Chuck Berry: [Watch the dance-off here].\n\nPost-Show Interview Videos:\n\nTeamUSA.org: Mirai Nagasu Lived Her Best Life On “Dancing With The Stars”\n\nEntertainment Tonight: ‘DWTS’: Mirai Nagasu ‘Loved Every Second’ Despite Surprising Elimination\n\nAccess: Mirai Nagasu’s ‘DWTS’ Partner Alan Bersten Dishes On Her Trash Talk\n\nMirai’s Blog for People: Mirai Nagasu on Moving in with Fellow DWTS Competitor Adam Rippon — and Their Battle Ahead! (written before the week 3 show)\n\nMirai Nagasu and Alan Bersten talk about their ‘DWTS’ experience so far (May 14, Icenetwork)\n\nWEEK 2 VIDEOS: Mirai and Alan dance a Foxtrot to “It’s a Small World” by The O’Neill Brothers Group / ”We Love Disney” (Official DWTS YouTube channel, May 7)\n\nThey also performed a team dance, as part of Team 1970s Football, to “Instant Replay” by Dan Hartman: [Watch the Team Dance here]\n\nPost-Show Interview Videos (3): [Fox 11’s Good Day L.A. (6 mins.)]; [Access]; [Entertainment Tonight (First ’10’ by Mirai on DWTS: Athletes)]\n\nMirai’s Blog for People: DWTS’ Mirai Nagasu Says Her Boyfriend Has Been with Her ‘Every Step of This Journey’ (written before the week 2 show)\n\nVideo: Behind the scenes with Mirai Nagasu as she prepares for night two on ‘DWTS’ with an appearance by Adam Rippon (Good Morning America on Facebook Live, May 7)\n\nWEEK 1 VIDEO: Mirai Nagasu and Alan Bersten dance a Salsa to “No Excuses” by Meghan Trainor on Dancing with the Stars Season 26 premiere! (Official DWTS YouTube channel, April 30)\n\nPost-Show Interview Videos (3): [Access]; [E! News]; [Extra TV]\n\nVideo: MIRAI’S VLOG #2: Pre-Premiere of Dancing With the Stars and on the road with Stars on Ice (May 6)\n\nNagasu, Rippon finding their groove on ‘DWTS’ (May 7, Icenetwork)\n\nArticle: Skating in St. Paul [Sunday 5/6] or dancing on TV, Mirai Nagasu has ‘Star’ power to burn (Star Tribune, May 3)\n\nArticle: From the ice to the dance floor, Mirai Nagasu is ‘living in the moment’ (Figure Skaters Online, April 30)\n\nVideo: Interview with Mirai & Alan Bersten filmed before the premiere of ‘DWTS: Athletes’ (Young Hollywood, April 30)\n\nPodcast: What’s it Like to Do a Triple Axel? with Mirai Nagasu (Getting Curious with Jonathan Van Ness, April 30)\n\nArticle+Video: ‘It’s all about those hips!’ Mirai Nagasu, Chris Mazdzer will dance salsa first on all-athlete ‘DWTS’ (ABC7, April 27)\n\nVideo: Mirai Nagasu Shares Her Aspirations To Be A TV Host: ‘I’m Ready!’ (Access Live, April 26)\n\nArticle+Video: Mirai Nagasu Says Tonya Harding Didn’t Know Who She Was When They Met on DWTS (People, April 26) [YouTube link to watch her and Alan Bernsten’s Access Live interview]\n\nVideo: Chris Mazdzer and Mirai Nagasu Live – Dancing With the Stars : Athletes (Celebs Q&A YouTube channel, April 25)\n\nArticle+Video: Olympic figure skater Mirai Nagasu ready for her ‘Dancing’ moment (ABC Los Angeles, April 24)\n\nArticle: Nagasu, Rippon take center stage on ‘DWTS’ (Icenetwork, April 13)\n\nVideo: Mirai Nagasu Gunning for Adam Rippon on “DWTS” (E! Live from the Red Carpet, April 13)\n\nVideo: ‘Dancing With The Stars’: Mirai Nagasu – ‘I’m Really Determined Not To Get Eliminated The 1st Week!’ (Access, April 13)\n\nAcademy Awards (March 4, 2018), Pre-Worlds articles & Vlog #1:\n\nVideo: MIRAI’S VLOG #1 (March 23)\n\nArticle+Olympic Team Event FS Video: Mirai Nagasu’s perseverance pays off (ISU.org/Olympic Channel, March 20)\n\nArticle: Mirai Nagasu enters worlds motivated by Olympic finish, future undecided (NBC Sports’ Olympic Talk blog, March 19)\n\nArticle+Video: Mirai Nagasu on Oscar Night With Adam Rippon, DWTS — and Wanting to Do Better After the Olympics (People, March 15)\n\nOlympic skaters Adam Rippon and Mirai Nagasu talk meeting Margot Robbie and if they’ll do DWTS (Entertainment Tonight)\n\nVideo: Olympic skater Mirai Nagasu jokingly offers to do triple axel for I, Tonya sequel – in a blonde wig (People)\n\n6 videos uploaded to Access’ YouTube channel featuring Mirai and Adam Rippon (Access’ invited guests this year), plus one by ABC News:\n\nPre-Show: [Video 1] [Video 2] [Video 3];\n\nRed Carpet interviews: [ABC News Video] [Video 4] [Video 5];\n\nPost-Oscars: [Video 6].\n\nPre-Short Program/Press Conference articles (Feb. 18-20, 2018):\n\nHow Mirai Nagasu Grew Up and Got Back to the Olympics (New York Times)\n\nMirai Nagasu holding nothing back in search of Olympic individual medal (Orange County Register)\n\nMirai Nagasu was once a hidden Olympian in plain view (Yahoo! News)\n\nTriple axels don’t frighten Mirai Nagasu: ‘If I fall, I’ll take the fall.’ (Washington Post via Daily Herald)\n\nNagasu firmly in Olympic medal conversation (Icenetwork)\n\n8 Years After Fourth-Place Finish In Vancouver, Mirai Nagasu Hopes To Be Cinderella Story At PyeongChang Olympics (Team USA)\n\nA star reborn: Mirai Nagasu reclaims her Olympic story (espnW)\n\nMirai Nagasu is a lesson in perseverance at Olympics (Boston Globe)\n\nOlympics articles (Feb. 12-15, 2018):\n\nWhat Connects Figure Skating Legend Michelle Kwan and New Medalist Mirai Nagasu (People)\n\nMirai Nagasu’s Parents Are Worried About Adding ‘More Pressure’ During the Winter Olympics (US Magazine)\n\nMirai Nagasu’s Quotes About Her Boyfriend, Darian Weiss, Are Literally Goals (Elite Daily)\n\nWhat Life is Like in Figure Skating BFFs Mirai Nagasu and Adam Rippon’s Olympic Village Apartment (Cosmopolitan)\n\nAdam Rippon and Mirai Nagasu share a special bond … and matching tattoos (Yahoo! Sports)\n\nThe Internet Goes Crazy For Adam Rippon And Mirai Nagasu: Relive Feb. 12 In Social Media At The Olympics (Team USA)\n\nNo, that’s not a gigantic ‘USA’ tattoo on Mirai Nagasu’s leg (Time)\n\nMirai Nagasu was once a Colorado Avalanche Ice Girl (Los Angeles Times)\n\nW.Pa. skaters celebrate Mirai Nagasu’s Olympic triple axel (Pittsburgh TribLIVE.com)\n\nFebruary 12, 2018 HISTORIC TRIPLE AXEL coverage:\n\nWATCH HER FULL PERFORMANCE: Mirai Nagasu lands triple Axel in PyeongChang debut (NBC Olympics on YouTube)\n\nMirai Nagasu lands triple axel, a first by an American woman at an Olympics (New York Times)\n\nMirai Nagasu is the first American to land a triple axel at the Winter Olympics (Glamour)\n\nLet’s marvel at Mirai Nagasu’s historic triple axel, frame by frame (SB Nation)\n\nMirai Nagasu’s historic triple axel helps land the U.S. bronze in the team figure skating (Time)\n\nTriple axel launches Nagasu into history books (Icenetwork)\n\nMirai Nagasu’s skate of a lifetime secures bronze for Team USA (Orange County Register)\n\nMirai Nagasu leaps into history with Olympic triple axel (CNN)\n\nMirai Nagasu makes history and Twitter reacts (NBC Olympics)\n\nMirai Nagasu becomes first American women to land triple axel in Olympics (Washington Post)\n\nWATCH: Mirai Nagasu Becomes First American Woman in History to Land Triple Axel at Olympics (Sports Illustrated)\n\nTriple axel propels figure skater Mirai Nagasu into rarefied air at 2018 Winter Olympics (USA Today)\n\nA historic triple axel and a giggle: How Mirai Nagasu helped the U.S. win Olympic bronze in team skate (Yahoo! Sports)\n\nTriumph after tears as Nagasu makes skating history (Reuters)\n\nNagasu, Rippon help lead Americans to figure skating bronze (Associated Press)\n\nFigure Skating Legends React to Mirai Nagasu’s Historic Olympic Triple Axel: ‘What a Triumph’ (People)\n\nOLYMPICS:\n\nOlder, wiser Mirai Nagasu refreshed before second Olympic appearance (NBC Olympics, February 10, 2018)\n\nMirai Nagasu recommits to skating, takes on difficult triple axel (USA Today, February 9, 2018)\n\nFigure skater Mirai Nagasu brings imaginative streak onto ice (USA Today, February 8, 2018)\n\nVideo: Mirai Nagasu started skating when she couldn’t go golfing (NBC Olympics, February 8, 2018)\n\nNo American woman has landed a triple axel in an Olympics. Mirai Nagasu intends to try twice. (Washington Post, February 1, 2018)\n\nNagasu endures hard times with parents’ support (Icenetwork, February 1, 2018)\n\nMirai Nagasu heads to second Olympic games with different approach (Figure Skaters Online, January 30, 2018)\n\nMirai Nagasu’s Olympic Media Teleconference [AUDIO] (U.S. Figure Skating/Icenetwork, January 30, 2018)\n\n2018 Winter Olympics: Mirai Nagasu Q&A (Teen Vogue, January 29, 2018)\n\nMirai Nagasu using old Olympic snub as fuel for 2018 Games (KOAA, January 25, 2018)\n\nOlympics-Bound Figure Skater Mirai Nagasu Asks for Donations So Her Family Can Attend the Games (People, January 12, 2018)\n\nMirai Nagasu looks toward South Korea and past Sochi snub (USA Today, January 12, 2018)\n\n4 Years After Heartbreak, Mirai Nagasu Is at Her Best and an Olympian Again (Bleacher Report, January 6, 2018)\n\n‘Comeback kid’ Nagasu perseveres to reach dream (Icenetwork, January 6, 2018)\n\nNagasu, Tennell, Chen earn U.S. Olympic figure skating spots (AP, January 6, 2018)\n\nU.S. Figure Skating nominates new national champion Bradie Tennell, Mirai Nagasu and Karen Chen to 2018 Pyeongchang Olympic team (NBC Olympics, January 6, 2018)\n\nU.S. Figure Skating announces ladies nominations for 2018 U.S. Olympic Figure Skating Team (U.S. Figure Skating, January 6, 2018)\n\nVIDEO: Mirai Nagasu is 2018 U.S. silver medalist (NBC Olympics, January 5, 2018)\n\nTraining For The Olympics Is Hard Enough. Try Doing That While Earning A Degree (NPR All Things Considered, January 4, 2018)\n\nThe redemption of figure skater Mirai Nagasu (Deadspin, January 4, 2018)\n\n15 things to know about Mirai Nagasu, Team USA’s Figure Skating Comeback Kid (Cosmopolitan, January 4, 2018)\n\nMy Focus [VIDEO]: How Mirai Nagasu’s Triple Axel, Nutrition And Training Will Aid Her At U.S. Championships (Team USA, January 3, 2018)\n\nTeam USA stars play with puppies and kitchens: Pics (US Weekly, January 3, 2018)\n\nHow Olympic hopefuls turned the ultimate disappointment into new dreams for 2018 (ESPN W, January 3, 2018)\n\nVIDEO: Mirai Nagasu on training the Triple Axel (Players’ Tribune Facebook, January 2, 2018)\n\nMirai Nagasu talks 2014 Nationals gala emotions (NBC Olympics, January 2, 2018)\n\nAfter heartbreak, U.S. figure skater Mirai Nagasu again takes aim at Olympic bid (The Orange County Register, January 2, 2018)\n\nMirai Nagasu Counting On Triple Axel To Secure Second Olympic Berth, 8 Years After The First (Team USA, December 28, 2017)\n\nMirai Nagasu focused on Olympic goal at U.S. Championships (FigureSkatersOnline.com, December 27, 2017)\n\nA day in the life with Mirai Nagasu (NBCOlympics.com, December 27, 2017)\n\nFigure skating’s triple Axel: What it is and why it’s important (NBCOlympics.com, December 26, 2017)\n\nEverything You Need to Know About Team USA Figure Skating Hopeful Mirai Nagasu (Pop Sugar Fitness, December 19, 2017)\n\nIce skating star Mirai Nagasu: ‘I can eat 18 dumplings’ (San Jose Mercury News, December 13, 2017)\n\nQ&A with Mirai Nagasu (NBC Olympics, November 28, 2017)\n\nMirai Nagasu: 5 Fast Facts You Need to Know (Heavy.com, October 12, 2017)\n\nWho is Mirai Nagasu? (NBCOlympics.com, October 10, 2017)\n\nMirai Nagasu: “What is important to me is to do everything in my power to make it a strong season” (FigureSkatersOnline.com, May 22, 2017)\n\n2016-17 SEASON\n\nNagasu bulks up arsenal ahead of Olympic run (IceNetwork.com, March 9, 2017)\n\nMirai Nagasu wins bronze medal at the Four Continents Championships (Excelle Sports, February 18, 2017)\n\nNagasu finds desperately needed oasis in Colorado (IceNetwork.com, January 17, 2017)\n\nChampion Figure Skater Mirai Nagasu – interview about the role of music (Kansas Public Radio, January 13, 2017)\n\nResilient Mirai Nagasu Hopes To Rebound At Japan’s NHK Trophy (TeamUSA.org, November 23, 2016)\n\nCreating the program: Costume shines for Nagasu (IceNetwork.com, October 25, 2016)\n\nCreating the program: Nagasu hits competition ice (IceNetwork.com, July 28, 2016)\n\nCreating the program: Nagasu, Wilson get to work (IceNetwork.com, July 14, 2016)\n\nCreating the program: From ‘Avatar’ to ABBA (IceNetwork.com, July 5, 2016)\n\n2015-16 SEASON\n\nPress Release announcing that Nagasu has replaced the injured Edmunds at the World Championships (USFigureSkating.org / March 23, 2016)\n\nNagasu well-equipped to succeed at Four Continents (IceNetwork.com by Amy Rosewater / February 16, 2016)\n\nFormer U.S. Olympian wins collegiate figure skating title at RMU (Pittsburgh TribLIVE.com by Joe Sager / August 8, 2015)\n\nNagasu puts on a show (Lake Placid News by Christie Sausa / July 22, 2015)\n\nDoggone good advice from an American figure skating champion (espnW.com by D’Arcy Maine / May 8, 2015)\n\nOlympic skater performs at Coon Rapids show (ABC Newspapers by Sue Austreng / April 30, 2015)\n\nCall to mom helps Nagasu rebound from disappointment (USA Today by Maggie Hendricks / October 26, 2014)\n\nThough Sochi snub still stings, Nagasu stronger (USA Today by Nancy Armour / October 23, 2014)\n\nThe Inside Edge: Nagasu flits toward classic opera (IceNetwork by / October 20, 2014)\n\nTireless Nagasu performs in Weiss’ benefit show (IceNetwork by Amy Rosewater / September 16, 2014)\n\nChange of scenery puts Nagasu on solid ground\n\n(IceNetwork by Lynn Rutherford / September 12, 2014)", "images": ["http://figureskatersonline.com/mirainagasu/home/wp-content/uploads/2014/03/miari-6.jpg", "http://figureskatersonline.com/mirainagasu/home/wp-content/uploads/2014/05/mirai-title.png"], "top_img": "http://figureskatersonline.com/mirainagasu/home/wp-content/uploads/2014/03/miari-6.jpg", "keywords": [], "authors": ["Sarah S. Brannen", "Drew Meekins"], "canonical_link": "http://figureskatersonline.com/mirainagasu/home/news/", "title": "Official Web Site", "meta_data": {"generator": "WordPress 4.9.10", "fb": {"app_id": 1403128776661766}, "tec-api-version": "v1", "tec-api-origin": "http://figureskatersonline.com/mirainagasu/home", "viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0"}, "movies": [], "publish_date": null, "source": "http://figureskatersonline.com", "summary": ""}