{"url": "https://www.techradar.com/black-friday/black-friday-cyber-monday-2018-deals-in-usa", "text": "The best Black Friday deals in 2019 will become harder to find, as more US retailers join Walmart, Amazon and Best Buy in discounting items before Christmas. There's going to be more on sale, and harder choices to make.\n\nThe same fervor will apply to the online-exclusive Cyber Monday, which extends the price cuts of Black Friday into Monday morning and beyond. Some retailers call this Cyber Week in a way to keep you shopping for several days. It's a trick that's working.\n\nWhat's amazing is that Cyber Monday unseated Black Friday last year, becoming the largest online shopping day of all time in the US, according to data from Adobe via Business Wire . It drove a record-breaking $7.9 billion, and $2 billion of those orders were made on smartphones and tablets.\n\nBlack Friday wasn't down, though. Black Friday sales were up year-over-year, too: $3.7 billion on Thanksgiving, and $6.2 billion on Black Friday. Saturday and Sunday saw another $6.4 billion come in… and that’s just what was spent online.\n\nBlack Friday and Cyber Monday remain the one-two punch American retailers need to move more TVs, laptops, phones and other high-margin electronics, and every year, we're seeing more competition translate into US retailers starting the discounts weeks in advance of the actual Black Friday date.\n\nWhen is Black Friday?\n\nThe Black Friday date is November 29, 2019, which, of course, is a Friday. The actual date shifts every year, by the day of the week stays the same: it's always the Friday after Thanksgiving.\n\nThe Cyber Monday date is December 2, 2019, so it follows the same trend – the date (and even the month) can change from year to year, but it's always the Monday after Thanksgiving and Black Friday.\n\nThis Black Friday sales period isn't just a four-day affair. They're two distinct terms with different deals and often different types of shoppers, we've learned over the year. US retailers have tuned their sales to meet the needs of these shoppers, too.\n\nBlack Friday in the US is ideal for bargain hunters who are willing to forgo time with turkey leftovers in order to seek deep discounts on hot-ticket times like electronics. This is where we see 4KTVs, laptops and iPads go on sale – in the wee hours before Thanksgiving on through the end of Friday.\n\nCyber Monday is a more recent phenomenon that started with the advent of the internet, and it's tailored toward more lifestyle goods. We expect the same from Cyber Monday 2019 – you'll see some iPads still on sale, but only if retailers don't run out of stick over the Saturday and Sunday between Black Friday and Cyber Monday.\n\nBlack Friday ads and how long do sales last?\n\nBest Buy, Walmart, Amazon and Target have a habit of stretching the saving across multiple days preceding the classic four-day window, posting Black Friday ad leaks in October and early November. We'll be monitoring the Black Friday ads this year.\n\nThe first signs of price drops come from these ad leaks, usually through major US newspaper print outs. Black Friday ad scans make their way online, giving you a heads-up on what to buy, how much to spend and where to shop.\n\nThis means Black Friday and Cyber Monday is more than just a two days sales frenzy, or even an extended weekend tradition. It's a whole month of savings, if you know where to shop and when to hit that checkout button. If you’re savvy, it's the best time of the year to shop, and you can save a lot of money.\n\nImage credit: TechRadar\n\nWill Black Friday 2019 be different in any way?\n\nBlack Friday 2019 should continue last year's trend of not just offering discounts, but offering discounts on items you'll actually want to buy. There was some fierce competition between Amazon, Walmart, B&H Photo and Best Buy last year, and that's a good sign headed into Black Friday this year.\n\nSpecifically, we're expecting to see big-ticket items like 4KTVs with HDR support – a once expensive proposition, and Apple to offer cheap iPads, which was a big hit last year.\n\nNew AirPods in 2019 may see the older models on sale for a better price, while laptops, iPhones and Android smartphones should be at their lowest levels in 2019. It's not surprise that Apple launches new iPhones in September to discount them (just a little bit) by Black Friday and Cyber Monday. This mostly happens through US carriers and BYGO Free deals.\n\nBlack Friday predictions\n\nThe sales period has fallen into a rhythm, so here are some Black Friday predictions that we fee are safe bets:\n\nHere at TechRadar we spent hours and hours sifting through the best deals on every major retailer - and last year we saw some really big trends emerge, which should influence this year’s discounts.\n\nHeadphones were among the big winners, with Apple’s AirPods desperately sought after throughout the US. Even though most stores only discounted them by $5, it was one of the top-selling gadgets on Black Friday.\n\nMobile carriers were offering hundreds of dollars off on flagship smartphones like the iPhone XR, XS, and XS Max when customers traded in an old phone and started new lines of service. Samsung’s Galaxy S9 also got some straight discounts, especially when it came to unlocked models.\n\nHow does TechRadar prepare for Black Friday? Black Friday is one of the most important times of the year for TechRadar - we spend weeks ahead of the big day (or weekend) making sure the whole site is ready for people looking for the information they need to help them make the right buying choice. Whether that's knowing which is the best laptop, TV or iPad, or just seeing great deals for them through our Hawk price comparison widget, we've got everything you need to know.\n\nNintendo Switch bundles once again outshone PS4, PS4 Pro, Xbox One and Xbox One X deals, and in the laptop world one of our favorite laptops, the Dell XPS 13, was reduced by over $400, which was an incredible knock-down.\n\nAmazon makes life difficult on Black Friday by discounting pretty much everything. But, the biggest price cuts come from its own products: Fire tablets, Kindle e-readers and its Echo devices last year, as we well the Ring series of tech that it bought. With Amazon having bought Eero, expect the mesh routers to be discounted, too.\n\nWe’re not expecting the Black Friday / Cyber Monday bandwagon to slow down in any way this year, with retailers extending their deals even further than before to entice the buying public.\n\nIn 2018 we saw a couple of brands promise to ‘future price match’, meaning consumers could buy something now and know that if it got dropped in later wars to offer the cheapest tag, they could reclaim the difference.\n\nHowever, despite all this we’re still expecting that the best deal will be found surrounding Black Friday - as ever, our advice is to know your budget going in, set a maximum price you’re willing to pay (having done the research to know what sort of prices your desired tech has been at throughout the year) and stick to it.\n\nNot to be too self-promoting (OK, a little bit, but we really put the effort in here…) but TechRadar’s Black Friday and Cyber Monday deals pages are really worth keeping an eye on if you’re looking for the very best deals in tech.\n\n(Bookmark this page and it’ll be populated with all the best Black Friday deals come November - you won’t even need to search it out!)\n\nWhere will we see the best Black Friday deals?\n\nOne thing we’ve noticed over the years: in many cases the available discounts changed as the month progressed: headline-grabbing stuff aside, the best value deals tended to appear later in the month on more expensive products where retailers could still make a profit while knocking a hefty amount off the price.\n\nThat’s partly due to upselling and cross-selling opportunities too: many firms hope if you buy something expensive for a bargain price, you’ll then buy some accessories to go with it.\n\nBut what technology should you be looking out for? These are our top predictions for what desirable gadgets you’ll be able to get for less.\n\n2019 iPads and iPhone XR (2?)\n\nImage credit: TechRadar\n\nThe last couple of years we’ve seen decent discounts on the ‘new iPad’ (the non-Pro model), with 2018’s version getting insane price drops to just $249 and even $229, for a cool $100 off. It was so good that our Mobile Editor in the US instantly bought two for his parents.\n\nWe’re expecting Apple to bring out a new iPad for 2019, as well as an iPad Mini 5, and we’re expecting both of those to get some good price cuts by November. Even if they don’t, 2018’s model will be even cheaper and will be primed for a lower cost. Note that this isn’t from Apple, but the retailers themselves - Apple only usually offers extra gift cards when you buy expensive gadgets from it, so it pays to know where to shop.\n\nThe iPhone XR was one of the biggest sellers in 2018 as well, with discounts appearing instantly on contract even though it was a newer phone. This year we expect the iPhone XR sequel to come out a little earlier, which means it’s even more likely to be part of the Black Friday sales this year.\n\nApple AirPods\n\nImage credit: TechRadar\n\nSticking with the Apple theme, we’re very much expecting retailers to realize that there’s a lot of money to be made from discounting Apple’s wireless headphones - they were among the most searched-for items on Black Friday last year, and if Apple launches the Apple AirPods 2 this year, the older, first-gen AirPods are going to be in high demand.\n\nSamsung Galaxy S9\n\nImage credit: TechRadar\n\nAs with iPhones, so with Galaxies: not just the S10 but the new Note too. We saw low-cost up-front deals with very little to pay per month for the Galaxy S9 and siblings - which was impressive for these well-reviewed phones - and we’re expecting to see the same this year for the Galaxy S10 and its siblings. If your contract is up for renewal around then, it’s worth waiting for Black Friday. Even full retail prices dropped below $600 on the Galaxy S9 last year.\n\nPS4 and Xbox One\n\nImage credit: TechRadar\n\nWe’re still waiting for news of the PS5, but right now Sony is still all about the PS4 and the PS4 Pro and Microsoft continues to push its Xbox One S and One X deals to extend the ecosystem and get more people to buy its games and peripherals.\n\nIt’s in the bundles that we expect to see some good deals - although there weren’t as many sensational options last year (apart from some to include Red Dead Redemption 2), we always expect good bundles.\n\nThe same can be said on things like PSVR - last year saw some discounts there too, and we’re still seeing games come out of the platform, so the virtual reality discounts are still highly likely.\n\n4K TVs - OLEDs especially\n\nImage credit: LG\n\nFor TVs, using tools like PriceSpy or CamelCamelCamel is perfect, as you’ll really want to know the true previous price for the large sets.\n\nEvery year TVs are one of the big winners in terms of discounts - there’s usually something for everyone on offer, with low-cost 4K TVs something many retailers offered last year.\n\nWe often see discounts on LG’s OLED range, and OLED technology is dropping in price every year, making it far more of a bargain.\n\nYou can also look into Samsung’s QLED TV - it’s meant to be the equivalent of OLED tech in many ways - or top-end LED TVs if you’re looking to spend a little less. We’re talking less than $900 in for even 65-inch 4K HDR smart TV sets in some situations.\n\nWe also saw some sub-$100 prices for Full HD 40-inch sets in 2018, which is an insane price for a TV, even if the quality is less than you might expect at a higher price - there could still be one final hurrah for 1080p sets, perfect for the second bedroom or kitchen, in 2019.\n\nAmazon Echo devices, Fire TV sticks and Kindle Fire tablets\n\nImage credit: TechRadar\n\nIt wouldn’t be Black Friday or Cyber Monday if Amazon wasn’t slashing the price of its own-brand devices.\n\nThere were multiple cuts to Amazon’s top tech in 2018, with the Echo Dot getting 50% off, the Ring series of smart home tech also being cut and Philips Hue bundles getting chucked in with the top-end Echo speakers.\n\nIn fact, we’re expecting multiple smart home speakers and displays to be discounted again in 2019 - Lenovo and Google had high discounts on their top speakers last year, and the same is almost certain to happen again in order to pull users into the relevant ecosystems.\n\nWhat is Black Friday?\n\nBlack Friday is the Friday immediately after Thanksgiving when retailers begin the holiday shopping season. It’s based around the aforementioned “doorbusters”, discounts so impressive that bargain-crazed customers will try to break the doors down before the shop opens - although that’s more of a virtual craze these days.\n\nWhat’s the origin of Black Friday?\n\nImage credit: Shutterstock (Image credit: Shutterstock)\n\nLet’s take a Black Friday history lesson: the first known mention of Black Friday related to this shopping experience was in November 1951, when the journal Factory Management and Maintenance used it to describe people calling in sick the day after Thanksgiving so they could have an extra day off work.\n\nAt the same time US police were using the phrases “Black Friday” and “Black Saturday” to describe the horrendous traffic that occurred at the beginning of the pre-Christmas shopping season. In 1961 there was a movement from the local government to change the shopping season to “Big Friday” and “Big Saturday”, but it clearly never caught on.\n\nWhy is Cyber Monday called Cyber Monday?\n\nThe term was coined by Ellen Davis and Scott Silverman of the US’ National Retail Federation and Shop.org, and it was a deliberate move to promote online shopping back in 2005 when the Internet was made of wood and powered by steam.\n\nIt was intended to help smaller retailers compete with the big names who were harping on about Black Friday, although of course those big names promptly jumped on the Cyber Monday bandwagon, too.\n\nAre Black Friday deals and Cyber Monday deals real?\n\nGenerally speaking, yes - although there are two kinds of deals. The first has been pre-agreed between brands and retailers, so they’re not as off-the-cuff as you might expect. The other is sudden price drops, whether that’s an algorithm working out the best way to attract users to buy (as brands like Amazon often will) or just the big names price-matching one another, or pushing the price down further as they look to be the big winner. (We saw something similar with iPads in the US).\n\nAs with any sales event you’ll see a mixture of bargains, discounted end-of-line stock and strange things found in the back of a warehouse somewhere. In 2016, consumer magazine 'Which?' accused retailers of some pretty dodgy behavior.\n\nWhere can I find the best Black Friday deals and Cyber Monday deals?\n\nAs mentioned, you’ll find the best options if you bookmark this page right now - there will be deals from the beginning of November, and we’ll be bringing you the best of them, those that we think are worth checking out, the second that we see them flash up.\n\nHow do I get the best Black Friday and Cyber Monday deals in 2019?\n\nHomework really helps. Some retailers up prices from August through to October so they can offer supposedly amazing discounts on Black Friday and Cyber Monday, so don’t be fooled by such moves. They’re particularly prevalent in expensive consumer electronics such as TVs or laptops with product numbers rather than names, with products that were dropped down to a great bargain price suddenly being pushed back to their MSRP again.\n\nIt’s also a very good idea to be flexible: for example, if you fancy a Samsung UHD TV it’s best to think about the features you want rather than a specific model number: the BRV553ABD34-82C-9218-X may not be discounted on Black Friday 2019, but an almost identical set with the specification you want probably will be - so do your research on what matters and we’ll do our best to give you the right comparison needed.\n\nHowever, don’t be fooled into thinking that something that looks like a five star set is the same but cheaper - certain elements (often with regards to screen quality or image processing) won’t be as high quality to achieve that lower price point.\n\nCan I get cashback on Black Friday deals?\n\nSometimes, yes. Your debit card or credit card may offer cashback on purchases. It’s definitely worth looking into, not just for Black Friday 2019 and Cyber Monday 2019 but for any online shopping, when you’ll be spending the most online.\n\nAm I protected when I buy on Black Friday and Cyber Monday?\n\nIn general, you should be just as protected as you are when shopping any other time of the year. You’ll want to check on return policies and warranty periods, and you should also make sure you’re shopping at known retailers you trust. While many deals can seem too good to be true on Black Friday and Cyber Monday, landing on an unfamiliar website claiming to have a product for pennies on the dollar is a good sign you’re in the wrong place.\n\nRemember that using your credit card also can offer a level of protection, so as long as you have the means to pay it back straight away, using this method can give you more peace of mind. Many credit cards can help you contest payments if you never receive a product, and some even offer extended warranties on products beyond the one included from manufacturer or retailer.", "images": ["https://cdn.mos.cms.futurecdn.net/H2DHk6yDMBCCE8zRyEdfr6-320-80.jpg", "https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg", "https://cdn.mos.cms.futurecdn.net/H2DHk6yDMBCCE8zRyEdfr6-1200-80.jpg"], "top_img": "https://cdn.mos.cms.futurecdn.net/H2DHk6yDMBCCE8zRyEdfr6-1200-80.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.techradar.com/black-friday/black-friday-2019-cyber-monday-2019-usa", "title": "Black Friday 2019 and Cyber Monday 2019 deals: when are they and what to expect", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "pub_date": "2019-03-12T09:49:21+00:00", "description": "Getting ready for the Black Friday deals? We've got all the info you need.", "msapplication-TileColor": "#000000", "msapplication-TileImage": "https://vanilla.futurecdn.net/techradar/122118/apple-touch-icon.png", "og": {"title": "Black Friday 2019 and Cyber Monday 2019 deals: when are they and what to expect", "site_name": "TechRadar", "url": "https://www.techradar.com/black-friday/black-friday-2019-cyber-monday-2019-usa", "description": "When is Black Friday 2019?", "image": {"identifier": "https://cdn.mos.cms.futurecdn.net/H2DHk6yDMBCCE8zRyEdfr6-1200-80.jpg", "width": 1200}, "type": "article"}, "article": {"publisher": "https://www.facebook.com/TechRadar", "author": "https://www.facebook.com/TechRadar"}, "fb": {"app_id": 235441786508054}, "twitter": {"card": "summary_large_image", "site": "@TechRadar", "title": "Black Friday 2019 and Cyber Monday 2019 deals: when are they and what to expect", "description": "When is Black Friday 2019?", "creator": "@TechRadar", "image": "https://cdn.mos.cms.futurecdn.net/H2DHk6yDMBCCE8zRyEdfr6-1200-80.jpg", "account_id": 15560223}, "google-site-verification": "jEzBNX-r47v-rgc86g7xG47qMqF4VJuXdLUueTx8saU", "p": {"domain_verify": "10329f1fd4d0a2cd5c0d3b3b809cb4cd"}, "taboola": {"url": "https://www.techradar.com/black-friday/black-friday-2019-cyber-monday-2019-usa"}, "botify-site-verification": "xkNFqB6l1qBl8BEqMjQvrHuYinhxlJVe", "msvalidate.01": "CC462E6DF91492086145CA5EBDCB615E", "theme-color": "#2f6e91"}, "movies": [], "publish_date": null, "source": "https://www.techradar.com", "summary": ""}