{"url": "https://www.biography.com/people/oprah-winfrey-9534419", "text": "She later became the host of her own, wildly popular program, The Oprah Winfrey Show, which aired for 25 seasons, from 1986 to 2011. That same year, Winfrey launched her own TV network, the Oprah Winfrey Network (OWN).\n\nOprah Gail Winfrey was born in the rural town of Kosciusko, Mississippi, on January 29, 1954. In 1976, Winfrey moved to Baltimore, where she hosted a hit television chat show, People Are Talking. Afterward, she was recruited by a Chicago TV station to host her own morning show.\n\nIn 2005, Winfrey helped give The Color Purple a new life onstage as one of the producers of the 11-time Tony-nominated musical, which ran on Broadway until 2008. A revival of the musical, which Winfrey co-produced in 2015, won a Tony Award.\n\nHer highly successful monthly, O: The Oprah Magazine debuted in 2000, and in 2004, she signed a new contract to continue The Oprah Winfrey Show through the 2010-11 season. At the time, the syndicated show was seen on nearly 212 U.S. stations and in more than 100 countries worldwide.\n\nWith the debut in 1999 of Oxygen Media, a company she co-founded that is dedicated to producing cable and Internet programming for women, Winfrey ensured her place in the forefront of the media industry and as one of the most powerful and wealthy people in show business. In 2002, she concluded a deal with the network to air a prime-time complement to her syndicated talk show.\n\nThe media giant contributed immensely to the publishing world by launching her \"Oprah's Book Club,\" as part of her talk show. The program propelled many unknown authors to the top of the bestseller lists and gave pleasure reading a new kind of popular prominence.\n\nWinfrey, who became almost as well-known for her weight loss efforts as for her talk show, lost an estimated 90 pounds (dropping to her ideal weight of around 150 pounds) and competed in the Marine Corps Marathon in Washington, D.C., in 1995.\n\nWinfrey also signed a multi-picture contract with Disney. The initial project, 1998's Beloved, based on Pulitzer Prize-winning novel by Toni Morrison and starring Winfrey and Danny Glover, got mixed reviews and generally failed to live up to expectations.\n\nIn 1994, with talk shows becoming increasingly trashy and exploitative, Winfrey pledged to keep her show free of tabloid topics. Although ratings initially fell, she earned the respect of her viewers and was soon rewarded with an upsurge in popularity. Her projects with Harpo have included the highly rated 1989 TV miniseries, The Women of Brewster Place, which she also starred in.\n\nShe soon gained ownership of the program from ABC, drawing it under the control of her new production company, Harpo Productions ('Oprah' spelled backwards) and making more and more money from syndication.\n\nWinfrey launched The Oprah Winfrey Show in 1986 as a nationally syndicated program. With its placement on 120 channels and an audience of 10 million people, the show grossed $125 million by the end of its first year, of which Winfrey received $30 million.\n\nHer success led to nationwide fame and a role in Steven Spielberg 's 1985 film The Color Purple, for which she was nominated for an Academy Award for Best Supporting Actress.\n\nHer major competitor in the time slot was Phil Donahue . Within several months, Winfrey's open, warm-hearted personal style had won her 100,000 more viewers than Donahue and had taken her show from last place to first in the ratings.\n\nIn 1976, Oprah Winfrey moved to Baltimore, Maryland, where she hosted the TV chat show People Are Talking. The show became a hit and Winfrey stayed with it for eight years, after which she was recruited by a Chicago TV station to host her own morning show, A.M. Chicago.\n\nAfter a troubled adolescence in a small farming community, where she was sexually abused by a number of male relatives and friends of her mother, Vernita, Oprah Winfrey moved to Nashville to live with her father, Vernon, a barber and businessman. She entered Tennessee State University in 1971 and began working in radio and television broadcasting in Nashville.\n\nOprah Winfrey Network (OWN)\n\nIn 2009, Winfrey announced that she would be ending her program when her contract with ABC ended, in 2011. Soon after, she moved to her own network, the Oprah Winfrey Network, a joint venture with Discovery Communications.\n\nDespite a financially rocky start, the network made headlines in January 2013, when it aired an interview between Winfrey and Lance Armstrong, the American cyclist and seven-time Tour de France winner who was stripped of his Tour titles in 2012 due to doping charges.\n\nDuring the interview, Armstrong admitted to using performance-enhancing substances throughout his cycling career, including the hormones cortisone, testosterone and erythropoietin (also known as EPO). \"I am deeply flawed ... and I'm paying the price for it, and I think that's okay. I deserve this,\" he stated. The interview reportedly brought in millions of dollars in revenue for OWN.\n\nOf her interview with Armstrong, Winfrey said in a statement, \"He did not come clean in the manner I expected. It was surprising to me. I would say that, for myself, my team, all of us in the room, we were mesmerized by some of his answers. I felt he was thorough. He was serious. He certainly prepared himself for this moment. I would say he met the moment. At the end of it, we both were pretty exhausted.\"\n\nIn March 2015, Winfrey announced that her Chicago-based Harpo Studios would close at the end of the year to consolidate the company’s production operations to the Los Angeles-based OWN headquarters. Winfrey’s television empire was launched at the studio and it had been home to her daily syndicated talk show through its finale in 2011.\n\n\"The time had come to downsize this part of the business and to move forward. It will be sad to say goodbye,\" said Winfrey, \"but I look ahead with such a knowing that what the future holds is even more than I can see.\"\n\nWinfrey returned to acting in Greenleaf, which marked her first recurring scripted television role. The original family drama, which revolves around a Memphis megachurch, premiered on OWN in June 2016.\n\nIn December 2017, it was announced that Discovery had become the majority owner of OWN with the purchase of 24.5 percent of the company from its founder for $70 million. Winfrey retained 25.5 percent of OWN and remained its chief executive under terms of the agreement.\n\nActivism, Charity and Awards\n\nAccording to Forbes magazine, Winfrey was the richest African American of the 20th century and the world's only Black billionaire for three years running. Life magazine hailed her as the most influential woman of her generation.\n\nIn 2005, Business Week named her the greatest Black philanthropist in American history. Oprah's Angel Network has raised more than $50 million for charitable programs, including girls' education in South Africa and relief to the victims of Hurricane Katrina.\n\nWinfrey is a dedicated activist for children's rights; in 1994, President Bill Clinton signed a bill into law that Winfrey had proposed to Congress, creating a nationwide database of convicted child abusers.\n\nShe also founded the Family for Better Lives foundation and also contributes to her alma mater, Tennessee State University. In September 2002, Oprah was named the first recipient of the Academy of Television Arts & Sciences' Bob Hope Humanitarian Award.\n\nCampaigning for Barack Obama\n\nWinfrey campaigned for Democratic presidential hopeful Barack Obama in December 2007, attracting the largest crowds of the primary season to that point. Winfrey joined Obama for a series of rallies in the early primary/caucus states of Iowa, New Hampshire, and South Carolina. It was the first time Winfrey had ever campaigned for a political candidate.\n\nThe biggest event was at the University of South Carolina football stadium, where 29,000 supporters attended a rally that had been switched from an 18,000-seat basketball arena to satisfy public demand. \"Dr. (Martin Luther) King dreamed the dream. But we don't have to just dream the dream any more,\" Winfrey told the crowd. \"We get to vote that dream into reality by supporting a man who knows not just who we are, but who we can be.\"\n\nOprah Winfrey's Sister\n\nIn her final season of her talk show, Winfrey made ratings soar when she revealed a family secret: she has a half-sister named Patricia. Winfrey's mother gave birth to a baby girl in 1963. At the time, Winfrey was nine years old, and living with her father.\n\nLee put the child up for adoption because she believed that she wouldn't be able to get off public assistance if she had another child to care for. Patricia lived in a series of foster homes until she was seven years old.\n\nPatricia tried to connect with her birth mother through her adoption agency after she became an adult, but Lee did not want to meet her. After doing some research, she approached a niece of Winfrey's, and the two had DNA tests done, which proved they were related.\n\nWinfrey only learned of her sister's existence a few months before she made the decision to publicize the knowledge. \"It was one of the greatest surprises of my life,\" she said on her show.\n\nIn November 2013, Winfrey received the nation's highest civilian honor, the Presidential Medal of Freedom. President Barack Obama gave her this award for her contributions to her country.\n\nIn February 2018, after a shooting at Florida's Marjory Stoneman Douglas High School left 17 people dead, Winfrey announced she would follow the example set by George and Amal Clooney and donate $500,000 to the March for Our Lives demonstration scheduled for March 24.\n\nShe tweeted: \"George and Amal, I couldn’t agree with you more. I am joining forces with you and will match your $500,000 donation to 'March For Our Lives.' These inspiring young people remind me of the Freedom Riders of the 60s who also said we've had ENOUGH and our voices will be heard.\"\n\nGolden Globes Speech\n\nIn January 2018, Winfrey became the first African-American woman to be honored with the Golden Globes' Cecil B. DeMille Award, for lifetime achievement. In a powerful speech, she recalled being inspired by seeing Sidney Poitier honored at the Globes decades earlier, before emphasizing the importance of a free press and the power of speaking the truth in a \"culture broken by brutally powerful men.\"\n\n\"So I want all the girls watching here and now to know that a new day is on the horizon,\" she said, in closing. \"And when that new day finally dawns, it will be because of a lot of magnificent women, many of whom are right here in this room tonight, and some pretty phenomenal men, fighting hard to make sure that they become the leaders who take us to the time when nobody ever has to say, 'Me too' again.\"\n\nThe overwhelming reception to the speech was such that many began calling for the media mogul and personality to run for president. Winfrey generally downplayed the suggestion that she would do so, though she admitted to People that the support had her entertaining the idea, and prompted her to check with the Big Guy upstairs for guidance: \"God, if you think I’m supposed to run, you gotta tell me, and it has to be so clear that not even I can miss it,\" she recalled, adding that she had yet to receive clear affirmation to proceed.\n\nOther Projects: '60 Minutes,' Oprah's Favorite Things Lives On\n\nIn January 2017, CBS announced that Winfrey would join the newsmagazine 60 Minutes as a special contributor in the fall.\n\nWinfrey introduced her \"Oprah's Favorite Things\" holiday list during her time as a talk show host, and continued the annual tradition even after moving on to other projects. For the 2017 edition, featured on Amazon, she became the first celebrity behind Alexa, the company's voice-control system, allowing shoppers to hear Winfrey herself explain her top picks for the season.\n\nStedman Graham\n\nWinfrey has been in a relationship with Stedman Graham, a public relations executive, since the mid-1980s. They became engaged in 1992, but never tied the knot. The couple lives in Chicago, and Winfrey also has homes in Montecito, California, Rolling Prairie, Indiana, and Telluride, Colorado.", "images": ["https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cg_face%2Ch_170%2Cq_auto:good%2Cw_300/MTQ1MTQwNzYyMTEwMDc2Mzg1/alice-walker---the-mysterious-wonder-of-life.jpg", "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cg_face%2Ch_170%2Cq_auto:good%2Cw_300/MTQ1MTM5ODUxMzA4OTAxNzg0/madam-cj-walker---successful-business-woman.jpg", "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cg_face%2Ch_170%2Cq_auto:good%2Cw_300/MTQ1Mjk4OTAxNzMyMTczMjgx/michelle-obama---mini-biography.jpg", "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cg_face%2Ch_170%2Cq_auto:good%2Cw_300/MTQ1NDY1Njg2MzE4MTMwOTYx/ellen-degeneres---full-episode.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTE4MDAzNDEwNzY0NTMxMjE0/ellen-degeneres-9542420-1-402.jpg", "https://www.biography.com/.image/cs_srgb%2Cq_auto:good/MTQ1NTM0MTQ5NzA3NDQxNzE5/navbarwhite.png", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTE4MDAzNDEwMTUzMTQ1ODcw/sara-gilbert-6430-1-402.jpg", "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cg_face%2Ch_170%2Cq_auto:good%2Cw_300/MTQ1NDY4MTY3NzM1NDg2MjI1/whoopi-goldberg---mini-biography.jpg", "https://www.biography.com/.image/c_fit%2Ccs_srgb%2Cfl_progressive%2Ch_406%2Cq_auto:good%2Cw_620/MTE1ODA0OTcxODI3Mjk5ODUz/oprah-winfrey-1980s-raw.jpg", "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cg_face%2Ch_170%2Cq_auto:good%2Cw_300/MTQ1Mjk5NjgwNzMxODY2NTkz/ellen-degeneres---public-backlash.jpg", "https://www.biography.com/.image/ar_1:1%2Cc_fill%2Ccs_srgb%2Cg_face%2Cq_auto:good%2Cw_300/MTE1ODA0OTcxODI4MTUxODIx/oprah-winfrey-9534419-1-402.jpg", "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cg_face%2Ch_170%2Cq_auto:good%2Cw_300/MTQ1MzAwMjU2MjU3NDg0MjU3/tyra-banks---full-episode.jpg", "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cg_face%2Ch_170%2Cq_auto:good%2Cw_300/MTQ1MTQxMDU0NDM2Mjg3ODk2/dr-phil---mini-biography.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTQzMzAyMTU3MjA5MTgzODE1/tyra-banks_gettyimages-516572662jpg.jpg", "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cg_face%2Ch_170%2Cq_auto:good%2Cw_300/MTQ1MTQwNzYxMzA0NzcwMDE3/alice-walker---pursuing-civil-rights.jpg", "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cg_face%2Ch_170%2Cq_auto:good%2Cw_300/MTQ1Mjk5Njc5OTI2NTYwMjI1/ellen-degeneres---death-of-matthew-shepard.jpg", "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cg_face%2Ch_170%2Cq_auto:good%2Cw_300/MTQ1NDY1NjU1OTg0OTI0MjE1/rosie-odonnell---full-episode.jpg", "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cg_face%2Ch_170%2Cq_auto:good%2Cw_300/MTQ1NDY3ODE2MDg1MDM4NjQ3/sidney-poitier---mini-bio.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTE1ODA0OTcxNDczMTQzMzA5/joan-rivers-324890-1-402.jpg", "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cg_face%2Ch_170%2Cq_auto:good%2Cw_300/MTQ1MTQwODU0NzIwMzA4NjMy/toni-morrison---mini-biography.jpg", "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cg_face%2Ch_170%2Cq_auto:good%2Cw_300/MTQ1Mjk5NjgyMzQyODA3MDA5/ellen-degeneres---coming-out.jpg", "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cg_face%2Ch_170%2Cq_auto:good%2Cw_300/MTQ1MTQwMzEzMDE3NTU4NDI0/ellen-degeneres---funniest-person-in-america.jpg", "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cg_face%2Ch_170%2Cq_auto:good%2Cw_300/MTQ1MTQwNTg4NzAwNzcxODA5/eugene-allen-the-butler-by-wil-haygood.jpg", "https://www.biography.com/.image/t_share/MTE1ODA0OTcxODI4MTUxODIx/oprah-winfrey-9534419-1-402.jpg", "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cg_face%2Ch_170%2Cq_auto:good%2Cw_300/MTQ1MzAwMjU3MDYyNzkwNjI1/tyra-banks---mini-bio.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTE1ODA0OTcxNjQ1Njk5NTk3/whoopi-goldberg-9314384-1-402.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTE1ODA0OTcxODM1NTU3Mzg5/katie-couric-9542060-1-402.jpg", "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cg_face%2Ch_170%2Cq_auto:good%2Cw_300/MTQ1NDY3NTQ5NTI4NjMxMDU3/barbara-walters---news-pioneer.jpg", "https://www.biography.com/.image/c_fit%2Ccs_srgb%2Cq_auto:good%2Cw_458/MTQ1NTMzOTkyNDA0MjY0NTAz/sitelogowhite.png", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTE5NTU2MzE2MDQzNzczNDUx/joan-lunden-262764-1-402.jpg", "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cg_face%2Ch_170%2Cq_auto:good%2Cw_300/MTQ1Mjk5NjgxNTM3MzA0MDMz/ellen-degeneres---early-years.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTE1ODA0OTcxODE1OTYyMTI1/barbara-walters-9523127-1-402.jpg", "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cg_face%2Ch_170%2Cq_auto:good%2Cw_300/MTQ1MjUwMzc1NTgxMDUwMzM3/maya-angelou---on-the-pulse-of-morning.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTQ3NjM5NTA5NjU4Mzc5NjUy/maya_angelou_photo_by_deborah_feingold_corbis_entertainment_getty_533084708.jpg"], "top_img": "https://www.biography.com/.image/t_share/MTE1ODA0OTcxODI4MTUxODIx/oprah-winfrey-9534419-1-402.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.biography.com/media-figure/oprah-winfrey", "title": "Oprah Winfrey", "meta_data": {"referrer": "unsafe-url", "HandheldFriendly": "True", "MobileOptimized": 320, "viewport": "width=device-width, initial-scale=1", "apple-mobile-web-app-capable": "no", "apple-mobile-web-app-status-bar-style": "black", "format-detection": "address=no", "google-site-verification": "Rw9Z4UJK89QUjgFzrFI2QbZmTRyWu_Cuy15hu4Y1MXw", "msvalidate.01": "565AA37CB662E60BF24DDCABEC686D8F", "generator": "Tempest - www.saymedia.com", "pinterest": "nohover", "description": "Follow the rise to success of media giant Oprah Winfrey, from her start in broadcasting to her two-and-a-half decade career as host of 'The Oprah Winfrey Show,' at Biography.com.", "section": "Media Figures", "pagetype": "person", "robots": "noodp", "item-id": "ci01a8bfd61a40860b", "published": "2018-03-21T11:51:24Z", "modified": "2019-06-25T18:33:28Z", "dcterms.rightsHolder": "Bio and the Bio logo are registered trademarks of A&E Television Networks, LLC.", "dcterms.dateCopyrighted": 2019, "twitter": {"card": "summary_large_image", "site": "@bio", "url": "https://www.biography.com/media-figure/oprah-winfrey", "image": "https://www.biography.com/.image/t_share/MTE1ODA0OTcxODI4MTUxODIx/oprah-winfrey-9534419-1-402.jpg", "description": "Billionaire media giant and philanthropist Oprah Winfrey is best known for hosting her own internationally popular talk show from 1986 to 2011. From there, she launched her own television network, OWN.", "domain": "www.biography.com"}, "og": {"type": "website", "url": "https://www.biography.com/media-figure/oprah-winfrey", "title": "Oprah Winfrey", "description": "Billionaire media giant and philanthropist Oprah Winfrey is best known for hosting her own internationally popular talk show from 1986 to 2011. From there, she launched her own television network, OWN.", "image": "https://www.biography.com/.image/t_share/MTE1ODA0OTcxODI4MTUxODIx/oprah-winfrey-9534419-1-402.jpg", "site_name": "Biography"}, "fb": {"pages": 123492867697144, "app_id": 104784826244596}, "pinterest-rich-pin": "true", "apple-mobile-web-app-title": "Biography", "parsely-title": "Oprah Winfrey - Biography", "parsely-link": "https://www.biography.com/media-figure/oprah-winfrey", "parsely-image-url": "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cfl_progressive%2Ch_400%2Cq_auto:good%2Cw_620/MTE1ODA0OTcxODI4MTUxODIx/oprah-winfrey-9534419-1-402.jpg", "parsely-post-id": "ci01a8bfd61a40860b", "parsely-pub-date": "2018-03-21T11:51:24Z", "parsely-section": "Media Figures", "parsely-metadata": "{\"associated_content\":[\"Oprah Winfrey's Best Talk Show Moments\",\"Oprah Winfrey: All the Ways the First Black Female Billionaire Has Made History\",\"Why Oprah's Car Giveaway Is the Most Epic Talk Show Moment Ever\",\"Maya Angelou\",\"Toni Morrison\",\"Phil Donahue\"]}", "phx": {"content-item-id": "ci01a8bfd61a40860b", "content-object-type": "ContentPerson"}}, "movies": [], "publish_date": null, "source": "https://www.biography.com", "summary": ""}