{"url": "https://www.gq.com/story/dacre-montgomery-stranger-things-audition-tape", "text": "I always just like to improvise, and that goes for my audition tapes as well. I kind of play around with it, have fun with it. Obviously in the audition tape, you can see that I'm holding my iPhone because I'm playing music as I'm going, and it's kind of a bit like a theater piece for me sometimes. I'll just speak and dance and go crazy and, you know, turn the music up as the audition tape goes on, and just leave the camera rolling.\n\nWhat did the Duffer brothers say about the audition tape?\n\n[laughs] I love it because they're so casual. I sent off the tape at 11 o'clock that night, Australian time. And then in the morning we had a response saying, the Duffers want to Skype you on Sunday. They were kind of like, \"Hey man. So we saw your tape, and, you know, it caused a bit of a stir at Netflix.\" Apparently it was played in the big board meeting.\n\nSo tell me about your choice to use Duran Duran's \"Hungry Like the Wolf\" and Dexy's Midnight Runners' \"Come On Eileen\" in the tape.\n\nSo the season takes place in Hawkins in 1984 in October, so if I was going to be using any music in this thing, it couldn't have come out after that time. I wanted to not just go, Okay, it's the '80s, and just pick two big tracks from the '80s. It had to be before October of 1984, so I went and looked up the songs. [\"Hungry Like the Wolf\" and \"Come on Eileen\" both came out in 1982.]\n\n\"I was thinking: Either I'm never going to work again, or somebody somewhere is going to see one thing in me, and they'll give me a chance.\"\n\nI was at the premiere [of Stranger Things 2, in L.A.], five or six days ago, and the director of photography Tim Ives and the costume designer Kim Wilcox are working on a film together in Vancouver. They had close friends that are daughters or something like that to Duran Duran, and Duran Duran found out about this tape. And they're sending me a mystery present to my house in Perth! It's amazing!\n\nNo way. What do you think it is?\n\nI have no idea. I'm wondering. It might just be a G-string. From their era. A used G-string. As a joke.\n\nI have to ask. What inspired the G-string?\n\nI did a play in high school, and that's the only reason I had this nude-colored G-string [laughs]. I think Billy's kind of unpredictable nature, it's not like me. It's obviously not like me to get in a G-string and do that, so I was like, what wouldn't Dacre do? And when I heard the music, I was like, well, whatever. YOLO [laughs]. Because I think that's Billy in every way. I get so self-conscious, so it was a nice reprieve from that, to be able to do that at home, during the day, while none of my family was home, and just go for it, to just have that moment of freedom, and be able to show them that I can have that uninhibited freedom. And I was like, Okay, what better way to do that than to oil myself up, put on a G-string, and... yeah.\n\nDid you oil yourself up?\n\nYes, there might have been a bit of oiling that went on.\n\nDid your parents see the tape?\n\n[sheepishly] Yep. They saw it... Look, it was an interesting evening, but I think all was rectified when I got the call the next morning.\n\nI remember sending it to my representatives in the States, and they forwarded it on to Netflix and the casting director, and I was thinking: Either I'm never going to work again, or somebody somewhere is going to see one thing in me, and they'll give me a chance.", "images": ["https://media.gq.com/photos/5d03b3105a0422052cd9370f/4:3/w_800%2Ch_600%2Cc_limit/Fashion-RoundUp-GQ-06142019_16x9.jpg", "https://media.gq.com/photos/59f10cc5f64b735d7390bcb1/master/w_775%2Cc_limit/joe-keery-aaron-feaver-9-2.jpg", "https://www.gq.com/verso/static/gq/assets/logo-header.d739eb0c2af2cf500d0c7ebecd1d6597474e69aa.svg", "https://www.gq.com/verso/static/gq/assets/logo-reverse.2fe772617ee3b7f2fc81c9f7237c17495b42eaee.svg", "https://media.gq.com/photos/57bb5af37c4c5fcf03df63ec/1:1/w_80%2Cc_limit/Typewriter-2.jpg", "https://media.gq.com/photos/5cffd3a927710c46b54e5749/4:3/w_800%2Ch_600%2Cc_limit/RLD-Mick-Rouse_11278.jpg", "https://media.gq.com/photos/59fb29e763a4417750d3d6a7/16:9/w_1280%2Cc_limit/dacre-montgomery-stranger-things-2.jpg", "https://media.gq.com/photos/5d03f2fa5a0422f37dd9374c/4:3/w_800%2Ch_600%2Cc_limit/meal-kit-best-stuff-3x2.png", "https://media.gq.com/photos/5cfec4fd5a04225046d935dc/4:3/w_800%2Ch_600%2Cc_limit/Best-Sex-Podcasts-GQ-2019-061019.jpg", "https://media.gq.com/photos/59fb29e763a4417750d3d6a7/16:9/w_1280,c_limit/dacre-montgomery-stranger-things-2.jpg"], "top_img": "https://media.gq.com/photos/59fb29e763a4417750d3d6a7/16:9/w_1280,c_limit/dacre-montgomery-stranger-things-2.jpg", "keywords": [], "authors": ["Condé Nast", "Alex Shultz", "Rachel Tashjian", "Sophia Benoit", "Andrew Goble", "Luisa Rollenhage", "Scott Meslow"], "canonical_link": "https://www.gq.com/story/dacre-montgomery-stranger-things-audition-tape", "title": "Witness Dacre Montgomery's Wild, Shirtless Audition Tape for Stranger Things 2", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Condé Nast", "copyright": "Copyright (c) Condé Nast 2019", "description": "Montgomery, who plays Hawkins' new resident bully Billy, was quite determined to make an impression.", "keywords": "entertainment,netflix,tv,stranger things,dacre montgomery", "robots": "index, follow", "og": {"description": "Dacre Montgomery, who plays Hawkins' new resident bully, was quite determined to make an impression.", "image": "https://media.gq.com/photos/59fb29e763a4417750d3d6a7/16:9/w_1280,c_limit/dacre-montgomery-stranger-things-2.jpg", "site_name": "GQ", "title": "Witness the Wild, Shirtless Audition Tape of Billy from 'Stranger Things'", "type": "article", "url": "https://www.gq.com/story/dacre-montgomery-stranger-things-audition-tape"}, "twitter": {"card": "summary_large_image", "description": "Dacre Montgomery, who plays Hawkins' new resident bully, was quite determined to make an impression.", "domain": "https://www.gq.com", "image": {"src": "https://media.gq.com/photos/59fb29e763a4417750d3d6a7/16:9/w_1280,c_limit/dacre-montgomery-stranger-things-2.jpg?mbid=social_retweet"}, "site": "@gqmagazine", "title": "Witness the Wild, Shirtless Audition Tape of Billy from 'Stranger Things'"}, "fb": {"app_id": 606963029328755, "pages": 7962048097, "admins": 108943}}, "movies": [], "publish_date": null, "source": "https://www.gq.com", "summary": ""}