{"url": "http://feedbox.com/2018/07/ariana-grande-wants-to-spread-the-f-king-light-in-this-chaotic-time/", "text": "Author: Zach Johnson / Source: E! Online\n\nAriana Grande, ELLE\n\nAriana Grande‘s voice is bigger than her small stature.\n\nGracing the cover of ELLE‘s August issue (on newsstands July 24), the pint-sized pop star spoke passionately about why it’s important to speak out about political and social issues. Realizing that the United States is in the midst of a “tough, wild, chaotic time,” Grande said, “Everyone has to have uncomfortable conversations with their relatives. Instead of unfriending people on Facebook who share different political views, comment! Have a conversation! Try to spread the f–king light.” That last line may be a reference to her current single, “The Light Is Coming,” but that doesn’t mean it’s untrue. And should she face any repercussions for being outspoken, so be it. “There’s a lot of noise when you say anything about anything. But if I’m not going to say it, what’s the f–king point of being here? Not everyone is going to agree with you, but that doesn’t mean I’m just going to shut up and sing my songs. I’m also going to be a human being who cares about other human beings.” As an ally, she wants to use her “privilege to help educate people.”\n\nAriana Grande, ELLE\n\nAccording to Grande, an artist’s role is…\n\nClick here to read more\n\nMore from Around the Web", "images": ["https://feedbox.com/wp-content/uploads/2018/07/ariana-grande-wants-to-spread-the-f-king-light-in-this-chaotic-time-634x675.jpg", "https://akns-images.eonline.com/eol_images/Entire_Site/2018611/rs_634x799-180711055212-634.ariana-grande-elle-cover.71118.jpg?fit=inside%7C900:auto&output-quality=90", "https://feedbox.com/wp-content/uploads/2016/11/Feed-Box-logo_PNG-400px.png", "http://media.fraud.net/shield/shield_lt.png", "https://akns-images.eonline.com/eol_images/Entire_Site/2018611/rs_634x855-180711055212-634.ariana-grande.71118.jpg?fit=inside%7C900:auto&output-quality=90", "https://feedbox.com/wp-content/uploads/2016/11/Feed-Box-logo_PNG-200px-w.png", "https://feedbox.com/wp-content/uploads/2018/07/ariana-grande-wants-to-spread-the-f-king-light-in-this-chaotic-time.jpg", "https://feedbox.com/wp-content/uploads/gravatar/sashah.jpg", "https://feedbox.com/wp-content/uploads/2017/06/logo-sm-2.png"], "top_img": "https://feedbox.com/wp-content/uploads/2018/07/ariana-grande-wants-to-spread-the-f-king-light-in-this-chaotic-time.jpg", "keywords": [], "authors": ["Sasha Harriet"], "canonical_link": "https://feedbox.com/2018/07/ariana-grande-wants-to-spread-the-f-king-light-in-this-chaotic-time/", "title": "Ariana Grande Wants to “Spread the F–king Light” in This “Chaotic Time”", "meta_data": {"og": {"locale": "en_US", "type": "article", "title": "Ariana Grande Wants to \"Spread the F-king Light\" in This \"Chaotic Time\" - FeedBox", "description": "Ariana Grande's voice is bigger than her small stature.\nGracing the cover of ELLE's August issue (on newsstands July 24), the pint-sized pop star spoke passionately about why it's important to speak out about political and social issues.\nRealizing that the United States is in the midst of a \"tough, wild, chaotic time,\" Grande said, \"Everyone has to have uncomfortable conversations with their relatives.\nInstead of unfriending people on Facebook who share different political views, comment!\nTry to spread the f--king light.\"\nAnd should she face any repercussions for being outspoken, so be it.\nELLE's cover story, conducted the day after the 2018 Met Gala (i.e. before Pete Davidson proposed), also touched on how she's been affected by last year's Manchester Arena bombing.\nBut I've also spent the past handful of years growing up under very extraordinary circumstances,\" she told ELLE. \"And I know how that story goes...\" Initially, Grande was unsure if she would ever sing again.\nBut, she later realized, it would be dishonorable to stop living her life.", "url": "https://feedbox.com/2018/07/ariana-grande-wants-to-spread-the-f-king-light-in-this-chaotic-time/", "site_name": "FeedBox", "image": {"identifier": "https://feedbox.com/wp-content/uploads/2018/07/ariana-grande-wants-to-spread-the-f-king-light-in-this-chaotic-time.jpg", "secure_url": "https://feedbox.com/wp-content/uploads/2018/07/ariana-grande-wants-to-spread-the-f-king-light-in-this-chaotic-time.jpg", "width": 634, "height": 799}}, "article": {"tag": "United States", "section": "Entertainment", "published_time": "2018-07-12T09:57:11+00:00"}, "twitter": {"card": "summary", "description": "Ariana Grande's voice is bigger than her small stature. Gracing the cover of ELLE's August issue (on newsstands July 24), the pint-sized pop star spoke passionately about why it's important to speak out about political and social issues. Realizing that the United States is in the midst of a \"tough, wild, chaotic time,\" Grande said, \"Everyone has to have uncomfortable conversations with their relatives. Instead of unfriending people on Facebook who share different political views, comment! Try to spread the f--king light.\" And should she face any repercussions for being outspoken, so be it. ELLE's cover story, conducted the day after the 2018 Met Gala (i.e. before Pete Davidson proposed), also touched on how she's been affected by last year's Manchester Arena bombing. But I've also spent the past handful of years growing up under very extraordinary circumstances,\" she told ELLE. \"And I know how that story goes...\" Initially, Grande was unsure if she would ever sing again. But, she later realized, it would be dishonorable to stop living her life.", "title": "Ariana Grande Wants to \"Spread the F-king Light\" in This \"Chaotic Time\" - FeedBox", "image": "https://feedbox.com/wp-content/uploads/2018/07/ariana-grande-wants-to-spread-the-f-king-light-in-this-chaotic-time.jpg"}, "generator": "WordPress 5.2.2", "viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0", "msapplication-TileImage": "https://feedbox.com/wp-content/uploads/2016/11/cropped-Feed-Box-logo_PNG-400px-270x270.png"}, "movies": [], "publish_date": 1531389431.0, "source": "http://feedbox.com", "summary": ""}