{"url": "discussion.femalefirst.co.uk/viewtopic.php?t=228152", "text": "Postby Guest » Sun Jun 14, 2009 3:22 pm\n\nSo things started going downhill after Jen was at the academy Awards show. And smiled at Pitt. Up till tpo that moment Crazy Jo-lie had kept Brad far from Jen. Make no mistake about it. Her frantic traveling all over the place was an attempt at keeping Pitt away from her and and any other person who might think they were a friend. She can't stand anyone but her having anything to do with Pitt . Including his own family. I knew it would backfire one day. Brad what took so long????? She suffers from an extreme mental illness. She doesn't have the kids in school for the same reason.\n\nI do believe she thought it would last. Seeing how sexy and pretty she thinks she is. A man should and would do anything she tells them to.\n\nI am under the impression her treatment of her surrogate Holly had a sort of wake up call to Pitt as to how utterly evil she is. You can bet she dismissed her like a piece of shite. A woman who carried twins for her. Started making Brad see her game of using and abusing.\n\nAnd when Jen said her and Brad talk all the time on the phone you know that was news to little miss do as I say not as I do Angelina still talks to her ex's Jo-LIE.\n\n\n\nGuess all the years of trying to force Brad to believe Jen was a shallow no good woman has a way of catching up to one. It took this long for Pitt to see just what had truly happened. Her spells have lost the power to confuse.In Touch said she has a terrible jealous streak and can't stand Brad even looking at a woman SHE DEEMS ATTRACTIVE IN ANY WAY. WE ALL KNOW HOW MUCH FUN THAT CAN BE.\n\n\n\nThe National Enquirer\n\nSays Brad is so happy to have a separation from her.Brad's closest friends are woman and that drives Angelina nuts she hates sharing him\n\nHe was mad she took the salt role because she had promised him she would stay at home and be a mom.\n\nI mean you can see her doing whatever she damn well wanted to. And he went along with it. But they have twin babies and my guess is she spends very little time bonding with them. What woman would not want to be able to stay with her new little babies. Not this woman. Sick behavior for sure. And the only thing keeping Brad from making it final is the kids.\n\nAngie be careful what you wish for. Seems like 6 kids are going to be without a mom and dad in one place. Good luck with that", "images": ["http://discussion.femalefirst.co.uk/images/smilies/icon_rolleyes.gif", "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/d/drive-thru-marijuana-store-opens-in-colorado-8862e7ad7120819.jpg", "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/b/bride-1bd63718702c29ccd16544053c7c8537a559d2d5.jpg", "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/7/75-year-royal-ale-found-3e5cb6617d38c8e7788d14b4d8d196ae9973bfe6", "http://a.collective-media.net/seg/etu/1b", "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/s/sleeping-with-a-fan-on-can-be-bad-for-your-health-e52c8c3bc.jpg", "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/n/new-species-of-lizard-found-in-stomach-of-dinosaur-2775a85f0.jpg", "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/a/atm-machine-dispenses-cupcakes-124046e05e25a165a8feb55805fce.jpg", "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/3/3m-long-great-white-eaten-3d3a3589edd92ff9a8ad43941775747df9.jpg", "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/m/meet-britains-85-year-old-prostitute-ed5b2f14fd18f63b45ead77.jpg", "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/b/british-man-sells-air-for-200-4fe09e4e12d69b7a4005b32a4bf929.jpg", "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/m/mothers-ghost-friend-c98a085b9cf41b82b1e59d1d567fbffaa5194cd.jpg", "http://www.femalefirst.co.uk/assets/gfx/ff/logos/femalefirst.png"], "top_img": "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/d/drive-thru-marijuana-store-opens-in-colorado-8862e7ad7120819.jpg", "keywords": [], "authors": [], "canonical_link": "https://discussion.femalefirst.co.uk/viewtopic.php?t=228152", "title": "Female First Forum", "meta_data": {"viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": null, "source": "http://discussion.femalefirst.co.uk", "summary": ""}