{"url": "http://www.encyclopediaofarkansas.net/encyclopedia/entry-detail.aspx?entryID=7356", "text": "The Duggars are an Arkansas family who became famous on the TLC network show 19 Kids and Counting. The family is known for its strict adherence to the Baptist faith and conservative values, which include restrictions against any birth control methods. However, the Duggars have been criticized by those who believe that such large families are not healthy for children and those who oppose their anti-contraceptive activism. On May 22, 2015, TLC announced that they were pulling all episodes of 19 Kids and Counting after Josh Duggar, the eldest child of Jim Bob and Michelle Duggar, admitted publicly that he had engaged in acts of child molestation as a teenager; the show was officially cancelled later that year. However, certain of the Duggar daughters have been featured in the follow-up series Counting On.\n\nJim Bob Duggar was born on July 18, 1965, and Michelle Ruark was born on September 13, 1966. They married on July 21, 1984. Both of them are real estate agents, and Jim Bob Duggar served two terms as an Arkansas state legislator (from 1998 to 2003). The Duggars reside in Tontitown (Washington County) in northwestern Arkansas.\n\nThe Duggars have often explained why they chose to have a large family. Initially, Michelle used birth control pills, but between her first and second children, she became pregnant while on birth control, and the pregnancy ended in a miscarriage. The couple felt that their use of birth control had caused them to lose the baby, and so they decided that they would no longer use it; in their words, they would “let God decide how many children we would have.”\n\nThere are nineteen children in the Duggar family. The oldest, Josh, was born in 1988. Twins Jana and John David were born in 1990, Jill in 1991, Jessa in 1992, Jinger in 1993, Joseph in 1995, Josiah in 1996, Joy-Anna in 1997, twins Jedidiah and Jeremiah in 1998, Jason in 2000, James in 2001, Justin in 2002, Jackson in 2004, Johannah in 2005, Jennifer in 2007, Jordyn-Grace in 2008, and Josie in 2009.\n\nJim Bob Duggar ran for U.S. Senate in 2002. Although he lost the race, the Duggars credit the beginning of their celebrity to this event. A picture taken of the family at the polls appeared in the New York Times, which led to interviews and articles in Ladies’ Home Journal and Parents Magazine, which in turn led to a documentary on Discovery Health Channel. The documentary was called 14 Kids and Pregnant Again! The Duggars agreed to take part in the project when they were promised that their faith would be highlighted. The first episode of what was then called 17 Kids and Counting aired on September 29, 2008, on TLC and featured the family traveling to New York to appear on a talk show and announce Michelle’s pregnancy with their eighteenth child.\n\nThe oldest child, Josh, married Anna Keller in September 2008, and they now have five children whose names all begin with the letter “M.” Although they moved to Washington DC, where Josh originally worked for the political action committee of the Family Research Council, they still appeared on 19 Kids and Counting until the show was suspended, whereupon they returned to Arkansas. Jill married Derick Dillard on June 21, 2014, and they now have two sons. Jessa married Ben Seewald on November 1, 2014, and they also have two sons. Jinger married Jeremy Vuolo, a former professional soccer player, on November 5, 2016, and the couple is expecting their first child, a girl, in July 2018. Joy-Anna married Austin Forsyth on May 26, 2017, and the couple’s first child, a boy, was born February 23, 2018. Joseph married Kendra Caldwell on September 8, 2017, and the couple’s first child, a boy, was born on June 8, 2018. Josiah is engaged to be married to Lauren Swanson on December 31, 2018.\n\nThe Duggars do not watch television, and the children’s Internet usage is closely monitored by the parents. The family is also known for following the tradition of courtship instead of dating. They involve prayers and hymns as part of their daily life, and they consider themselves Independent Baptists, which means that they do not belong to any specific branch of the Baptist faith.\n\nFamily members work as spokespeople with the Financial Freedom Seminar. They credit their financial stability to their ability to budget and save money, but they also rent out commercial properties for income, and their various public appearances generate income. It is estimated that the Duggars make at least $25,000 per episode of the show.\n\nBoth the show and the family have received criticism from the public. On their blog, Josh and Anna say, “Being in the public eye, people often disagree with our beliefs or the way we have chosen to live our lives. Our goal in life is to share of the hope that we have in Christ and to use whatever platform He has given us to do so.” When asked if having a large family was harmful because of overpopulation, Michelle Duggar replied that she does not feel overpopulation is a problem.\n\nAnother controversy relates to the health of the children. The nineteenth child, Josie, was born prematurely and weighed only one pound and six ounces. Michelle was suffering from a rare complication of pregnancy in which her blood pressure was too high, and Josie had to be delivered via emergency C-section. In 2011, Michelle suffered a miscarriage but announced that she was still hoping to have more children. In 2014, Michelle and Jim Bob were shown on their TLC show visiting a Little Rock (Pulaski County) OB-GYN who specializes in high-risk pregnancies to investigate whether Michelle could have any more children.\n\nMichelle and Jim Bob Duggar have released two books: The Duggars: 20 and Counting! (2008) and A Love that Multiplies (2011). Four of the older daughters—Jana, Jill, Jinger, and Jessica—have released their own book, Growing Up Duggar: It’s all about Relationships (2013), in which the sisters write about their relationship with God, family, friends, and significant others, as well as self-acceptance and the trials of adolescence.\n\nThe family is also politically active, having spoken out against pro-choice organizations such as Planned Parenthood. In the 2012 U.S. presidential race, they supported Republican candidate Rick Santorum. They filmed a short campaign video called 19 Reasons & Counting to Vote for Rick Santorum, in which they praised the candidate for his family values and conservative stance. In addition, Michelle Duggar participated in the successful campaign to repeal a Fayetteville (Washington County) city ordinance that would have protected people from discrimination in housing, employment, and public accommodations on the basis of sexual orientation.\n\nIn May 2015, In Touch magazine reported on the existence of a police report into allegations of child molestation by Josh Duggar when he was fourteen years old. An anonymous tipster had contacted Oprah Winfrey’s production company, Harpo Studios, with information on the allegations shortly before the Duggar family was to appear on Oprah in 2006, leading to the cancellation of the episode and the initiation of a police investigation into the charges. Police later dropped the investigation as the statute of limitations for the alleged 2002 incidents, involving five girls (including four of his sisters), had passed. After the In Touch exposé, copies of the Springdale (Washington and Benton counties) police report began circulating widely online. On May 21, 2015, Josh Duggar admitted the validity of reports and resigned his position with the Family Research Council; he and his wife moved back to Arkansas shortly thereafter. Subsequently, TLC suspended its broadcast of the Duggar family’s show, officially announcing its cancellation on July 16, 2015. On August 19, 2015, Josh Duggar was revealed to have an account with Ashley Madison, a website for people seeking extramarital affairs. The next day, he released a public statement acknowledging a “double life” that included marital infidelity and the viewing of pornography.\n\nShortly thereafter, Josh Duggar checked himself into a rehabilitation clinic and has since remained out of the public eye, even after returning to Arkansas in March 2016. In November 2015, adult film actress and model Ashley Stamm-Northup (a.k.a. Danica Dillon) filed suit against him alleging that he assaulted her violently during a sexual encounter. The following month, two of the sisters he molested appeared in the three-part TLC special Jill and Jess: Counting On, which chronicles their own lives. The second season of Counting On began airing in August 2016 and focused upon Jinger and her engagement to a professional soccer player. In May 2017, it was revealed that the four sisters molested by Josh Duggar had filed a lawsuit against the City of Springdale, Washington County, and In Touch for beach of privacy. Most of this lawsuit was dismissed in October 2017.\n\nFor additional information:\n\n“Bombshell Duggar Police Report.” In Touch, May 21, 2015. http://www.intouchweekly.com/posts/bombshell-duggar-police-report-jim-bob-duggar-didn-t-report-son-josh-s-alleged-sex-offenses-for-more-than-a-year-58906 (accessed June 4, 2018).\n\nDuggar, Jana, Jill Duggar, Jessa Duggar, and Jinger Duggar.Growing Up Duggar: It’s all about Relationships. New York: Howard Books, 2013.\n\nDuggar, Michelle, and Jim Bob Duggar. A Love that Multiplies: An Up-Close View of How They Make It Work. New York: Howard Books, 2011.\n\n———. The Duggars: 20 and Counting!: Raising One of America’s Largest Families: How They Do It. New York: Howard Books, 2008.\n\nThe Duggar Family. http://www.duggarfamily.com/ (accessed June 4, 2018).\n\nLeon, Melissa. “Duggar Says Overpopulation Is a Lie & More Controversies.” The Daily Beast, March 30, 2012. http://www.thedailybeast.com/articles/2012/03/30/duggar-says-overpopulation-is-a-lie-more-controversies-photos.html (accessed June 4, 2018).\n\nThe Original Duggar Family Blog. http://duggarsblog.blogspot.com/ (accessed June 4, 2018).\n\nPosner, Sarah. “Inside the Duggars’ Deep Ties with a Once-Powerful, Now-Scorned Ministry.” Talking Points Memo, September 10, 2015. http://talkingpointsmemo.com/theslice/duggars-bill-gothard-iblp (accessed June 4, 2018).\n\nWilliams, Mary Elizabeth. “Have the Duggars Stopped ‘Counting’?” Salon.com, May 20, 2014. http://www.salon.com/2014/05/20/have_the_duggars_stopped_counting/ (accessed June 4, 2018).\n\nAnastasia Teske\n\nNorth Little Rock, Arkansas", "images": ["https://encyclopediaofarkansas.net/wp-content/uploads/sites/7/2019/05/01bookflix-300x110.png", "https://s3.amazonaws.com/eoamedia/DuggarFam_t.jpg", "https://s3.amazonaws.com/eoamedia/duggar2_t.jpg", "https://encyclopediaofarkansas.net/wp-content/uploads/sites/7/2019/05/01overdrive.png", "https://encyclopediaofarkansas.net/wp-content/themes/bulmapress/frontend/images/footer-logo.png", "https://encyclopediaofarkansas.net/wp-content/themes/encyclopedia-of-arkansas/images/sponsors/acf_logo.png", "https://encyclopediaofarkansas.net/wp-content/uploads/sites/7/2019/05/01freegal.png", "https://encyclopediaofarkansas.net/wp-content/themes/encyclopedia-of-arkansas/images/sponsors/ahc-logo.png", "https://encyclopediaofarkansas.net/wp-content/themes/encyclopedia-of-arkansas/images/sponsors/heritage-logo.png", "https://encyclopediaofarkansas.net/wp-content/themes/encyclopedia-of-arkansas/images/sponsors/ar-flag.png", "https://encyclopediaofarkansas.net/wp-content/themes/encyclopedia-of-arkansas/images/sponsors/taylor_foundation_logo.png", "https://encyclopediaofarkansas.net/wp-content/uploads/sites/7/2019/05/01flipster.png", "https://encyclopediaofarkansas.net/wp-content/themes/bulmapress/frontend/images/social-share.jpg", "https://s3.amazonaws.com/eoamedia/DuggarTV_t.jpg", "https://encyclopediaofarkansas.net/wp-content/themes/encyclopedia-of-arkansas/images/sponsors/RockefellerFoundation.png", "https://encyclopediaofarkansas.net/wp-content/themes/encyclopedia-of-arkansas/images/sponsors/apt.png", "https://encyclopediaofarkansas.net/wp-content/uploads/sites/7/2019/05/01rbdigital-300x300.png", "https://s3.amazonaws.com/eoamedia/DuggarCampaign_t.jpg"], "top_img": "https://encyclopediaofarkansas.net/wp-content/themes/bulmapress/frontend/images/social-share.jpg", "keywords": [], "authors": [], "canonical_link": "https://encyclopediaofarkansas.net/entries/duggar-family-7356/", "title": "Encyclopedia of Arkansas", "meta_data": {"viewport": "width=device-width, initial-scale=1", "application-name": "CALS", "msapplication-TileColor": "#FFFFFF", "msapplication-TileImage": "https://encyclopediaofarkansas.net/wp-content/uploads/sites/7/2019/06/cropped-box_only_w_spark-270x270.png", "msapplication-square70x70logo": "https://encyclopediaofarkansas.net/wp-content/themes/bulmapress/frontend/images/favicon/mstile-70x70.png", "msapplication-square150x150logo": "https://encyclopediaofarkansas.net/wp-content/themes/bulmapress/frontend/images/favicon/mstile-150x150.png", "msapplication-wide310x150logo": "https://encyclopediaofarkansas.net/wp-content/themes/bulmapress/frontend/images/favicon/mstile-310x150.png", "msapplication-square310x310logo": "https://encyclopediaofarkansas.net/wp-content/themes/bulmapress/frontend/images/favicon/mstile-310x310.png", "og": {"url": "https://encyclopediaofarkansas.net/entries/duggar-family-7356/", "type": "article", "title": "Duggar Family - Encyclopedia of Arkansas", "image": "https://encyclopediaofarkansas.net/wp-content/themes/bulmapress/frontend/images/social-share.jpg", "locale": "en_US", "description": "The Duggars are an Arkansas family who became famous on the TLC network show 19 Kids and Counting. The family is known for its strict adherence to the Baptist faith and conservative values, which include restrictions against any birth control methods. However, the Duggars have been criticized by those who believe that such large families are not healthy for children and those who oppose their anti-contraceptive activism. On May 22, 2015, TLC announced that they were pulling all episodes of 19 Kids and Counting after Josh Duggar, the eldest child of Jim Bob and Michelle Duggar, admitted publicly that he had engaged in acts of child molestation as a teenager; the show was officially cancelled later that year. However, certain of the …", "site_name": "Encyclopedia of Arkansas"}, "robots": "noindex,follow", "twitter": {"card": "summary_large_image", "description": "The Duggars are an Arkansas family who became famous on the TLC network show 19 Kids and Counting. The family is known for its strict adherence to the Baptist faith and conservative values, which include restrictions against any birth control methods. However, the Duggars have been criticized by those who believe that such large families are not healthy for children and those who oppose their anti-contraceptive activism. On May 22, 2015, TLC announced that they were pulling all episodes of 19 Kids and Counting after Josh Duggar, the eldest child of Jim Bob and Michelle Duggar, admitted publicly that he had engaged in acts of child molestation as a teenager; the show was officially cancelled later that year. However, certain of the …", "title": "Duggar Family - Encyclopedia of Arkansas"}, "generator": "WooCommerce 3.6.4", "et-api-version": "v1", "et-api-origin": "https://encyclopediaofarkansas.net", "tec-api-version": "v1", "tec-api-origin": "https://encyclopediaofarkansas.net"}, "movies": [], "publish_date": null, "source": "http://www.encyclopediaofarkansas.net", "summary": ""}