{"url": "www.cinemablend.com/pop/1628520/the-real-reason-kate-winslet-is-skipping-the-oscars-according-to-a-report", "text": "The Real Reason Kate Winslet Is Skipping The Oscars, According To A Report Dylan Kickham Random Article Blend Facebook\n\n\n\n\n\ncinemablend\n\n\n\nEmail There will be no shortage of A-list celebrities attending the Oscars this weekend, but one superstar that won't be in attendance is Kate Winslet. The actress is reportedly skipping the awards show this year, and there's a pretty scandalous reason why if you choose to believe the tabloids. Star Magazine is reporting that Kate Winslet is staying away from the Oscars to avoid her Titanic costar Leonardo DiCaprio, but GossipCop is calling bullshit on that story. The tabloid claims that Winslet's husband Ned Rocknroll is feuding with DiCaprio after seeing how the actor interacted with his wife at last year's ceremony. After last year's Oscars, Star posted a gallery of images of Winslet and DiCaprio hugging and kissing at the show, and speculated that the former costars may have sparked a romance. The tabloid is claiming that Rocknroll was upset that DiCaprio barely acknowledged him last year and doesn't want to sit through another night where his wife will \"fawn over\" DiCaprio. Of course, Star is looking for drama anywhere it can find it, and the tabloid debunking site GossipCop is reporting that this rumor of a feud between Leonardo DiCaprio and Ned Rocknroll is pure fantasy. The real reason that Winslet is skipping the Oscars is much less dramatic --- the site says she actually won't be in attendance because she's currently filming her upcoming romance The Mountain Between Us with Idris Elba in Canada. A work conflict is obviously much more believable than some random feud, especially since Kate Winslet and Ned Rocknroll have been married for a good four years now. The couple met in 2011 on the British Virgin Islands, which are owned by Rocknroll's billionaire uncle Richard Branson. They got engaged and married a year later, and in 2013 had their son Bear Blaze Winslet. Both Winslet and Rocknroll had been married before --- Winslet twice, to directors Jim Threapleton and Sam Mendes, and Rocknroll once, to heiress Eliza Pearson --- and Winslet has two children from her previous marriages. If you're wondering what's up with Ned Rocknroll's last name (like I was), it was apparently just a result of him wanting to take life less seriously. The 38-year-old businessman was born with the much less eye-catching last name of Smith, but decided to legally change it to Rocknroll as a reaction against people taking things so seriously, according to the Daily Mail. And if Ned Rocknroll hates seriousness enough to legally change his name, it sure leads me to believe that he wouldn't get too wrapped up in a petty celebrity feud. Kate Winslet isn't up for any awards at this years Oscars, so she probably isn't too upset to be working on her movie this weekend instead of attending. Blended From Around The Web\n\nBack to top", "images": ["data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR4nGNaOxMAAfwBSW8IE8UAAAAASUVORK5CYII=", "https://ct.pinterest.com/v3/?tid=YourTagID&noscript=1", "https://i.imgur.com/EmLcl1s.gif", "https://img.cinemablend.com/quill/c/b/d/c/2/9/cbdc29e5f75f657af6e21fae278ccde31ab6417c.jpg", "https://sp.analytics.yahoo.com/spp.pl?a=1000772689113&.yp=431002", "https://img.cinemablend.com/filter:scale/quill/c/b/d/c/2/9/cbdc29e5f75f657af6e21fae278ccde31ab6417c.jpg?mw=600", "https://sb.scorecardresearch.com/p?c1=2&c2=21229662&cv=2.0&cj=1"], "top_img": "https://img.cinemablend.com/quill/c/b/d/c/2/9/cbdc29e5f75f657af6e21fae278ccde31ab6417c.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.cinemablend.com/pop/1628520/the-real-reason-kate-winslet-is-skipping-the-oscars-according-to-a-report", "title": "The Real Reason Kate Winslet Is Skipping The Oscars, According To A Report", "meta_data": {"msapplication-TileColor": "#f5aa06", "msapplication-config": "/static/browserconfig.xml", "theme-color": "#ffffff", "article": {"tag": "Leonardo Di Caprio", "publisher": "https://www.cinemablend.com/", "published_time": "2017-02-23T22:30:35+00:00", "modified_time": "2018-10-08T21:17:25+00:00", "section": "pop"}, "CinemaBlend": 10042, "page": "story", "description": "Tabloids are saying that Kate Winslet is avoiding the Oscars because of a feud with Leonardo DiCaprio! But just how true is that?", "robots": "all", "msvalidate.01": "9AA1A3C35B6D716AE80C1B615C6E8FE8", "fb": {"pages": 90893081682, "app_id": 956050344476201, "admins": 585420252}, "og": {"title": "The Real Reason Kate Winslet Is Skipping The Oscars, According To A Report", "url": "https://www.cinemablend.com/pop/1628520/the-real-reason-kate-winslet-is-skipping-the-oscars-according-to-a-report", "image": {"identifier": "https://img.cinemablend.com/quill/c/b/d/c/2/9/cbdc29e5f75f657af6e21fae278ccde31ab6417c.jpg", "width": 600, "height": 300}, "description": "Tabloids are saying that Kate Winslet is avoiding the Oscars because of a feud with Leonardo DiCaprio! But just how true is that?", "type": "article", "site_name": "CINEMABLEND"}, "twitter": {"title": "The Real Reason Kate Winslet Is Skipping The Oscars, According To A Report", "description": "Tabloids are saying that Kate Winslet is avoiding the Oscars because of a feud with Leonardo DiCaprio! But just how true is that?", "image": "https://img.cinemablend.com/quill/c/b/d/c/2/9/cbdc29e5f75f657af6e21fae278ccde31ab6417c.jpg", "card": "summary_large_image", "site": "@cinemablend", "url": "https://www.cinemablend.com/pop/1628520/the-real-reason-kate-winslet-is-skipping-the-oscars-according-to-a-report"}}, "movies": [], "publish_date": 1487889035.0, "source": "http://www.cinemablend.com", "summary": ""}