{"url": "www.msn.com/en-ph/entertainment/celebrity/jamie-foxx-%E2%80%98betrayed%E2%80%99-katie-holmes-by-%E2%80%98flirting%E2%80%99-with-mystery-blonde/ar-BBL9DfA", "text": "Jamie Foxx did not “betray” Katie Holmes by supposedly “getting flirty” with a mystery blonde at a New York City hotspot, despite a bogus report. Gossip Cop can debunk this narrative. It’s simply a non-issue.\n\nAccording to In Touch, just a few days after the actor had dinner with Holmes at Tao in NYC, he got cozy with another woman while having lunch at the trendy seafood restaurant Catch. An alleged insider tells the magazine, “When Jamie arrived to the rooftop area with friends, an attractive young blonde went and sat with them. She hugged Jamie and sat next to him.”\n\nThe outlet’s questionable source further contends that Foxx “would reach over and touch the woman’s leg or hold her hand” throughout the lunch. The magazine then baselessly theorizes that Holmes is “headed for heartbreak,” quoting its supposed insider as saying, “She needs to watch out. Jamie loves her, but he also loves to flirt.”\n\n© Gossip Cop (Getty Images)\n\nIt should be noted, the tabloid doesn’t have any real proof that Foxx got “flirty” with a mystery blonde at Catch. The outlet provides two photos, one of the actor giving a friendly hug to an unidentified woman, and another of him touching the woman’s arm during a conversation. That’s as intimate as the two get in the images and there’s no evidence to suggest they’re anything more than friends.\n\nRegardless, Gossip Cop can confirm that Holmes doesn’t feel “betrayed” when the actor socializes with other woman. The actor and actress have a somewhat unconventional dynamic, which People also noted in a recent article about Holmes and Foxx’s secretive relationship. The publication explained that the two “don’t see themselves as a couple in the traditional sense and they don’t want to be labeled as a couple.” It was further stressed that neither “want to have expectations placed on them about how they should be acting in public.”\n\nMeanwhile, the unreliable magazine is trying to make it seem as if Foxx was caught acting inappropriately by talking to another woman, but he has nothing to hide. A mutual pal of ours and the movie star recently told us “he knows he’s in a public forum” when he chats with other women. As we’ve repeatedly noted, Foxx and Holmes enjoy spending time together, but their dynamic is relaxed and both have their own separate lives.\n\nAdditionally, this isn’t the first time Gossip Cop has called out In Touch for coming up with a variation of this phony premise. Back in March, we busted the tabloid for falsely claiming that Foxx “betrayed” Holmes by “getting cozy” with a mystery woman at an Oscar party. However, the actor and actress have been spotted together several times since March, so she obviously didn’t feel “betrayed.” That remains the case.", "images": ["http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BBbyo11.img?h=17&w=0&m=6&q=60&u=t&o=t&l=f&f=png", "http://static-entertainment-eus-s-msn-com.akamaized.net/sc/57/a49b8d.gif", "http://sg.effectivemeasure.net/em_image", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/AACQhOP.img?h=66&w=88&m=6&q=60&u=t&o=t&l=f&x=622&y=421", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BBL9HPr.img?h=185&w=300&m=6&q=60&o=f&l=f&x=386&y=221", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BBbyo11.img?h=100&w=100&m=6&q=60&u=t&o=f&l=f", "http://static-entertainment-eus-s-msn-com.akamaized.net/sc/82/c22c7d.gif", "http://otf.msn.com/c.gif?js=0&evt=impr&di=3856&pi=&ps=&su=http%253A%252F%252Fwww.msn.com%252Fen-ph%252Fentertainment%252Fcelebrity%252Fjamie-foxx-%25E2%2580%2598betrayed%25E2%2580%2599-katie-holmes-by-%25E2%2580%2598flirting%25E2%2580%2599-with-mystery-blonde%252Far-BBL9DfA&mkt=en-ph&pp=False&cv.partner=Gossip%2BCop&cv.publcat=Gossip%2BCop%2BMedia&st.dpt=entertainment-celebrity&st.sdpt=&dv.Title1=&cts=636985806081462593&rf=&rid=170ff520adda4e4ca69401987031a585&cvs=Browser&subcvs=entertainment&cv.entityId=BBL9DfA&cv.entitySrc=ar&provid=AAdsRm7&ar=0&d.dgk=downlevel.pc&d.imd=0&cv.parentId=&isCorePV=&pgIdx=&pgTot=&activityId=170ff520adda4e4ca69401987031a585&pm=&pg.n=articlevnext&pg.t=article&pg.c=&pg.p=prime&anoncknm=&issso=0&ex=&aadState=0", "https://sb.scorecardresearch.com/p?c1=2&c2=3000001&cs_ucfr=1&rn=636985806081462593&c7=http%253A%252F%252Fwww.msn.com%252Fen-ph%252Fentertainment%252Fcelebrity%252Fjamie-foxx-%25E2%2580%2598betrayed%25E2%2580%2599-katie-holmes-by-%25E2%2580%2598flirting%25E2%2580%2599-with-mystery-blonde%252Far-BBL9DfA&c8=&c9=", "http://c.msn.com/c.gif?udc=true&rid=170ff520adda4e4ca69401987031a585&rnd=636985806081462593&rf=&tp=http%253A%252F%252Fwww.msn.com%252Fen-ph%252Fentertainment%252Fcelebrity%252Fjamie-foxx-%25E2%2580%2598betrayed%25E2%2580%2599-katie-holmes-by-%25E2%2580%2598flirting%25E2%2580%2599-with-mystery-blonde%252Far-BBL9DfA&di=3856&lng=en-ph&activityId=170ff520adda4e4ca69401987031a585&d.dgk=downlevel.pc&d.imd=0&st.dpt=entertainment-celebrity&st.sdpt=&subcvs=entertainment&pg.n=articlevnext&pg.t=article&pg.c=&pg.p=prime&anoncknm=&issso=0&aadState=0", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BBTEmTk.img?h=66&w=88&m=6&q=60&u=t&o=t&l=f&x=1038&y=688", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/AADlWxc.img?h=66&w=88&m=6&q=60&u=t&o=t&l=f&x=955&y=860", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BBbyo1E.img?h=16&w=16&m=6&q=60&u=t&o=t&l=f"], "top_img": "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BBL9HPr.img?h=185&w=300&m=6&q=60&o=f&l=f&x=386&y=221", "keywords": [], "authors": [], "canonical_link": "https://www.gossipcop.com/jamie-foxx-katie-holmes-flirting-mystery-blonde/", "title": "Jamie Foxx ‘Betrayed’ Katie Holmes By ‘Flirting’ With Mystery Blonde?", "meta_data": {"application-name": "Jamie Foxx ‘Betrayed’ Katie Holmes By ‘Flirting’ With Mystery Blonde?", "cq": "passed", "robots": "noindex, nofollow", "description": "Jamie Foxx did not “betray” Katie Holmes by supposedly “getting flirty” with a mystery blonde at a New York City hotspot, despite a bogus report. Gossip Cop can debunk this narrative. It’s simply a non-issue. According to In Touch, just a few days after the actor had dinner with Holmes at Tao in NYC, he got cozy with another woman while having lunch at the trendy seafood restaurant Catch. An alleged insider tells the magazine, “When Jamie arrived to the rooftop area with friends, an attractive young blonde went and sat with them. She hugged Jamie and sat next to him.” The outlet’s questionable source further contends that Foxx “would reach over and touch the woman’s leg or hold her hand” throughout the lunch. The magazine then baselessly theorizes that Holmes is “headed for heartbreak,” quoting its supposed insider as saying, “She needs to watch out. Jamie loves her, but he also loves to flirt.” It should be noted, the tabloid doesn’t have any real proof that Foxx got “flirty” with a mystery blonde at Catch. The outlet provides two photos, one of the actor giving a friendly hug to an unidentified woman, and another of him touching the woman’s arm during a conversation. That’s as intimate as the two get in the images and there’s no evidence to suggest they’re anything more than friends. Regardless, Gossip Cop can confirm that Holmes doesn’t feel “betrayed” when the actor socializes with other woman. The actor and actress have a somewhat unconventional dynamic, which People also noted in a recent article about Holmes and Foxx’s secretive relationship. The publication explained that the two “don’t see themselves as a couple in the traditional sense and they don’t want to be labeled as a couple.” It was further stressed that neither “want to have expectations placed on them about how they should be acting in public.” Meanwhile, the unreliable magazine is trying to make it seem as if Foxx was caught acting inappropriately by talking to another woman, but he has nothing to hide. A mutual pal of ours and the movie star recently told us “he knows he’s in a public forum” when he chats with other women. As we’ve repeatedly noted, Foxx and Holmes enjoy spending time together, but their dynamic is relaxed and both have their own separate lives. Additionally, this isn’t the first time Gossip Cop has called out In Touch for coming up with a variation of this phony premise. Back in March, we busted the tabloid for falsely claiming that Foxx “betrayed” Holmes by “getting cozy” with a mystery woman at an Oscar party. However, the actor and actress have been spotted together several times since March, so she obviously didn’t feel “betrayed.” That remains the case.", "viewport": "width=device-width,initial-scale=1, maximum-scale=1"}, "movies": [], "publish_date": null, "source": "http://www.msn.com", "summary": ""}