{"url": "https://www.wmagazine.com/story/antonio-banderas-hair-eyebrows", "text": "Eyebrows have many capabilities. For those like Cara Delevingne , they can make your career. For those like Kendall Jenner, they can cement your status as a serious model, because only those actually committed to the runway would bleach their brows and become full-on goth for at Marc Jacobs . And, well, as for both celebrities and, you know, normal people? Eyebrows of course also serve the central purpose of subtly and effectively keeping sweat and debris from falling into your eyes, thereby protecting your vision.\n\nBut none of these capabilities, apparently, appeal to Antonio Banderas , who, at the moment, seems to be completely devoid of eyebrows. On Wednesday, the 57-year-old actor stepped out on a red carpet in Madrid without any visible hair on his head. (Okay, he still has his eyelashes, but that's an oversight we're quite thankful for.) According to E! , the look is ostensibly part of his getting into character for his starring role as Pablo Picasso in the upcoming National Geographic series Genius: Picasso . Take a closer look at the red carpet, though, and you may start to question this reasoning.\n\nLoading View on Instagram\n\nWhat's that Banderas is standing in front of? A larger-than-life photo of his face in his portrayal of Picasso, in which the artist has eyebrows . We haven't seen the series yet, so it's unclear whether the poster is simply a less jarring image of Banderas than that which will appear onscreen, or if the two looks simply show Picasso at different stages of his life, since Banderas had previously shared a photo of himself in the role with plenty of gray hair on his face. When he made a lower-key red-carpet appearance sans eyebrows back in December, it simply seemed likely he was still finishing up filming. That possibility seems much less viable this week, though, with the series' April 24 premiere date fast approaching.\n\nAntonio Banderas Takes W's Screen Test:\n\nIn Madrid, the two juxtaposed Banderases certainly did make for an, um, eyebrow-raising red-carpet moment. And if Banderas is simply trying out a new look, we're completely for that. It may just be that he discovered he actually prefers his onscreen look, or that he's simply looking for some change. Given his track record of late, which includes studying at the same storied fashion school as Alexander McQueen and creating his own line of candles , Banderas does seem to be quite into trying new things. In any case, it's certainly a better look than some of the others he's recently rocked on his Instagram.\n\nLoading View on Instagram\n\nRelated: The Ultimate Guide to Enviable Celebrity Eyebrows, From Cara Delevingne to Lily Collins", "images": ["https://www.wmagazine.com/images/w_logo.svg", "https://vulcan.condenastdigital.com/wmag-services/photos/592f1832802c577242df3ef7/1:1/w_128,c_limit/Bella%20Hadid.jpg", "https://media.wmagazine.com/photos/5ab2e2fac238cf7aeeee32c8/3:2/w_640/antonio-banderas.jpg", "https://media.wmagazine.com/photos/5ab2e2fac238cf7aeeee32c8/2:1/w_790,c_limit/antonio-banderas.jpg", "https://vulcan.condenastdigital.com/wmag-services/photos/592f184acc1eac746f6e7547/1:1/w_128,c_limit/kendall%20jenner.jpg", "https://vulcan.condenastdigital.com/wmag-services/photos/592f1855cc1eac746f6e7549/1:1/w_128,c_limit/Kristen%20Stewert.jpg"], "top_img": "https://media.wmagazine.com/photos/5ab2e2fac238cf7aeeee32c8/2:1/w_790,c_limit/antonio-banderas.jpg", "keywords": [], "authors": ["Stephanie Eckardt"], "canonical_link": "https://www.wmagazine.com/story/antonio-banderas-hair-eyebrows", "title": "Antonio Banderas Just Shaved His Head and Eyebrows", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=no, width=device-width, initial-scale=1, maximum-scale=1", "msapplication-TileColor": "#ffffff", "msapplication-TileImage": "/images/favicon/ms-icon-144x144.png", "theme-color": "#ffffff", "author": "Stephanie Eckardt", "copyright": "Copyright (c) Condé Nast 2019", "description": "Antonio Banderas' eyebrows appear to have disappeared, in a move ostensibly part of his hairless role as Pablo Picasso in the series Genius: Picasso.", "publishDate": "2018-03-21T23:20:34Z", "keywords": "Antonio Banderas,eyebrows", "fb": {"app_id": 230068530489385, "admins": 108943, "pages": 40621875003}, "og": {"site_name": "W Magazine", "title": "Wait, Where Did Antonio Banderas' Eyebrows Go?", "url": "https://www.wmagazine.com/story/antonio-banderas-hair-eyebrows", "description": "They appear to have disappeared, along with what seems to be pretty much every other hair on his head.", "type": "article", "image": "https://media.wmagazine.com/photos/5ab2e2fac238cf7aeeee32c8/2:1/w_790,c_limit/antonio-banderas.jpg"}, "twitter": {"card": "summary_large_image", "site": "wmag", "title": "Wait, Where Did Antonio Banderas' Eyebrows Go?", "description": "They appear to have disappeared, along with what seems to be pretty much every other hair on his head.", "image": "https://media.wmagazine.com/photos/5ab2e2fac238cf7aeeee32c8/2:1/w_790,c_limit/antonio-banderas.jpg?mbid=social_retweet", "domain": "wmagazine.com"}, "version": "2.0.0"}, "movies": [], "publish_date": 1521674434.0, "source": "https://www.wmagazine.com", "summary": ""}