{"url": "https://www.quora.com/How-old-were-the-characters-during-the-first-season-of-Friends", "text": "Friends (TV series) was about six oddly insular, twenty something Fictional Characters who rarely let anyone else into their highly caffeinated clique — filled with more than enough mysteries that desperately needs to be solved even though two long decades has already pass by since it premiered on our Television screen. So, it’s true that you guys do wonder how old these New-Yorkers are? I mean, yeah, we've seen them celebrating their birthdays, and they did mention how old they were. All of them actually mentioned their ages directly and specifically, however, the numbers seemed to change, and I mean a dozen times! And in its decade-long run on the air, it had quite a few inconsistencies. But most of these are simply very minor annoyances. Truly frustrating are the glaring plot holes that affected entire episodes.\n\nOne of those were the six character’s “birth dates” plus the “ages” — Two or three of the characters’ age seemed to radically change and then change again.\n\nRachel was 24 in the pilot and 34 in the finale. Monica's age was supposed to be 24 at first, in the pilot and 34 in the finale. But later it was 25 and even later before the season 1 finale, she was 26. This was clearly a major character error, since Ross's stated age in the pilot episode, was 26. But her age should have been 25-26 in first season so than it would end with her being 35 years old in the finale. Phoebe was 27 in the pilot, and 37 in the finale. Joey was 25 in the pilot and 36 in the finale. Chandler was 26 in the pilot and 36 in the finale. Ross was also 26, turned 27 a month later, in the pilot and 37 in the finale.\n\nJust for the record, here’s how old the wonderful Cast and the Characters they played in Friends (TV series) where in both their real and fictional lives. Measured from the time of it’s Season 1 premiere (on 22 September 1994) and till it’s season finale (on 18 May 1995).\n\nActors and Actresses’ age in Season 1 (22 September, 1994 — 18 May, 1995):\n\n*Perry was the youngest member of the group.\n\nFictional Characters age in Season 1 (22 September, 1994 — 18 May, 1995):\n\nNote: Based on the birthdates, all of the six characters aged a year older during the Season 1 run,\n\n*At first Joey was younger than Chandler but later it was the other way around. (Never cleared but definitely was hinted, and people didn’t get that, obviously).\n\n“The One Where They All Turn Thirty,” Season 7: Rachel becomes the last member of the group to turn 30 and is terribly depressed about her birthday. The episode shows a series of flashbacks to the others’ own birthdays when they turned 30.\n\nSeason 7: Rachel becomes the last member of the group to turn 30 and is terribly depressed about her birthday. The episode shows a series of flashbacks to the others’ own birthdays when they turned 30. The problem is that Joey is actually the youngest in the group. In the season one episode, “ The One With The Birth,” he says that he is 25, while Rachel is implied to be closer to Monica’s age of 26 since they went to highschool together.\n\nIn the season one episode, “ he says that he is 25, while Rachel is implied to be closer to Monica’s age of 26 since they went to highschool together. Moreover, Rachel’s birthday is supposed to be in May, which she tells Gunther in, “The One With Joey’s New Girlfriend.” But in Season 7, she tells a police officer that she is an Aquarius (a January - February baby).\n\nBut in Season 7, she tells a police officer that she is an Aquarius On the other hand, her “love of life”, Ross Geller (These two were meant for eachother!)\n\nRead the full post below, after the jump.\n\nFriends (TV series) ran for 10 years, from 22nd September of 1994 to May 6th of 2004, as the actors got 10 years older, so did the six Characters:\n\nInfographics Courtesy of @asifahsankhan; In addition to Warner Bros. Entertainment; Friends (TV series) and all related characters and elements © & ™ Warner Bros. Interactive Entertainment Inc.\n\nThe details above you see is that “quick answer”, for the ones who don’t like to or more specifically don’t want to read much or are always in a hurry. (Since I write monstersized answers, that was a to show you my gratitude).\n\nNote: To keep with the line of the series of both Friends (TV series) and Joey (TV series) being 1 year for each season were taken under serious investigation and research, by me. And below are the full details of how and why “the numbers” came to be. Exactly.\n\nRead the full stories, after the jump, below:\n\nRachel (friends character)\n\nAlthough Rachel's age is treated inconsistently by the show's writers, like all birthdays, the best evidence is that she was born on May 5, 1970 or 1971. So she’s either 24 or 25 during that famous “runaway bride” incident.\n\nIn real life, Aniston’s birthday is February 11, 1969. She’s the daughter of Greek actor John Aniston and American actress Nancy Dow.\n\nHow old is this spoiled and beautiful woman actually is?\n\nSeason 4, Episode 16 : “The One With The Fake Party”\n\nRachel: Ross, that girl just spent the entire evening talking to your friends, asking to hear stories about you, looking through Monica’s photo albums, I mean you don’t do that if you’re just in it for two weeks.\n\nRoss: You think?\n\nRachel: Yeah, you got like 14 hours until she has to be at the airport, and you’re sitting here in the hallway with a 28-year-old cheerleader with a fat lip.\n\nThat means she was only 24 or almost 25 years old, when she left the evil orthodontist, Barry at the altar.\n\nAnd still almost 25, when she eventually decided…\n\n…to get one of those job things.\n\nBirthday (Month and Day)\n\nIn \"The One With Joey's New Girlfriend,\" Rachel tells Gunther her birthday is May 5. This is consistent with the month of birthday parties thrown for her on the show.\n\nThe party in \"The One Where Rachel Finds Out,\" which aired in May, 1995.\n\nwhich aired in May, 1995. Season five's month-early surprise party in \"The One Where Rachel Smokes,\" which aired in April 1999.\n\nRachel's 30th birthday, however, is celebrated in February in season seven's \"The One Where They All Turn Thirty,\" which aired on February 8, 2001. (There is no question that the party is on the birthday itself: Rachel, at one point, says, \"In Guam, I'm still 29\".) Rachel also mentions that her birthday is after Valentine's Day in, \"The One With The Girl From Poughkeepsie\" (\"Next thing you know, it'll be Valentine's Day, then my birthday, then ... Bang! They're lighting that damned tree again.\")\n\nA birthday in February is also consistent with Rachel's statement to a police officer in season seven that she is an Aquarius (Jan. 21-Feb. 19). May 5 would make her a Taurus. The February date might be a reference to Jennifer Aniston's real-life birthday, February 11.\n\nYear of Birth\n\nA 30th birthday in 2001 (season seven's \"The One Where They All Turn Thirty\") implies that Rachel was born in 1971. Her 30th birthday is celebrated as the last, while the 30th birthdays of the others are shown in the flashbacks. This makes her the youngest of all six. However, a 29th birthday in 1999 (season five's \"The One Where Rachel Smokes\") implies that she was born in 1970. In other episodes, Rachel's stated age is inconsistent with birth in either 1971, and advances at varying speeds. Chandler refers to her as 28 in season three's \"The One Where Rachel Quits\" (December 12, 1996), but 15 months later Rachel describes herself as \"a 28-year old cheerleader with a fat lip\" in season four's \"The One With The Fake Party\" (March 19, 1998). While these differences appear as inconsistencies, it may be in keeping with Rachel's character to shield her actual age.\n\nSo technically, this is how Rachel's age should have gone during the series; 1 (24-25), 2 (25-26), 3 (26-27), 4 (27-28), 5 (28-29), 6 (29-30), 7 (30-31), 8 (31-32), 9 (32-33), 10 (33-34).\n\nDid you know?\n\nOn the first episode, you see Joey and Chandler pour their Coffee, which Rachel made (for the first time apparently) into the plant on the table.\n\nAt the end of the episode, the plant on the table is dead.\n\nNot, exactly. It’s rather creepy to be precise.\n\nMonica Geller (TV character)\n\nBorn April 22, 1969. To keep with the line of the series of both Friends (TV series) and Joey (TV series) being 1 year for each season, Monica's age should have been: 1 (25-26), 2 (26-27), 3 (27-28), 4 (28-29), 5 (29-30), 6 (30-31), 7 (31-32), 8 (32-33), 9 (33-34), 10 (34-35).\n\nBy the way, Monica couldn't tell time until 13 years prior to the reveal and stated \"it's hard for some people!\".\n\nSeason 1, Episode 22 : “The One With The Ick Factor”\n\nChandler: And this manchild has no problem with how old you are? Monica: No, of course not. It´s not even an issue. Cause I told him I was 22. All: What? Monica: Oh, I can´t pass for 22? Phoebe: Well, maybe 25-26. Monica: I am 26. Phoebe: There you go.\n\nShe started as 25 but turned 26 before the first season ended.\n\nShe’s 26, I concluded that's also her age in midway through season 2! Because if she's 26 in the Season 1, it means she's 29 at the start of Season 4. And that's impossible, because Ross mentioned his age is 29 in series 4. Why impossible you ask? Because, Ross is her older brother! And they're not twins! Get it? One of them messed it up. Her character or the ones who wrote it.\n\nThe writers, presumably.\n\nPhoebe Buffay (TV character)\n\nPhoebe Buffay, born February 16. (1968?) is the younger twin daughter born to Phoebe Abbott and Frank Buffay. Her identical twin sister Ursula (also portrayed by Lisa Kudrow, and spun off from the character of the same name whom Kudrow portrayed on Mad About You), was born one minute earlier. By age 14, Phoebe was living on the streets, although Ursula apparently was not; no explanation for why one twin became homeless while the other apparently grew up under adult supervision of some kind was ever provided. Phoebe quickly found herself resorting to mugging to survive. While still 14, she, armed with a pipe, mugged her later best friend Ross Geller near St. Mark's Comics, acquiring, among other items, the only copy of Ross' homemade comic book “Science Boy”, which she kept for years before returning it to Ross, claiming that it \"taught [her] well\". (Means, she and Ross are about the same age). St. Mark's Comics was her preferred territory and \"pre-teen comic book nerds\" her preferred victims, but did her best to lead an honest life, sometimes resorting to begging.\n\nIn real life, Lisa Kudrow, born July 30, 1963, is the “smartest woman in Hollywood”. Kudrow worked on her father's staff for eight years while breaking into acting, earning a research credit on his study on the comparative likelihood of left-handed individuals developing cluster headaches. She was already 31 when Friends (TV series) aired in 1994.\n\nBirthday\n\nPhoebe revealed that her birthday is February 16 in an early season, and in \"The One With Phoebe's Birthday Dinner\" she said that the restaurant could only have a table for them on Thursday and Joey replied saying that Thursday is Halloween, implying that Phoebe's birthday is around Halloween. However, in a flashback to Phoebe's thirtieth birthday in \"The One Where They All Turn Thirty\", it is revealed by her twin sister Ursula that they are actually 31 and not 30 like she previously thought, this would make her the oldest of the six friends. She is the younger twin of her and Ursula by a minute as revealed in \"The One With The Halloween Party\".\n\nGuess how old is she?! I gotta’ admit, even though she has mentioned her age (not directly), I'm still confused. Okey, here are the quotes when she talked to her birth mom:\n\nSeason 4, Episode 1 : “The One With The Jellyfish”\n\nPhoebe Sr.: Well, I’m so sorry. I thought I was leaving you with the best parents in the world, I didn’t even hear about your Mom and Dad til a couple of years ago, and by then you were already grown up. I don’t know, you’re here, and I\n\nwould, I would really, I would like to get to know you. Phoebe: Yeah, well, everybody does! I’m a really cool person. And y'know you had 29 years to find that out, but you didn’t even try! Y'know what, you walked out on me, and I’m just, I’m gonna do the same thing to you.\n\nWhat makes me confused is, she mentioned that in the 4th season premiere, I mean, it could be her age in 3rd season (because the 4th season premiere definitely not that long after the 3rd season finale) or it also could be her age in 4th season!! So, if it's the first one, she's older one year from the guys, but if it's the second one, that means her age is just the same with the guys'. Your pick. But I think she was older than both the Chick and the Duck.\n\nThe weirdest things I’ve seen on the series regarding her character:\n\nPhoebe can hear Joey's thoughts.\n\nPhoebe can see and read the auras of others.\n\nPhoebe can speak French fluently despite learning it on the streets (of New York).\n\nShe probably had a threesome with her friend Mary Ellen Jenkins.\n\nJoey Tribbiani (TV character)\n\nJoseph Francis Tribbiani, Jr. Born January 9, 1968.\n\nJoey's age is not consistently treated. It is first mentioned in \"The One With The Birth\" which aired in May 1995 in which he says he is 25, which would made him born around 1969-1970 and would even make him younger than Monica (who claims being 26 just an episode before in \"The One With The Ick Factor\"). But, a little less than a year later in \"The One Where Joey Moves Out\", which aired in February, 1996, Joey says he is 28. The latter would put his birth in 1967 or early 1968, which would makes him than to be older than Chandler. Joey says he has been acting for 10 years. This is consistent with birth in 1967 or 1968, assuming he began his acting career at about age 18.\n\nSeason 4, Episode 2 : “The One With The Cat”\n\nMonica: (entering) Oh my God! What happened? Chandler: Oh, umm, Joey was born, and then 28 years later, I was robbed!!\n\nAnd so, even though he didn’t like it but he did got older… just like everybody else… As mentioned earlier, at first Joey was younger than Chandler but later it was the other way around. Never cleared but definitely was hinted, and people didn’t get that, obviously.\n\nIn \"The One With Joey's Fridge\", he refers to his activities during spring break in 1981 and Monica comments,\"You were thirteen.\" On the contrary, the possibility of him being born in 1969-1970 is referred to again in Season 3. Indeed, in \"The One With The Jam\", when Monica is reading a list of sperm donors, she sees Joey is among them and it is written here that he is \"27\".\n\nBut when Joey tells his friends that he's supposed to play a 19-year-old, Chandler comments, \"So by 'get up early', do you mean 1986?\", which is inconsistent with his birth in 1969.\n\nDue to the age at the end, this is how the ages should have gone: 1 (25-26), 2 (26-27), 3 (27-28), 4 (28-29), 5 (29-30), 6 (30-31), 7 (31-32), 8 (32-33), 9 (33-34), 10 (34-35). Joey's birthday is then consistent with what Michael Tribbiani reveals in the first season of Joey (TV Series), where he said to be 35. This results in a 35-36 age for season 1 and 36-37 for season 2.\n\n*(Michael Tribbiani is a fictional character on the Friends’ television spin-off Joey (2004-2006), played by Paulo Costanzo.)\n\nDid you know?\n\nWhen Joey is comparing women to ice cream he says that \"You can get them with jimmies or nuts or whipped cream\". In New York, jimmies are called chocolate sprinkles. But Matt LeBlanc (actor) is from Newton, Ma., where they are called jimmies. Plus he had a fever and flu the first day. He was at 102 degrees during “The Pilot” and had to repeatedly use a variety of remedies to attempt to cure it.\n\nBy the way, Joey's wristwatch appears and disappears during the whole first episode.\n\nChandler Bing (TV character)\n\nChandler Muriel Bing was born on April 8, 1968, to an erotic novelist mother and a gay father who later became the star of a Las Vegas drag show. He is of Scottish and Swedish ancestry. He was voted class clown in his high school yearbook. (Obviously!)\n\n\"I was on Friends from age 24 to 34. I was in the white-hot flame of fame. The six of us were just everywhere all the time.\" — Matthew Perry on People;\n\nHe comes from the wealthiest family within the group and he himself was one of the wealthiest friends. As we saw in season seven that he had been saving money from his job for the last six years. (The amount, most likely to cross 100k).\n\nHe becomes angry when Monica expects him to spend his savings on her dream wedding, convincing her that they should save the money for their life after the wedding.\n\nAge and birthday\n\nChandler's birthday is most likely in early April. In the episode where a month-early surprise party for Rachel is thrown, Rachel says that Chandler's birthday is before hers. Therefore, his birthday would have to be after or on Rachel's party day (April 8) and before Rachel's birthday (May 5). In \"The One With Unagi\", an episode that takes place on February 24, Monica says that Chandler's birthday is in a month and a half. A month and a half from February 24 is early April. This would make him an Aries.\n\nChandler's age should be like this throughout the series; 1 (26-27), 2 (27-28), 3 (28-29), 4 (29-30), 5 (30-31), 6 (31-32), 7 (32-33), 8 (33-34), 9 (34-35), 10 (35-36).\n\nThe name Chandler is actually named for an archaic trade. A chandler was a candlemaker. Chandler was almost never a first name before Friends aired. Even though that was irrelevant to this question. But hey, some things you gotta’ know right? Like his smoking obsession:\n\nDid you know?\n\n“All right, kids, I've got to get to work. If I don't input those numbers... it doesn't make much of a difference.” — Chandler Bing.\n\nChandler’s Job —Although seemly it remains a running joke through most of the seasons that no one quite knows what he does, but only Ross is aware of his job title as he created the trivia game (along with all the answers).\n\nRoss Geller (TV character)\n\nAlthough Ross's age is treated inconsistently by the show's writers, the best evidence is that he was born on October 18, 1967. Which makes him 26 years old, soon to turn 27 within a month during “the Pilot” episode.\n\nDavid Schwimmer didn’t have to audition, but he still didn’t want to do Friends (TV series).\n\n(The writers really messed up this character’s age, and when they tried to fix it, they f%cked it up, even worse.)\n\nPivot! If you've moved a couch in the last twelve years, some unhelpful person has probably shouted this as you've hoisted it down a hallway or flight of stairs. Also if you lie about your age unintentionally.\n\nPivot! Ross Geller will live on forever.\n\nMonth and Day\n\nTwo episodes state Ross's birthday as October 18. In, \"The One Where Emma Cries,\" Ross names that date as his birthday, as well as in, \"The One With Five Steaks and an Eggplant\", where he is taken to a Hootie & the Blowfish concert as his birthday present. However, in \"The One With George Stephanopoulos\", when Joey and Chandler buy Rangers tickets to celebrate Ross's birthday on the 20th of October, Ross says that his birthday was, \"seven months ago.\" In \"The One With Joey's New Girlfriend\", when Gunther asks Rachel when her birthday is, claiming to be making a list of people's birthdays, Ross says, Mine's December, before being cut off by Gunther.\n\nYear of birth\n\nIn, \"The Pilot,\" which aired in September, 1994, Ross exclaims, \"I'm only 26, and I'm divorced.\" That means that Ross was born in 1967—assuming that in using \"26,\" he was not projecting forward to his upcoming October birthday. A person born on October 18, 1967, would be expected to graduate from college around 1990. But we later learn that Ross and Chandler were Class of 1991. The discrepancy is not that great, and could be explained by Ross having taken some time off between high school and college, perhaps when he tried to, \"make it as a dancer,\" as revealed by Monica in \"The Last One\". Although in, \"The One With Ross' Library Book\", Ross replies to an attractive woman that he skipped fourth grade after her comment that he looks younger than she expected. But this could easily not be true, meaning that he only says that to impress her.\n\nIn, \"The One With The Videotape\", while Ross is telling the \"western Europe\" story to try to get a girl into bed, he claims that he backpacked across Europe in 1983. The he whispers to himself, \"I was thirteen?\" implying he was born in 1970 or 1969.\n\nIn \"The One with Ross's`Wedding Part 2\" one of Emily's relatives thinks Monica is Ross's mother and Monica says \"I'm a single mom with a 30 year old son,\" talking about Ross. If that was true Ross is born in 1967 or 1968.\n\nRoss describes himself as 29 in seasons 3, 4 and 5.\n\n(It’s like the time when everyone was unintentionally accusing him for marrying a lesbian intentionally. When actually, his wife Carol, herself wasn’t aware about the fact of being a lesbian either.)\n\nIn season 3, he tells Chandler, \"Thanks. I'm twenty-nine,\" when offered chocolate milk. In season 4, when the guys try to party without Gandalf, they all say they are 29. And in season 5, when trying to reconcile with Emily, he says that if they don't stay together he will be divorced for the second time before age 30. However, when a drunk man refers to Monica as Ross's mother at Ross's wedding rehearsal dinner in London, she expresses her distaste at having a, \"thirty-year-old son.\"\n\nSeason 4, Episode 9 : “The One Where They're Gonna PARTY!”\n\nChandler: Y’know what? We’re not sad, we’re not sad, we’re just not 21 anymore. Y’know? I’m 29 years old, dammit! And I want to sit in a comfortable chair, and watch television and go to bed at a reasonable hour! Joey and Ross: Yeah! Joey: Yeah! And I like to hang out in a quiet place where I can talk to my friends. Chandler and Ross: Yeah! Ross: And so what if I like to go home, throw on some Kenny G, and take a bath! Joey: Ross, we’re 29, we’re not women.\n\nSo apparently, he was 29 in season 3, 4 and 5. Was it because he was counting his age Mississippily?\n\nHey, it’s a good thing he’s not “an eight!”\n\nDid you know?\n\nHe is the only male member of the group to be a biological father; He first gets Carol pregnant who gives birth to their son Ben and later he then gets Rachel pregnant who gives birth to their daughter Emma. Joey never produces any children during the show, and Chandler adopts twins with Monica.\n\nIf you are still curious about his “Religion”: Certainly the Gellers identify as being Jewish but non practicing Jews. Non-practicing Jews celebrate Christmas all the time as an American tradition rather than one of faith.\n\nAlthough the producers were coy about the friends' religious backgrounds, it is revealed that Ross and Monica's father is Jewish and their mother is not. That said, Ross is seen attempting to get his son Ben to celebrate Hanukkah, by dressing up as a character he invents named the Holiday Armadillo. On another occasion, Chandler alludes to Ross being Jewish when Ross goes to steal a Bible from a hotel and Chandler says, \"Besides, it's a New Testament! What are you gonna do with it?\" Ross simply shrugs and says he'll learn about Jesus. Finally, he notes that he bought his sister Monica a Hanukkah present, when others are participating in a Secret Santa.\n\nHaving pointing out all the age related errors, I must let you know that the original script for “the Pilot” episode of Friends was a lot different to the one you saw on Tv. The scripts were changed every now and then. So it’s possible that they would eventually mess a few things up. It was the 90’s with no cell phones and no annoying teenagers, people. Oh yeah, so different. And if Marta Kauffman and David Crane got away with it, Friends could have had some quite unusual plot developments. Like Ross not being *that* into dinosaurs, actually or Rachel being nicer and \"Rachel Robbins,\" Phoebe was more into busking, Monica was a little more cynical, Joey was kind of mean, and the show was called Friends Like Us. But beyond the superficial differences, however, the worst part was, Chandler talks after 10 lines already spoken by others. Thank god they had to change that. Otherwise why else so many 20-something-year-olds want to stream a 20-something-year-old sitcom about a bunch of 20-somethings sitting around in a coffee shop? Chandler, Monica, Joey, Phoebe, Rachel, Ross, and, fleetingly, that monkey? Central Perk? “We were on a break”? The show that feels, in its way, as iconic a relic of the 1990s as do Nirvana or Pulp Fiction (1994 movie) or the two-term Clinton presidency if you were in America. Friends (TV series) became undoubtedly the national Television Series for many nations and the national anthem for many national beings.\n\nThe Friends’ debut season was overwhelmingly successful, and beyond anybody’s expectation.\n\nImage: The cast of Friends (TV series) : Matt LeBlanc, Lisa Kudrow, Matthew Perry, Jennifer Aniston, Courteney Cox and David Schwimmer at the Universal Studios in Universal City, California March 05, 1995, after winning the People's Choice Award for “Favorite Television Comedy Series”; Credit: GETTY.\n\nFrankly, Friends was not only born of that era but may, in hindsight, embody it more completely than any other TV show. Sexier than Cheers, less acerbic than Seinfeld and became more iconic and now critically and historically significant, Friends existed at the sweet spot of populist mass entertainment and prescient pop escapism. If you were alive and sentient in the 1990s, you already understand this. If you just became a fan of the Sitcom genre because of Friends, then you wished you were alive and well everyday during the 90’s.\n\nThank you,\n\nAsif Ahsan Khan\n\n*P.S.: Thanks for asking Nusly Phillips.\n\nExternal Links", "images": ["https://qph.fs.quoracdn.net/main-qimg-1cdcb34b318048708295457380c17b3a", "https://qph.fs.quoracdn.net/main-qimg-d84b203fc068996d565c14a46618a85b-c", "https://qph.fs.quoracdn.net/main-qimg-3deb776ec211347ce6ec7a688f9575ff", "https://qph.fs.quoracdn.net/main-thumb-73964102-100-ydnoylehssjpohkgwqhnbtltgkauoqoy.jpeg", "https://qph.fs.quoracdn.net/main-qimg-98fcfa5b9bcd92fab5241017f07dcfa0-c", "https://qph.fs.quoracdn.net/main-qimg-9f545eca99b5f35adaf6ea0ab55e469e", "https://qph.fs.quoracdn.net/main-qimg-b1abe427e4687e395a84323f7339a572-c", "https://qph.fs.quoracdn.net/main-qimg-0f787b44fde5f9ba0e6aa8bbdd302edf", "https://qsf.fs.quoracdn.net/-3-images.favicon.ico-26-ae77b637b1e7ed2c.ico", "https://qph.fs.quoracdn.net/main-qimg-6f32c8acaa178caf475a4023d5cd5619", "https://qph.fs.quoracdn.net/main-qimg-b49cf7797ebef6d9c86849f16e8e2058", "https://qph.fs.quoracdn.net/main-qimg-fd7cde723008fd7cd37c51b4f1f1b818", "https://qph.fs.quoracdn.net/main-qimg-183aeb5535a197e4ee04160c57400d38", "https://qph.fs.quoracdn.net/main-qimg-a524f8eafd5a7b6eae2f44b7069150b6", "https://qph.fs.quoracdn.net/main-qimg-9adc6e0bd3ff650e909f55d44fc00fbc", "https://qph.fs.quoracdn.net/main-qimg-f5740299fe4c451a500f87021c939946-c", "https://qph.fs.quoracdn.net/main-qimg-1afa048ed1e9fb3b847218f90a957156", "https://qph.fs.quoracdn.net/main-qimg-5e14fbe983280e2021b65ebeb8d677b6", "https://qph.fs.quoracdn.net/main-qimg-ae7bce361baa80c60cd53a19cf3e955c", "https://qph.fs.quoracdn.net/main-qimg-ee190948c476fd7d4e5e0691cf4b12cb", "https://qph.fs.quoracdn.net/main-qimg-e8952ad8b048ffab61fe331940e43919", "https://qph.fs.quoracdn.net/main-qimg-f078b8c41cd25efc5b80a40b6fc8efd3", "https://qph.fs.quoracdn.net/main-qimg-44dbb1e501751537ac239a3b58396a7c", "https://qph.fs.quoracdn.net/main-qimg-afee20a9695d67e336491b6aac861310-c"], "top_img": "https://qsf.fs.quoracdn.net/-3-images.favicon.ico-26-ae77b637b1e7ed2c.ico", "keywords": [], "authors": [], "canonical_link": "https://www.quora.com/How-old-were-the-characters-during-the-first-season-of-Friends", "title": "How old were the characters during the first season of Friends?", "meta_data": {"robots": "noarchive"}, "movies": [], "publish_date": null, "source": "https://www.quora.com", "summary": ""}