{"url": "https://www.islandpacket.com/opinion/opn-columns-blogs/liz-farrell/article160651629.html", "text": "From left, Craig Conover, Kathryn Calhoun Dennis and Shepard Rose on part one of the season four “Southern Charm” reunion show. Heidi Gutman/Bravo\n\nTo read the recap for part two of the reunion, click here.\n\nFirst, let me just say, that was so nice of Bravo to give the set designer, all the producers, whoever coordinates reunion outfits and basically everyone with fully functioning vision and a tiny bit of taste the night off!\n\nI mean, other than Andy Cohen. He obviously had to be there.\n\nPlus, I can’t imagine this visual boat wreck of a reunion was in any way his fault.\n\nUnlimited Digital Access: Only $0.99 For Your First Month Get full access to The Island Packet content across all your devices. SAVE NOW\n\nBut how thoughtful!\n\nI wonder who covered for them ... was it a high school prom committee whose theme was “Rocky Horror Grandma’s House”? Or was it contestants on an off-brand reality game show? Like “Project Run Away” or “Celebrity You’re Fired”?\n\nI can think of no decision that would’ve resulted in such thematically disparate visuals other than the bizarro kind that get made by two committees of out-for-themselfers competing against each other on lame TV.\n\nOK. Maybe I’m being too harsh. Maybe.\n\nLet’s just look at the evidence. Let’s just ask ourselves some critical questions here.\n\nFor instance, was that set supposed to be a replica of Patricia’s living room? If so, God why? And was that fake staircase in the background seriously painted on the wall? If not, it seemed that way, which is to say it looked faker than actual fake but I’m sure this set totally killed it in Hillcrest Elementary School’s significantly toned-down production of “The Beguiled.”\n\nAnother question: Why was the cast not told “Wear variations on a theme from this classy color palette”?\n\nAnd why oh why ... wait. I have to break this down by cast member, and Austen and Craig are the only ones who get a full fashion pass from me because First Place, Second Place in that order.\n\nEveryone else: last place.\n\nKathryn: separate contest altogether, but I’ll get to that.\n\nMy questions:\n\nWas Landon on her way to a “Downton Abbey”-themed mixer for old maids? Or was she pretending to be the spazzy ghost of a second-class passenger on the Titanic? Or was she modeling a graduation dress from Belk?\n\nDoes Victoria’s Secret sell maternity clothes now? I know that’s mean, Cameran is perfect 99 percent of the time, but come on ... her dress looked like one of those creepy cut-out bras that only 4 percent of its buyers know how to wear appropriately. Also, if it’s pink and black, there’s probably a word written across the butt.\n\nI’m not done.\n\nDid Shep look back on his Season 3 reunion (sponsored by Band-Aid?) look, shudder and say “This time we’re doing things my way, Bravo, and my way is off the floor, at the very last minute, using the socks I stole off the Wicked Witch of the West and absolutely, positively not involving someone spitting on their hand and smoothing my hair down?”\n\nDid Thomas get distracted while doing his very private but weekly “Put on Daddy’s Sunday Supper Suit and stand in front of the mirror while whispering ‘I’m Arthur Ravenel. Pass the biscuits! Pass the spiral ham! My son Thomas is, in fact, not a disappointment! And when I pass, the bridge should be renamed after him’” routine and forget to change into his reunion outfit?\n\nAnd did Naomie ask her hairdresser to make her side-waves hair look like the “after” to Landon’s “before” in a commercial for anti-frizz spray?\n\nBecause it did.\n\nI think I’ve made my case. This was a reunion of people who got very different invitations in the mail.\n\nAnd I haven’t even mentioned Kathryn’s dress.\n\nBut I’m gonna.\n\nLet’s start with other notations from my Big Book of Observations first, though:\n\n— I had forgotten that Austen showed his Coppertone butt during that first episode. (Likely because I was still confused by his presence on the show.) Holy little lady, that tan line was amazing and impressive. I’m obsessed with it. If I were Chelsea I would’ve begged him to let me fill it in with self-tanner lotion “just to see what happens.”\n\n— What a bunch of smirkers, right? Again, I have so many questions. But mostly I just have this one and it needs to be answered: Surely there’s no way Craig and Naomie have been faking their relationship woes this entire time ... or do you think? I could totally be wrong but I thought I saw doubting facial pings on the other cast members as Craig and Naomie talked about their problems. The kind of facial pings that say “Oh please.” Also, looking back it really seems like those two offered us an awfully quick and tidy clean-up to their issues in that finale, no? Literally Naomie owned up to everything Craig accused her of being. And I know I’m a sad person for wishing this, but I hope those two weren’t faking it because that would make them gross ... I also hope they make it. Gizmo can’t be going to two houses at Christmas. It’s just not fair.\n\n— Craig got beaten up and I’m annoyed at myself for kind of enjoying his reactions. It’s so kid brother. One minute he’s giving the camera Dejected Face because they’re busting on his “jack of all trades, master of none” season and his future in gardening law. The next he’s giving the camera Damn It, I’m Smiling Face because they’re making a funny joke about how his blabber would be an asset for a job that bills by the hour and he can’t help but laugh at that incorrigible truth about himself.\n\n— I’ll say it again, Craig and Austen put some effort into their appearances. Even their skin looked great. That’s all. A-plus, dermatologists of Charleston.\n\n— Two things. One, Thomas accusing Craig of having “tumbleweed blowing around” between his ears is LOL because Thomas should be so lucky, and two, the proof of that is how proud Thomas looked “coming up” with that saying. It’s about as original as his inability to have a mature and monogamous relationship.\n\n— THAT WAS A DEAD LEG! I have to say, I like Shep and all, but I could watch Craig hit him on the leg on repeat for the rest of my life and die happy. Hilarious. The look on Craig’s face when he did it! Shep is so right, though ... Craig is such an easy target.\n\n— Speaking of, I don’t believe Craig got that cheese-oral sex question from a women’s studies class. I think he got it from Gizmo (who was hoping to stop all the contorted facial atrocities he’s had to witness in that bedroom and, you know, maybe attract a few mice to the joint in the meantime).\n\n— Thomas’ dumb wink-face when Craig gave Kathryn his handkerchief made me want to drill a spigot into his temple, drain out the contents of his head, bottle it up and sell it under the brand name THIS IS WHY YOU SHOULDN’T DATE AN OLDER MAN. THEY’RE SMUG ABOUT THEIR POWER OVER YOU. Sorry. Flashbacks ... I’m putting the spigot down. And this mallet.\n\n— This week on Sexame Street: “She’s a manipulative XYZ” and “I would do XYZ” and “He and I suffer from ABC” ... stay tuned for next week when Big Bird dyes himself red to match a certain dress and the Count gives a rousing enumeration of the Cialis tabs he has left.\n\n— Exchange of the night: “Should I go to a monastery and collect bees?” “No. You should just cut down on your drinking.” Shep on the only other alternatives to not partying (?) and Andy Cohen on common freaking sense. Shep at a monastery though ...\n\n— Edit of the night: “I think people project a lot of things they don’t like about themselves onto other people.” Kathryn about Shep’s angry-drunk persona right as the camera flashes to Landon’s face\n\n— Most authentic moment of the night: “I hate that I don’t have self-control. I hate that after a few beers everything sounds like a good idea.” Shep on his drinking, which ... at what point do we all worry? He’s going to be OK, right? It’s not as bad as it looks, right? I guess we’ll have to find out on “RelationShep”\n\n— Things I believe: Landon read about Kathryn’s drug use online before the reunion. Landon also validated it by bringing it up at the reunion. Kathryn ordered that margarita to be like “I’m not a freak. See?” Kathryn drank that margarita.\n\n— Things I don’t believe: Landon’s strange tears. I want to! I really do. But no. No. Regardless of her sincerity she totally stole that moment from Kathryn. Kathryn was having a genuine emotional moment about her anxiety and “marijuana addiction” (get real, Thomas) and not being able to trust the people in her life and then Edina Monsoon is like “Squish squish, sweetie. Mama’s crying too, sweetie darling. See? Squish squish.”\n\n— When Craig handed Kathryn that handkerchief why didn’t Jennifer Snowden use that opportunity to run onto the set and kick in that staircase wall? I would have ...\n\n— I’m going to hell for this but Jen, your fake tan lady gave you a white hairline stripe. Use that fact to get a year’s worth of free service, though.\n\n— Thomas to Jennifer: “I did a 180 on you!” The rest of us: “I hope he wiped it off.”\n\n— Phone calls? Confiding in a supposed friend? Getting stabbed in the back? Where have I heard this before? Oh my God, guys. Jennifer Snowden is Kathryn’s LINDA MOTHER-EFFING TRIPP.\n\nBetter clothes though.\n\nPossibly even less sadness.\n\n— Remember when Thomas climbed out of the second-floor nursery window in Season 3? It helps to picture that while thinking about his sinister threat to Kathryn at the end of the first part of the reunion. It’s like sucking the lemon after taking the shot.\n\n— How have I not discussed Kathryn’s hair? That was like “Run Lola Run” meets that epic first episode of “Alias” meets an actual stylist who knows what they’re doing. My compliments to the chef. It was perfect. It was the kind of hair you’d want to have at a face-off with the Enemy. It said “Try me. I’m as lethal as this looks.”\n\n— All right. Let’s do this. That Dress.\n\nReasons to hate it:\n\n▪ It really needs a fruit hat?\n\n▪ It looks like Cinderella’s stepsisters already tore it apart in their pre-ball frenzy?\n\n▪ I’m sure Elmo already has a drag-queen tribute character dedicated to him?\n\n▪ If that dress is here, then what did we bury Madame the “Solid Gold” puppet in?\n\nReasons to love it:\n\n▪ Glitter gear, don’t care.\n\nJust like the woman inside it, that Marchesa dress gave zero F’s, a million go F’s and at least a dozen bow down, bishes.\n\nSo what’s not to love?\n\nCatch up on previous episodes of “Southern Charm” here and “Southern Charm Savannah” here.", "images": ["https://www.islandpacket.com/wps/build/images/islandpacket/logo.svg", "https://ece-logger.nandomedia.com/analysis-logger/Logger?rt=1&ctxId=36501&contextPath=7053-36501&pubId=21&cat=&meta=read-story&objId=160651629&type=article&title=%E2%80%98Southern+Charm%E2%80%99+recap%3A+In+defense+of+Kathryn%E2%80%99s+red+dress+(but+not+Landon%E2%80%99s+very+strange+crying)&url=https%3A%2F%2Fwww.islandpacket.com%2Fopinion%2Fopn-columns-blogs%2Fliz-farrell%2Farticle160651629.html", "https://www.islandpacket.com/latest-news/qkit8b/picture230138324/alternates/LANDSCAPE_480/dgsdgsdgsdg.jpg", "https://www.islandpacket.com/wps/build/images/islandpacket/apple-touch-icon-57-precomposed.png", "https://googleads.g.doubleclick.net/pagead/viewthroughconversion/968074018/?value=0&guid=ON&script=0", "https://www.islandpacket.com/latest-news/djox6c/picture211766074/alternates/LANDSCAPE_480/gadsenwedDM02.jpg", "https://www.islandpacket.com/latest-news/p2cu5s/picture231570268/alternates/LANDSCAPE_1140/Gruber_KeveanyReportILLIO.jpg", "https://www.islandpacket.com/latest-news/5q4mxi/picture207738594/alternates/LANDSCAPE_480/Wine.jpeg", "https://www.islandpacket.com/latest-news/ur90tj/picture229478519/alternates/LANDSCAPE_480/Screen%20Shot%202019-04-19%20at%204.33.41%20PM.png", "https://www.islandpacket.com/opinion/opn-columns-blogs/liz-farrell/frogvt/picture160651619/alternates/LANDSCAPE_1140/NUP_178779_1121"], "top_img": "https://www.islandpacket.com/opinion/opn-columns-blogs/liz-farrell/frogvt/picture160651619/alternates/LANDSCAPE_1140/NUP_178779_1121", "keywords": [], "authors": ["Liz Farrell"], "canonical_link": "http://www.islandpacket.com/opinion/opn-columns-blogs/liz-farrell/article160651629.html", "title": "'Southern Charm' recap: In defense of Kathryn Dennis' reunion dress", "meta_data": {"msapplication-TileColor": "#FFFFFF", "msapplication-TileImage": "/wps/build/images/islandpacket/windowsmetro-144.png", "twitter": {"card": "summary_large_image", "site": "islandpacket", "title": "‘Southern Charm’ recap: In defense of Kathryn’s red dress (but not Landon’s very strange crying)", "description": "To read the recap for part two of the reunion, click here.", "image": "https://www.islandpacket.com/opinion/opn-columns-blogs/liz-farrell/frogvt/picture160651619/alternates/LANDSCAPE_1140/NUP_178779_1121"}, "og": {"site_name": "islandpacket", "type": "article", "title": "‘Southern Charm’ recap: In defense of Kathryn’s red dress (but not Landon’s very strange crying)", "url": "https://www.islandpacket.com/opinion/opn-columns-blogs/liz-farrell/article160651629.html", "description": "To read the recap for part two of the reunion, click here.", "image": "https://www.islandpacket.com/opinion/opn-columns-blogs/liz-farrell/frogvt/picture160651619/alternates/LANDSCAPE_1140/NUP_178779_1121"}, "fb": {"app_id": 606330409419854, "pages": 120084158072401}, "title": "'Southern Charm' recap: In defense of Kathryn Dennis' reunion dress | Hilton Head Island Packet", "allow-comments": "true", "description": "To read the recap for part two of the reunion, click here.", "keywords": "Southern Charm, recap, reunion, Shep Rose, Landon Clements, Kathryn Dennis, Charleston, Bravo, South Carolina, SC,", "news_keywords": "Southern Charm, recap, reunion, Shep Rose, Landon Clements, Kathryn Dennis, Charleston, Bravo, South Carolina, SC,", "googlebot": "noodp, noarchive", "viewport": "width=device-width, initial-scale=1.0", "original-source": "http://www.islandpacket.com/opinion/opn-columns-blogs/liz-farrell/article160651629.html", "google-site-verification": "2ao-GZvsEZm5gIWn8SChVxk9wgOgFPryVr-cN5XpyIc", "parsely-metadata": "{\"article_id\": \"160651629\"}"}, "movies": [], "publish_date": null, "source": "https://www.islandpacket.com", "summary": ""}