{"url": "https://en.wikipedia.org/wiki/BTS_(band)", "text": "South Korean boy band\n\nBTS (Korean: 방탄소년단; RR: Bangtan Sonyeondan), also known as the Bangtan Boys, is a seven-member South Korean boy band formed in Seoul in 2013. The septet co-writes and produces much of their output. Originally a hip hop group, their musical style has evolved to include a wide range of genres. Their lyrics, often focused on personal and social commentary, touch on the themes of mental health, troubles of school-age youth, loss, the journey towards loving oneself, and individualism. Their work features references to literature and psychological concepts and includes an alternative universe storyline. Popular for their live performances, the group have staged several world tours.\n\nThe group initially formed as teenagers under Big Hit Entertainment and released their debut single album, 2 Cool 4 Skool (2013). Subsequent work such as their first U.S. Billboard 200 entries The Most Beautiful Moment in Life, Part 2 (2015), The Most Beautiful Moment in Life: Young Forever (2016), and Wings (2016) helped establish BTS' reputation as a socially conscious group. Wings became BTS' first album to sell one million copies in South Korea. By 2017, BTS crossed into the international music market, leading the Korean Wave into the United States and breaking numerous sales records, becoming the first Korean group to receive a certification by the Recording Industry Association of America (RIAA) with their single \"Mic Drop.\" The band is the first and only Korean act as of 2019 to top the U.S. Billboard 200 with their studio album Love Yourself: Tear (2018) and have since hit the top of the U.S. charts with their albums Love Yourself: Answer (2018) and Map of the Soul: Persona (2019), making BTS the first group since The Beatles to earn three number one albums in less than a year. Love Yourself: Answer also broke South Korea's Gaon Album Chart's all-time monthly record previously set by Love Yourself: Tear and became the first Korean album certified Gold in the United States.\n\nIn 2018, BTS had the second and third best-selling albums worldwide and were the second best-selling artists worldwide. In 2019, Map of the Soul: Persona became the best-selling album in Korean history, and BTS became the best-selling artist in South Korea of all time, having sold over fourteen million albums.The group won Top Social Artist three years in a row and Top Duo/Group at the 26th Billboard Music Awards. Time magazine has named the band one of the 25 most influential people on the internet, featured them on their international cover as \"Next Generation Leaders,\" and named them one of Time 100's most influential people of 2019. Forbes Korea Power Celebrity has named BTS the most influential celebrities of Korea in 2018. BTS are worth more than $4.65 billion to South Korea's economy each year, attracting one in every 13 foreign tourists that visit the country, and are cited as one of the key acts boosting global music sales to $19 billion in 2018, a figure not seen since 2006 after digital purchases gained momentum. Forbes also revealed BTS made $57 million in 2018, making them the 43rd highest paid celebrities in the world at the time.[3]\n\nFollowing their philanthropic efforts in their Love Myself anti-violence campaign in partnership with UNICEF, BTS addressed the United Nations 73rd General Assembly and became the youngest ever recipients of the Order of Cultural Merit from the President of South Korea due to their contributions in spreading Korean culture and language.\n\nName\n\nThe group's name, BTS, stands for the Korean expression Bangtan Sonyeondan (Korean: 방탄소년단; Hanja: 防彈少年團), literally meaning \"Bulletproof Boy Scouts\". According to member J-Hope, the name signifies the group's desire \"to block out stereotypes, criticisms, and expectations that aim on adolescents like bullets\".[4][5] In Japan, they are known as Bōdan Shōnendan (防弾少年団), which translates similarly.[6] In July 2017, BTS announced that their name would also stand for \"Beyond the Scene\" as part of their new brand identity.[7] This extended their name to mean \"growing youth BTS who is going beyond the realities they are facing, and going forward.\"[8]\n\nCareer\n\n2010–2014: Formation and early years\n\nBTS in 2013 performing at the Incheon Music Center.\n\nBTS formed in 2010 after Big Hit Entertainment CEO Bang Si-hyuk met with group leader RM and was impressed with his rapping.[9] BTS was originally supposed to be a hip hop group similar to YG Entertainment's 1TYM,[10] but between their initial formation and their debut, Bang Si-hyuk decided that the contemporary youth needed instead \"a hero who can lend them a shoulder to lean on, even without speaking a single word\".[11] The group was meant to debut in 2011 and featured on several tracks by artists such as 2AM and Lee Seung-gi before their debut was postponed and the group was reorganized into a more traditional idol group.[12] The lineup was then finalized with Jin, Suga, J-Hope, RM, Jimin, V, and Jungkook in 2012. Six months prior to their debut, they began to gain attention for their presence on various social media websites, as well as song covers on YouTube and SoundCloud.[13][14]\n\nWe started to tell the stories that people wanted to hear and were ready to hear, stories that other people could not or would not tell. We said what other people were feeling—like pain, anxieties and worries. That was our goal, to create this empathy that people can relate to. —Suga[15]\n\nOn June 12, 2013, BTS released their debut single album 2 Cool 4 Skool, the first installment in their \"school trilogy\" series, simultaneously with its lead single \"No More Dream\", which peaked at number 124 in Korea before quickly falling off the charts.[16][17] While the album peaked at number five in South Korea and eventually sold over 145,000 copies,[18] it was not a major hit, selling only 24,000 copies in 2013.[19] Their subsequent single “We Are Bulletproof Pt. 2” failed to chart. In 2 Cool 4 Skool, BTS employed an old-school hip-hop sound with scratches from the 1980s-90s and excessively fierce visuals.[20] From their inception, BTS was convinced that telling their story was the only way for the younger generation to relate to their music.[21] The lyrics of the album primarily reflected on the misunderstanding and prejudice towards them, criticism of the society that diminishes their dreams, and their anxiety and determination towards their future.[20] During the production of the album, Suga and RM rewrote the lyrics of “No More Dream” more than 20 times.[21] The single album's release was followed by several appearances on Korean music shows.[22][23] Despite being unpolished, these early live performances demonstrated BTS' potential with their intense and charismatic stage presence.[22] Expanding their endeavors to Japan, \"No More Dream\" was later re-recorded in Japanese and released in June 2014.[24]\n\nIn September 2013, BTS released the second part to their \"school trilogy,” the extended play O!RUL8,2?, along with its single \"N.O,” which peaked at number 92 in Korea.[25] The EP peaked at number four in Korea and has sold over 160,000 copies to date, including 34,000 copies in its release year.[26] Musically, BTS did not fundamentally change their sound as compared with 2 Cool 4 Skool, utilizing fiery rapping along with trap beats, brass, and soulful melodies. Lyrically, the EP expanded on the theme of dreams and happiness, revealing their frustration under the harsh Korean education system and their determination to confront the struggle of proving themselves.[27] Despite several performances on Korean music shows, the single quickly fell off the charts.[28] That same month, BTS starred in their own variety show, SBS MTV's Rookie King Channel Bangtan, based on a fake broadcast station, \"Channel Bangtan\", through which members parodied variety shows such as VJ Special Forces and MasterChef Korea.[29] At the end of the year, BTS was recognized with several New Artist of the Year awards, including the 5th Melon Music Awards, 28th Golden Disc Awards and the 23rd Seoul Music Awards.[30]\n\n2014–2015: Moderate success and first concert tour\n\nExterior of the nightclub Troubadour (photo taken 2006) where BTS held their first concert in the United States for free.\n\nThe last act to their \"school trilogy\", the EP Skool Luv Affair,[31] was released in January 2014 and topped the Gaon Album Chart, selling 100,000 copies in 2014 and over 250,000 copies overall.[32] It also marked BTS’ first appearance on Billboard's World Albums Chart, peaking at number three.[31][33] The album was supported by the singles \"Boy in Luv\" (Korean: 상남자; RR: Sang-namja) and \"Just One Day\" (Korean: 하루만; RR: Haruman), which peaked at number 45 and number 149 in Korea, respectively.[34] While Skool Luv Affair musically retained much of their hip-hop influences with the incorporation of R&B and hard rock, the album coincided with a thematic shift from dreams and happiness to love, focusing on school-age and youthful love.[35] Following Skool Luv Affair’s release, BTS made several appearances on Korean music shows and held their first fan meeting that March with an audience of 3,000 fans in Seoul.[36][37] That July, BTS held their first concert in the United States in West Hollywood for free to an audience of 200 fans.[38] In August, the group also made their first appearance at KCON in Los Angeles.[39] Despite being the newest artist on the list, BTS met such intense crowd reaction that Billboard noted they “wouldn’t be surprised to see a U.S. tour announced soon.”[40]\n\nIn August 2014, BTS released their first Korean studio album, Dark & Wild, which peaked at number two in Korea and sold over 200,000 copies total.[41] It was supported by two singles: \"Danger\" and \"War of Hormone\" (Korean: 호르몬 전쟁; RR: Horeumon Jeonjaeng), which peaked at number 58 and number 173 in Korea, respectively.[42] The album served as a narrative extension of the “school trilogy” and a transition into their next series. Musically, the album fused the grungy electric guitar sounds of rock within the framework of hip-hop and continued to expand their sound towards R&B. The central theme of the album’s lyrics focused on expressing the sentiments of maturing, youthful desires, and impatience for romance.[43] During production of the album, BTS recorded their single \"Danger\" in a makeshift studio in a garage in Los Angeles.[44] Following several appearances on Korean music shows, [45] BTS embarked on their first concert tour, 2014 BTS Live Trilogy Episode II: The Red Bullet, from October to December, held in various halls and theaters in six cities: Seoul, Kobe, Tokyo, Manila, Singapore, and Bangkok.[46]\n\nTheir first Japanese studio album, Wake Up (2014), released that December, peaked at number three on the weekly Oricon Albums Chart and sold 28,000 copies.[47] Along with re-recorded Japanese versions of older songs, it also contained the original tracks \"Wake Up\" and \"The Stars.\"[48] In support of the album, BTS held their 1st Japan Tour 2015 Wake Up: Open Your Eyes in February 2015 to an audience of 25,000 fans in four cities.[49] After successfully ending their Japan tour, BTS held their second solo concert in Korea, BTS Live Trilogy Episode I: BTS Begins, in March to a crowd of 6,500 fans.[50]\n\n2015–2016: Mainstream breakthrough and commercial success\n\nBTS shifted their sound and image from solely aggressive, masculine hip hop to more diverse styles,[51] wanting to express the beauty and anxiousness of \"youth\" and settled on the title of \"花樣年華\" (Korean: 화양연화; RR: Hwayangyeonhwa), loosely interpreted to define \"youth\" as \"the most beautiful moment in life.\"[52] Their third EP, The Most Beautiful Moment in Life, Part 1 (March 2015), explored the growth and emotional agony of youth as well as its playful and uplifting sides.[51] Fuse included it as the only Korean album on their list of the \"27 Best Albums of 2015 So Far.\"[53] The EP has sold over 415,000 copies to date.[54] Its lead single \"I Need U\" was BTS' first top five hit in Korea[55] and garnered BTS first ever music show win on SBS MTV's The Show.[56] While its second single, \"Dope (Korean: 쩔어; RR: Jjeoreo)\", only peaked at number 44 in Korea,[57] it peaked at number three on Billboard's World Digital Songs Chart[58] and became their first music video to accrue over 100 million views on YouTube in October.[59] In May, Twitter launched its first ever K-pop emoji featuring BTS.[60] The group began the world tour extension of their Red Bullet Tour in June, titled 2015 Live Trilogy Episode II: The Red Bullet, visiting cities throughout Asia, Oceania, North America, and Latin America.[46] Their fourth Japanese single, \"For You\", was released on June 17 to celebrate the first anniversary of their Japanese debut and topped Oricon's daily chart, selling over 42,000 copies within its first day.[61] BTS later performed at Japan's Summer Sonic Festival on August 15 and 16.[62][63] In November, BTS commenced their third concert tour, 2015 BTS LIVE \"The Most Beautiful Moment in Life: On Stage\", debuting their new song and the lead single from their fourth EP The Most Beautiful Moment in Life, Part 2, \"Run\", during the Seoul dates.[64] Thematically, the EP focused more on the serious and speculative aspects of youth, touching on the pursuit of success, loneliness, affection for their origins, and the suffering of the younger generation due to unfavorable conditions in current society. Critically, it was praised as the successful merging of the style of The Most Beautiful Moment in Life, Part 1 with BTS' initial identity.[65] The album topped the weekly Gaon Album and Billboard World Albums charts and BTS became the first K-pop act to remain atop the latter for multiple weeks.[66][67] It also marked their first appearance on the Billboard 200 chart, peaking at number 171 with over 5,000 copies.[68] BTS were awarded Best World Performer at the 17th Mnet Asian Music Awards in recognition of their international fan base.\n\nBTS performing at KCON France in Paris on June 2, 2016.\n\nTheir first Korean compilation album and the finale to their \"youth series\", The Most Beautiful Moment in Life: Young Forever, was released in May 2016. It included three new singles: the top 40 hit \"Epilogue: Young Forever\", the top 10 hit \"Fire\" (Korean: 불타오르네; RR: Bultaoreune), and the top 20 hit \"Save Me\".[69][70] The album topped Gaon Weekly Chart in Korea for two consecutive weeks and peaked at number 107 on the U.S. Billboard 200.[71][72][73] The Most Beautiful Moment in Life: Young Forever later won BTS' first major Korean award for Album of the Year at the 8th Melon Music Awards.[74] BTS embarked on their Asia tour extension, 2016 BTS LIVE \"The Most Beautiful Moment in Life On Stage: Epilogue\", from May to August, visiting 10 cities and performing to 144,000 fans.[75] During their tour, BTS held a landmark two-day concert at the Olympic Gymnastics Arena in Seoul in May,[76] and performed as first time headliners at both U.S. KCON shows held that year in Newark (June) and Los Angeles (July), to sold out audiences.[77][78]\n\nBTS win their first major Korean award for Album of the Year at the 8th Melon Music Awards on November 19, 2016.\n\nIn September 2016, BTS released their second Japanese studio album Youth.[79] It sold over 44,000 copies on its first day of release and peaked at number one in Japan.[80] Pre-orders for their second Korean studio album Wings, released in October 2016, accumulated over 500,000 copies within the first week.[81] Wings combined the themes of youth presented in their previous \"youth series\" with temptation and adversity and, for the first time as a major group effort, included seven solo tracks that demonstrated each members' potential and individuality as independent musicians.[82] The album was generally well-received by critics, with Rolling Stone naming it \"one of the most conceptually and sonically ambitious pop albums of 2016,\"[83] while Fuse praised the \"vulnerable and honest song material\" and diverse tracks.[84] The lead single \"Blood Sweat & Tears\" achieved a music chart \"all-kill\" in South Korea[85] and became their first number one hit on the weekly Gaon Digital Chart.[86] Its music video gained over 6 million views within 24 hours, breaking the previous record held on YouTube for the highest number of views of a K-pop group music video within 24 hours.[87] Wings opened at number 26 on the U.S. Billboard 200, the highest chart ranking ever for a K-pop album,[88] and BTS became the first Korean group to top the Billboard Social 50 chart that month.[89] It was their first \"million seller\" album,[90] moving over 1.5 million copies in South Korea that year and became the best-selling album in Gaon Album Chart history at the time.[91] BTS were the first artist not from a \"Big Three\" entertainment company (SM, YG and JYP) to win Artist of the Year at the 18th Mnet Asian Music Awards in December.[92][93]\n\n2017: International expansion and collaborations\n\nIn February 2017, BTS released the repackaged edition of Wings (2016), entitled You Never Walk Alone. Pre-orders of the repackage reached over 700,000 copies, breaking the record for most albums sold in a month.[94][95] The repackage included an additional four tracks that offered consolation and encouragement to its listeners.[96] Its lead single, \"Spring Day\" (Korean: 봄날; RR: Bomnal) met critical praise as \"an intelligent, compelling and elegantly restrained study of loss and longing\" that \"deliberately avoids cliché pomp and drama\" by Dazed Digital.[97] Embodying nostalgia and sorrow, it opened a new chapter in BTS' aesthetics and lyricism and attracted fans across generational boundaries.[82] Upon release, \"Spring Day\" topped eight of the major South Korean online music charts, as well as Gaon,[98][99] and crashed Melon's digital chart due to the high influx of user traffic.[100] It also entered the U.S. Billboard's Bubbling Under Hot 100 singles chart at number 15 with \"zero promotions.\"[101] As evidence of its staying power, \"Spring Day\" is the longest-charting song on Melon by an idol group to date.[102] \"Spring Day\" later won Best Song of the Year at the 9th Melon Music Awards.[103][104]\n\nBTS at their press conference in Seoul, South Korea after winning Top Social Artist at the 24th Billboard Music Awards on May 29, 2017.\n\nIn conjunction with the release of You Never Walk Alone, BTS commenced their second world tour, 2017 BTS Live Trilogy Episode III: The Wings Tour, from February to December. The tour visited 12 countries including Brazil, Australia, Japan, Hong Kong, and the United States and gathered 550,000 fans.[105] On the tour, BTS began to play progressively larger venues, moving from halls into arenas and domes. Tickets for the North American leg sold out within minutes and two additional shows were added due to high demand, making BTS the first K-pop act to sell out arenas in the United States.[106][107] After completing their North American leg, BTS attended the 24th Billboard Music Awards in May and won Top Social Artist, becoming the first Korean group awarded a Billboard Music Award.[108]\n\nCelebrating Korean music icon Seo Taiji's 25th anniversary as a part of his anniversary project \"Time: Traveler\", BTS released a remake of Seo Taiji's 1995 classic \"Come Back Home\" in July 2017, reworking the sound and lyrics to similar sentiments toward societal change that Seo Taiji argued for in his songs.[109] BTS was later invited by Seo Taiji to perform as backup vocalists and dancers for eight songs in his Seoul Olympic Stadium concert held early September. During the concert, Seo Taiji acknowledged BTS' thematic similarities to his music and recognized the group as his musical successors, declaring, \"This is your generation now. Show them.\"[110][111]\n\nFollowing the depiction of growth and temptation in Wings (2016) and consolation in You Never Walk Alone (2017), BTS embarked on their \"Love Yourself\" series which sought the enlightenment of self-love through the \"起承轉結\" (Korean: 기승전결; RR: Giseungjeongyeol) narrative sequence of \"beginning, development, turn, and conclusion.\"[112] In September 2017, BTS released the first part of the series, their fifth EP, Love Yourself: Her[113] and featured music from the Chainsmokers' Andrew Taggart for the track \"Best of Me\".[114] The EP was supported by two singles: the lead single \"DNA\" and a Steve Aoki remix of their song \"Mic Drop\" featuring American rapper Desiigner. In the narrative sequence, the EP represented the \"承,\" or \"development\" of the series and is considered by RM to be one of the major turning points in BTS' career.[115] Within the larger narrative, Love Yourself: Her described the joy and happiness of falling in love.[112] Sonically, the EP served as \"a dual exploration of the group's electro-pop and hip-hop leanings,\" with the first half consisting of “dance tracks that emphasize the group's vocals\" while in the second half \"the act's hip-hop side arrives in earnest...delivering powerful rap performances.\"[116]\n\nBTS at the 45th American Music Awards shortly before making their debut performance on U.S. television on November 19, 2017.\n\nCommercially, BTS continued to hit new career heights with the Love Yourself: Her EP, debuting at number seven on the Billboard 200 with 31,000 album-equivalent units.[117] In Korea, the EP sold over 1.2 million copies on the Gaon Album Chart in its first month, achieving the highest monthly album sales in the chart's history and the highest on any Korean chart in 16 years, second to g.o.d's Chapter 4 album in 2001.[118] The single \"DNA\" was released simultaneously with the EP and debuted at number two in Korea. Its music video broke the previous record for most viewed K-pop group music video within the first 24 hours with more than 20 million views on YouTube.[119] \"DNA\" also became the group's first entry on the Billboard Hot 100 at number 85, making BTS the first K-pop boy band to do so and the second Korean act with a Korean-language song.[120] The following week, \"DNA\" rose to number 67 and became the highest-charting song on the Billboard Hot 100 for a K-pop group, beating Wonder Girls' previous record at number 76.[121] The following single \"Mic Drop (Remix)\" peaked at number 28 on the Billboard Hot 100, becoming the first top 40 entry for a K-pop group on the chart.[122][123] Both \"Mic Drop Remix\" and \"DNA\" were later certified Gold[124] by the Recording Industry Association of America (RIAA)[125] making BTS the first and only Korean artist to receive two certifications.[126] \"Mic Drop\" went on to receive Platinum certification in November 2018, making BTS the first Korean group with a Platinum-certified single in the United States.[127] In December 2017, \"DNA\" and \"Mic Drop\" were released as a triple-A side single in Japan with the new song \"Crystal Snow\",[128] which topped the Oricon Chart[129] and became the highest-selling single from a K-pop artist within a week.[130] The single sold more than 380,000 copies by the end of the year and BTS became the only foreign artist to have a single certified double platinum by the RIAJ that year.[131][132][133][134][135]\n\nIn November 2017, BTS became the first K-pop group to perform at the American Music Awards,[136][137] raising their profile internationally.[138][139] That same month, Guinness World Records revealed that BTS had earned a spot in their 2018 edition for \"having the world's most Twitter engagements for a music group\".[140] In December, they also became the first K-pop group to perform on Dick Clark's New Year's Rockin' Eve to welcome the new year[141] and made their Japanese TV music show debut on TV Asahi's Japan Music Station Super Live.[142] At the end of the year, BTS won their second Artist of the Year at the 19th Mnet Asian Music Awards,[143] becoming the first act to win the award two years in a row.[144][145] They also became the first artist outside of the \"Big Three\" to win major awards at the Golden Disc Awards[146] and the Seoul Music Awards, respectively.[147]\n\n2018: Worldwide recognition\n\nIn the lead up to their next album, BTS released an original eight-episode documentary series exclusively on YouTube Premium entitled Burn the Stage that ran from March until May 2018, offering a behind-the-scenes look at the group's 2017 Wings Tour.[148][149] In April, the group also released their third Japanese studio album, Face Yourself,[150] which debuted at number 43 on the Billboard 200 as the third-highest-charting Japanese album in the history of the chart.[151] In conjunction with the release of Face Yourself, the group released a nine-minute short film titled \"Euphoria: Theme of Love Yourself: Wonder,\" which featured the song \"Euphoria\" and embodied the \"起\" or \"beginning\" of the narrative sequence.[152]\n\nLove Yourself: Tear on May 24, 2018. BTS at their press conference foron May 24, 2018.\n\nIn May 2018, BTS released their third Korean-language studio album, Love Yourself: Tear in conjunction with an appearance at the 25th Billboard Music Awards.[153] At the show, BTS debuted as performers with the premiere of their lead single, \"Fake Love\"[154] and won Top Social Artist, making them the only Korean artist to win the award two years in a row.[155][156] In the narrative sequence, the album coincided with the \"轉\" or \"turn\" of the series, touching on the tortuous enlightenment of loving without being loved and encouragement to those without dreams.[157] It received generally positive reviews from critics. Caitlin Kelley from Billboard described the album as \"one of their most thematically cohesive yet sonically varied albums, with maximalist production erupting against lyrics about emptiness,\"[158] while Sheldon Pearce of Pitchfork wrote that the album \"formula is a slick, loosely thematic album about love and loss, with a stronger focus on rapping than ever before\" and that it \"aims for cohesion and produces fun, prismatic songs in the process.\"[159]\n\nCommercially, Love Yourself: Tear was one of BTS' most successful albums, bringing them to new heights both domestically and internationally. The album debuted at number one on the U.S. Billboard 200 with 135,000 album-equivalent units (including 100,000 pure album sales), becoming BTS' highest-charting and first number one album in the US, the first K-pop album to top the U.S. albums chart, and the highest-charting album by an Asian act.[160][161] Love Yourself: Tear also became BTS' first top ten hit in the United Kingdom, reaching number eight on the UK Albums Chart.[162] Their single \"Fake Love\" became their first top ten hit at number 10 on the Billboard Hot 100, becoming the seventeenth non-English song to reach the top ten and the first by a Korean group.[163][164] \"Fake Love\" later became their third single to attain Gold certification by the RIAA that August.[165]\n\nAs the conclusion of the Love Yourself series, BTS released their second Korean compilation album Love Yourself: Answer in August 2018,[166] which contained songs from the previous Love Yourself releases along with seven additional new tracks.[167] The album was supported by the lead single \"Idol\" and the alternative digital release featuring Nicki Minaj.[168][169] Thematically, Love Yourself: Answer placed the songs of the Love Yourself series within the narrative of beginning, development, turn and conclusion to illustrate the excitement of love, the pains of farewell, and the enlightenment of self-love.[170] Critically, the album received generally positive reviews, with Billboard calling it a \"masterful culmination of years of work and rife with meaning\" and \"undeniably a magnum opus from BTS that that few other artists, boy bands or otherwise, ever can hope to achieve.\"[171]\n\nCommercially, the record sold over 1.9 million copies on the Gaon Album Chart in August 2018, breaking the chart's all-time monthly record once again.[172] The album became BTS' second number-one album on the U.S. Billboard 200 and their highest sales week in the country at that time,[173] making BTS the only K-pop act with two Billboard 200 toppers and the first pop act with two number one albums in less than a year since One Direction topped the chart with Midnight Memories in 2013 and Four in 2014.[173] Love Yourself: Answer later became the first Korean language album to be certified Gold by the RIAA in November.[127] In Canada, Love Yourself: Answer became the band's first number-one album on the Canadian Albums Chart. In the United States, \"Idol\" peaked at number 11 on the Billboard Hot 100.[174] The single \"Idol\" also reached number five on the Canadian Singles Chart, marking BTS' first top-ten hit in Canada.[175] The music video for \"Idol\" received over 45 million views in its first 24 hours on YouTube, breaking the record previously set by Taylor Swift with \"Look What You Made Me Do\".[176]\n\nNew York City's Citi Field , the venue for BTS' first stadium concert in the United States, sold out in 20 minutes.\n\nIn conjunction with Love Yourself: Answer's release in August 2018, BTS commenced their third world tour, BTS World Tour: Love Yourself, with a landmark concert in the Seoul Olympic Stadium, the largest stadium in South Korea.[177] During their tour, BTS also featured on Steve Aoki's single \"Waste It On Me\" released that October, which was their first and only all-English language feature.[178][179] On tour, BTS continued to play to progressively larger venues from arenas to domes to stadiums. For the final stop of the North American leg, the band performed at Citi Field, marking the first time a Korean act has performed at a U.S. stadium.[180] All 40,000 tickets for the stadium date sold out in under 20 minutes.[181] According to StubHub BTS was one of 2018's best-selling concerts in international markets outside the US, second to only Ed Sheeran.[182] Vivid Seats named BTS the 2018 artist of the year, citing the group's history-making concert at Citi Field.[183] The tour also received generally positive reviews from critics. Philip Cosores from Uproxx described BTS' four nights at the Staples Center as an \"enormous, multi-sensory experience\" bringing an \"inclusive\" and \"multicultural experience\" where music is above any language barrier,[184] while Crystal Bell from MTV said \"BTS have created an experience so captivating, so inclusive, and so visually stunning that it’s cemented the boy band as one of the most vital acts in pop music today.\"[185] That October, with more than a year remaining in their contract, BTS renewed their contract with Big Hit Entertainment through 2026.[186]\n\nIn early November 2018, a popular Japanese music show cancelled BTS' performance citing a T-shirt a member wore the year before.[187] In the same month the Jewish human rights organization Simon Wiesenthal Center (SWC) stated BTS owed victims an apology for the shirt in 2017, clothing with Nazi symbolism, and a flag.[188] Big Hit Entertainment issued an apology, saying that the images on the clothing were not intended to be hurtful to the victims of Nazism or atomic bombings, and that the band and management would take steps to prevent future mistakes. They also stated the flags were meant to be a commentary on the Korean school system.[189] The apology was accepted by SWC and the Korean Atomic Bomb Victim Association.[190][191]\n\nCrossing over to film, BTS released Burn the Stage: The Movie in theaters worldwide in November 2018 to commercial success. In the United States it accumulated $1.2 million on opening day for a total of $3.54 million over the three day weekend, breaking the record for the highest grossing event cinema musical production which was previously set in 2014 by the band One Direction. It ranked at number ten in the box office despite selling at only 620 locations compared to the 2,000-4,000 locations for the other top ten sellers.[192]\n\nAt the end of the year, BTS won their third Artist of the Year at the 20th Mnet Asian Music Awards in a row and ranked number eight on Billboard's year-end Top Artist Chart alongside the likes of Drake and Taylor Swift and were also the number two act of the year in the Duo/Group ranking, only behind Imagine Dragons.[193][194] They also made the Bloomberg 50 due to their \"willingness to address social issues, mental health, and politics, despite being in a genre often painted as bubble gum pop\".[195] The group sold more than ten millions albums in South Korea alone, with five million being sold in 2018 alone.[196]\n\n2019: Map of the Soul: Persona , Stadium world tour and BTS World\n\nIn February 2019, BTS attended the 61st Grammy Awards as award presenters.[197][198] It was their first time attending the event following an appearance by the group at the LA Grammy Museum in 2018.[199][200] In April, BTS became the first Asian act to surpass 5 billion streams on Spotify,[201] and Time named BTS as one of Time 100's most influential people of 2019.[202]\n\nTheir sixth EP, Map of the Soul: Persona, was released on April 12 with the lead single \"Boy With Luv\" (Korean: 작은 것들을 위한 시; RR: Jageun geotdeureul wihan si), featuring American singer Halsey.[203] The EP's release was followed by a performance on Saturday Night Live, as the first Korean act to do so.[204] The group's appearance was anticipated as one of the biggest in the show's history.[205] Commercially, BTS reached new career heights. Map of the Soul: Persona became the first Korean-language album to reach the number one position in both the UK and Australia[206][207] and the group's third consecutive album to top the Billboard 200 and the third within eleven months, joining the likes of The Beatles, who achieved the same in 1995–96. The EP became the best selling physical album in the USA for the year of 2019, with 312,000 physical sales.[208] Map of the Soul: Persona later became the best-selling album ever in South Korea, with more than 3.2 million sales in less than a month. Prior to BTS, the best-selling were dominated by late 90's albums, making BTS the only act formed after 2000 to be featured in the top 10 best-selling list.[209] \"Boy With Luv\" debuted at number 8 on the Billboard Hot 100, the highest in history for a Korean group,[210] and its music video became the most-viewed online video within the first 24 hours as of 2019 , accumulating more than 74.6 million views.[211] \"Boy With Luv\" was certified in multiple countries, including in Australia where \"Boy With Luv\" was certified Gold, selling 35,000 units, and certified Platinum in the US by the Recording Industry Association of America, selling over one million units.[212][213] Map of the Soul: Persona also attained Silver in the UK, selling over 60,000 units.[214]\n\nBTS performing at the Rose Bowl in front of 60,000 fans.\n\nIn May 2019, following their two wins at the 26th Billboard Music Awards, including a win for Top Duo/Group, BTS embarked on their stadium world tour extension, Love Yourself: Speak Yourself, with dates in multiple stadium venues including Wembley Stadium, Stade de France, MetLife Stadium, Rose Bowl, and Soldier Field.[215] All dates sold out within two hours with second dates for all venues added due to the high demand.[216] During the tour, BTS performed on The Late Show with Stephen Colbert[217] and kicked off Good Morning America's 'Summer Concert Series' as headliners at Central Park in Manhattan.[218] They also performed on the finale episode of The Voice[219] and one of the semi-finals of Britain's Got Talent.[220]\n\nIn the lead up to the release of their new mobile game BTS World in June 2019, BTS released three collaboration singles, \"Dream Glow\" featuring English singer Charli XCX,[221] \"A Brand New Day\" with Swedish singer Zara Larsson,[222] and \"All Night\" featuring American rapper Juice Wrld. The band also released the song \"Heartbeat\" with a music video from the game's official soundtrack, titled BTS World: Original Soundtrack.[223][224] Developed by South Korean company Netmarble, the game was released on June 26 to iOS and Android systems in over 175 countries.[225]\n\nIn July 2019, BTS were ranked 43 by Forbes in their list of highest paid entertainers in the world. The septet were revealed to have made more than $57 million USD in 2018.[226]\n\nArtistry\n\nInfluences\n\ncenter) performing BTS member Jin () performing Freddie Mercury 's \"ay-oh\" chant at their first concert in Wembley Stadium on June 1, 2019.\n\nBTS has cited Nas, Eminem, Kanye West, Drake, Post Malone, and Charlie Puth as musical inspirations.[227] BTS has also cited Queen as an influence, saying they \"grew up watching videos of Live Aid.” During their concert at Wembley Stadium in London, Jin paid tribute to Queen by leading the crowd in a version of Freddie Mercury’s \"ay-oh\" chant from the band’s Live Aid concert.[228]\n\nBTS are also influenced by many literary, psychological, artistic, and philosophical mediums. Their album Wings (2016) was inspired by Hermann Hesse's coming of age novel, Demian.[229] Their song \"Blood Sweat and Tears\" references Friedrich Nietzsche's Thus Spoke Zurathustra, Herbert James Draper's The Lament for Icarus, Pieter Bruegel's Landscape with the Fall of Icarus, and Pieter Bruegel's The Fall of the Rebel Angels by quoting Nietzsche and featuring the three aforementioned paintings in the music video.[230] Their \"Spring Day\" music video contains lyrical and visual references to Ursula Le Guin's short story The Ones Who Walk Away from Omelas.[231] The Love Yourself series was primarily influenced by Erich Fromm's The Art of Loving,[232] while their song \"Magic Shop\" of Love Yourself: Tear' (2018) was inspired by James R. Doty's memoir Into the Magic Shop.[233] Their 2019 album Map of the Soul: Persona gains its name from Murray Stein's Jung's Map of the Soul: An Introduction.[234]\n\nMusic\n\nBTS co-writes, produces, and composes much of their output, to which some media outlets have attributed their success.[235][236] Since their inception, BTS have developed and maintained a style of \"fusion music\" with an emphasis on hip hop as their musical base[237] largely due to the influence of RM and Suga's background as underground rappers[10] and their main producer Pdogg.[238] Rather than wanting to stick to a specific genre, BTS have introduced brand new elements into their musical repertoire with each new album.[237] BTS' sound began with old-school hip hop influences heard on 2 Cool 4 Skool and O!RUL8,2?,[20] but evolved to include R&B and rock with Skool Luv Affair and Dark and Wild,[239][43] orchestral strings and electronic dance music with their The Most Beautiful Moment in Life album series,[65] moombahton, neo soul, and gospel in Wings and You Never Walk Alone,[240][82] and future bass, Latin pop, and jazz hip hop in their Love Yourself album series.[112]\n\nLyrics and themes\n\nBTS' lyrics are known for their social commentary, often incorporating criticism of South Korean society. Songs such as \"No More Dream\" and \"N.O\" from their \"school trilogy\" were deeply motivated by their experiences with South Korea's emphasis on education and called for change to the education system and societal expectations.[241] Their experiences with youth culture in South Korea inspired songs like \"Dope\" and \"Silver Spoon\" (Korean: 뱁새; RR: Baepsae) from their \"youth series,\" referencing generational disparity and the millennial's giving up of romantic relationships, marriage, children, proper employment, homes, and social life in the face of economic difficulties and societal ills while facing condemnation from the media and older generations.[241] The song \"Am I Wrong\" from Wings (2016) questioned societal apathy towards the state of current events—the lyric \"We're all dogs and pigs / we become dogs because we're angry\" referenced the South Korean Ministry of Education official Na Hyang-wook who was a proponent of the caste system and described the average person as \"dogs and pigs,\" and BTS performed the song on television during the 2016 South Korean political scandal that led to the impeachment of ex-President Park Geun-hye.[241] RM and Suga's personal struggles with mental health inspired songs like \"Tomorrow\", \"Intro: The Most Beautiful Moment in Life\", \"So Far Away\", \"The Last\", and \"Forever Rain.\"[242][243] \"Not Today\" from You Never Walk Alone (2017) is an anti-establishment anthem, with messages advocating for minority groups,[244] while \"Spring Day\" was created to memorialize the victims of the Sewol Ferry tragedy.[245]\n\nBTS' albums have recurring themes that fall under the over-arching theme of \"reflection of youth.\"[8] Their \"school trilogy\" explored \"the troubles and anxieties of school-age youth.\"[246] Their \"youth series\" \"tackled a subject that the vast majority of youth experience, but few pop musicians articulate well: mental health and the desire to belong in society.\"[246] Wings (2016) focused on temptation and sin.[247] The \"Love Yourself\" series utilized a narrative form to illustrate the excitement of love, the pains of farewell, and the enlightenment of self-love.[170]\n\nSince their inception, BTS was convinced that telling their story was the only way for the younger generation to relate to their music.[21] Writing over 90 percent of their lyrics,[248] BTS try to include experiences everyone has felt in life, such as sadness and loneliness, and turn them to something more light and manageable. In regards to their lyricism, RM states he tries to not sound as if they're preaching or reprimanding people in their songs as everyone has different lives and different destinies.[249] When asked if it is difficult to write about things like mental health, Suga responded,\n\n\"We feel that people who have the platform to talk about those things really should talk more, because they say depression is something where you go to the hospital and you’re diagnosed, but you can’t really know until the doctor talks to you. [...] More and more, I think artists or celebrities who have a voice should talk about these problems and bring it up to the surface.[250]\n\nBTS has been praised for \"speak[ing] honestly about topics they deem important, even in a conservative society\" by Jeff Benjamin in Fuse magazine.[96] South Korean president Moon Jae-in, in a letter to BTS, recognized their sincerity and inclusion of diversity as key to their success, writing, \"Each of the seven members sings in a way that is true to himself and the life he wants to live. Their melody and lyrics transcend regional borders, language, culture, and institutions.\"[251]\n\nImpact and influence\n\nKorea-France Friendship Concert in Paris on October 14, 2018. BTS performing at thein Paris on October 14, 2018.\n\nBTS has been described as \"easily the biggest and most successful name in K-pop in the world\" that can \"do things no other name in their genre can.\"[252] As the first Korean musician to make the Global Artist Chart in 2018, BTS had the second and third best-selling albums worldwide and were the second best-selling artists worldwide in terms of physical, digital, and streaming platforms, coming second only to Drake.[253][254] In the United States, BTS accounted for 72.7 percent of the album consumption units generated by K-pop acts in 2018 out of a total of 17 acts.[255] The most tweeted-about celebrities in the world in 2017 and 2018,[256][257] Time magazine has named the band one of the 25 most influential people on the internet,[258] featured them on the cover of their October 2018 global edition as \"Next Generation Leaders,\"[259] and named them one of Time 100's most influential people of 2019.[260] BTS also made it to the Bloomberg 50 in 2018,[195] and Forbes Korea Power Celebrity has named them the fifth most influential celebrities of Korea in 2017 and the most influential celebrities of Korea in 2018.[261][262] CNN has alikened the intensity of the fans of BTS to that of \"Beatlemania.\"[263] Their influence led them to address the United Nations at their 73rd General Assembly[264][265] and to perform to 400 officials including South Korean president Moon Jae-in at the Korea-France Friendship Concert in Paris, a summit meant to show the friendly relations between France and South Korea.[266] Due to their contributions in spreading Korean culture and language, BTS became the youngest ever recipients to be awarded the Order of Cultural Merit by the President of South Korea.[267]\n\nBTS has measurably revitalized the Korean economy[268] and the global music industry. Credited for the surge in popularity of online purchases of K-pop items[269] and the growth of the Korean Wave between 2016 and 2018 by the Korea Customs Service and Korea Foundation,[270] BTS was cited as one of the main driving forces for the recovery of South Korea’s music-related sector to levels seen before China’s 2016 ban on domestic cultural contents over soured diplomatic relations.[271] Yung Duk Kim, vice president and chief operating officer of the Korea Creative Content Agency, stated K-pop has “skyrocketed” since BTS' popularity surged, creating jobs not only for BTS and their team but other K-pop idols as well.[272] Various news outlets coined the term the \"BTS effect\" to refer to the commercial effects of BTS' influence, such as when KB Kookmin Bank savings accounts increased six-fold compared to the prior year following BTS' endorsement and when stock prices of entertainment companies in South Korea shot up for five days after BTS topped the U.S. Billboard 200.[273][274][275] The effect was also observed when companies tied to BTS, such as Netmarble, NetMark, Soribada, Key Shares, GMP, Diffie, and Mattel had their stocks rise.[276][277] Data firm SM2 Networks estimated Hyundai Motor received ₩600 billion ($502 million) in promotional results after commissioning BTS as their promotional models in 2018.[278] Signed on as tourism ambassadors in 2017, the Seoul Metropolitan Government credits BTS for the recovery of Seoul's shrinking tourism industry following the 2016 THAAD controversy, bringing in an average of 790,000 tourists to Korea annually.[279] In December 2018, the Hyundai Research Institute estimated BTS was worth more than $3.67 billion to the Korean economy each year, attracting one in every thirteen foreigners who visit Korea.[280][281] As of June 2019 , BTS' economic effect on South Korea is estimated to be over ₩5.5 trillion ($4.65 billion) per year.[282] Along with Ariana Grande and Drake, BTS was credited as a key act boosting global music sales to $19 billion in 2018. Such profit had not been seen since 2006 after digital purchases gained momentum.[283]\n\nBTS' work has influenced numerous artists, including (G)I-dle,[284] D-Crunch's Hyunho,[285] The Boyz' Younghoon,[286] SF9's Zuho,[287] Euna Kim,[288] Golden Child's Jaehyun,[289] Wanna One,[290] IN2IT,[291] Park Ji-hoon,[292] Kim Dong-han,[293][294] Seven O'Clock,[295] Hyeongseop X Euiwoong,[296] Noir,[297] Victon's Sejun,[298] and Loona.[299] After BTS released their single \"Idol,\" the National Gugak Center had to expand the amount of Korean instrument sounds available due to increased demand from Korean and foreign producers alike.[300] K-pop idol groups also began changing the themes of their lyrics from love stories to words such as \"looking for myself\" following BTS' \"Love Yourself\" era and RM's speech at the United Nations.[301]\n\nAwards and achievements\n\nBTS have received many awards and honors, including 15 Melon Music Awards, 15 Mnet Asian Music Awards, 14 Golden Disc Awards, 12 Seoul Music Awards, 10 Gaon Chart Music Awards, 4 Billboard Music Awards (first Korean group), 4 Korean Music Awards, and one American Music Award (first Korean group). In Korea, BTS have 2 Multi-Million albums and one Million album.[302] As the first Korean group to receive RIAA certification, BTS have two Platinum singles, 3 Gold singles, and one Gold album in the United States.[303] In Japan, BTS have 2 Multi-Platinum singles, one Multi-Platinum album, and 3 Gold albums.\n\nBTS also have a large social influence and as of 2019 hold seven Guinness World Records, including the world record for most Twitter engagements. To date they have spent 134 weeks at #1 on the Billboard Social 50 chart.[304] In October 2018, BTS was awarded a fifth-class Hwagwan Order of Cultural Merit from the President of South Korea for their contributions in spreading Korean culture and language.[267] The members of BTS became members of the Recording Academy in 2019 in honor of their contributions to music and as part of a push to help diversify Grammy Award voters.[305][306]\n\nOther ventures\n\nEndorsements\n\nBTS has maintained numerous global endorsement deals in various industries throughout their career and was named one of Time 100's most influential people of 2019.[260] Since 2015, BTS has maintained a partnership with Puma, initially promoting their sportswear as Puma Korea's brand ambassadors before expanding to become their global ambassadors in 2018[307][308] and promoting the remix of Puma's \"Turin\" and \"Sportstyle\" line worldwide.[309][310] BTS has also served as global brand ambassadors for LG Electronics to promote their LG G7 ThinQ telephone,[311] and for Hyundai Motors as part of the company's promotions at the 2018 LA Auto Show for their 2019 flagship SUV the \"Palisade.\"[312] Due to BTS' endorsement, Hyundai struggled to keep up with demand of the car, having received almost double their anticipated domestic order volume.[313] As a draw for tourism, BTS has worked as brand models for Lotte Duty Free Shop since 2017[314] and worked as honorary tourism ambassadors for Seoul as part of the 'I Seoul U' program. The group filmed an advertisement produced by the Seoul Metropolitan Government, which was subsequently aired in over 100 countries, and released the promotional song \"With Seoul.\"[315] They also collaborated with popular Korean communication app Line to create new Line 'characters', called BT21, that serve as emojis, stickers, clothing, and more.[316] The BT21 collaboration quickly swept the global market, opening flagship stores in Itaewon, Hongdae, Myeong-dong and other tourist hotspots in Seoul, as well as stores in Japan, Hong Kong and Los Angeles.[317]\n\nBTS have also worked with numerous companies in the entertainment sector, publishing the webtoons Hip Hop Monster and We On through the Nate Webtoon portal, and the webtoon Save Me in collaboration with LICO and Line Webtoon.[318][319][320] In the toy industry, Mattel created dolls modeled off BTS' outfits from the music video \"Idol,\"[277] Medicom Toy created the \"BE@RBRICK\", a block-like toy with the BTS logo and gold-hued accents modeled after BTS' stage clothes,[321] and Funko released BTS versions of Funko Pops.[322] In the gaming industry, Nexon released character avatars based on BTS for their RPG game Elsword,[323] and BTS worked with DalcomSoft to release the rhythm game Superstar BTS in January 2018,[324] as well as with Netmarble Games for the story-based, mobile simulation game BTS World released in June 2019.[325]\n\nIn Asia, BTS has also promoted a number of other goods and services. BTS has worked as brand spokespersons for KB Kookmin Bank, one of the top four largest banks in South Korea.[326][327] Their collaboration was highly successful, generating the opening of over 180,000 accounts, and BTS extended their contract with KB Kookmin Bank through 2019.[328] Coca-Cola Korea[329] also signed BTS on as their new campaign models for promotions during the 2018 World Cup in Russia.[330][331] In the beauty and apparel industry, BTS has maintained a relationship with uniform brand SMART since 2016, having renewed their contract with them through 2019.[332] BTS has also promoted the face mask brand Mediheal,[333] the cosmetics brand VT Cosmetics,[334] and the contact lens brand Play/Up.[335]\n\nPhilanthropy\n\nIn 2015, BTS donated seven tons (7,187 kg) of rice to charity at the K-Star Road opening ceremony held in Apgujeong-dong.[336] The following year they participated in ALLETS's \"Let's Share the Heart\" collaboration charity campaign with Naver[337] to raise donations for LISA, a Korean medical charity which promotes organ and blood donation.[338]\n\nIn January 2017, BTS and Big Hit Entertainment donated ₩100 million ($87,915) to the 4/16 Sewol Families for Truth and A Safer Society, an organization connected to the families of the 2014 Sinking of MV Sewol. Each member donated ₩10 million and Big Hit Entertainment donated an additional ₩30 million. The donation was intended to have been made in secret.[339] Later that year, BTS officially launched their Love Myself campaign, an initiative dedicated to funding several social programs to prevent violence against children and teens and to provide support for victims of violence in partnership with the Korean Committee for UNICEF.[340][341] BTS donated ₩500 million ($448,000) from the members and 100% of all sales of official goods for the Love Myself campaign over the next two years in addition to donations collected from donation desks installed by UNICEF[342] In addition, 3% of the sales from each album in the Love Yourself series (Love Yourself: Her, Love Yourself: Tear, and Love Yourself: Answer) were donated to the cause.[341] Within two months of its launch the campaign raised an additional ₩106 million, taking the worldwide funds total to ₩606 million.[343] In November 2018, UNICEF Korea announced that the Love Myself campaign had raised over ₩1.6 billion ($1.4 million).[344]\n\nIn April 2018, BTS participated in Stevie Wonder's \"Dream Still Lives\" tribute to Martin Luther King Jr. alongside other celebrities.[345] That June, the group donated to the ALS hospital building fund.[346] In September, BTS attended the United Nations 73rd General Assembly for the launch of the youth initiative \"Youth 2030: The UN Youth Strategy\" and its corresponding UNICEF campaign \"Generation Unlimited\".[265][347] On behalf of the group, BTS' leader RM delivered a six-minute speech in English about self-acceptance, as well as their Love Myself campaign.[264][265] According to UNICEF, the goal of the initiative is \"to provide quality education and training for young people\".[348] BTS were selected to attend due to their impact on youth culture through their music and social messages, previous philanthropic endeavors, and popularity among the 15-to-25-year-old age demographic.[265][347]\n\nBTS Universe\n\nLogo for BTS Universe\n\nThe BTS Universe, also known as the Bangtan Universe or BU, is an alternate universe created by Big Hit Entertainment that winds through the group's output. The webtoon Save Me closely follows the story line, along with their book HYYH: The Notes 1.[349][350] The chronology of the universe began with the song \"I Need U\" and spans to the present time.[351] It tells the story of the seven members in an alternate reality and depicts their anxieties and uncertainties as they confront their futures.[352][353]\n\nMariejo Ramos from The Inquirer said about the universe \"no other artists have successfully mixed the same literary technique to pop music in such a scale.\" They used the alternate universe and literary books, such as The Ones Who Walk Away from Omelas, as a framing device for their albums.[354] Mixing the two has created an interactive environment for their fans who make theories when new material or hints are released.[355][356][357]\n\nMembers\n\nDiscography\n\nTours and concerts\n\nConcert tours\n\nFilmography\n\nExhibitions\n\nYear Title Country Ref. 2018 \"BTS Exhibition: 24/7=Serendipity (Five, Always)\" Korea [365] 2019 China [366] United States [367]\n\nFilm\n\nTelevision\n\nVariety shows on V Live\n\nYear Title Note(s) Ref. 2015 BTS Bokbulbok [376] 2015–2017 BTS GAYO 2015–present Run BTS! 3 seasons [377] 2016–2018 BTS: Bon Voyage 3 seasons or 8 episodes each [378]", "images": ["https://upload.wikimedia.org/wikipedia/commons/a/ab/BTS_Universe_logo.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/Line_FriendsStore_BT21_03.jpg/220px-Line_FriendsStore_BT21_03.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b8/180524_BTS_at_a_press_conference_for_Love_Yourself_Tear_%283%29.png/220px-180524_BTS_at_a_press_conference_for_Love_Yourself_Tear_%283%29.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/db/Troubadour_02.jpg/220px-Troubadour_02.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/BTS_at_2017_American_Music_Awards_in_Los_Angeles%2C_19_November_2017_02.jpg/220px-BTS_at_2017_American_Music_Awards_in_Los_Angeles%2C_19_November_2017_02.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9e/170529_BTS_at_a_press_conference_for_the_BBMAs_%283%29.png/220px-170529_BTS_at_a_press_conference_for_the_BBMAs_%283%29.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fd/BTS_win_first_Daesang_%28Grand_Prize%29_at_Melon_Music_Awards%2C_19_November_2016.jpg/220px-BTS_win_first_Daesang_%28Grand_Prize%29_at_Melon_Music_Awards%2C_19_November_2016.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/07/BTS_Love_Myself_Logo.png/220px-BTS_Love_Myself_Logo.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/48/Le_Citi_Field.jpg/220px-Le_Citi_Field.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/22/BTS_Love_Yourself_-_Speak_Yourself_tour_at_Rose_Bowl%2C_Pasadena_%28California%29%2C_4_May_2019_04.jpg/220px-BTS_Love_Yourself_-_Speak_Yourself_tour_at_Rose_Bowl%2C_Pasadena_%28California%29%2C_4_May_2019_04.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/190601_Jin_Wembley_Stadium_Day_1_Ay-Oh_Chant.webm/250px--190601_Jin_Wembley_Stadium_Day_1_Ay-Oh_Chant.webm.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/%E2%80%98LG_Q7_BTS_%EC%97%90%EB%94%94%EC%85%98%E2%80%99_%EC%98%88%EC%95%BD_%ED%8C%90%EB%A7%A4_%EC%8B%9C%EC%9E%91_%2842773472410%29_%28cropped%29.jpg/280px-%E2%80%98LG_Q7_BTS_%EC%97%90%EB%94%94%EC%85%98%E2%80%99_%EC%98%88%EC%95%BD_%ED%8C%90%EB%A7%A4_%EC%8B%9C%EC%9E%91_%2842773472410%29_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7c/BTS_performing_at_the_Korea-France_Friendship_Concert%2C_Paris_Treasure_Art_Theater%2C_14_October_2018.jpg/220px-BTS_performing_at_the_Korea-France_Friendship_Concert%2C_Paris_Treasure_Art_Theater%2C_14_October_2018.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/Bangtan_Boys_at_KCON_France_2016.jpg/220px-Bangtan_Boys_at_KCON_France_2016.jpg", "https://upload.wikimedia.org/wikipedia/commons/0/0d/%E2%80%98LG_Q7_BTS_%EC%97%90%EB%94%94%EC%85%98%E2%80%99_%EC%98%88%EC%95%BD_%ED%8C%90%EB%A7%A4_%EC%8B%9C%EC%9E%91_%2842773472410%29_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/Bangtan_Boys_at_the_Incheon_Music_Center_in_September_2013_02.jpg/220px-Bangtan_Boys_at_the_Incheon_Music_Center_in_September_2013_02.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/0/0d/%E2%80%98LG_Q7_BTS_%EC%97%90%EB%94%94%EC%85%98%E2%80%99_%EC%98%88%EC%95%BD_%ED%8C%90%EB%A7%A4_%EC%8B%9C%EC%9E%91_%2842773472410%29_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/BTS_(band)", "title": "BTS (band)", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.13", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/0/0d/%E2%80%98LG_Q7_BTS_%EC%97%90%EB%94%94%EC%85%98%E2%80%99_%EC%98%88%EC%95%BD_%ED%8C%90%EB%A7%A4_%EC%8B%9C%EC%9E%91_%2842773472410%29_%28cropped%29.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}