{"url": "www.msn.com/en-ph/entertainment/celebrity/kendall-jenner-bella-hadid-were-secret-lovers/ar-BBL9xjP?li=AAb2fpp&%252525253Bocid=SK2HDHP", "text": "© 2017 Getty Images (Getty Images)\n\nKendall Jenner and Bella Hadid were never secret lovers, despite a report from exactly one year ago that maintained the two models were hooking up. Gossip Cop debunked the claim when it first emerged, and now a full 12 months later, it should be clear that our information was accurate and that Jenner and Hadid are just close friends.\n\nOn July 27, 2017, Star published a ridiculous article with the headline, “Kendall and Bella: Undercover Lovers?” The story was based on an Instagram photo of the two models posing together at the London Pride parade, just a few weeks before. According to the tabloid’s report, the image of the two friends at an LGBT event was somehow proof that “Kendall isn’t as straight as an arrow.” The outlet’s anonymous and untraceable “source” said Hadid’s “gay pals are telling her to try dating girls for a while,” since all of the guys she was meeting turned out to be “complete sleazebags.”\n\nBut since Gossip Cop actually bases its articles on more than extrapolations from Instagram photos and comments from unidentifiable sources, we looked into the claim. Literally, no one in Jenner or Hadid’s circles could confirm the tabloid’s premise. However, a rep for Jenner, who was authorized to speak on her behalf, told us the story was “false.”\n\nTime has proven, as Gossip Cop noted 365 days ago, that Jenner and Hadid were not hooking up, and are simply the closest of friends. In reality, the only Hadid that Jenner has gotten physical with was Anwar, her and Gigi’s younger brother. Star apparently has some sort of fantasy about Jenner being romantically involved with other female models. In the past, we busted the outlet for also falsely claiming she was dating Cara Delevingne.\n\nAnd while Jenner’s spokesperson acts as a de facto primary source when fielding questions from the media about her, the model herself debunked questions about her love life this past spring. When Jenner appeared on the April cover of Vogue, she got candid about her private life and addressed rumors about her sexuality in a wide-ranging interview. “I don’t think I have a bisexual or gay bone in my body,” she told the fashion magazine. “I’m not gay, I have literally nothing to hide,” added Jenner.\n\nAdditionally, it’s also obvious these days the two models are not secret lovers. Currently, Jenner is dating NBA star Ben Simmons. In fact, the two were spotted “getting cozy” at Khloe Kardashian’s Fourth of July party. And for her part, it appears Hadid is back together with The Weeknd.\n\nNot only was the magazine wrong, but it never published an update or a correction. As Gossip Cop has mentioned before, we revisit stories from a year ago because we want readers to see how claims how up 12 months later and to question the sources of their entertainment news. Do outlets have sources commenting on the record or furnish any of proof for their claims? It’s time this industry commits more to transparency.", "images": ["http://otf.msn.com/c.gif?js=0&evt=impr&di=3856&pi=&ps=&su=http%253A%252F%252Fwww.msn.com%252Fen-ph%252Fentertainment%252Fcelebrity%252Fkendall-jenner-bella-hadid-were-secret-lovers%252Far-BBL9xjP%253Fli%253DAAb2fpp%2526%2525252525253Bocid%253DSK2HDHP&mkt=en-ph&pp=False&cv.partner=Gossip%2BCop&cv.publcat=Gossip%2BCop%2BMedia&st.dpt=entertainment-celebrity&st.sdpt=&dv.Title1=&cts=636985693514340969&rf=&rid=3088bf60e60944cdb56273f61812dc15&cvs=Browser&subcvs=entertainment&cv.entityId=BBL9xjP&cv.entitySrc=ar&provid=AAdsRm7&ar=0&d.dgk=downlevel.pc&d.imd=0&cv.parentId=AAb2fpp&isCorePV=&pgIdx=&pgTot=&activityId=3088bf60e60944cdb56273f61812dc15&pm=&pg.n=article&pg.t=article&pg.c=&pg.p=prime&anoncknm=&issso=0&ex=&aadState=0", "https://sb.scorecardresearch.com/p?c1=2&c2=3000001&cs_ucfr=1&rn=636985693514340969&c7=http%253A%252F%252Fwww.msn.com%252Fen-ph%252Fentertainment%252Fcelebrity%252Fkendall-jenner-bella-hadid-were-secret-lovers%252Far-BBL9xjP%253Fli%253DAAb2fpp%2526%2525252525253Bocid%253DSK2HDHP&c8=&c9=", "http://c.msn.com/c.gif?udc=true&rid=3088bf60e60944cdb56273f61812dc15&rnd=636985693514340969&rf=&tp=http%253A%252F%252Fwww.msn.com%252Fen-ph%252Fentertainment%252Fcelebrity%252Fkendall-jenner-bella-hadid-were-secret-lovers%252Far-BBL9xjP%253Fli%253DAAb2fpp%2526%2525252525253Bocid%253DSK2HDHP&di=3856&lng=en-ph&activityId=3088bf60e60944cdb56273f61812dc15&d.dgk=downlevel.pc&d.imd=0&st.dpt=entertainment-celebrity&st.sdpt=&subcvs=entertainment&pg.n=article&pg.t=article&pg.c=&pg.p=prime&anoncknm=&issso=0&aadState=0", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BBbyo11.img?h=17&w=0&m=6&q=60&u=t&o=t&l=f&f=png", "http://static-entertainment-eus-s-msn-com.akamaized.net/sc/57/a49b8d.gif", "http://sg.effectivemeasure.net/em_image", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/AACQhOP.img?h=66&w=88&m=6&q=60&u=t&o=t&l=f&x=622&y=421", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BBbyo11.img?h=100&w=100&m=6&q=60&u=t&o=f&l=f", "http://static-entertainment-eus-s-msn-com.akamaized.net/sc/82/c22c7d.gif", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BBL9mA6.img?h=200&w=300&m=6&q=60&o=f&l=f&x=604&y=207", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BBTEmTk.img?h=66&w=88&m=6&q=60&u=t&o=t&l=f&x=1038&y=688", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/AADlWxc.img?h=66&w=88&m=6&q=60&u=t&o=t&l=f&x=955&y=860", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BBbyo1E.img?h=16&w=16&m=6&q=60&u=t&o=t&l=f"], "top_img": "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BBL9mA6.img?h=200&w=300&m=6&q=60&o=f&l=f&x=604&y=207", "keywords": [], "authors": [], "canonical_link": "https://www.gossipcop.com/kendall-jenner-bella-hadid-secret-lovers/", "title": "Kendall Jenner, Bella Hadid Were Secret Lovers?", "meta_data": {"application-name": "Kendall Jenner, Bella Hadid Were Secret Lovers?", "cq": "passed", "robots": "noindex, nofollow", "description": "Kendall Jenner and Bella Hadid were never secret lovers, despite a report from exactly one year ago that maintained the two models were hooking up. Gossip Cop debunked the claim when it first emerged, and now a full 12 months later, it should be clear that our information was accurate and that Jenner and Hadid are just close friends. On July 27, 2017, Star published a ridiculous article with the headline, “Kendall and Bella: Undercover Lovers?” The story was based on an Instagram photo of the two models posing together at the London Pride parade, just a few weeks before. According to the tabloid’s report, the image of the two friends at an LGBT event was somehow proof that “Kendall isn’t as straight as an arrow.” The outlet’s anonymous and untraceable “source” said Hadid’s “gay pals are telling her to try dating girls for a while,” since all of the guys she was meeting turned out to be “complete sleazebags.” But since Gossip Cop actually bases its articles on more than extrapolations from Instagram photos and comments from unidentifiable sources, we looked into the claim. Literally, no one in Jenner or Hadid’s circles could confirm the tabloid’s premise. However, a rep for Jenner, who was authorized to speak on her behalf, told us the story was “false.” Time has proven, as Gossip Cop noted 365 days ago, that Jenner and Hadid were not hooking up, and are simply the closest of friends. In reality, the only Hadid that Jenner has gotten physical with was Anwar, her and Gigi’s younger brother. Star apparently has some sort of fantasy about Jenner being romantically involved with other female models. In the past, we busted the outlet for also falsely claiming she was dating Cara Delevingne. And while Jenner’s spokesperson acts as a de facto primary source when fielding questions from the media about her, the model herself debunked questions about her love life this past spring. When Jenner appeared on the April cover of Vogue, she got candid about her private life and addressed rumors about her sexuality in a wide-ranging interview. “I don’t think I have a bisexual or gay bone in my body,” she told the fashion magazine. “I’m not gay, I have literally nothing to hide,” added Jenner. Additionally, it’s also obvious these days the two models are not secret lovers. Currently, Jenner is dating NBA star Ben Simmons. In fact, the two were spotted “getting cozy” at Khloe Kardashian’s Fourth of July party. And for her part, it appears Hadid is back together with The Weeknd. Not only was the magazine wrong, but it never published an update or a correction. As Gossip Cop has mentioned before, we revisit stories from a year ago because we want readers to see how claims how up 12 months later and to question the sources of their entertainment news. Do outlets have sources commenting on the record or furnish any of proof for their claims? It’s time this industry commits more to transparency.", "viewport": "width=device-width,initial-scale=1, maximum-scale=1"}, "movies": [], "publish_date": null, "source": "http://www.msn.com", "summary": ""}