{"url": "https://www.ajc.com/news/national/harvey-weinstein-turn-himself-authorities-new-york-reports/MOTjumGgNlKjwhZYmdEXoK/", "text": ">> Read more trending news\n\nUpdate: 6:00 p.m. EDT, May 30, 12018: Manhattan District Attorney Cyrus Vance Jr. announced the indictment on Wednesday, less than a week after Weinstein turned himself in to New York police and was arrested on sex crimes charges.\n\nVance said it brings Weinstein “another step closer to accountability,” according to a report by The Associated Press.\n\n\"Our office will try this case not in the press, but in the courtroom where it belongs. The defendant's recent assault on the integrity of the survivors and the legal process is predictable. We are confident that when the jury hears the evidence, it will reject these attacks out of hand,\" Vance said in a statement, according to news outlets.\n\nWeinstein, 66, did not testify before the grand jury because his lawyers said there wasn’t enough time to prepare for the testimony.\n\nWeinstein has denied the allegations.\n\nIf convicted on the rape charges alone, Weinstein could be sentenced to between five and 25 years behind bars, The New York Times reported.\n\nJUST IN: A Grand Jury has voted to indict Harvey Weinstein on charges of Rape in the First and Third Degrees, and Criminal Sexual Act in the First Degree, according to a statement by the Manhattan DA's office — Elizabeth Joseph (@ElizabethCNN) May 30, 2018\n\n(Original story)\n\nDisgraced movie mogul Harvey Weinstein turned himself in to authorities on Friday to face charges related to sexual abuse allegations in New York.\n\n>> Read more trending news\n\nUpdate: 10:10 a.m. EDT, May 25, 2018: Weinstein will plead not guilty to charges of rape, criminal sex act, sex abuse and sexual misconduct, his attorney, Benjamin Braffman, said outside a New York courtroom Friday morning.\n\n“We believe at the end of this, Mr. Weinstein will be exonerated,” he said.\n\n“We believe that at the end of the process, Mr. Weinstein will be exonerated,” his lawyer says https://t.co/rlYhJdOTmA — Meg Wagner (@megwagner) May 25, 2018\n\nUpdate: 9:45 a.m. EDT, May 25, 2018: A judge set a $10 million bond for Weinstein on Friday as he awaits trial on charges including rape and sex abuse.\n\nHarvey Weinstein's bond was just set. Here's the moment. https://t.co/Po4dLoRRiI — Meg Wagner (@megwagner) May 25, 2018\n\nWeinstein was ordered to surrender his passport and to wear an electronic monitor. The Associated Press reported he will post $1 million bail.\n\nBREAKING: Harvey Weinstein arraigned on rape, sex assault charges; will post $1 million bail and wear electronic monitor. — The Associated Press (@AP) May 25, 2018\n\nUpdate 8:35 a.m. EDT, May 25, 2018: Police confirmed in a statement released Friday morning that Weinstein has been charged with rape, criminal sex act, sex abuse and sexual misconduct in cases involving two women.\n\nStatement from the NYPD following the arrest of Harvey Weinstein. pic.twitter.com/SrE315vhC7 — Kevin Rincon (@KevRincon) May 25, 2018\n\nUpdate 7:28 a.m. EDT, May 25, 2018: Weinstein has turned himself in to police to face charges in a sexual misconduct investigation. He will be charged with first- and third-degree rape in one case and first-degree sex act in a second, CNN reported.\n\nBREAKING: Harvey Weinstein arrives at New York police station to surrender in sexual misconduct investigation. . — The Associated Press (@AP) May 25, 2018\n\nReporters waited as Weinstein arrived at the police department just before 7:30 a.m. After booking, he will then be transferred to Manhattan Criminal Court to face his charges, NBC News reported.\n\nThe charges, according to sources close to the investigation, come from the allegations made by two women, NBC News reported. The women have not been identified, however, many big-name stars have accused Weinstein of various acts. Some of the women who have come out against the mogul include: Rose McGowan, Uma Thurman, Salma Hayek, Lupita Nyong’o and Ashley Judd, NBC News reported. Their speaking out sparked the #MeToo movement.\n\nUpdate 6:39 a.m. EDT, May 25, 2018: Weinstein is expected to arrive at the NYPD’s 1st Precinct station Friday morning, WNBC reported. It could be as early as 7 a.m., according to Deadline.\n\nPolice will fingerprint Weinstein, have mug shots taken and be given an arrest ID. Then he will be taken to his court appearance on felony complaint based on allegations of to women, WNBC reported. It is expected he will leave court on $1 million bail and will be issued an ankle monitor, sources told WNBC. Deadline reported that Weinstein will also have to forfeit his passport.\n\nUpdate 8:47 p.m. EDT, May 24, 2018: Weinstein is expected to face first-degree rape and third-degree rape charges in one case, and a first-degree criminal sex act charge in another case, law enforcement officials told The New York Times.\n\nThe Times is reporting that the sex act charge is related to an incident with Lucia Evans, who told the New Yorker and investigators that Weinstein assaulted her during a casting meeting.\n\nIt’s unclear which of Weinstein’s many victims over two decades may be at the center of the rape case.\n\nMr. Weinstein is expected to turn himself in to the police on Friday to face first- and third-degree rape charges, law enforcement officials said https://t.co/3KqdynwgNo — NYT Metro (@NYTMetro) May 25, 2018\n\nOriginal story: Two unidentified law enforcement officials told The New York Times on Thursday that Weinstein is expected to surrender to authorities Friday morning.\n\nThe Manhattan District Attorney’s Office is expected to bring charges against Weinstein one day after a grand jury convened to hear evidence in connection to allegations of sexual abuse that have been levied against the well-known producer, according to WNBC.\n\nHarvey Weinstein is expected to turn himself in on sex abuse-related charges in NYC Friday, a source familiar with the case tells NBC 4 https://t.co/3mqrLRAJRU — NBC New York (@NBCNewYork) May 24, 2018\n\nDozens of women came forward to accuse Weinstein of sexual harassment and misconduct after the Times published a report last year detailing complaints of sexual harassment made against Weinstein over nearly three decades. Weinstein, who co-founded entertainment company Miramax, was ousted from his position at The Weinstein Company in the wake of the Times report.\n\nNew York police opened an investigation into Weinstein in 2015, after Filipina-Italian model Ambra Battilana Gutierrez told officers that she was groped by Weinstein without consent.\n\nAuthorities outfitted Gutierrez with a wire and had her meet with the producer. In an audio recording of the meeting obtained by The New Yorker, Weinstein could be heard apologizing after he’s confronted about the alleged assault.\n\n>> Harvey Weinstein recording was not enough to charge him, DA says\n\nDespite the recording, no charges were filed against Weinstein.\n\nProsecutors said that they were never consulted about the New York Police Department’s plan to get Weinstein to admit to the assault on tape and that the tape was not enough evidence to convict the 65-year-old. Police defended their actions, saying that the recording was one of multiple bits of evidence collected by officers and presented to the Manhattan District Attorney for prosecution.\n\n>> Harvey Weinstein investigations launched in New York, London\n\nNew York City police said last year that they were working to learn of any additional complaints against Weinstein.\n\n﻿Check back for updates to this developing story.\n\n\n\nSupport real journalism. Support local journalism. Subscribe to The Atlanta Journal-Constitution today. See offers.\n\nYour subscription to the Atlanta Journal-Constitution funds in-depth reporting and investigations that keep you informed. Thank you for supporting real journalism.", "images": ["https://www.ajc.com/r/PortalConfig/np-one/assets-one/images/icons/user-icon-anonymous-hamburger.svg", "https://www.ajc.com/r/PortalConfig/np-one/assets-one/images/icons/facebook.svg", "https://www.ajc.com/rw/PortalConfig/np-one/assets-one/images/weatherlogo-affiliate-wsbtv.png", "https://www.ajc.com/r/PortalConfig/np-one/assets-one/images/icons/user-icon.svg", "https://www.ajc.com/r/PortalConfig/np-one/assets-one/images/icons/user-icon-anonymous-desktop.svg", "https://www.ajc.com/r/PortalConfig/np-one/assets-one/images/icons/twitter.svg", "https://www.ajc.com/r/PortalConfig/np-one/assets-one/myajc/images/one-facebook-icon.svg", "https://media-beta.wsbtv.com/photo/2019/02/25/Eboni%20Deon%20positioned_14584038_ver1.0.png", "https://www.ajc.com/r/PortalConfig/np-one/assets-one/ajc/images/logo-footer.svg", "https://www.ajc.com/r/PortalConfig/np-one/assets-one/myajc/images/one-twitter-icon.svg", "https://www.ajc.com/rf/image_large/Pub/p9/CmgSharedContent/2018/05/25/Videos/4402317.vpx", "https://www.ajc.com/r/PortalConfig/np-one/assets-one/images/icons/search-icon.svg", "https://www.ajc.com/r/PortalConfig/np-one/assets-one/myajc/images/one-round-button.svg", "https://www.ajc.com/r/PortalConfig/np-one/assets-one/images/icons/close.svg", "https://www.ajc.com/r/PortalConfig/np-one/assets-one/images/icons/user-icon-anonymous-mobile.svg", "https://www.ajc.com/r/PortalConfig/np-one/assets-one/ajc/images/logo-full.svg", "https://www.ajc.com/r/PortalConfig/np-one/assets-one/myajc/images/one-footer-menu-arrow.svg", "https://www.ajc.com/r/PortalConfig/np-one/assets-one/images/icons/user-icon-white.svg", "https://www.ajc.com/r/PortalConfig/np-one/assets-one/ajc/images/logo-short.svg", "https://www.ajc.com/r/PortalConfig/np-one/assets-one/ajc/images/logo-mobile-hamburger.svg"], "top_img": "https://www.ajc.com/rf/image_large/Pub/p9/CmgSharedContent/2018/05/25/Videos/4402317.vpx", "keywords": [], "authors": [], "canonical_link": "https://www.ajc.com/news/national/harvey-weinstein-turn-himself-authorities-new-york-reports/MOTjumGgNlKjwhZYmdEXoK/", "title": "Harvey Weinstein indicted on first-degree rape, other charges by New York grand jury, reports say", "meta_data": {"description": "Former movie mogul Harvey Weinstein has been indicted on first and third-degree rape and first-degre...", "viewport": "width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no", "apple-mobile-web-app-status-bar-style": "black", "thumbnail": "https://www.ajc.com/rf/image_large/Pub/p9/CmgSharedContent/2018/05/25/Videos/4402317.vpx", "og": {"image": {"identifier": "https://www.ajc.com/rf/image_large/Pub/p9/CmgSharedContent/2018/05/25/Videos/4402317.vpx", "height": 450, "width": 800}, "title": "Harvey Weinstein indicted on first-degree rape, other charges by New York grand jury, reports say", "type": "article", "url": "https://www.ajc.com/news/national/harvey-weinstein-turn-himself-authorities-new-york-reports/MOTjumGgNlKjwhZYmdEXoK/", "description": "Former movie mogul Harvey Weinstein has been indicted on first and third-degree rape and first-degre...", "site_name": "ajc", "pers_rec_image": "https://www.ajc.com/rf/image_large/Pub/p9/CmgSharedContent/2018/05/25/Videos/4402317.vpx", "pers_rec_first_pub_date": "2018-05-30T17:56:00-0400", "pers_rec_web_type": "article"}, "twitter": {"card": "summary_large_image", "description": "Former movie mogul Harvey Weinstein has been indicted on first and third-degree rape and first-degre...", "image": "https://www.ajc.com/rf/image_large/Pub/p9/CmgSharedContent/2018/05/25/Videos/4402317.vpx", "site": "@ajc", "title": "Harvey Weinstein indicted on first-degree rape, other charges by New York grand jury, reports say", "url": "https://www.ajc.com/news/national/harvey-weinstein-turn-himself-authorities-new-york-reports/MOTjumGgNlKjwhZYmdEXoK/"}, "fb": {"app_id": 366816260017522, "pages": 13310147298}, "news_keywords": "harvey weinstein sex abuse allegations,  harvey weinstein charged,  harvey weinstein to turn himself in,  harvey weinstein sexual abuse,  harvey weinstein rape allegations", "language": "English", "eomportal-instanceid": 231252, "eomportal-id": 1248974, "eomportal-loid": "4.0.1576505782", "eomportal-uuid": "5df6b79e-5f89-11e8-ab02-d32187d4f344", "eomportal-lastUpdate": "Sat Jul 13 11:57:47 EDT 2019", "cmg": {"product": "ajc", "connext": {"config": "ajc_prod_default"}, "siteSection": "News", "mainSection": "/nation", "primaryCategory": "/News/National", "categories": "/News/National", "topics": "cox_shared,  cox_stub,  ts_stub, cox_entertainment, cox_breaking, cox_celebrity, video_added, se_stub, nd_stub", "meter": "true", "maxMeterTemporary": 5}}, "movies": [], "publish_date": null, "source": "https://www.ajc.com", "summary": ""}