{"url": "https://www.cheatsheet.com/gear-style/most-memorable-grammy-looks-of-all-time.html/", "text": "Awards season doesn’t only recognize the best in film and television. Sunday, February 12, marks the 59th annual Grammy Awards, so if you’re looking to celebrate Beyoncé’s Lemonade album and Adele’s earth-shattering comeback, you better tune in. While the Grammys are known for epic musical performances and the occasional collaboration, the red carpet has had its fair share of, um, daring looks. Love them or hate them, many outfits that graced the Grammys’ red carpets have gone down in history.\n\n1. Lady Gaga in an egg, 2011\n\nWhat came first: the Gaga or the egg? In case you missed it back in 2011, Gaga laid in an enclosed, translucent egg while her minimalist entourage trotted her down the red carpet. Oh, and she and the egg were being lifted for the entire duration of the red carpet. Eventually, Gaga’s egg hatched, revealing a less-anticipated look. The whole thing sounds bizarre; however, she redefined what it means to make a grand entrance.\n\n2. Rihanna in Giambattista Valli, 2015\n\nTired of seeing the same sequined column dress every awards season? So are we, which is why we’re particularly fond of Rihanna. The industry heavyweight loves fashion — she even has her own clothing line with Puma — and is never afraid to take a risk. While she’s sported a lot of exceptional looks in her sartorial heyday, our favorite has to be the pink Giambattista Valli gown she wore in 2015.\n\nAt The Cheat Sheet, we believe in dressing for yourself and having fun with what you wear — life’s too short to wear the same cleavage-baring dress time after time. Not only was this dress unapologetically feminine, but you could also tell Rihanna felt great wearing it. Later that year, Vanity Fair highlights an equally extravagant ensemble she wore to the Met Ball — and we’re hoping there are many more jaw-dropping looks underway.\n\n3. Pharrell Williams in a Vivienne Westwood hat, 2014\n\nBefore Pharrell, we thought we’d seen just about every lavish men’s trend on the Grammys’ red carpet. As the years went by, patterns and sparkles became more predictable than risky. Then, in 2014, Pharrell arrived wearing an oversized mountain hat from Vivienne Westwood. The hat itself received a lot of attention, both good and bad, and quickly became a career-defining look for the “Happy” singer. Let this be a lesson that one accessory can change your life in ways you’d never imagine. Hyperbolic? Slightly, but you get the message.\n\n4. Michael Jackson, 1984\n\nSpeaking of male style trailblazers, it’d be criminal to not talk about Michael Jackson. While the late singer is remembered most for his silky smooth voice and catchy tunes, Jackson sported countless infamous looks over the course of his life. Case in point: The glitzy number he wore to the 1984 ceremony.\n\nNowadays, there’s nothing earth-shattering about a guy wearing a sparkling suit to the Grammys, but Jackson was ahead of his time. Everything from the military-inspired jacket to the single glove was so eccentric and uniquely Jackson that it will forever go down in history.\n\n5. Adele in Giorgio Armani, 2012\n\nIn a world where virtually every celebrity tries to wear the most original, over-the-top look on the carpet, there’s something really comforting about Adele’s style. For as long as we can remember, she’s sported different iterations of a slim, black dress — but it works. The crooner keeps her life private and is only looking to top the charts, not tabloid headlines.\n\nWe’re not surprised she doesn’t strive to up the sartorial ante every season. Instead, she sticks with what she feels confident in. This Giorgio Armani dress was the start of many great, albeit predictable, looks — and we’re a big fan of the red lip.\n\n6. Lady Gaga in Armani Privé, 2010\n\nBetween the infamous meat dress and aforementioned egg ensemble, Lady Gaga has sported some of the most polarizing looks in Grammys history. But this one, courtesy of Armani Privé, was different. A modern day princess look, this dress embraced Gaga’s loud style but was surprisingly wearable. Paired with ombré yellow hair, platform shoes, and a incredibly sharp death star, it was the perfect balance of eclectic and exceptional.\n\n7. Madonna in Givenchy, 2015\n\nMadonna’s extensive career has been chock-full of memorable looks. While we don’t think Madge’s Givenchy matador attire will become as infamous as the cone bra, it did turn heads. If you ask us, this ensemble seemed like a desperately plea to reclaim her title as the music industry’s fashion darling — especially since she flashed some of the carpet’s spectators, according to Us Weekly — but it aligned nicely with Madonna’s off-the-cuff fashion choices. Sure, it’s costumey, but the Grammys are a better time than any to really push the envelope.\n\n8. M.I.A. in Henry Holland, 2009\n\nGetting dressed for an awards show must be hard enough. But while pregnant? Forget about it. Though a very pregnant M.I.A. sported a comfortable, flowing dress and sneakers on the red carpet, the expecting rapper performed wearing a revealing polka dot outfit. This look isn’t the first one that comes to mind when reviewing the best of the Grammys, but it’s something we’ll never forget. Love it or hate it, we applaud the “Paper Planes” artist for wearing something more elevated than sweats during her final trimester, let alone performing.\n\n9. Nick Minaj in Atelier Versace, 2012\n\nLike the divas before her — Gaga and Madonna come to mind — Nicki Minaj doesn’t shy away from a fashion risk. The rapper has worn everything from head-to-toe leopard to bubblegum pink hair, but perhaps her most questionable look was the Atelier Versace getup she wore on the 2012 carpet. Not only did her dress look like that of a colonial woman’s, her red carpet sidekick was dressed as a priest. This look channeled The Exorcist — not necessarily in a good way. But still, it was memorable.\n\n10. Alicia Keys in Christian Dior, 2002\n\n“Out of the box is my theme tonight,” Alicia Keys once said of her look, according to InStyle. And we can’t help but agree. All told, this look has all the necessary ingredients to be Grammys red carpet gold. Though we’re talking about America’s most important awards ceremony for musicians, honorees are not expected to dress to the nines. Opting for jeans and a white tank top was risky, though incredibly rock and roll, but we love how she balanced out the casual foundation with a beautiful headpiece and sheer draping. Paired with sparkly eye shadow, this look was glamorous, daring, and surprisingly relaxed.\n\n11. Christina Aguilera in Trish Summerville, 2001\n\nA simple Google search will show you Christina Aguilera has had many style transformations; however, there’s no period as memorable and uniquely Aguilera as her “Dirty” phase. During this time, the singer boasted platinum blonde hair with dark streaks, the occasional dreadlocks, and revealing looks, like this one from designer Trish Summerville. In a simpler time, this ensemble raised a lot of eyebrows for being too risqué, but it’s 2017. We’ve seen a lot worse.\n\n12. Jennifer Lopez in Versace, 2000\n\nOf course, no roundup would be complete without paying homage to Jennifer Lopez and that green Versace dress. While this dress was a big deal for 2000, it over time became synonymous with the Grammys’ red carpet. It’s loud, revealing, and thought-provoking. Yes, the down-to-there neckline and bare back are revealing, but we like how they were paired with a long hem and sleeves. She brought back the look years later, but nothing’s better than the original.\n\nFollow Kelsey on Twitter @Kmulvs and Instagram @Kmulvs", "images": ["https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "https://www.cheatsheet.com/wp-content/uploads/2017/02/US-singer-Alicia-Keys.jpg?x46112", "https://www.bizographics.com/collect/?pid=4708&fmt=gif", "https://www.cheatsheet.com/wp-content/uploads/2017/02/Pop-diva-Christina-Aguilera.jpg?x46112", "https://www.cheatsheet.com/wp-content/uploads/2017/02/Jennifer-Lopez-and-Sean-Puffy-Combs.jpg?x46112", "https://www.cheatsheet.com/wp-content/uploads/2017/02/An-egg-like-container-with-singer-Lady-Gaga-inside.jpg?x46112", "https://www.cheatsheet.com/wp-content/uploads/2017/02/Recording-artist-Pharrell-Williams.jpg?x46112", "https://www.cheatsheet.com/wp-content/uploads/2017/02/A-doll-of-the-entertainer-Michael-Jackson.jpg?x46112", "https://www.cheatsheet.com/wp-content/uploads/2017/02/Singer-Adele.jpg?x46112", "https://www.cheatsheet.com/wp-content/uploads/2017/02/Singer-Lady-Gaga.jpg?x46112", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.cheatsheet.com/wp-content/uploads/2017/02/Singer-Nicki-Minaj.jpg?x46112", "http://www.cheatsheet.com/wp-content/uploads/2017/02/An-egg-like-container-with-singer-Lady-Gaga-inside.jpg", "https://www.cheatsheet.com/wp-content/uploads/2017/02/Singer-M.I.A.-Maya-Arulpragasam-L-and-Ben-Brewer.jpg?x46112", "https://www.cheatsheet.com/wp-content/uploads/2017/02/Singer-Rihanna.jpg?x46112", "https://www.cheatsheet.com/wp-content/uploads/2017/02/Singer-Madonna.jpg?x46112"], "top_img": "http://www.cheatsheet.com/wp-content/uploads/2017/02/An-egg-like-container-with-singer-Lady-Gaga-inside.jpg", "keywords": [], "authors": ["Kelsey Mulvey"], "canonical_link": "https://www.cheatsheet.com/gear-style/most-memorable-grammy-looks-of-all-time.html/", "title": "12 of the Most Memorable Grammy Looks of All Time", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/gear-style/most-memorable-grammy-looks-of-all-time.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "Many musicians take the Grammys as an opportunity to show off their best (and most outrageous) fashion choices. Here they are.", "og": {"locale": "en_US", "type": "article", "title": "12 of the Most Memorable Grammy Looks of All Time", "description": "Many musicians take the Grammys as an opportunity to show off their best (and most outrageous) fashion choices. Here they are.", "url": "https://www.cheatsheet.com/gear-style/most-memorable-grammy-looks-of-all-time.html/", "site_name": "Showbiz Cheat Sheet", "updated_time": "2017-02-12T23:19:11+00:00", "image": "http://www.cheatsheet.com/wp-content/uploads/2017/02/An-egg-like-container-with-singer-Lady-Gaga-inside.jpg"}, "article": {"publisher": "https://www.facebook.com/wallstcheatsheet", "tag": "women's fashion advice", "section": "Gear & Style", "published_time": "2017-02-12T23:19:00+00:00", "modified_time": "2017-02-12T23:19:11+00:00"}, "twitter": {"card": "summary_large_image", "description": "Many musicians take the Grammys as an opportunity to show off their best (and most outrageous) fashion choices. Here they are.", "title": "12 of the Most Memorable Grammy Looks of All Time", "site": "@cheatsheet", "image": "http://www.cheatsheet.com/wp-content/uploads/2017/02/An-egg-like-container-with-singer-Lady-Gaga-inside.jpg", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.2.2", "position": 2}, "movies": [], "publish_date": 1486941540.0, "source": "https://www.cheatsheet.com", "summary": ""}