{"url": "https://www.byrdie.com/zendaya-beauty-routine", "text": "If we're surprised that Zendaya turns 20 years young today, it's only because the actress and singer perpetually schools us on beauty and culture, quietly boasting a wisdom that definitely exceeds her age. Whether she's walking the red carpet, appearing in a Beyoncé video, or even addressing criticism or haters, it's never without the utmost eloquence nor lack of insight—the girl just gets it. And from a beauty standpoint alone, she constantly surprises us. What can we say? Just in the past year or two, Zendaya has quickly become one of our all-time favorite muses.\n\nIn honor of her birthday, we thought it only fitting to count down some of the best beauty tips we've learned from this perennially rising star… so far, of course. Keep reading to see her must-know advice, from the anti-contouring trend she helped foster to her beauty philosophy. (Spoiler: There are no rules.)\n\nIt's probably pretty easy to garner this from her countless bold red carpet appearances, but Coleman came right out and said it when we chatted with her last fall. \"If you’re asking for the answers, they don’t exist,\" she said. \"Beauty has no definition, and if you do create a definition for yourself as you grow older, it’s ever-changing. It’ll be very different from when you’re my age and you’re 18 years old to when you’re 22 and when you’re 30. Take your time.\" PREACH.\n\nWe got it, straight from her hairstylist. Basically, it involves two different-sized curling irons and a lot less effort than you'd think.\n\nPretty please. Non-touring, the anti-contour that embraces a fresh, dewy finish without heavy face sculpting, will continue to be huge into the fall season.\n\nThe actress famously does her own, even for the biggest red carpets. But she says that ditching fancy glam squads has only benefited her look. \"Honestly, I just kind of learned, and it was a process,\" she told us last year. \"There were a lot of times people would do my makeup and it would be awful, and I would be orange. Nothing matched. So then you learn how to do your own makeup. I watched a lot of YouTube videos when I was little and taught myself.\"\n\nIn at least one way, Zendaya is all of us—even she has to put on her entire face in a flash just to get out the door sometimes. Better yet, her quickie regimen involves drugstore makeup that amounts to less than $20—see how she does it here.\n\n\"Shimmer,\" she says. \"I love shimmery stuff. That’s my secret. Once I do all this makeup and I put shimmery powder on, it’s like, Oh my gosh—your skin is so fresh and glowy! Nope. It’s actually just shimmer powder.\" PSA: She's a fan of Urban Decay's Naked Illuminated Shimmering Powder for Face and Body ($32).\n\n\"In general, it comes to whatever I’m wearing that day, whatever seems to pop into my head,\" she says of her famously unpredictable turns on the red carpet. \"A lot of times, it’s past inspirations. Bianca Jagger was one inspiration; Cher was a huge inspiration for my VMAs look a few years ago. Everything just repeats itself.\"", "images": ["https://www.byrdie.com/thmb/UquWc1VsMypAC_a3d1cnwYPY42Q=/699x830/filters:fill(auto,1)/Screenshot1906-6fc696a44dba4097a4a42961f77f244f.png", "https://:0"], "top_img": "https://www.byrdie.com/thmb/UquWc1VsMypAC_a3d1cnwYPY42Q=/699x830/filters:fill(auto,1)/Screenshot1906-6fc696a44dba4097a4a42961f77f244f.png", "keywords": [], "authors": ["Victoria Hoff"], "canonical_link": "https://www.byrdie.com/zendaya-beauty-routine", "title": "The 7 Best Beauty Tips We've Ever Learned From Zendaya", "meta_data": {"robots": "NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "In honor of the actress's 20th birthday, we're counting down Zendaya's best hair and makeup tips.", "sailthru.tags": "byrdie,makeup,makeup-face", "article": {"section": "Byrdie"}, "fb": {"app_id": 166036133580911}, "og": {"type": "article", "site_name": "Byrdie", "url": "https://www.byrdie.com/zendaya-beauty-routine", "title": "The 7 Best Beauty Tips We've Ever Learned From Zendaya", "description": "In honor of the actress's 20th birthday, we're counting down Zendaya's best hair and makeup tips.", "image": "https://www.byrdie.com/thmb/UquWc1VsMypAC_a3d1cnwYPY42Q=/699x830/filters:fill(auto,1)/Screenshot1906-6fc696a44dba4097a4a42961f77f244f.png"}, "twitter": {"card": "summary", "site": "@ByrdieBeauty", "title": "The 7 Best Beauty Tips We've Ever Learned From Zendaya", "description": "In honor of the actress's 20th birthday, we're counting down Zendaya's best hair and makeup tips.", "image": "https://www.byrdie.com/thmb/UquWc1VsMypAC_a3d1cnwYPY42Q=/699x830/filters:fill(auto,1)/Screenshot1906-6fc696a44dba4097a4a42961f77f244f.png"}, "lotame": {"tax2": "byr_makeup-face", "tax1": "byr_makeup", "tax0": "byr"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.13.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.13.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.13.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.13.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.13.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://www.byrdie.com", "summary": ""}