{"url": "https://www.vibe.com/2017/09/tracee-ellis-ross-raps-big-sean-carpool-karaoke", "text": "We’d be lion if we said we weren’t excited for the Jon Favreau-remake of The Lion King. The film stars Donald Glover, Beyonce, James Earle Jones and many more, and it was revealed on Instagram that Chance The Rapper is also featured in the CGI-edition of the Disney classic.\n\nIn a social media post after attending the world premiere of the movie, Lil Chano wrote that he was a part of the film’s consulting process, which was a dream come true.\n\n“I grew up my whole life obsessed with all things related to #TheLionKing,” he wrote. \"Needless to say the original film was immensely impactful on my music and overall life. So when my big bro Donald [Glover] got casted as Simba, he did the coolest thing ever and told director Jon Favreau to call me in as a consultant to keep the original flavor.\"\n\nHe then continued his post by stating that what followed was recording some singing and speaking parts for the movie. According to reports, he can be heard in the film in the role of “Bush Baby,” and is billed as Chance Bennett.\n\n\"One day I’m there Jon [Favreau] asked me to do some singing stuff, another day he asks me to do some lines,” he continues. “Its all a blur, but I’ll tell u its one of the best blurs of my whole life. I am so blessed to know people like Donald and Jon man. AMAZING FILM, AMAZING CAST AND AN AMAZING (NIGHT) LAST NIGHT. GOD BLESS AND LONG LIVE THE KING.\"\n\nView this post on Instagram\n\nHere’s a short story. I grew up my whole life obsessed with all things related to #TheLionKing; like all three films, the Timon and Pumbaa tv show, the broadway play and especially the broadway soundtrack. Needless to say the original film was immensely impactful on my music and overall life. So when my big bro Donald got casted as Simba, he did the coolest thing ever and told director Jon Favreau to call me in as a consultant to keep the original flavor. So for about a year I would go to the LK studio and see early animations, scenes, music direction or assemblies and they’d always be out of this world amazing. One day I’m there Jon asked me to do some singing stuff, another day he asks me to do some lines. Its all a blur, but I’ll tell u its one of the best blurs of my whole life. I am so blessed to know people like Donald and Jon man. AMAZING FILM, AMAZING CAST AND AN AMAZING NIGGHT LAST NIGHT. GOD BLESS AND LONG LIVE THE KING\n\nA post shared by Chance The Rapper Owbum (@chancetherapper) on Jul 10, 2019 at 8:17am PDT", "images": ["https://static.vibe.com/files/2019/07/chance-the-rapper-the-lion-king-1562787953-650x366.jpg", "https://static.vibe.com/files/2019/07/spinderella-suing-salt-n-pepa-1562856595-240x135.jpg", "https://static.vibe.com/files/2019/07/euphoria-renewed-season-2-1562945204-650x366.jpg", "https://static.vibe.com/files/2017/09/Big-Sean-Carpool-Karaoke-1505920599-compressed.png", "https://static.vibe.com/files/2019/07/lil-kim-blasts-media-1562792338-240x135.jpg", "https://static.vibe.com/files/2019/07/cardib-jennifer-lopez-hustlers-film-1553025230-768x768-1562858258-240x135.jpg", "https://www.vibe.com/assets/images/logo/white.svg?edb4fa5dcea44378cb64", "https://static.vibe.com/files/2019/07/GettyImages-1160402526-2-1562776630-300x169.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1"], "top_img": "https://static.vibe.com/files/2017/09/Big-Sean-Carpool-Karaoke-1505920599-compressed.png", "keywords": [], "authors": ["Desire Thompson"], "canonical_link": "https://www.vibe.com/2017/09/tracee-ellis-ross-raps-big-sean-carpool-karaoke", "title": "Tracee Ellis Ross Raps With Big Sean On 'Carpool Karaoke'", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=no", "article": {"modified_time": "2017-09-20T13:05:45-04:00", "published_time": "2017-09-20T12:00:28-04:00"}, "description": "\"It's past time that y'all knew, I'm not the lady from 'The Chew'\"", "og": {"description": "\"It's past time that y'all knew, I'm not the lady from 'The Chew'\"", "image": {"identifier": "https://static.vibe.com/files/2017/09/Big-Sean-Carpool-Karaoke-1505920599-compressed.png", "height": 350, "width": 640}, "title": "Tracee Ellis Ross Raps With Big Sean On 'Carpool Karaoke'", "type": "article", "url": "https://www.vibe.com/2017/09/tracee-ellis-ross-raps-big-sean-carpool-karaoke", "site_name": "Vibe"}, "twitter": {"card": "summary", "description": "\"It's past time that y'all knew, I'm not the lady from 'The Chew'\"", "image": "https://static.vibe.com/files/2017/09/Big-Sean-Carpool-Karaoke-1505920599-compressed.png", "title": "Tracee Ellis Ross, AKA T-Murda, Spits Hot Fire With Big Sean On 'Carpool Karaoke'", "site": "@vibemagazine"}}, "movies": [], "publish_date": 1505923228.0, "source": "https://www.vibe.com", "summary": ""}