{"url": "https://www.thewrap.com/inside-the-nickelodeon-kids-choice-sports-awards-slime-test-photos/", "text": "This Wrap editor finally has something in common with Kobe Bryant, David Beckham, Derek Jeter and Rob Gronkowski — she got slimed!\n\nThe rite of passage happened as part of a slime test for the 2017 Nickelodeon “Kids’ Choice Sports Awards,” which will be hosted by Russell Wilson live from the Pauley Pavilion in Los Angeles Thursday.\n\nThe first thing you need to know about slime is it gets everywhere – and it’s super slick, super messy, and super cold. But considering the heat wave Los Angeles is currently experiencing, the chill was very refreshing. (See step by step photos below.)\n\nAlso Read: Russell Wilson to Host Nickelodeon's 'Kids' Choice Sports' Awards for 3rd Year Running (Video)\n\nBefore taking the plunge (literally) I was, thankfully, armed with a plastic poncho that at least saved my hair from looking like a demented green Joker rip off. Daring participants are then told to stand under three huge chutes, while in our case, volunteers on the deck above rode exercise bikes that then activated the slime machine (the actual mechanics behind this are still a mystery to me).\n\nWe were warned that, above all, not to look up (slime apparently doesn’t taste very good) and not to move afterward — as the plastic-covered floor is as slick as after a Patrick Bateman “American Psycho” rampage.\n\nAlso Read: Russell Wilson Parties With Pitbull for Nickelodeon's 'Kids' Choice Sports' (Exclusive Video)\n\nAnd then WHOOSH — the wave of slime that millions of kids across America dream of being drenched in came flooding down like a green tsunami over our heads, before slowing down to a steady drip like a giant leaky faucet.\n\nSimilar to a roller coaster ride, the buildup to a sliming is far worse than the actual experience, and the exhilaration afterwards lasts far longer.\n\nBut of course, you have green sticky remnants in your shoes, clothes, hair and other orifices for days to come as a reminder of the epic experience.\n\nAlso Read: Julian Edelman, Von Miller, Michael Strahan Set to Appear at Nickelodeon 'Kids' Choice Sports' Awards\n\nEarlier (before being nearly drowned in green gunk by his crew), TheWrap spoke with Jay Schmalholz, SVP of unscripted development and live events at Nickelodeon, about what viewers can expect from the star-filled show, which features Julian Edelman, Von Miller, Michael Strahan and many others this year.\n\nAlso Read: Nickelodeon 'Kids' Choice Sports': 9 Things You Didn't See on TV\n\nSee highlights from our pre-sliming chat below.\n\nTheWrap: Why is Russell Wilson the perfect three-peat host?\n\nJay Schmalholz: It’s a no-brainer. He is so likeable, he is really good at it, kids love him and he’s like a big kid himself. He supports anything with kids in sports and he’s really just so playful. From a Nickelodeon perspective, that is what we’re looking for. Russell also treats it like a football game and reads the playbook so is always super prepared.\n\nWhat new surprises should we expect this year? What big stunts or challenges are you most excited about?\n\nEvery year we try to go bigger and blow kids’ minds. This year, we have Slime Mountain, which is a giant ramp that goes into a pool of slime. Athletes have to climb it, break the codes and then they come down a water park-worthy slide that’s 80 feet long and 45 feet high.\n\nHow does the show attract such a high level of stars each year?\n\nOur audience has a huge appetite for sports. The athletes like coming because they get to be big kids, be playful and bring their families. Nickelodeon has great relationships with the leagues and many of today’ biggest sports stars grew up with the brand. We do it in such a special, unique way that it’s not an ordinary awards show.\n\nAside from being such fun entertainment, why is it important to encourage kids to be sports fans and have such good role models?\n\nThat is one of the reasons we do the shows. Kids love sports stars and they’re great role models. Their acceptance speeches are so genuine — they really encourage the kids to follow their dreams and to keep playing sports.\n\nWhat is the secret to making slime?\n\nIt is a special(secret) mixture that we make specifically for the network. It is sticky, wet, fun and is always a celebration. It’s our own special sauce!\n\nAlso Read: Guess Who WWE Superstar John Cena Wants to Slime at Nickelodeon's Kids Choice Awards?\n\nWhat’s the best way to survive a sliming?\n\nI always tell the athletes — including Kobe Bryant, Derek Jeter and David Beckham — that it is an honor to be slimed. You’ve gotta take it with as much as excitement as you can. Embrace it, enjoy it and don’t brace yourself too much. It’s really fun experience and unlike any other.\n\nWho handled the sliming the best — or worst?\n\nEveryone handles it well, we’ve slimed the biggest stars in the world, and they’re all laughing backstage afterwards. It is a rite of passage and on everyone’s bucket list.\n\n“Kids’ Choice Sports 2017” will be taped live on Thursday, July 13, from UCLA’s Pauley Pavilion in Los Angeles, and air July 16 at 8 p.m. The show’s sponsors include include Airheads, Crest, Nationwide’s Make Safe Happen, Popsicle, Chrysler Pacifica, Capri Sun and Verizon.", "images": ["https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/thewrap-logo-white.svg", "https://www.thewrap.com/wp-content/uploads/2017/07/Slime-Test-3.jpg", "https://www.thewrap.com/wp-content/uploads/2016/07/Kobe-Bryant-Gold-Slime-Nickelodeon-Kids-Choice-Sports.jpg", "https://www.thewrap.com/wp-content/uploads/2017/07/Getting-Slimed.jpg", "https://www.thewrap.com/wp-content/plugins/contextual-links/assets/img/loading.gif", "https://www.thewrap.com/wp-content/uploads/2017/06/Pitbull-on-Nickelodeon--160x105.jpg", "https://www.thewrap.com/wp-content/uploads/2017/07/Slime-Test-5.jpg", "https://www.thewrap.com/wp-content/uploads/2016/07/Rob-Gronkowski-Russell-Wilson-and-Michael-Strahan-Nickelodeon-Kids-Choice-Sports-160x105.jpg", "https://www.thewrap.com/wp-content/uploads/2014/05/SPORTS-100.jpg", "https://pixel.quantserve.com/pixel/p-8flXM--ZHulLQ.gif", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/envelope.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/thewrap-logo.svg", "https://sb.scorecardresearch.com/p?c1=2&c2=8498827&cv=2.0&cj=1", "https://www.thewrap.com/wp-content/uploads/2017/05/Russell-Wilson-Getting-Slimed-at-Nickelodeon-Kids-Choice-Sports--160x105.jpg", "https://www.thewrap.com/wp-content/uploads/2017/07/Getting-Slimed-2.jpg", "https://www.thewrap.com/wp-content/uploads/2016/07/ESPYs-Inside.jpg"], "top_img": "https://www.thewrap.com/wp-content/uploads/2016/07/Kobe-Bryant-Gold-Slime-Nickelodeon-Kids-Choice-Sports.jpg", "keywords": [], "authors": ["Debbie Emery"], "canonical_link": "https://www.thewrap.com/inside-the-nickelodeon-kids-choice-sports-awards-slime-test-photos/", "title": "Inside the Nickelodeon ‘Kids’ Choice Sports Awards Slime Test (Photos)", "meta_data": {"parsely-title": "Inside the Nickelodeon ‘Kids’ Choice Sports Awards Slime Test (Photos)", "parsely-link": "https://www.thewrap.com/inside-the-nickelodeon-kids-choice-sports-awards-slime-test-photos/", "parsely-type": "post", "parsely-pub-date": "2017-07-13T12:55:44-07:00", "parsely-section": "tv", "parsely-author": "Debbie Emery", "parsely-tags": "david_beckham, derek_jeter, julian-edelman, kobe_bryant, michael_strahan, nickelodeon-kids-choice-sports-awards, rob-gronkowski, russell-wilson, verizon", "viewport": "initial-scale=1.0, maximum-scale=6.0, user-scalable=yes", "description": "TheWrap gets slimmed ahead of Thursday's sticky Nickelodeon 'Kids' Choice Sports Awards -- and things are real messy", "news_keywords": "david beckham, derek jeter, julian edelman, kobe bryant, michael strahan, nickelodeon kids choice sports awards, rob gronkowski, russell wilson, verizon", "original-source": "https://www.thewrap.com/inside-the-nickelodeon-kids-choice-sports-awards-slime-test-photos/", "og": {"locale": "en_US", "type": "article", "title": "Inside the Nickelodeon 'Kids' Choice Sports Awards' Slime Test (Photos)", "description": "TheWrap gets slimmed ahead of Thursday's sticky Nickelodeon 'Kids' Choice Sports Awards -- and things are real messy", "url": "https://www.thewrap.com/inside-the-nickelodeon-kids-choice-sports-awards-slime-test-photos/", "site_name": "TheWrap", "image": {"identifier": "https://www.thewrap.com/wp-content/uploads/2016/07/Kobe-Bryant-Gold-Slime-Nickelodeon-Kids-Choice-Sports.jpg", "secure_url": "https://www.thewrap.com/wp-content/uploads/2016/07/Kobe-Bryant-Gold-Slime-Nickelodeon-Kids-Choice-Sports.jpg", "width": 618, "height": 412, "alt": "Kobe Bryant gold slime Nickelodeon Kids' Choice Sports Awards"}}, "article": {"publisher": "http://facebook.com/thewrap", "author": "https://www.facebook.com/thewrap/", "tag": "Verizon", "section": "News", "published_time": "2017-07-13T19:55:44+00:00"}, "fb": {"app_id": 228236404181023, "pages": 48941893663}, "twitter": {"card": "summary_large_image", "description": "TheWrap gets slimmed ahead of Thursday's sticky Nickelodeon 'Kids' Choice Sports Awards -- and things are real messy", "title": "Inside the Nickelodeon 'Kids' Choice Sports Awards' Slime Test (Photos)", "site": "@thewrap", "image": "https://www.thewrap.com/wp-content/uploads/2016/07/Kobe-Bryant-Gold-Slime-Nickelodeon-Kids-Choice-Sports.jpg", "creator": "@debemery"}, "generator": "WooFramework 6.2.0", "sailthru.title": "Inside the Nickelodeon ‘Kids’ Choice Sports Awards Slime Test (Photos)", "sailthru.date": "2017-07-13T19:55:44+00:00", "sailthru.author": "Debbie Emery", "sailthru.tags": "david beckham,verizon,kobe bryant,michael strahan,derek jeter,russell wilson,nickelodeon kids choice sports awards,rob gronkowski", "sailthru.category": "awards,tv,sports,news", "sailthru.image.full": "https://www.thewrap.com/wp-content/uploads/2016/07/Kobe-Bryant-Gold-Slime-Nickelodeon-Kids-Choice-Sports.jpg", "sailthru.image.thumb": "https://www.thewrap.com/wp-content/uploads/2016/07/Kobe-Bryant-Gold-Slime-Nickelodeon-Kids-Choice-Sports-150x150.jpg", "wp-parsely_version": "1.12.1", "google-site-verification": "-PpFSIrGHybVDxbndrL6MCngw3j6BXdy0xDVBVVOacI"}, "movies": [], "publish_date": 1499975744.0, "source": "https://www.thewrap.com", "summary": ""}