{"url": "https://www.self.com/story/blow-dry-mistakes", "text": "It’s rare to find me without my curls smoothed, twisted by a curling iron into beach waves , and misted with texture spray. I love to have my hair done. A trip to the local blow-dry bar is my favorite Saturday afternoon pastime. However, at $50 a session, getting this look done by professionals on the regular is costly. So I’ve perfected my own blowout skills.\n\nIt may seem like an easy task: grab a blow-dryer, point, and blast with heat. But there is a mastery behind it. And you may be making simple mistakes that are actually hurting your hair even more than your look. Here, top pros break down the science to getting a gorgeous at-home blowout every single time and point out all the rookie mistakes that keep them in business.\n\n1. You don’t have a great blow-dryer.\n\nLet’s start at the very beginning: Investing in a high-quality tool is important, especially if you have a lot of hair or you’re blow-drying your hair often.\n\n“If you have thick hair, you’re probably damaging your hair more with a cheap blow-dryer as opposed to investing in a great one that will protect your hair and blow-dry it quicker,” Kérastase celebrity stylist Jennifer Yepez tells SELF. Expensive dryers tend to come with hair-saving smart features like high power, multiple heat settings, a cool shot, and ionic air technology. The last one helps with frizz, creates shine, and minimizes blow-dry time. “The technology in ionic hair dryers helps break down water molecules faster, which makes the hair dry faster,” she adds. The less time your hair is under heat and the more control you have over the temperature, the healthier it will be.\n\nYepez’s favorites are the new T3 Cura Luxe ($250) and the Dyson Supersonic ($399). Expensive? Yes, but you’ll pay for it in what you save skipping just five to 10 blowouts at the salon—and they’ll last you years.\n\n2. You’re spending too long with your hair wrapped in a towel.\n\n“After getting out of the shower, women tend to leave their hair in the towel for like 30 minutes,” says Giovanni Vaccaro, Glasmsquad’s creative director. “A cotton-based towel causes friction on the hair, and it's more prone to damaging the strands to the point where the hair breaks off,” he explains.\n\nIf you want to get rid of excess water, Vaccaro recommends using a microfiber towel like the Aquis or an old, clean t-shirt. And still, only spend about 10 minutes with your head wrapped up post-shampoo.\n\nThe best thing for your hair’s health is actually letting it air-dry before blow-drying. “Hair is in its most vulnerable state when wet, so allowing it to air-dry is always the healthiest option,” explains Vaccaro.\n\nMake sure to dry your hair according to your texture. Vaccaro says that fine-to-medium hair can air-dry a bit longer, to about 80 percent dryness, whereas thicker hair should only be about 50 percent dry before blow-drying. That’s because you have a better chance of getting curly or full hair straight while it’s still a little damp.\n\nIf you have curly or wavy hair and want to enhance your natural texture, add product when it’s very wet, squeeze out the excess with your hands, and wrap it up gently in a microfiber towel or t-shirt. Once your curls stop dripping, you can start blow-drying.\n\n3. You start in with the brush too soon.\n\nOn the opposite side of the 30-minute towel turban faux paus is taking a round brush to sopping wet hair. It’s bad form to immediately walk out of the shower and pick up your blow-dryer and round brush for a blowout. T3 celebrity stylist David Lopez suggests using a dryer to rough dry hair first. Set it to medium heat and low speed. “If hair is very wet and put on high speed, then it gets whipped around a lot,” he says. “This can cause split ends, tangles, and frizz.” Once hair is about 80 percent dry from the rough dry, then you can start sectioning it, molding it, and styling it with a round brush.\n\n4. You forget to spray heat protectant on the back of your head.\n\nUsing the right product pre-blowout is going to save your ends from breakage and make your blowout last longer. But make sure you’re applying it correctly.\n\n“When some people use a serum for frizzy hair or a thickening spray for volume, they just spray the top of their hair, instead of all around,” says Yepez. “Sometimes you just forget the back of your hair.”\n\nShe advises parting the hair, creating sections, and working the product from mid-shaft to ends. You can also comb it through, but Yepez says she’s often in a hurry and just uses her fingers.\n\n5. You ignore the concentrator nozzle attachment.\n\nYou know that flat, nozzle thing that attaches to the end of your hair dryer? Don’t lose it! That little nozzle helps concentrate the air in a more precise way and protect hair from excess heat, which is better for hair health and styling.\n\n“A nozzle is a must for a smooth finish!” Vaccaro adds. “The nozzle provides distance between the hair and the lip of the dryer, which is the hottest point. Additionally, the nozzle keeps the air flow concentrated, and without it, the hot air disperses, causing undesirable frizz.”\n\nEven if you’re not going for a sleek style, it is important to attach the nozzle—no matter how lazy you feel. “If you're just a ‘rough dry and go’ girl, you should still utilize the smoothing capabilities of the concentrator,” Lopez says. “It helps streamline the airflow leading to less tangles and split ends.” That means fewer haircuts, ladies.\n\nNot all nozzles are created equal. “Look for thinner nozzles—that way, it’s more direct,” says Yepez. The thinner nozzle will help blast hot air directly to the roots and get more volume in your styles.\n\n6. You’re using the wrong brush.\n\nWhen it comes to choosing a brush, the type you use should depend on the results you’re looking for and your hair type. Typically a round brush is the stylist favorite for a voluminous, bouncy look. But you have choices when it comes to the material of the bristles. “For women with straight hair who want movement, ceramics are fantastic,” says Vaccaro. “For women who want smoothness but have coarse, frizzy hair, boar bristle is key to provide the right amount of tension needed to achieve that smoothness.”\n\nYepez adds that she favors brushes with ceramic-coated barrels (such as this T3 one ) since it heats up to dry hair faster. “If you have curly hair or need extra shine, it will get your hair to blow-dry quicker,” she says. For volume and lift in the roots, she recommends the YS Park G Series Curl Shine Styler Round Brush ($80). “This brush is the perfect size for any hair type,” she says. “The bristles are specially made to help with faster drying and less heat damage .”\n\n7. You start drying from the back of the head.\n\nAccording to both Lopez and Vaccaro, many women make the mistake of starting their blowout from the back of the hair. It’s better to start at the temples, hairline, and crown then move backwards to the nape. That way you tackle the most visible parts first.\n\n“Usually you start in the back, and by the time you get to the top and hairline, your hair has dried making it harder to get smooth,”says Lopez.\n\nAnd if you have bangs, we’re definitely talking to you. “The front of hair tends to be the most challenging to smooth—think cowlicks and short wisps—and is also the most visible part of your style,” notes Vaccaro. “By starting from the back, your hairline is bound to get frizzy, so get the tough part done first.”\n\n8. You want volume, but don’t give your roots extra attention.\n\nLifting from the roots is key if you want more volume. “If you don’t have a lot of time or you’re not a professional and you want volume, a great tip is to flip the hair upside down and brush it so that your roots are going the opposite direction,” says Yepez. Do this while adding a final blast of heat with the blow-dryer. You can also use a wide-tooth comb or your hands.\n\nIf you want extra volume at the crown, you can set the top of the head with larger rollers. Put in the rollers while the hair is still warm from the blow-dryer. “Pin it up with a bobby pin, and let it cool,” she explains. “So you get the most full volume and a nice wave.”", "images": ["https://media.self.com/photos/5c118341f52edf5a5c329766/4:3/h_130/woman-with-ponytail-and-headphones.jpg", "https://media.self.com/photos/5a946210fb42c00245b6b7da/4:3/w_728,c_limit/blowdrying-hair-mistakes.jpg", "https://media.self.com/photos/5aa03fdc2a1b7629bd42d412/4:3/h_130/beauty-products.jpg", "https://media.self.com/photos/5ac78a55811fd16eba758b3c/4:3/h_130/IMG_6687.JPG", "https://collector-PX69t0oUvr.perimeterx.net/api/v1/collector/noScript.gif?appId=PX69t0oUvr", "https://media.self.com/photos/5a946210fb42c00245b6b7da/2:1/pass/blowdrying-hair-mistakes.jpg", "https://www.self.com/images/self-starter-failsafe.jpg"], "top_img": "https://media.self.com/photos/5a946210fb42c00245b6b7da/2:1/pass/blowdrying-hair-mistakes.jpg", "keywords": [], "authors": ["Lauren Levinson", "March"], "canonical_link": "https://www.self.com/story/blow-dry-mistakes", "title": "8 Mistakes You're Making When You Blow-Dry Your Hair", "meta_data": {"generator": "autopilot-build-Sat Jul 13 2019 10:48:01 GMT+0000 (UTC)", "msapplication-tap-highlight": "no", "viewport": "user-scalable=no, width=device-width, initial-scale=1, maximum-scale=1", "author": "Lauren Levinson", "copyright": "Copyright (c) Cond&#233; Nast 2019", "description": "Want to get salon-level blowout results at home when you blow-dry your hair? Get these tips from two professional hairstylists.", "keywords": "hair,blowdry", "news_keywords": "Beauty,Hair,hair,blowdry", "og": {"description": "Here's how to get salon-level results at home.", "image": "https://media.self.com/photos/5a946210fb42c00245b6b7da/2:1/pass/blowdrying-hair-mistakes.jpg", "site_name": "SELF", "title": "8 Mistakes You're Making When You Blow-Dry Your Hair", "type": "article", "url": "https://www.self.com/story/blow-dry-mistakes"}, "twitter": {"card": "summary_large_image", "creator": "@SELFmagazine", "description": "Here's how to get salon-level results at home.", "domain": "https://www.self.com", "image": {"src": "https://media.self.com/photos/5a946210fb42c00245b6b7da/2:1/pass/blowdrying-hair-mistakes.jpg?mbid=social_retweet"}, "site": "SELFmagazine", "title": "8 Mistakes You're Making When You Blow-Dry Your Hair"}, "fb": {"pages": 8908243810, "admins": "1515690174,835972574,1301604672,505160,43600163"}}, "movies": [], "publish_date": null, "source": "https://www.self.com", "summary": ""}