{"url": "http://trolls.wikia.com/wiki/King_Peppy", "text": "King Peppy Gender Male Personality Happy Occupation King of the Trolls (Formerly) Alignment Good Family Princess Poppy (Daughter) Enemies Chef\n\n“ No Troll left behind! „ ~ King Peppy\n\nKing Peppy is a king troll and the ruler of the Trolls. King Peppy is Princess Poppy's father and one of the two tritagonists of the movie, Trolls. He is voiced by Jeffrey Tambor.\n\n\n\n\n\nContents show]\n\nPersonality\n\nKing Peppy, as the brave leader of the Trolls, led his people on a torch-lit escape to freedom from Bergen Town. His heroism and valor were the stuff of Troll legend. Quick with inspirational words of wisdom, King Peppy ushered in a new era of happiness and security in Troll Village. Now it’s 20 years later, and King Peppy has become a grandfatherly elder statesman to the Trolls. A tad dottier and forgetful than he was as a young man, King Peppy brings some unintentional humor to the Trolls, but is still beloved by everyone in Troll Village, and his legacy lives on in his daughter Poppy.\n\nAppearance\n\nKing Peppy is a orange troll that has pink hair with grey streaks in it. He also has a pink Vera which has grey Speaks in it too. He wears a green and blue waistcoat and he also wears green trousers. In one scene though he is spotted wearing only his White Boxers.\n\nRelationships\n\nPrincess Poppy is the daughter of King Peppy. King Peppy gets anxious and worried when Princess Poppy tells him that she would be going on a journey to find her friends and tries to stop her, however Princess Poppy does not listen.\n\nFun Facts\n\nHe ​led the great Troll escape from the Bergens 20 years ago.\n\nHe never leaves a Troll behind.\n\nKing Peppy’s a bit absent-minded — but if he ever misplaces anything, it’s usually stuck in his hair.\n\nKing Peppy won’t let anything stop him from protecting his trolls… not even his underwear.\n\nQuotes\n\nTrolls Wiki has a collection of quotes said by King Peppy. has a collection of quotes said by\n\nGallery", "images": ["https://slot1-images.wikia.nocookie.net/__cb1562783215262/common/skins/common/images/wiki.png", "https://vignette.wikia.nocookie.net/kinnikuman/images/7/76/Spotlight_Image_2.png/revision/latest/zoom-crop/width/100/height/56?cb=20190629204130", "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D", "https://vignette4.wikia.nocookie.net/trolls/images/8/89/Wiki-wordmark.png/revision/latest?cb=20170614203644", "https://vignette.wikia.nocookie.net/spotlightsimagestemporary/images/4/4c/Glitchtale-en.jpg/revision/latest/zoom-crop/width/100/height/56?cb=20190618182700", "https://vignette.wikia.nocookie.net/trolls/images/f/f7/Wiki-215px.png/revision/latest/scale-to-width-down/60?cb=20161105082307", "https://vignette.wikia.nocookie.net/trolls/images/f/f6/Peppy.png/revision/latest?cb=20160730002749", "https://slot1-images.wikia.nocookie.net/__cb1562783215262/common/extensions/wikia/WikiaBar/images/wikiabarIcon.png", "https://vignette.wikia.nocookie.net/spotlightsimagestemporary/images/4/4c/Mixels-en.jpg/revision/latest/zoom-crop/width/100/height/56?cb=20190618182701"], "top_img": "https://slot1-images.wikia.nocookie.net/__cb1562783215262/common/skins/common/images/wiki.png", "keywords": [], "authors": [], "canonical_link": "https://trolls.fandom.com/wiki/King_Peppy", "title": "King Peppy", "meta_data": {"viewport": "width=device-width, user-scalable=yes", "generator": "MediaWiki 1.19.24", "keywords": "Trolls (film) Wikia,trolls,King Peppy,Princess Poppy,Chef,Trolls,Jeffrey Tambor,Trolls(film) Wikia,King Peppy/Gallery,Aspen Heitz,Biggie,Branch,Cookie Sugarloaf", "description": "King Peppy is a king troll and the ruler of the Trolls. King Peppy is Princess Poppy's father and one of the two tritagonists of the movie, Trolls. He is voiced by Jeffrey Tambor. King Peppy, as the brave leader of the Trolls, led his people on a torch-lit escape to freedom from Bergen Town. His...", "twitter": {"card": "summary", "site": "@getfandom", "url": "https://trolls.fandom.com/wiki/King_Peppy", "title": "King Peppy | Trolls (film) Wikia | FANDOM powered by Wikia", "description": "King Peppy is a king troll and the ruler of the Trolls. King Peppy is Princess Poppy's father and one of the two tritagonists of the movie, Trolls. He is voiced by Jeffrey Tambor. King Peppy, as..."}, "fb": {"app_id": 112328095453510}, "og": {"type": "article", "site_name": "Trolls (film) Wikia", "title": "King Peppy", "description": "King Peppy is a king troll and the ruler of the Trolls. King Peppy is Princess Poppy's father and one of the two tritagonists of the movie, Trolls. He is voiced by Jeffrey Tambor. King Peppy, as the brave leader of the Trolls, led his people on a torch-lit escape to freedom from Bergen Town. His heroism and valor were the stuff of Troll legend. Quick with inspirational words of wisdom, King Peppy ushered in a new era of happiness and security in Troll Village. Now it’s 20 years later, and...", "url": "https://trolls.fandom.com/wiki/King_Peppy"}, "apple-itunes-app": "app-id=422467074, app-arguments=https://trolls.fandom.com/wiki/King_Peppy"}, "movies": [], "publish_date": null, "source": "http://trolls.wikia.com", "summary": ""}