{"url": "dlisted.com/tag/justin_theroux/page/2/", "text": "Justin Theroux and Emma Stone are two people who are not dating ( just friends! ), but they just can’t stop throwing out the signals of people who are dating each other. They’ve been seen repeatedly together , and they recently spent time in France at the same places and beaches. If you’re keeping track at home, it’s time to whip out a marker and make yet another note for the “Ok but they’re totally dating” column. And the latest evidence comes by way of Jennifer Lawrence .\n\nFor about a month now, Justin Theroux and Emma Stone have been sucked into a rumor that their friendship is a lot friendlier than either of them will let on. E! News thinks they’ve gotten to the bottom of things, and they say the two are platonic.\n\nJustin and Emma have been seen most recently in France for a work obligation related to their respective deals with Louis Vuitton. Once source says that they’re just hanging out as friends “and colleagues were with them during the day [on Monday].”\n\nJustin has also been “spotted” with fellow face of LV, Laura Harrier. They might possibly be dating, but it’s not serious. Another source says that Justin is just casually dating.\n\n“Justin is hanging out and having the time of his life. He’s casually dating, but it’s nothing more. He’s in a great place and very happy. He’s enjoying being social and meeting people from all walks of life. He is excited about doing new things and traveling. He’s looking forward to a great summer of fun and just seeing where it leads.”\n\nThe source adds that he’s “letting loose” for the first time in several years because he doesn’t have anyone else “to be responsible for or to report back to” and he’s “moved on” from Jennifer Aniston.\n\nI hope the source was serious when they said Justin is being social with people from all walks of life. I know I would be delighted to trade in a week of “Justin spotted canoodling with Emma” to “Justin caught dry humping on a beach towel with Dame Judi Dench.”\n\nPic: Wenn.com", "images": ["https://dlisted.com/wp-content/uploads/2018/05/wenn33869840.jpg", "https://dlisted.com/wp-content/uploads/2018/05/wenn33851858.jpg", "https://dlisted.com/wp-content/uploads/2018/06/wenn33864561.jpg", "https://dlisted.com/wp-content/themes/dlisted_44/img/dlistedbw.png", "https://dlisted.com/wp-content/uploads/2018/06/wenn32304693.jpg", "https://dlisted.com/wp-content/uploads/2018/05/wenn33916219.jpg", "http://pixel.quantserve.com/pixel/p-ejSXfyZMwcbnr.gif", "http://dlisted.com/favicon.ico?v=1", "https://dlisted.com/wp-content/themes/dlisted_44/img/dlisted.png", "https://dlisted.com/wp-content/uploads/2018/05/Screenshot-2018-05-21-11.10.05.jpg"], "top_img": "http://dlisted.com/favicon.ico?v=1", "keywords": [], "authors": [], "canonical_link": "https://dlisted.com/tag/justin_theroux/", "title": "Be Very Afraid", "meta_data": {"google-site-verification": "wtgaXQuvduR_ynbFXYU1BBBEM-yaIh4zid2J5aq9r5Q", "og": {"locale": "en_US", "site_name": "Dlisted", "title": "Justin Theroux", "url": "https://dlisted.com/tag/justin_theroux/", "type": "article", "description": "Be Very Afraid"}, "fb": {"app_id": 662132140485214}, "description": "Dlisted | Be Very Afraid | Page 2", "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": null, "source": "http://dlisted.com", "summary": ""}