{"url": "https://popculture.com/celebrity/2018/07/20/kaley-cuoco-workout-exercise-shoulder-surgery/", "text": "After going in for surgery on her right shoulder following a romantic wedding in San Diego, California, Big Bang Theory actress, Kaley Cuoco is back to her active lifestyle.\n\nCuoco took to Instagram on Thursday to share an update with fans through the Stories feature that she is on the mend by hitting the gym and returning to her active workout lifestyle, despite exercising with just one arm.\n\n(Photo: Instagram / @normancook)\n\n“I’m able to kind of do more now but I still can’t get my arm up to do my hair and makeup if you couldn't tell, so I haven’t tweezed my eyebrows in two weeks,” Cuoco told followers.\n\nShe went on to share several snapshots of herself in the gym, working out with one arm, telling fans she “can’t just sit around anymore.”\n\n“Alright there you have it, no excuses,” Cuoco said during her workout. “Injured or not you can still have a badass workout. I’m absolutely dead and ready to eat something.”\n\nBy the end of her workout, Cuoco called it all “frickin’ awesome.”\n\n(Photo: Instagram / @normancook)\n\nCuoco, who plays Penny on Big Bang Theory, tied the knot this past July with equestrian, Karl Cook. Cuoco first revealed the news on Instagram in the form of a black-and-white image of her and her athlete husband. However, five days after the big wedding, the 32-year-old told fans the two would have to cut their honeymoon for the procedure that was planned a year prior.\n\nPosting a photo from her hospital bed, Cuoco thanked fans for their love and support, and later took to the Instagram Stories feature, letting fans know about her recovery time.\n\n“For everyone asking, because everyone’s been so sweet and worried about me, this is a planned surgery I’ve had for over a year,” she explained. “I hurt it over a year ago, did not need immediate surgery. So, I brilliantly planned it five days after our wedding. Right, babe?”\n\n“Just brilliant, hun,” chimed in Cook, who was in the room with Cuoco.\n\n“I knew I’d have a babysitter,” Cuoco joked.\n\n“No horsies for a minute,” she added. “But time to lay low and hopefully not kill this guy [Cook], or him kill me. Thanks for the love!”\n\nThe actress shared that she’s currently “in a pretty big cast,” and that her recovery will take around four to six weeks.\n\nCuoco has been known to stay in shape, recently telling Women's Health Magazine about her go-to fitness outlet: hot yoga.\n\n“I tried spinning, I tried running, I tried yoga, I tried Pilates,” Cuoco said. “I realized I don’t like running… I refuse to do it. I like spinning, so I try to mix that in. When I found hot yoga, I fell in love with it and was like, this is my thing.”\n\nShe also said she has to buckle down on her diet and put in a lot more effort into staying fit than she used to.\n\n“Bottom line is, you know, I’m not 21 anymore,” Cuoco said. “It used to be so easy, I didn’t have to do as much. Now, it’s part of my day — working out is part of my day, eating right is part of my day.”", "images": ["https://media.popculture.com/2018/07/kaley-cuoco-workout-01-20041093.jpeg", "https://media.popculture.com/2019/07/serena-williams-halep-wimbledon-getty-20065033-239x108.jpeg", "https://media.popculture.com/2018/07/kaley-cuoco-workout-02-20041094.jpeg", "https://media.popculture.com/2018/06/kaley-cuoco-abs-goldsheep-20036638-640x320.jpeg"], "top_img": "https://media.popculture.com/2018/06/kaley-cuoco-abs-goldsheep-20036638-640x320.jpeg", "keywords": [], "authors": [], "canonical_link": "https://popculture.com/celebrity/2018/07/20/kaley-cuoco-workout-exercise-shoulder-surgery/", "title": "Kaley Cuoco Hits the Gym 2 Weeks After Shoulder Surgery", "meta_data": {"description": "After going in for surgery on her right shoulder following a romantic wedding in San Diego, California, Big Bang Theory actress, Kaley Cuoco is back to her active lifestyle.Cuoco took to Instagram on Thursday to share an update with fans through the Stories feature that she is on the mend by [...]", "keywords": "Kaley Cuoco,The Big Bang Theory", "twitter": {"card": "summary", "site": "ComicBook", "creator": "ComicBook", "title": "Kaley Cuoco Hits the Gym 2 Weeks After Shoulder Surgery", "description": "After going in for surgery on her right shoulder following a romantic wedding in San Diego, [...]", "image": "https://media.popculture.com/2018/06/kaley-cuoco-abs-goldsheep-20036638-640x320.jpeg"}, "og": {"title": "Kaley Cuoco Hits the Gym 2 Weeks After Shoulder Surgery", "type": "article", "url": "https://popculture.com/celebrity/2018/07/20/kaley-cuoco-workout-exercise-shoulder-surgery/", "image": {"identifier": "https://media.popculture.com/2018/06/kaley-cuoco-abs-goldsheep-20036638-640x320.jpeg", "width": 640, "height": 320}, "site_name": "Celebrity", "description": "After going in for surgery on her right shoulder following a romantic wedding in San Diego, [...]"}, "fb": {"app_id": 398373180287205, "pages": 1075190092524035}, "google-site-verification": "iPoSsgn-BS2aFT9iphBFS8eF6I23H2Le3DRVOCodjJg", "p": {"domain_verify": "c711bf7a7a8040f2b74003958afd81d4"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1,user-scalable=0", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1532059200.0, "source": "https://popculture.com", "summary": ""}