{"url": "https://www.vibe.com/2013/07/lady-gaga-nude-photo-hot-or-not-nsfw-2", "text": "When you think about the evolution of natural hair products in the modern area, Miss Jessie's Hair Care easily comes to mind. Officially launched in 2004 by Miko and Titi Branch, the sisters helped set the precedent for products that work for every kind of kink, coil and curl.\n\nAs a pioneer in the natural hair care movement, Miko has seen it all. The wins, the losses and the stories of how Miss Jessie's products have changed the lives of young girls who learned to love and care for their natural hair. It's an aspect she's heard before but needed to hear again as we chat over the phone. In a calm and poised manner, the businesswoman and proud mother allows me to take her 2009 when I had my first encounter with Curly Pudding. With Dominican salons killing my curls with blistering heat and reliable family members miles away from my college dorm, Curly Pudding arrived right on time. My curls could breathe and my esteem rose a degree or two with the presence of what became their signature product.\n\n\"Titi and I thought we were coming up with hair solutions but what we quickly realized was we were helping to build back esteem; many of us were told that our hair was bad and 'not good,'\" Miko tells VIBE Vixen. With over 20 years in the hair game (Miko and her late sister began in their Brooklyn brownstone as hair salon in 1997), the brand continues to find new ways to shake the table.\n\nTheir latest rollout is all about moisture and control–a la edge control. Favorites like Curls So Fresh and Honey Curls are dedicated to luscious and soft curls while Hold Me Down's coconut and argon oils give baby hairs new (and non-sticky) life.\n\nCheck out our interview below with Miko as she shares the importance of taking risks in the natural hair care market and how Miss Jessie's continues to thrive above the rest.\n\n***\n\nThe new products are once again, ahead of the game. What goes into creating new mixes, especially with other brands invading the natural hair care market?\n\nMiko Branch: We try to do one thing at a time. Over skewing is not something that we practice, particularly during a time when we have plenty of competitors where there's a lot of product from the shelf. We really feel like coming out with products that are really needed that perform well, that were developed well, make the difference. I believe Miss Jessie's continues to be a leader in this business because we truly are not coming up with a product just to compete.\n\nPerformance is particularly important to us. 'Hold Me Down' is not just an edge control that you can put on and it's going to flake or be crunchy, or maybe it stinks, the list goes on. It's something that really, really does exactly what it says it's going to do in the right way. I think with that approach to new products I think that Miss. Jessie's can continue to win.\n\nSpeaking of the new products, how would you pair the following: The one who doesn't like products, the one who is new to the natural hair movement and lastly, the one who loves a good luxury brand?\n\nThere's so many to choose from because you put a nice mix and blend in here. The product that's sticking out to me for everyone would be Multicultural Curl. It's great for someone who has a tighter coil texture, it's definitely going to bring the softness. It may not be as defined as some of the products that are a bit heavier but you certainly can't go wrong with it. Multicultural Curl also takes less expertise to use a lotion type consistency in the styling product.\n\nThen for the woman who's really about a brand, and maybe she doesn't realize performance is really important, she's really a brand whore. We really rely on word of mouth, the efficacy of it and then also we have wonderful packaging. We're known to really front on our brand in that 'This looks like this is for this kind of person or this product is not a good enough or packaged enough for me.'\n\nMiss Jessie's is good looking, a product like Multicultural Curl or any of our products next to any person who's really about brand names, I think Ms. Jessie's really adds something nice to the mix. It's very clean, it's nicely designed so I think just on a visual tip, I think that person would be drawn and attracted to it.\n\nView this post on Instagram\n\nHave you tried the best curly products? Drop a 🙌🏾 below 📸: @jeanicewebb #missjessies #multiculturalcurls #honeycurls #holdmedownedges #curlypudding #jellysoftcurls #multiculturalclear #curlymeringue #quickcurls\n\nA post shared by Miss Jessie's (@miss_jessies) on Jun 24, 2019 at 4:30pm PDT\n\nWhat are some of your favorites from the latest release?\n\nCurl So Fresh is great because it works for tighter coils that need a burst of moisture. There's also Gloss So Good. It's so good because of all of the ingredients. It has avocado oil and jojoba oil, some many good ones. There's also Honey Curls. Our partners like Target, Walmart and Walgreens, they love it and it's our new product to market. We lose sight that we need to keep our scalped nourished and clean, and just as moisturized. Take some time out and use your fingertips to spread it around. What's great about the hair oil is the size. You're able to put it into your bag and doubles also as like a daily moisturizer.\n\nSonically, if you could curate a decade themed playlist for Miss Jessie's what are some of your song choices?\n\nGrowing up, my dad played a lot of soul music in our house so I'm going to take it to Donny Hathaway, I'll start with \"Love, Love, Love.\" Our product is made with love, love, love. And then maybe I'll bring it to Stevie. I love Stevie Wonder, we were raised on Stevie. I think \"As\" would be my second choice.\n\nMy sister and I [Titi Branch] grew up in the 80s so next, I have to go with Eric B and Rakim's \"Eric B For President.\" Like that song, Miss Jessie's was a real, innovated game changer in the hair industry. Titi and I were pioneers, we're trailblazers, within an industry. There were already existing haircare companies, some of them which are black. I think when I and Tiki put it down and really came to market, our twists and presentation for our buyers made us stand out.\n\nFor the 90s, I think about Brooklyn. The borough was very instrumental in who we were and what our brand was all about. Brooklyn was a melting pot so, I'm going to take it to Biggie. I love \"10 Crack Commandments\" because everything that he says in the song are really solid, teachable moments for many people whether it's in your personal life or whether it's in your business. We also have to add India. Aire's \"I Am Not My Hair.\" It's so fitting.\n\nWhen I think about Miss Jessie's, business and family come to mind. How did you find balance in maintaining motherhood while building the brand?\n\nThere would be no Miss Jessie's had there not been the birth of my son. I was a single parent and I understood all of the responsibilities I was taking on and being able to provide for him was really important, it was top of my list. Luckily, I was raised by a dad who thought it was important that my sister Tiki and I be in a position of choice and freedom. So with that, he thought us being an entrepreneur was the best way to express that and to demonstrate that.\n\nThat really prompted us to think outside of the box and come up with solutions and products like Curly Pudding, Baby ButterCreme, Curly ButterCream. Those things happened out of necessity, it wasn't actually a master plan or a big plan. Those were the things that we were responding to that were happening in our lives and luckily we were able to share those creations with you all where everyone was able to benefit. So, that's kind of the beginning of it. The creation of Miss Jessie's actually was a result of us trying to balance failure and wanting to succeed and being helpful and all those things. You found all of that in the end product in the jar of magic and Curly Pudding.\n\nI remember brands like Miss Jessie's and Carol's Daughter being met with backlash for working with major retailers. Now that we see how lucrative the move was for both the consumer and independent companies like yours, how do reflect on those moments?\n\nI think that it's very important that your generation and the next generation like my son's to understand the sacrifices that were made from the people before us. At one time we couldn't do a lot of things and there was a lot of sacrifices, a lot of people paved the way for us to be able to be in a position of choice. The first thing is being free and being able to do what you want to do when you want to do it. In 2013 my sister and I had lunch in New York and she thought our work wasn't finished.\n\nI was like 'Well, what more do we need to do, we're really busy with everything that we're doing, we're really tired, blah, blah,' and she said \"You know Miko we're influencers, we encourage many people, primarily women, to embrace their natural texture and they've done it and as a result we've been able to make a living. Our work is not done because we need to share our story and how we built our business from scratch.'\n\nI believe particularly in this country that's important. Ownership is key and if we own more we'll be able to do more. Many of us are the first generation in our businesses. We're just now learning to set up shop, so when we have our first generation of unsophisticated business people because I believe we are, we have these knee jerk reactions to businesses that are black-owned. The decision to go into Target, and how that was \"selling out\" is puzzling– but that's a move for growth.\n\nThat's a distribution move that actually makes it more accessible to our customers all around the nation. The good news is that my sister took the time out before she passed away to share our story so people can unpack and learn how someone like Titi and I with no money and no capital built something from scratch. With more information, the next person will be more informed and have more appropriate reactions to business moves.\n\nWe're proud to say that we're still privately owned. Being an entrepreneur certainly extends out to be able to make the best decisions for your company.\n\nWhere do you see Miss Jessie's going and how do you view the evolution of natural hair care?\n\nSeeing more hair products from Miss Jessie's is definitely next but exploring different areas of the beauty business like make-up and skin care. It would be uncommon for me to come to market with something like that sooner than later. I'm also working on my second book. My views and ideas of business have changed from five to ten years ago. Like the product, I've evolved as well.\n\nWith natural hair, it continues to be on the rise and the preferred style that someone actually feels more attractive in. That's a good thing but I think you know in terms of practicality, it makes sense as a daughter sees her mother wear her hair natural. She's creating a beauty standard that is normal to her daughter growing up.\n\nCheck out all of Miss Jessie's latest products here.", "images": ["https://static.vibe.com/files/2019/07/spinderella-suing-salt-n-pepa-1562856595-240x135.jpg", "https://static.vibe.com/files/2019/07/GettyImages-471499262-1562873105.jpg", "https://static.vibe.com/files/2019/07/GettyImages-471499262-1562873105-320x480.jpg", "https://static.vibe.com/files/2019/07/lil-kim-blasts-media-1562792338-240x135.jpg", "https://static.vibe.com/files/2013/07/lady-gaga-nude-naked-v-magazine-artpop-2013-full-size-600x400.jpg", "https://static.vibe.com/files/2016/06/Danielle-Brooks-650x366.jpg", "https://static.vibe.com/files/2019/07/cardib-jennifer-lopez-hustlers-film-1553025230-768x768-1562858258-240x135.jpg", "https://www.vibe.com/assets/images/logo/white.svg?edb4fa5dcea44378cb64", "https://static.vibe.com/files/2019/07/cassie-GettyImages-954469910-1562990958-650x366.jpg", "https://static.vibe.com/files/2019/07/GettyImages-1160402526-2-1562776630-300x169.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1"], "top_img": "https://static.vibe.com/files/2013/07/lady-gaga-nude-naked-v-magazine-artpop-2013-full-size-600x400.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.vibe.com/2013/07/lady-gaga-nude-photo-hot-or-not-nsfw-2", "title": "Lady Gaga Nude Photo: Hot or Not? (NSFW)", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=no", "article": {"modified_time": "2015-02-24T15:27:31-05:00", "published_time": "2013-07-21T20:15:08-04:00"}, "og": {"image": {"identifier": "https://static.vibe.com/files/2013/07/lady-gaga-nude-naked-v-magazine-artpop-2013-full-size-600x400.jpg", "height": 400, "width": 600}, "type": "article", "url": "https://www.vibe.com/2013/07/lady-gaga-nude-photo-hot-or-not-nsfw-2", "site_name": "Vibe"}, "twitter": {"card": "summary", "image": "https://static.vibe.com/files/2013/07/lady-gaga-nude-naked-v-magazine-artpop-2013-full-size-600x400.jpg", "title": "Lady Gaga Nude Photo: Hot or Not? (NSFW)", "site": "@vibemagazine"}}, "movies": [], "publish_date": 1374452108.0, "source": "https://www.vibe.com", "summary": ""}