{"url": "https://en.wikipedia.org/wiki/Lori_Greiner", "text": "Lori Greiner (born December 9, 1969) is an American television personality, inventor and entrepreneur. She is known as an investor on the reality TV show Shark Tank and on its spin-off, Beyond the Tank.[2] She has been known as the \"Queen of QVC\"[3] since 2000, with her show Clever & Unique Creations. Greiner is the president and founder of the company, For Your Ease Only, Inc.[4][5]\n\nEarly life [ edit ]\n\nGreiner grew up on the Near North Side, Chicago. She majored in communications at Loyola University Chicago, and worked for the Chicago Tribune while in college. She was briefly a playwright and a jewelry designer and seller.[6]\n\nCareer [ edit ]\n\nIn 1996, Greiner created and patented a plastic earring organizer,[7][8] which was picked up by J. C. Penney before the holiday season, paying off her $300,000 loan for it in eighteen months.[7] Greiner has patented consumer products in other categories such as cosmetic organization, jewelry storage, travel, electronics, and household items, and is also involved in venture capital investing, product design consulting and television production.\n\nQVC [ edit ]\n\nGreiner started her own company after her J.C.Penney success, with her product appearing on Home Shopping Network and in the retail store, Bed, Bath and Beyond. Shortly thereafter, she transitioned to QVC and in 2000, landed her own show called Clever & Unique Creations, one of the longest running shows on the network.[7][9][10][11]\n\nShark Tank [ edit ]\n\nIn 2012, Greiner joined the US TV series, Shark Tank.[12] In 2014, her investment in Scrub Daddy, a company that produces a texture changing household sponge, was noted as one of the biggest successes in Shark Tank history.[13][14] On the July 30, 2014 episode of Clever & Unique Creations, Greiner sold more than 2 million sponges.\n\nAmong Greiner's other Shark Tank investments are Bantam Bagels (mini stuffed bagels, which was fully acquired by T. Marzetti Company in 2014[15]), Squatty Potty, Readerest, Paint Brush Cover, Hold Your Haunches, Drop Stop, FiberFix, Simply Fit Board, Sleep Styler and Screenmend.[16][7][10]\n\nBooks [ edit ]\n\nIn March 2014, she authored the book Invent it, Sell it, Bank it! – Make Your Million Dollar Idea into a Reality, a how-to guide based on her entrepreneurial journey.[17][18]\n\nPersonal life [ edit ]\n\nLori is married to Dan Greiner.[1]\n\nSee also [ edit ]\n\nJoy Mangano, HSN inventor", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/2/25/Lori_Greiner.png/250px-Lori_Greiner.png", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f2/Edit-clear.svg/40px-Edit-clear.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a4/Text_document_with_red_question_mark.svg/40px-Text_document_with_red_question_mark.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/Unbalanced_scales.svg/45px-Unbalanced_scales.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b4/Ambox_important.svg/40px-Ambox_important.svg.png", "https://upload.wikimedia.org/wikipedia/commons/2/25/Lori_Greiner.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/2/25/Lori_Greiner.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Lori_Greiner", "title": "Lori Greiner", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.13", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/2/25/Lori_Greiner.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}