{"url": "https://www.vogue.co.uk/article/style-rules-for-dressing-your-age", "text": "In my late twenties I made an idle life plan. I say plan, but it was more of an un-plan. Get the hell over fashion by 40, was its gist. Forty seemed monumentally ancient and – happily – a zillion years into the future. No way would I be hobbling to fashion shows aged 41 (I had a very bleak impression of the ageing process back then). Public displays of undignified excitement about the new must-have, aged 45? God forbid.\n\nWhat was I thinking? I’m now at the stage where 40 looks immature, and, I can tell you, that tingle you feel when you get your hands on – or your feet in – a transformative piece of kit… it never leaves you. This can only be one of life’s positives. Given that no one is exempt from having to get dressed most days, I – we – might as well do it to the best of our abilities, whatever our DOB.\n\nBeing well-dressed is a discipline. It’s a talent. It’s a lifelong learning curve\n\nAdvertisement\n\nBeing well-dressed is a discipline. It’s a talent. It’s a lifelong learning curve – and it can’t be done without an injection of fashion. And yes, I do know that “a uniform” is the holy grail of modern style. It says you know who you are, what you want to project, and that you’ve managed to reduce it all to a single navy/latex/whatever exclamation mark. But uniforms can adapt: see Kate Moss, Stella Tennant, Emmanuelle Alt, Miuccia Prada, Caroline de Maigret, and Inès de la Fressange, who all constantly recalibrate their stylistic affiliations while staying true to their essence. Static style, on the other hand, is the sartorial equivalent of having your face Botoxed and filled until it’s an unmovable mask of fear.\n\nGetty Images\n\nRead next Styling Tips To Note From Lucinda Chambers type-gallery Styling Tips To Note From Lucinda Chambers\n\nI put this theory recently to Carolina Herrera, one of the most stylish 77-year-olds I know, and someone who appears to have alighted on her uniform of white shirts, whooshy skirts and tailored trousers when she was 12, but in fact still loves to experiment, albeit within a tight framework of self-knowledge. She may even be 78 or 79 – she’s a bit hazy on this particular detail, although she’s razor-sharp on why eye-catching sleeves are so important, and it’s to do with framing the face. “Of courrrrrse, I still loof fashion,” she purred, before telling me about her latest haul from H&M. “Maybe not all fashion. But really, what is fashion if not change, newness and experiment? It keeps you youthful.”\n\nKate Moss's Most Memorable Style Moments type-gallery Kate Moss's Most Memorable Style Moments + 316\n\n+ 315\n\n+ 314\n\n+ 313\n\n+ 312\n\n+ 311\n\nAdvertisement\n\nFor Ruth Chapman, the languidly elegant fiftysomething co-founder of Matchesfashion.com, fashion is a means of feeling relevant, in the same way that art, films or books are. “I’m not rebellious the way I was in my twenties, and sometimes I just want to wear my old favourite things, but being relevant informs my choices.”\n\nFashion is a means of feeling relevant, in the same way that art, films or books are\n\nSo if ever you find yourself trying on a rail of Valentino, Gucci or Erdem – or indeed H&M – and the tingle’s not there, seek help, because if there’s another lesson I’ve learnt after a lifetime of loving clothes, and half a lifetime of making a living out of loving clothes (yep, still covering the shows, no sign of hobbling), it’s that as the decades unfurl, we need those little shots of self-affirming gorgeousness more than ever.\n\nRead next Mango Celebrates The “You” In Unique type-gallery Mango Celebrates The “You” In Unique\n\n“I like a boyish uniform,” says Bella Freud (astonishingly youthful at 56), “but adding some new elements so I keep interested in what I’m wearing is vital.” In that sense, having her own brand to live up to, while occasionally a pressure, has its pluses. “It definitely keeps me from becoming a total slob,” she muses. “I get a lot of useful feedback, and it makes me think of other things I’d like to wear that I haven’t designed yet. Wearing my own stuff helps me not hide.”\n\nAdvertisement\n\nGetty Images\n\nHiding – the reflex of the middle-aged. Stop it. And muddle – the natural habitat of the young. I think I realised this when my daughter, now 21, and her friends were dressing in clothes they’d bought by weight from Brick Lane Market. They looked beautiful – the girls, not the clothes. The clothes were heinous. But it didn’t matter. When your muscles are firm with absolutely no effort on your part, your hair ebullient and your face a peachy map of optimism, you really don’t need a jewel-encrusted tunic to cast a flattering, uplifty glow on your cheekbones or a Hood by Air parka to give you edge. Youth already does that job.\n\nAt that age, travelling the world (gap years seem to go on forever these days) is what occupies conversation – and maybe, eventually, getting a job. When they do get jobs, truth to tell, their clothes get a little bit conservative – nothing would persuade my 24-year-old to give culottes, flares, jumpsuits or big sleeves a whirl. They have bosses and (perceived) rules to conform to. And even if they haven’t, they don’t always know where to start. It’s a jungle out there in Zara. I don’t mean to imply that I’m Edina to my daughter’s Saffy. I hope we’re both more sophisticated than those two. But whereas she’s young enough to play it straight, I need to keep an open mind. Michelle Obama is the queen of this, with her love of colour, pattern and sparkly bits; that sense of playfulness is one reason she looks youthful. But her way isn’t the only way: Sofia Coppola is more minimalist, Cate Blanchett more experimental, Tilda Swinton downright kamikaze – but they all know their core style while constantly nudging it forward.\n\nGetty Images\n\nRead next Truly Timeless type-gallery Truly Timeless\n\n“So much of fashion is wrapped up in the confidence of the wearer,” agrees Amy Smilovic, founder and creative director of Tibi. “I see this all the time in my office – really talented women in their twenties, and they’re just so reserved about what they’ll try, so concerned about others viewing them negatively, so self-conscious.”\n\nSmilovic’s own moment of reserve hit in her twenties, when she worked for American Express. “There was a senior executive who wore Armani exclusively, so I had about a year where I was buying only Armani, the lower line, and I really looked way too old for my age. I’m much more fashionable now. Looking back, I could have done so much better if I’d only known how.”\n\nHow Brigitte Macron Is Redefining First Lady Dressing How Brigitte Macron Is Redefining First Lady Dressing\n\n“Knowing how” isn’t easy. OK, it is if you’re naturally stylish, but that’s about 0.2 per cent of the population. Regardless of our age, the rest of us have to learn style. We have to practise putting outfits together. We need to keep repeating mantras such as, “Always remove one thing before you leave the house” (if we’re Coco Chanel acolytes), or, “Shovel on 17 more things” (if we’re more in the Anna Dello Russo camp). We must swot up on proportions (which aren’t only an age thing, but also a body-type thing). We must apply ourselves to the study of details – unless, like Michael Kors, who told his mother all the bows on her wedding dress were making him ill, we know everything there is to know about details aged five.\n\nOh God, do we have to know about details? “Buttons,” says Samantha Cameron, “and nice zips, and a pop of just the right colour… That’s the sort of thing that makes something eye-catching and just fashionable enough at every age. My constant search when I was in No 10 – and one of the catalysts for setting up my label Cefinn – was for affordable clothes that were classic but with enough fashion to be interesting, so that you could wear them to work, or to pick your kids up from school without embarrassing them, but also to meet your girlfriends.”\n\nRead next Inside July 2013 Vogue type-gallery Inside July 2013 Vogue\n\nStyle File - Samantha Cameron type-gallery Style File - Samantha Cameron + 72\n\n+ 71\n\n+ 70\n\n+ 69\n\n+ 68\n\n+ 67\n\nDon’t imagine it ends with buttons, zips and colour. “The right sleeve length, how the neckline on your sweater is cut, a glimpse of unadorned toned flesh, heels, which date faster than anything else you wear… It’s these little details that can so easily cause an outfit to unravel,” 42-year-old Carolyn Asome tells me. Asome is a fashion writer, consultant, shopper sans pareil and the woman I most often turn to for fashion advice, because she’s always just spotted the precise item that will elevate your entire wardrobe for the season; she’s brutally honest; and she doesn’t suffer from any namby-pamby Anglo-Saxon shopping guilt – three qualities that are essential on life’s great trek towards style nirvana.\n\nLet’s deal with those traits in order. The right piece. This may not be something you’d initially considered, on account of the age thing. Or the price thing. But by now you should have worked out that a good fashion investment isn’t simply a question of cost per wear but of joy per wear, and also of having something bankable in your wardrobe for those unexpected big moments. Who’s to say that a Balenciaga trench with the kind of outsize shoulders you never thought you’d wear again isn’t precisely the disrupter your otherwise beautifully ordered wardrobe is crying out for? By the way, that rule about never wearing something you remember from last time around? Twaddle, like so many other fashion rules.\n\nBy now you should have worked out that a good fashion investment isn’t simply a question of cost per wear but of joy per wear\n\nNever stop experimenting, albeit within the constraints of knowing what works with your shape, personality and lifestyle. Not long ago, on my way into Prada for my 15th pair of navy trousers, I bumped into my other fashion sounding-board, Annabel Hodin, a personal stylist for high-flying businesswomen. Hodin led me instead to an ostrich-trimmed blush-pink dress – infinitely more electrifying and also strangely more useful than yet another reflex purchase of Things I Already Own.\n\nRead next Ageless Style type-gallery Ageless Style\n\nLesson one: while revealing too much flesh or clinging to the holy terrors of boho, rock chic, grunge and girlish fussiness are all no-nos for the sophisticated grown-up, beyond that it’s an open field. The most surprising pieces can turn out to be the bedrock of your style. Mind you, those ostensibly simple items often turn out to be one or more of the following: fabulously cut, the best fabrics, slightly glossy, interestingly textured, impeccably fitting – and comfortable.\n\nGetty Images\n\n“I’m staggered when I look back at how uncomfortable some of the clothes I wore were,” says Victoria Beckham. “But I dressed to be a certain kind of sexy. Now that I’m 43, my idea of sexy has evolved. I feel more confident because I feel fulfilled creatively. I don’t feel I have to show it all off in a tight dress. Maybe that way of dressing was a reflection of how insecure I felt.”\n\nVictoria Beckham: Style File type-gallery Victoria Beckham: Style File + 234\n\n+ 233\n\n+ 232\n\n+ 231\n\n+ 230\n\n+ 229\n\nIn order to reach these little markers of revelation, we need brutal honesty. Actually, scrap that. We need not-brutal honesty. Cutting yourself some slack in this department makes you a better rather than worse self-critic, because if you can stop beating yourself up even for five minutes, you can focus properly on the job in hand. To recap, this job is to work out what to draw a loving veil over and what to accentuate, even if it’s just a high foot arch. In my twenties I probably wouldn’t have been able to tell a high arch from a dropped proscenium. This, my friends, is where age and experience give you a major advantage, because high arches are the acme of elegance. “Look closely at the items in your wardrobe that people always compliment you on or that you really enjoy wearing,” counsels Asome. “What is it about it that really suits your body and your psychology? It isn’t always obvious at first.”\n\nRead next Ageless Chic Ageless Chic\n\nGetty Images\n\nToo right. If you can think outside the cookie-cutter ideals force-fed to us, you may find that the physical idiosyncrasies that drive you to distraction when you’re young become the distinguishing hallmarks of your personal style. As Asome says, “Don’t stick to conventional rules but the ones that make you look your best.” This point was fabulously illustrated the other day when I hooked up with Susan Foster, designer of fatally tempting jewellery. It was only tea in my office, but Foster swept in holding a vintage python clutch and wearing Gianvito Rossi brown suede boots, a cream satin Brunello Cucinelli camisole, (very) fitted jeans, diamonds (her own designs, naturally) and a Sahara-coloured vintage mink coat (I don’t even like fur, but these creatures had sacrificed their lives in the Sixties, so I let it pass) that matched her creamy skin and vanilla-coloured hair. To be honest, though, it wasn’t the details that were hopelessly distracting so much as the overall fabulousness. Foster is the perfect example of someone who’s constructed a Venn diagram of her body shape (voluptuous) and fashion trends (ephemeral) and forged her Foster-look where the two overlap. “I do have one inviolate rule,” she says. “Quality. I love soft, satiny feminine materials and silhouettes that flatter my body type. My wardrobe is anchored in decadent statement pieces that I know I’ll still appreciate in 10 years. I work around those and build out from there. The bottom line – for me, it’s about the glamour.”\n\nStyle File - Michelle Obama type-gallery Style File - Michelle Obama + 136\n\n+ 135\n\n+ 134\n\n+ 133\n\n+ 132\n\n+ 131\n\nIdentifying a loose overarching theme that encapsulates what you wish to project, whether it’s glamour, power or high drama, is an inspired idea because it creates an anchor – no one should be skittering all over the shop floor as they get older (it’s OK when you’re young and still figuring things out) – while allowing leeway for (calculated) risk-taking. Amy Smilovic is meticulous in her methodology. “Every season I build my wardrobe like a chain-link fence: each new purchase is meant to go on top of an existing base,” she says. “It’s important to feel new and modern without creating a total upheaval in your closet to get there. If you’re rotating out your wardrobe every two years, then you really need to get a handle on what your core look is.”\n\nInteriors Shopping With The Chapmans type-gallery Interiors Shopping With The Chapmans + 9\n\n+ 8\n\n+ 7\n\n+ 6\n\n+ 5\n\n+ 4\n\nThis brings us to the final crucial factor: how much does all this cost? None of the women here stints on clothes, but equally none appears to have a chronic spending problem. They may splurge more on individual pieces, but they’re probably spending the same percentage of their income as they did in their twenties, even when they’re as ruthlessly immaculate as Ruth Chapman. “Probably 50 per cent of my wardrobe is over two years old,” she says. “I never hoard, though. I regularly cleanse as I can’t bear to have too many options. If I haven’t worn anything for six months, it gets chucked. Ditto bobbled cashmere.\n\nI often buy two of the same thing if I fall in love. Fashion is as much about how the clothes make you feel as how you look.” Does she feel guilty about the churn? “Fashion’s a huge love affair for me – but I sell things on so that they have a second life.” Smilovic is more businesslike. “I either calculate price per wear or whether I’ll treasure it, regardless. Everyone can make snarky remarks about the price of Vetements jeans, but in terms of cost per wear I’m down to about a dollar. The emotional side is also very important to me – I love beautiful things. Maybe I’m not going to wear it much, but sometimes I have to have it. I have an amazing Loewe dress in my closet just begging to be worn, but I’m perfectly happy admiring it for now.”\n\nAdvertisement\n\nStyle File - Carolina Herrera type-gallery Style File - Carolina Herrera + 25\n\n+ 24\n\n+ 23\n\n+ 22\n\n+ 21\n\n+ 20\n\nSecond, third and fourth lessons? The art of fashion as you grow up is to master it, not the other way around, to let it help you project the person you want to be, to use it as a tool that fills you with confidence, and never to lose sight of what Alan Greenspan (not a fashionista, but a rare economist with a sparkling turn of phrase) would call its “irrational exuberance”. Or as Carolina Herrera puts it, “I like it when fashion has some element of fantasy. Always leave room for fantasy. And try to do things with grace.”\n\nSubscribe to Vogue here.", "images": ["https://vg-images.condecdn.net/image/JKQWngKeAMP/crop/200/square/f/vbeckham47_gl_30jun09_pa_b_2.jpg", "https://vg-images.condecdn.net/image/Knord748ja5/crop/405/landscape/f/rexfeatures_6118216l.jpg", "https://www.vogue.co.uk/static/img/tiny.gif", "https://vg-images.condecdn.net/image/D29aPlvg17z/crop/200/square/f/mobama_v_20jan09_pa_bt.jpg", "https://vg-images.condecdn.net/image/XaEAGyx6Wlr/crop/200/square/f/mobama_v_22jan09_pa_b.jpg", "https://secure-uk.imrworldwide.com/cgi-bin/m?ci=uk-405185h&cg=0&cc=1&ts=noscript", "https://sb.scorecardresearch.com/p?c1=2&c2=15335235&cv=2.0&cj=1", "https://vg-images.condecdn.net/image/42Ylo1jloqb/crop/200/square/f/scameron10_4jun_v_13apr10_rex_b.jpg", "https://vg-images.condecdn.net/image/m1rjnKX2jaj/crop/200/square/f/gettyimages-1147453696.jpg", "https://vg-images.condecdn.net/image/kDyA9WWwJlE/crop/405/f/GettyImages-628313518.jpg", "https://vg-images.condecdn.net/image/AER5GzVyw7V/crop/200/square/f/mobama_ball_v_21jan09_pa_splash2.jpg", "https://vg-images.condecdn.net/image/orPwXADLKjP/crop/200/square/f/p111-helena-bonham-carter-vogue-mert-markus_b.jpg", "https://vg-images.condecdn.net/image/gBj8JaBKJNn/crop/200/square/f/Guinevere.jpg", "https://vg-images.condecdn.net/image/2r5JqEOqGQw/crop/405/f/GettyImages-541490216.jpg", "https://vg-images.condecdn.net/image/5noWv7Yn2RQ/crop/200/square/f/katemossvogue5_v_28jun11_b.jpg", "https://vg-images.condecdn.net/image/96PAXD6dBVj/crop/200/square/f/vbeckham49_gl_30jun09_pa_b_2.jpg", "https://vg-images.condecdn.net/image/Knord748ja5/crop/1440/0.5235602094240838/f/rexfeatures_6118216l.jpg", "https://www.facebook.com/tr?id=152961375395535&ev=PageView&noscript=1", "https://vg-images.condecdn.net/image/N2GnNRALPB3/crop/200/square/f/NAU.jpg", "https://vg-images.condecdn.net/image/dDj2ZmGQ7wQ/crop/200/square/f/scameron11_2jun_v_13apr10_rex_b.jpg", "https://vg-images.condecdn.net/image/GrxkjAEARNz/crop/200/square/f/scameron6_22sep_v_13apr10_rex_b.jpg", "https://vg-images.condecdn.net/image/GZB1q8OBkP2/crop/200/square/f/Lindsey-Adelman-Catch-Rock-table-light-1.jpg", "https://vg-images.condecdn.net/image/6AMyR284dkw/crop/200/square/f/Phillips.jpg", "https://vg-images.condecdn.net/image/MNY4n7oRwdg/crop/200/square/f/carolina-herrera-1988-vogue-23mar15-getty_b.jpg", "https://gwiq.globalwebindex.net/gwiq/img/?cid=wvn14oj&site=vogue", "https://vg-images.condecdn.net/image/zGJ8OxkzeRZ/crop/200/square/f/carolina-herrera-2001-vogue-23mar15-getty_b.jpg", "https://vg-images.condecdn.net/image/8lGkdRlXqvj/crop/200/square/f/vbeckham5_v_17jul09_pa_b.jpg", "https://vg-images.condecdn.net/image/POewMXZRoJe/crop/200/square/f/RL_Hero.jpg", "https://vg-images.condecdn.net/image/vnWJyoO4NEa/crop/200/square/f/Rita-Konig.jpg", "https://covers.condenast.co.uk/api/v1/vg/latest/image/print/300/", "https://vg-images.condecdn.net/image/zzYp14QJ9dg/crop/200/square/f/kmoss_92_v_3aug09_rex_big.jpg", "https://vg-images.condecdn.net/image/641Qxn4L1rx/crop/200/square/f/vbeckham48_gl_30jun09_pa_b_2.jpg", "https://vg-images.condecdn.net/image/PwRyPAobJqq/crop/200/square/f/mobama_24sep08_3nov08_pa.jpg", "https://vg-images.condecdn.net/image/9WGjz1DrpAA/crop/200/square/f/scameron12_1oct08_v_13apr10_rex_b.jpg", "https://vg-images.condecdn.net/image/mjXLZVNjBZz/crop/200/square/f/mobama_6nov08_rex_b.jpg", "https://vg-images.condecdn.net/image/z5WoQv5ggzP/crop/200/square/f/vogue_spice_girls_b.jpg", "https://vg-images.condecdn.net/image/Nqrx4JMnjGJ/crop/200/square/f/carolina-herrera-1994-vogue-23mar15-pa_b.jpg", "https://vg-images.condecdn.net/image/xAbeEv3V8de/crop/200/square/f/carolina-herrera-1985-vogue-23mar15-pa_b.jpg", "https://vg-images.condecdn.net/image/OW64L8z9qvD/crop/200/square/f/scameron8_10sep_v_13apr10_rex_b.jpg", "https://vg-images.condecdn.net/image/GM7XWex8RV4/crop/200/square/f/Rita-Konig-2.jpg", "https://vg-images.condecdn.net/image/XaWMRVYR1BK/crop/405/f/GettyImages-665522154.jpg", "https://vg-images.condecdn.net/image/ygmdK5gDZlz/crop/200/square/f/vbeckham4_v_17jul09_pa_b.jpg", "https://vg-images.condecdn.net/image/oE9jJMkoyk9/crop/200/square/f/cnstmmglpage000000084774.jpg", "https://vg-images.condecdn.net/image/J6NgPWy6lWR/crop/200/square/f/1.jpg", "https://vg-images.condecdn.net/image/ABqwNa0B9km/crop/200/square/f/cdeneuve_v_23jun11_pa_b.jpg", "https://vg-images.condecdn.net/image/xXKL85xBRAb/crop/200/square/f/katemossvogue8_v_28jun11_b.jpg", "https://vg-images.condecdn.net/image/WPWEwQk2r9A/crop/200/square/f/1993-mar-vogue-kate-moss-andrew-macpherson_b.jpg", "https://vg-images.condecdn.net/image/2Yy0PQ298ln/crop/200/square/f/scameron9_5sep_v_13apr10_rex_b.jpg", "https://vg-images.condecdn.net/image/PWL8YyyLLYR/crop/200/square/f/bridgete-vogue-24april17-rex_b.jpg", "https://vg-images.condecdn.net/image/ZqLemONOdJj/crop/200/square/f/007-waris-dirie-vogue-int-27th-feb-2019-credit-rankin.jpg", "https://vg-images.condecdn.net/image/NNzklXa30L1/crop/200/square/f/00010_vg_096_f8_cmyk.jpg", "https://vg-images.condecdn.net/image/odoEkrbMPvZ/crop/405/1.3173076923076923/middle/f/Vogue-July17-Cover.jpg", "https://vg-images.condecdn.net/image/EyxW9dKwWGy/crop/405/f/GettyImages-665217342.jpg", "https://vg-images.condecdn.net/image/3Aap5nd6vwb/crop/200/square/f/katemossvogue4_v_28jun11_b.jpg", "https://vg-images.condecdn.net/image/9O86ro35rzp/crop/200/square/f/carolina-herrera-1987-vogue-23mar15-getty_b.jpg", "https://vg-images.condecdn.net/image/Y7RLjMWkN55/crop/200/square/f/Pair-of-Armchaids-by-Gio-Ponti-c-1965-original-stone-and-green-upholstery---for-the-parco-dei-principi-hotel-Rome.jpg", "https://vg-images.condecdn.net/image/NDmvRw4mXy9/crop/200/square/f/carolina-herrera-1988-saks-vogue-23mar15-getty_b.jpg", "https://vg-images.condecdn.net/image/p1EG5jJ5kkW/crop/200/square/f/girlinred_alexa_viscius__6.jpg", "https://vg-images.condecdn.net/image/pn39bV70ZPM/crop/200/square/f/cdellorefice_v_3jun11_pa_b.jpg", "https://vg-images.condecdn.net/image/K0y2qJOL2qa/crop/405/f/GettyImages-648993026.jpg", "https://covers.condenast.co.uk/api/v1/vg/latest/image/tablet/300/", "https://vg-images.condecdn.net/image/k2laPA3QPMR/crop/200/square/f/mobama_8oct08_3nov08_pa.jpg"], "top_img": "https://vg-images.condecdn.net/image/Knord748ja5/crop/1440/0.5235602094240838/f/rexfeatures_6118216l.jpg", "keywords": [], "authors": ["Lisa Armstrong", "Sunday July", "In Partnership With", "John Lewis", "Ralph Lauren", "Ella Alexander", "Lucy Hutchings", "Emily Zemler", "Ellie Pithers", "Amel Mukhtar"], "canonical_link": "https://www.vogue.co.uk/article/style-rules-for-dressing-your-age", "title": "On Fighting - And Winning - The Style Eclipse", "meta_data": {"description": "Fight the style eclipse. The older you are, the more vital and rewarding fashion becomes, argues Lisa Armstrong", "GENERATOR": "Macromedia Dreamweaver", "viewport": "width=device-width, initial-scale=1", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "British Vogue", "apple-mobile-web-app-status-bar-style": "translucent black", "application-name": "British Vogue", "og": {"site_name": "British Vogue", "locale": "en_GB", "title": "On Fighting - And Winning - The Style Eclipse", "url": "https://www.vogue.co.uk/article/style-rules-for-dressing-your-age", "type": "article", "article": {"publisher": 104958196201736}, "description": "Fight the style eclipse. The older you are, the more vital and rewarding fashion becomes, argues Lisa Armstrong", "image": "https://vg-images.condecdn.net/image/Knord748ja5/crop/1440/0.5235602094240838/f/rexfeatures_6118216l.jpg"}, "fb": {"app_id": 449870811704655, "pages": 104958196201736}, "twitter": {"site": "@BritishVogue", "account_id": 27844479, "title": "On Fighting - And Winning - The Style Eclipse", "card": "summary_large_image", "description": "Fight the style eclipse. The older you are, the more vital and rewarding fashion becomes, argues Lisa Armstrong", "image": "https://vg-images.condecdn.net/image/Knord748ja5/crop/810/landscape/f/rexfeatures_6118216l.jpg"}, "theme-color": "#000", "article": {"section": "Ageless Style", "tag": "Ageless Style,News,On Instagram"}, "author": "Lisa Armstrong", "snippet": {"image": "https://vg-images.condecdn.net/image/Knord748ja5/crop/405/0.75/f/rexfeatures_6118216l.jpg"}}, "movies": [], "publish_date": null, "source": "https://www.vogue.co.uk", "summary": ""}