{"url": "https://www.inquisitr.com/4314304/rhonj-star-teresa-giudice-denies-cheating-as-jailbird-joe-giudice-is-flagged-for-deportation/", "text": "Real Housewives of New Jersey star Teresa Giudice endured an entire year behind bars – but is she cheating on her husband while he serves out his sentence? Teresa has been visiting her husband, Joe, on a weekly basis, yet sources claim that she’s already moved on to another man.\n\nAccording to Us Magazine, Teresa’s prison visits have gotten less frequent over the past month. While the couple’s kids continue to talk to their dad on the phone, Teresa has started dating a businessman from New Jersey and hasn’t seen Joe in months. In fact, Teresa’s former friend, Kim DePaola, claims that she’s been dating the man for almost half a year.\n\n“They’ve been pretty cozy I’m going to say in the last five months,” she stated.\n\nWhile Teresa is getting a little side action while her husband is in prison, DePaola doesn’t think she’s doing anything wrong. After all, Joe has allegedly cheated on Teresa on multiple occasions, though they have both denied it.\n\n“I think Teresa has every right to go out and find somebody else. She should leave Joe,” DePaola added.\n\nIn light of the cheating rumors, The Hollywood Gossip reports that Teresa’s lawyer, James J. Leonard Jr., revealed that Teresa is not having an affair while Joe is behind bars. Not only does she deny the reports, but Leonard slammed the people who started the rumors, calling them “attention-seeking lowlifes.”\n\nDePaola, on the other hand, is sticking by her story. In fact, she says that two different people told her about Teresa Giudice’s affair. At the end of the day, DePaola, who is currently involved in a feud with Teresa, believes she should leave Joe and start a new life with somebody else.\n\nTo make matters worse, OK Magazine reports that Joe is on the list for deportation. The Italian-born business man is not a U.S. citizen and is serving a three-year sentence for fraud. Unless Teresa can get the government to wave Joe’s deportation status, then it’s only a matter of time before he is sent back to Italy.\n\nhttps://www.instagram.com/p/BUPZe_1DH6h/?taken-by=teresagiudice&hl=en\n\nThere’s no telling if Teresa can keep Joe in the U.S. Joe’s fate will be determined by how he obtained a green card. If the reality star applied for a green card while in the U.S. then Teresa could win her case. If not, then Joe will likely be deported.\n\nTell us! Do you think Teresa Giudice is cheating on Joe while he is behind bars? Let us know in the comments below.\n\n[Featured Image by Bravo]", "images": ["https://www.inquisitr.com/wp-content/uploads/2019/07/Rita-Ora-3-300x170.jpg", "https://cdn.inquisitr.com/assets/ee54ce/dist/images/logos/favicon.png", "https://cdn.inquisitr.com/wp-content/uploads/2017/06/RHONJ-Star-Teresa-Giudice-Denies-Cheating-As-Jailbird-Joe-Giudice-Is-Flagged-For-Deportation.jpg", "https://secure.gravatar.com/avatar/5ed34468ceaaad942f0b4277ee61d2b2?s=250&d=mm&r=g", "https://www.facebook.com/tr?id=1472001486461948&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=478801082325642&ev=PageView&noscript=1", "https://cdn.inquisitr.com/assets/ee54ce/dist/images/logos/logo_header_no_tagline.png", "https://cdn.inquisitr.com/wp-content/uploads/2016/09/Kim-DePaola.jpg"], "top_img": "https://cdn.inquisitr.com/assets/ee54ce/dist/images/logos/favicon.png", "keywords": [], "authors": ["Perry Carpenter"], "canonical_link": "https://www.inquisitr.com/4314304/rhonj-star-teresa-giudice-denies-cheating-as-jailbird-joe-giudice-is-flagged-for-deportation/", "title": "‘RHONJ’ Star Teresa Giudice Denies Cheating As Jailbird Joe Giudice Is Flagged For Deportation", "meta_data": {"msapplication-TileImage": "//cdn.inquisitr.com/assets/ee54ce/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "https://www.inquisitr.com", "summary": ""}