{"url": "http://www.hqgolg.co/08/kate-upton-slams-guess-for-employing-paul-marciano-in/", "text": "Kate Upton Slams Guess for Employing Paul Marciano in #\n\nKate Upton is speaking out against Guess, the brand that helped make the model famous, and its chief creative officer and former co-CEO Paul Marciano, known as the “genius” behind the denim house.\n\nKate Upton: Guess co-founder Paul Marciano slams\n\n·\n\nShares of Guess are falling after Upton posted about company’s co-founder Paul Marciano on social media on Wednesday. Picture: AP Source:AP “As of today, Ms Upton still has provided no facts, no details, no dates and no circumstances to back anything she has alleged,” the statement continued.\n\nGuess’ Paul Marciano Denies Kate Upton’s – eonline.com\n\nKate Upton Slams Guess for Employing Paul Marciano in #MeToo Post Upton tweeted vague accusations about Marciano on Jan. 31. “It’s disappointing that such an iconic women’s brand @GUESS is still empowering Paul Marciano as their creative director #metoo,” she wrote.\n\nKate Upton Accuses Guess’ Paul Marciano of Sexual\n\nKate Upton has accused the man behind fashion giant Guess of harassing women. Once the face of Guess, the model called out the label’s co-founder and chief creative officer, Paul Marciano, 65, on social media Wednesday.\n\nGuess co-founder slams Kate Upton’s harassment claim\n\nGuess co-founder Paul Marciano fired back at Kate Upton’s allegations of sexual harassment.\n\nKate Upton Slams Guess for Employing Paul Marciano in #\n\nStan Lee Gives ‘Avengers’ Fans Hope for Fallen ‘Friends’ in Awesome…\n\nKate Upton Details Alleged Harassment by Guess’ Paul\n\nVideo ansehen · TIME: What happened with Paul Marciano? Kate Upton: After the first day of shooting the Guess Lingerie campaign [on July 25, 2010], Paul Marciano said he wanted to meet with me. As soon as I walked in with photographer Yu Tsai, Paul came straight up to me, forcibly grabbed my breasts and started feeling them — playing with them actually.\n\nKate Upton slams Guess’s probe of harassment allegations\n\n·\n\nKate Upton said on Wednesday she will not cooperate with an internal investigation by apparel brand Guess into alleged sexual harassment by its co-founder Paul Marciano because she says that the company has hired his personal attorney to handle the probe.\n\nKate Upton Accuses Guess Founder Paul Marciano of Sexual\n\nUpton’s full allegations can be read at Time. UPDATE, Tuesday, Feb. 20, 1:30 p.m.: Paul Marciano will step away from his “day-to-day responsibilities” at Guess, according to a report in The Hollywood Reporter. Marciano, who is chief creative officer and executive chairman of Guess’s board, will not be paid during his leave.\n\nKate Upton accuses GUESS co-founder Paul Marciano of\n\n·\n\nFox411: Kate Upton has publicly accused Paul Marciano, the co-founder of the Guess fashion line, of sexual misconduct in two separate social media posts. Kate Upton is eager to speak out on what really happened between her and GUESS co-founder Paul Marciano.", "images": [], "top_img": "", "keywords": [], "authors": [], "canonical_link": "http://www.hqgolg.co/08/kate-upton-slams-guess-for-employing-paul-marciano-in/", "title": "Kate Upton Slams Guess for Employing Paul Marciano in", "meta_data": {"viewport": "width=device-width"}, "movies": [], "publish_date": null, "source": "http://www.hqgolg.co", "summary": ""}