{"url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/08/28/john-goodman-reveals-roseanne-will-be-killed-off-in-the-conners-spinoff/", "text": "\n\nRoseanne Barr and John Goodman appear in a scene from the reboot of “Roseanne.” (Adam Rose/ABC/Associated Press)\n\nDan Conner had a heart attack in the second-to-last-season cliffhanger of “Roseanne.” He survived. Until he didn’t.\n\nJohn Goodman’s character, it was revealed by Roseanne in the last season’s closing minutes in 1997, had really died at his daughter’s wedding. The audience spent 24 episodes believing he pulled through. Roseanne’s narration explained she constructed a fantasy to cope.\n\nIt was one of the most divisive moments in recent television history when the show ended, but in this year’s short-lived revival, Dan was very much alive after the show opened with a self-aware joke about the controversy.\n\nNow, following Roseanne Barr’s racist Twitter rant in May that prompted ABC to cancel the revival mid-season and spin off the series in “The Conners,” Goodman has said how the show will address the matriarch’s absence.\n\nShe’s dead, Goodman explained.\n\nAnd this death might finally stick.\n\n“I guess he’ll be mopey and sad because his wife’s dead,” Goodman said of his blue-collar-hero character Dan in an interview with the Sunday Times.\n\nThe often media-shy Goodman opened up about Barr’s controversial departure that drew reactions from President Trump, whom Barr supports.\n\nIn May, she made references to President Barack Obama’s former adviser Valerie Jarrett and apes. Jarrett is black. The tweet in late May read: “muslim brotherhood & planet of the apes had a baby=vj.”\n\n[NBC announced John McCain’s death — then abruptly cut to men kissing in dolphin masks]\n\nABC canceled her show a day later, and President Channing Dungey called her tweet “abhorrent, repugnant and inconsistent with our values.” Trump appeared to reference the cancellation days later, calling it a “double standard” for conservatives after comedian Samantha Bee made a vulgar comment about his daughter, Ivanka.\n\nBarr later apologized and blamed Ambien for her tweets. Her representative did not return a request for comment.\n\nBut months after the fallout, Goodman revealed a shock that still lingers. The popular show revitalized legendary characters dormant for two decades, and nearly as quickly as it came back, the show ended.\n\n“I was surprised. I’ll put it this way, I was surprised at the response,” he told the Sunday Times. “And that’s probably all I should say about it.”\n\nHe paused for a long moment and thought about all that came before. “I know, I know, for a fact that she’s not a racist,” he said.\n\nThe new show, “The Conners,” will premiere in October. It will feature the core Conner family, but Barr will have no financial or creative ties to the series, ABC has said.\n\nIt may be difficult for Barr to see her characters on screen without her control. “Roseanne” was one of the biggest shows of the 1990s, and it brought Barr commercial and critical acclaim with her depiction of a struggling working-class family.\n\nIn the closing minutes of the series finale, after she revealed that Dan had died and that she wielded the power of the characters’ fate like a god, Roseanne wrote in her book that love is stronger than hate. But she also wrote more prescient words: “I learned that no one can stop me but me.”\n\nRead more:\n\nRoseanne Barr on her Valerie Jarrett tweet: ‘I was so sad that people thought it was racist’\n\nRoseanne Barr launched her new YouTube career by yelling an explanation for her Valerie Jarrett tweet", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=3005617&cv=2.0&cj=1", "https://www.washingtonpost.com/resizer/9fyArfXpajLX0KEMjGAt0-4l7g4=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/PTAUMRTJFA3RBPTHGSPMQLEDCM.jpg", "https://www.washingtonpost.com/resizer/yAFxThroW-CI5t-yu8Q6FsF7kHI=/1x1/www.washingtonpost.com/pb/resources/img/spacer.gif", "https://me.effectivemeasure.net/em_image", "https://www.washingtonpost.com/resizer/OsAtH-1XUhvh7UzAByTQh-5WRHg=/960x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/2ND3BJV66MZURHPJTN3UNKGLFY.jpg"], "top_img": "https://www.washingtonpost.com/resizer/9fyArfXpajLX0KEMjGAt0-4l7g4=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/PTAUMRTJFA3RBPTHGSPMQLEDCM.jpg", "keywords": [], "authors": ["Alex Horton", "General Assignment Reporter Covering National", "Breaking News", "August", "Alex Horton Is A General Assignment Reporter For The Washington Post. He Previously Covered The Military", "National Security For Stars", "Stripes", "Served In Iraq As An Army Infantryman."], "canonical_link": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/08/28/john-goodman-reveals-roseanne-will-be-killed-off-in-the-conners-spinoff/", "title": "John Goodman reveals Roseanne will be killed off in ‘The Conners’ spinoff", "meta_data": {"object-hash": 1535469797, "viewport": "width=device-width, initial-scale=1.0, user-scalable=yes, minimum-scale=0.5, maximum-scale=2.0", "referrer": "unsafe-url", "keywords": "John Goodman, Roseanne, Roseanne Barr, The Conners", "news_keywords": "John Goodman, Roseanne, Roseanne Barr, The Conners", "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "creator": "@AlexHortonTX"}, "og": {"type": "article", "site_name": "Washington Post", "url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/08/28/john-goodman-reveals-roseanne-will-be-killed-off-in-the-conners-spinoff/", "image": "https://www.washingtonpost.com/resizer/9fyArfXpajLX0KEMjGAt0-4l7g4=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/PTAUMRTJFA3RBPTHGSPMQLEDCM.jpg", "title": "John Goodman reveals Roseanne will be killed off in ‘The Conners’ spinoff", "description": "\"The Conners” will debut in October with John Goodman and the original cast, but Roseanne will not be among them."}, "article": {"publisher": "https://www.facebook.com/washingtonpost", "content_tier": "metered"}, "fb": {"app_id": 41245586762, "admins": 500835072}, "zeusAds": "true", "description": "\"The Conners” will debut in October with John Goodman and the original cast, but Roseanne will not be among them.", "robots": "index,follow", "theme": "normal"}, "movies": [], "publish_date": 1535428800.0, "source": "https://www.washingtonpost.com", "summary": ""}