{"url": "https://www.radiotimes.com/news/on-demand/2018-12-21/the-crown-season-3-netflix-release-date-cast-characters-plot-news-trailer-olivia-colman/", "text": "Olivia Colman succeeds Claire Foy as Queen Elizabeth II in season three of Netflix’s royal biopic The Crown. After much speculation, it was announced back in October that The Favourite and Broadchurch star Colman would be taking on the role of the Queen.\n\nAdvertisement\n\nFollowing Foy’s Emmy best actress win for her role in the Netflix drama, expectation is high for Oscar winner Colman’s performance.\n\nAfter a prolonged search, Tobias Menzies joined the ranks in March 2018 as Prince Philip. With Claire Foy and Matt Smith now gone, the drama is about to move into a new era both with a rebooted cast and with time moving forward in this epic story of the most famous family on the planet…\n\nBe the first to know when The Crown returns to Netflix Sign up to receive our newsletter! Thanks for signing up! Already have an account with us? Sign in to manage your newsletter preferences Sign in Register Sign me up! Sign up to get alerts on The Crown and receive TV and entertainment email newsletters from our award-winning editorial team. You can unsubscribe at any time. For more information about how we hold your personal data, please see our privacy policy.\n\nFind out everything we know about The Crown series three below. We’ll be updating this page with the latest news and views as they arrive…\n\nWhen is The Crown season three released on Netflix?\n\nSeason three is expected to be released at some point in 2019, although Netflix has not yet confirmed an exact date, it’s looking likely to be sometime in the autumn, and certainly before Christmas. Past seasons suggests a November or early December release date just in time to hunker down for a winter binge watch!\n\nWhile season one was released in November 2016 and season two in December 2017 – just in time for Christmas – Netflix was always anticipating a longer break in between series two and three due to the introduction of the brand new cast.\n\nFilming began in July 2018, and Olivia Colman confirmed at the Oscars that principal filming had finished in February 2019 – although she was still working on reshoots.\n\n“We’ve just finished season three a week ago, and when I go back I’ve got to do some reshoots” she said in a interview following her Oscar win on 24th February 2019. “We start again with season four in August.”\n\nThat’s good news for the future of the series, as it suggests we won’t have to wait as long for season four to be released. After that however, the cast is set to change again. It is a mystery who will take on the main roles of The Queen and Prince Philip as the epic series enters much more modern history.\n\nWhat is going to happen?\n\nThe third and fourth series will span the years 1964-76, with series one and two having covered the early years of Queen Elizabeth II’s reign, from 1947-63.\n\nShow-runner Peter Morgan is not giving anything away just yet, but history tells us that series three, if it does indeed take us from ’64-’70, will see the monarch cultivating her steadiest relationship with a Prime Minister yet in Harold Wilson, who served as head of the British government during this period.\n\nNew star Tobias Menzies revealed to RadioTimes.com that the series will include an episode on the Apollo 11 moon landing, and how Prince Philip reacted to the momentous event in history.\n\n“We’ve just been shooting a really interesting episode which was all tied into the moon landings in ’69,” he revealed.\n\n“[Showrunner] Peter [Morgan] has taken this angle that Philip gets very absorbed by the heroism of these men compared to what maybe he hasn’t done with his own life.”\n\nSpeaking at the BFI & Radio Times Television Festival 2017, producer Suzanne Mackie said that the new season would also see the introduction of Charles’ second wife Camilla Parker-Bowles.\n\nIt should also cover the decolonisation of Africa and the Caribbean, the birth of Prince Edward (March 1964), and Prince Charles’ movement into the public eye following his coronation as the Prince of Wales in 1969.\n\nJosh O’Connor, who plays the young prince, says the new series introduces Charles while he is still a student.\n\n“We start off with Charles at Cambridge University, that’s where we bring him into the series,” he told RadioTimes.com. “This is where we scale a significant part of his life which I feel so honoured and excited to tell the story. And tell a very different side of the story that we may not have seen or have known about.”\n\nHow well do you know the history of The Crown? You might be a fan of Netflix's The Crown, but do you know the history behind it? Take our quiz and discover just how well you've been paying attention... How many years was Winston Churchill prime minister for? What the real-life family nickname of King George VI, father to Queen Elizabeth II? How many people in Britain watched the coronation of Queen Elizabeth II? Who became prime minister after Winston Churchill resigned? What was the profession of Galina Ulanova, the woman whose photograph the Queen discovers hidden in Philip’s briefcase? Which custom did the Queen adopt after Lord Altrincham urged her to ‘modernise’ the monarchy? Where did the Duke and Duchess of Windsor visit in 1937, later causing controversy for the royal family? What was the name of the school where both Prince Philip and later Prince Charles studied? Why did the Secretary of State for War, John Profumo, have to resign? In which African country did the famously Queen dance the foxtrot in 1961? What year was Prince Edward, the youngest of Queen Elizabeth II’s four children, born? When did the Kennedys visit Buckingham Palace? Oops... you should probably go back and rewatch The Crown Which, let's face it, isn't too hard as it's great. \"History Queen\" You've certainly paid attention — are you sure you're not a member of the Royal Family? A right royal effort Not bad – but could you earn full marks before The Crown series three?\n\nIs there a trailer?\n\nSadly not. However, Netflix has released a first look at Oscar-winner Olivia Colman as the Queen in the picture below.\n\nNetflix followed this up with images of another Hollywood star, Helena Bonham Carter, as Princess Margaret and Ben Daniels as Lord Snowden.\n\nA first look at Tobias Menzies as Prince Philip was released on 28th August.\n\nWho is in the cast?\n\nThe Queen Olivia Colman was the first new cast member announced – she will replace Claire Foy as Queen Elizabeth II.\n\nNetflix has seemingly struck gold with the casting, especially after Colman won the Oscar for playing a different queen in 2018 film The Favourite.\n\nShe told RadioTimes.com about the moment when she knew she was in the running for the role.\n\n“I got a phone call from my agent when I was in a car [telling her that she had been asked to meet with director Peter Morgan],” she said. “I think I had fairly recently finished watching the first series, which I think I had done in about three nights – and so I was very excited. My agent was trying to be subtle, not knowing who was in the car with me and she went, ‘It’s something about a tiara’, and I went, ‘Oh, it’s The Crown!'”\n\nCheck out the full interview below.\n\nShe has also warned people however that her role as Queen Elizabeth will be very different compared to her Oscar-winning performance as Queen Anne in The Favourite.\n\n“You can’t compare the two. They both have the word ‘queen’ in the title but that’s it, that’s where it ends,” she said in a post-Oscars interview with ABC.\n\n“Queen Elizabeth’s much harder to play. There are sort of no rules for Queen Anne: no one can say, ‘She doesn’t sound like that.’”\n\nPrince Philip In late March 2018, it was announced that Outlander star Tobias Menzies would be filling the role of Prince Philip, after much speculation (it was initially rumoured that Paul Bettany was in line to replace Matt Smith).\n\nExplaining how he prepared to play the Duke of Edinburgh, Menzies told RadioTimes.com, “I just listened to him loads. It’s partly a technical thing: you want to sound and look like him, but move like him too. I’ve gone slightly crazy just listening to him and listening to him.”\n\nPrincess Margaret Veteran actress Helena Bonham Carter will take on the role of Princess Margaret in series three, after Netflix confirmed the long-rumoured casting.\n\nIn January 2018, Vanessa Kirby, the actress who played Margaret in the first two series, shared an Instagram picture with Bonham Carter along with the caption “honoured”. She tagged The Crown’s official Instagram account, too.\n\nLine of Duty star Jason Watkins meanwhile will play Prime Minister Harold Macmillan.\n\nCall the Midwife actor Erin Doherty has taken the role of Princess Anne.\n\nPrince Charles The Durrells star Josh O’Connor has been confirmed as the actor to play Prince Charles in what is set to be a key period in the Prince of Wales’s history. O’Connor joked he had “the ears for the part”.\n\nBut appearances aside, O’Connor has stated that he’s not looking to entirely mimic Prince Charles, stating his role in The Crown is distinct from the real-life heir to the throne.\n\n“What [writer] Peter Morgan does is that he doesn’t just present us with what we can see on YouTube. He goes behind the closed doors,” he said at the BFI and Radio Times Television Festival.\n\n“It’s ticking little things people can register and identify as Prince Charles but going beyond that and creating a full character that isn’t just Prince Charles, and is something else.”\n\nThe Queen Mother meanwhile will be played by Marion Bailey.\n\nIn October 2018, Netflix confirmed that Call the Midwife star Emerald Fennell would play the key role of Camilla Shand (now known as Camilla Parker-Bowles, or the Duchess of Cornwall) – Prince Charles’ future wife.\n\n“I’m absolutely over the moon and completely terrified to be joining so many hugely talented people on The Crown,” Fennell said, adding cheekily, “I absolutely love Camilla, and am very grateful that my teenage years have well prepared me for playing a chain-smoking serial snogger with a pudding bowl hair cut.”\n\nThe X-Files and Sex Education star Gillian Anderson meanwhile will play Margaret Thatcher.\n\nEmma Corrin will play Lady Diana Spencer (the future Princess of Wales) in The Crown.\n\n“I have been glued to the show and to think I’m now joining this incredibly talented acting family is surreal,” Corrin said.\n\n“Princess Diana was an icon and her effect on the world remains profound and inspiring. To explore her through Peter Morgan’s writing is the most exceptional opportunity and I will strive to do her justice!” she added.\n\nHer new co-star O’Connor later praised the casting, telling RadioTimes.com, “I’ve met her and I think she is young but she’s totally on point. She’s an incredible talent.”\n\nGame of Thrones star Charles Dance will be appearing in The Crown too, although his role is as-yet unconfirmed. Rumour has it however that he will play Prince Charles’ favourite great-uncle Lord Louis Mountbatten…\n\nOf course, that still leaves plenty of other empty roles: we’ll be keeping this page updated with the announcements as they come in.\n\nActor Alex Jennings, who played the Duke of Windsor in series one and two, has already admitted that he will find it difficult to watch his successor in the role.\n\n“I would love to have been involved in my story in The Crown, to have done the whole arc up until the Duke of Windsor’s end,” he told RadioTimes.com.\n\nWill Princess Diana feature in The Crown season three?\n\nWhile Emma Corrin has been cast in the Netflix series, she won’t make her first on-screen appearance until season four. However, with filming beginning on the fourth season, her casting was confirmed in April 2019.\n\nHow similar do the new cast of The Crown look to the actual royals?\n\nWhile Colman will be familiar to British drama fans, it’s striking just how similar she appears to Queen Elizabeth II in her first official photo in costume.\n\nWith the release of the first cast images from The Crown season 3, we finally get our chance to see how this new collection of actors have transformed into their royal counterparts… Posted by Radio Times on Monday, July 23, 2018\n\nAdvertisement\n\nAnd she’s not the only one: looking back at photos from the time, we can see that the new cast could well be very suited to their roles. Check out the comparisons here.", "images": ["https://images.immediate.co.uk/production/volatile/sites/3/2017/10/GettyImages-93414325-b90e822.jpg?quality=45&resize=620,413", "https://images.immediate.co.uk/production/volatile/sites/3/2018/07/TheCrown_302_00054_Rv2-bb4b1e7.jpg?quality=90&lb=620,413&background=white", "https://images.immediate.co.uk/production/volatile/sites/3/2019/05/Screen-Shot-2019-05-08-at-11.54.11-b6ca86c.png?quality=90&resize=620,413", "https://images.immediate.co.uk/production/volatile/sites/3/2018/08/image001-44a0fd9.png?quality=90&lb=620,413&background=white", "https://images.immediate.co.uk/production/volatile/sites/3/2019/06/wimbledon-towels-footer2-39f3372.png?quality=90&resize=100,100", "https://images.immediate.co.uk/production/volatile/sites/3/2017/12/TheCrown_210_Unit_00197_R-a6b2b25.jpg?quality=45&resize=556,556", "https://images.immediate.co.uk/production/volatile/sites/3/2018/05/13RW_203_01445R-3fa758f.jpeg?quality=90&resize=620,413", "https://images.immediate.co.uk/production/volatile/sites/3/2019/02/TheCrown_304_Unit_00289_R-bed4b13.jpg?quality=45&resize=620,413", "https://images.immediate.co.uk/production/volatile/sites/3/2017/08/cropped-radiotimes-header-logo-419324b.png?quality=90&resize=265,54", "https://images.immediate.co.uk/production/volatile/sites/3/2019/07/PB_Unit_04552_R2-909844d.jpg?quality=45&resize=620,413", "https://images.immediate.co.uk/production/volatile/sites/3/2017/06/97418.jpg?quality=90&resize=620,413", "https://images.immediate.co.uk/production/volatile/sites/3/2019/04/RT-cover-victoria-4506b72.png?quality=90&resize=100,100", "https://images.immediate.co.uk/production/volatile/sites/3/2019/01/CA522.1-Radio-Times-ER-Guide-Cover-999d568.jpg?quality=90&resize=100,100", "https://images.immediate.co.uk/production/volatile/sites/3/2018/03/tobiasmenzies-ae36eb7.jpg?quality=90&lb=620,413&background=white", "https://images.immediate.co.uk/production/volatile/sites/3/2018/07/GettyImages-954350490-copy-e5671f2.jpg?quality=90&lb=620,413&background=white", "https://images.immediate.co.uk/production/volatile/sites/3/2018/06/TheCrown_S3_301_001_R20180713-9788-1kvo8hm-34c5841.jpg?quality=90&lb=620,413&background=white"], "top_img": "https://images.immediate.co.uk/production/volatile/sites/3/2019/02/TheCrown_304_Unit_00289_R-bed4b13.jpg?quality=45&resize=620,413", "keywords": [], "authors": ["James Gill"], "canonical_link": "https://www.radiotimes.com/news/on-demand/2019-07-12/the-crown-season-3-netflix-release-date-cast-characters-plot-news-trailer-olivia-colman/", "title": "When is The Crown season 3 on Netflix? Who is in the cast, and what is going to happen?", "meta_data": {"viewport": "width=device-width, initial-scale=1", "title": "The Crown season 3 Netflix release date, cast, plot, trailer, news: Everything you need to know as Olivia Colman replaces Claire Foy", "og": {"site_name": "Radio Times", "title": "When is The Crown season 3 on Netflix? Who is in the cast, and what is going to happen?", "url": "https://www.radiotimes.com/news/on-demand/2019-07-12/the-crown-season-3-netflix-release-date-cast-characters-plot-news-trailer-olivia-colman/", "image": "https://images.immediate.co.uk/production/volatile/sites/3/2019/02/TheCrown_304_Unit_00289_R-bed4b13.jpg?quality=45&resize=620,413", "description": "Olivia Colman and Tobias Menzies will take over as the Queen and the Duke of Edinburgh when the drama returns to Netflix – but who else is joining them in the epic drama?", "type": "article"}, "twitter": {"title": "When is The Crown season 3 on Netflix? Who is in the cast, and what is going to happen?", "card": "summary_large_image", "site": "RadioTimes", "creator": "RadioTimes", "image": "https://images.immediate.co.uk/production/volatile/sites/3/2019/02/TheCrown_304_Unit_00289_R-bed4b13.jpg?quality=45&resize=620,413", "description": "Olivia Colman and Tobias Menzies will take over as the Queen and the Duke of Edinburgh when the drama returns to Netflix – but who else is joining them in the epic drama?"}, "fb": {"pages": "u4ylx6xopb5vy1edoq8hy242v9y83x"}, "google-site-verification": "iUM5QciI_0yvO6R3xDcoZPgevG7nfNhNsNv6zOjlvpU", "description": "Olivia Colman and Tobias Menzies will take over as the Queen and the Duke of Edinburgh when the drama returns to Netflix – but who else is joining them in the epic drama?", "robots": "index,follow", "msapplication-TileImage": "https://images.immediate.co.uk/production/volatile/sites/3/2016/11/cropped-RT-logo-2.png?quality=90&resize=270,270"}, "movies": ["https://www.youtube.com/embed/videoseries?list=PLbs-Pk9dtKb8pclF5oIi5pNoooGn01BqK", "https://www.youtube.com/embed/eME8tDc6DyY?feature=oembed", "https://www.youtube.com/embed/UlXJ_XUft9Y?feature=oembed"], "publish_date": 1545368400.0, "source": "https://www.radiotimes.com", "summary": ""}