{"url": "http://www.wopular.com/jennifer-lawrences-slip-dress-made-lazy-girls-and-more-best-dressed", "text": "Does premature birth impact a baby's love life in adulthood? New study says yes\n\nAccording to a study at the University of Warwick, adults who were born premature were less likely to form romantic relationships than their peers.\n\nMarried at First Sight's Nick Pendergrast Reveals ''Severe'' Accident Has Left Him Partially Paralyzed\n\nMarried at First Sight star Nick Pendergrast is opening up about what he described as a \"life-changing and devastating\" start to his year. The reality TV personality, who\n\nChip and Joanna Gaines share a sneak peek at their new cable network\n\nThe \"Fixer Upper\" stars' new cable network will replace Discovery's DIY Network and be unveiled in the summer of 2020.\n\n‘London Kills’ star Hugo Speer: I was a bad kid — now I play a cop\n\n“London Kills” won’t miss a beat when the five-episode second season of the bingey British crime drama premieres Monday on Acorn TV. “One of the best things about it was the way we shot it,” says Hugo Speer, who stars as London-based Detective Inspector David Bradford, whose wife has been missing since the series opener\n\nDwayne ‘The Rock’ Johnson posts ‘crazy throwback’ of Andre the Giant and his granddad\n\nDwayne “The Rock” Johnson may be a major Hollywood movie star now, but he hasn’t forgotten his roots. The former WWE champion posted a “crazy throwback” pic on Friday — showing his grandfather, High Chief Peter Maivia, alongside the “8th Wonder of the World” Andre the Giant. The black-and-white photo shows the wrestling icons laughing", "images": ["http://www.wopular.com/sites/all/themes/garland/wopular/images/mwb_sidebar_graphic.jpg", "http://www.wopular.com/sites/all/themes/garland/wopular/images/social_icon_facebook.gif", "http://www.wopular.com/sites/all/themes/garland/wopular/images/social_icon_rss.gif", "http://www.wopular.com/files/header_logo.png", "http://www.wopular.com/sites/all/themes/garland/wopular/images/share_email_button.gif", "http://www.wopular.com/sites/all/themes/garland/wopular/images/social_icon_twitter.gif", "http://www.wopular.com/files/wopular_favicon.ico", "http://www.wopular.com/sites/all/themes/garland/wopular/images/social_icon_gplus.gif", "http://www.wopular.com/sites/all/themes/garland/wopular/images/clear.gif"], "top_img": "http://www.wopular.com/files/wopular_favicon.ico", "keywords": [], "authors": [], "canonical_link": "", "title": "Jennifer Lawrence's Slip Dress Is Made For Lazy Girls And More Best Dressed", "meta_data": {"description": "Easy does it. Finding a dress for your next formal event can be stressful, but Jennifer Lawrence proves even simple looks can make an impact.", "keywords": "news,headlines,newspapers,news site,news website,aggregated news", "robots": "index,follow", "DC.title": "Jennifer Lawrence's Slip Dress Is Made for Lazy Girls and More Best Dressed", "og": {"title": "Jennifer Lawrence's Slip Dress Is Made for Lazy Girls and More Best Dressed", "site_name": "Wopular"}, "fb": {"admins": 663016824, "app_id": 214168345322701}}, "movies": [], "publish_date": null, "source": "http://www.wopular.com", "summary": ""}