{"url": "https://www.grammy.com/grammys/news/donald-glover-makes-history-emmy-win", "text": "Emmy nominations for 2018 — the 70th year of celebrating the best in TV over the course of the previous year — are out and here's how the music world stacked up.\n\nAll-Stars Pay Tribute To Elton John\n\nThe Recording Academy earned five nominations this year for our musical TV centerpieces. The 60th GRAMMY Awards telecast live from New York earned nods for Outstanding Production Design For A Variety Special, Outstanding Lighting Design/Lighting Direction For A Variety Special, Outstanding Variety Special (Live), and Outstanding Sound Mixing For A Variety Series Or Special.\n\nMeanwhile, the Academy's TV tribute to the indelible music of an icon, \"Elton John: I'm Still Standing — A Grammy Salute,\" earned a nomination for Outstanding Music Direction for the special's music director Davey Johnstone.\n\nBruno Mars also earned a nod for Outstanding Music Direction for his Bruno \"Mars: 24K Magic Live At The Apollo\" while Super Bowl music director Adam Wayne Blackstone earned recognition in the same category for this year's halftime show featuring Justin Timberlake.\n\nFor his role in the breakout hit live TV musical \"Jesus Christ Superstar Live In Concert,\" John Legend received an Emmy nod for Outstanding Lead Actor In A Limited Series Or Movie. Already a GRAMMY, Oscar and Tony winner, if Legend wins his Emmy this year, he would join the elite EGOT-winning crew alongside entertainers such as Rita Moreno and Whoopi Goldberg.\n\n\"Jesus Christ Superstar Live In Concert\" also earned several additional nominations, including Outstanding Supporting Actor In A Limited Series Or Movie for Brandon Victor Dixon as Judas, Outstanding Supporting Actress In A Limited Series Or Movie for Sara Bareilles as Mary Magdalene and Outstanding Variety Special (Live).\n\nOther familiar musical faces made the Emmy nominations list for their acting work. Donald Glover — aka Childish Gambino — earned several nods for his work on the hit comedy series \"Atlanta,\" including Outstanding Lead Actor In A Comedy Series and Outstanding Directing For A Comedy Series. One-time \"Glee\" actor/singer Darren Criss is up for Outstanding Lead Actor In A Limited Series Or Movie for his role as Andrew Cunanan in \"The Assassination Of Gianni Versace: American Crime Story.\"\n\nIn the musical categories, a number of composers earned nominations for their music works. This includes the GRAMMY-winning composers behind the score to La La Land Benj Pasek and Justin Paul, who earned a Emmy nod for Outstanding Original Music And Lyrics \"In The Market For A Miracle\" from \"A Christmas Story Live!\" Steve Martin earned a nomination in the same category for \"The Buddy Song\" from \"Steve Martin & Martin Short: An Evening You Will Forget For The Rest Of Your Life.\"\n\nCatching Up On Music News Powered By The Recording Academy Just Got Easier. Have A Google Home Device? \"Talk To GRAMMYs\"", "images": ["https://www.grammy.com/sites/com/files/styles/news_detail_header/public/gettyimages-848815714.jpg?itok=TKKKs_CN", "https://www.grammy.com/sites/com/files/styles/news_detail_header/public/gettyimages-955751848.jpg?itok=bYoNLWzh", "https://www.grammy.com/sites/com/themes/custom/com/logo.png", "https://www.grammy.com/sites/com/files/styles/news_detail_header/public/gettyimages-980975156.jpg?itok=OEF951Pi", "https://www.grammy.com/sites/com/themes/custom/com/images/grammy-dark.png", "https://www.grammy.com/sites/com/files/styles/twitter_image/public/gettyimages-848815714.jpg?itok=yM5RB-Hi", "https://pixel.quantserve.com/pixel/p-6E7VtLJEcC5ky.gif", "https://www.grammy.com/sites/com/files/styles/news_detail_header/public/gettyimages-958160942.jpg?itok=7KPzyzXQ", "https://www.grammy.com/sites/com/files/styles/news_detail_header/public/gettyimages-955778776.jpg?itok=QzlSMFKN"], "top_img": "https://www.grammy.com/sites/com/files/styles/twitter_image/public/gettyimages-848815714.jpg?itok=yM5RB-Hi", "keywords": [], "authors": [], "canonical_link": "https://www.grammy.com/grammys/news/donald-glover-makes-history-emmy-win", "title": "Donald Glover's Historic Emmy Wins", "meta_data": {"MobileOptimized": "width", "HandheldFriendly": "true", "fb": {"pages": "36736245747,268472583187472,196044303765874,64142649602"}, "drupal_parsely_version": "0.1", "description": "GRAMMY nominee Donald Glover makes history at the Emmys.", "keywords": "Donald Glover's Historic Emmy Wins, GRAMMYs, GRAMMYs news, grammy.com", "viewport": "width=device-width", "generator": "Drupal 7 (http://drupal.org)", "og": {"site_name": "GRAMMY.com", "type": "article", "url": "https://www.grammy.com/grammys/news/donald-glover-makes-history-emmy-win", "title": "Donald Glover's Historic Emmy Wins", "description": "GRAMMY nominee Donald Glover makes history at the Emmys.", "updated_time": "2019-02-26T04:03:41-08:00", "image": {"identifier": "https://www.grammy.com/sites/com/files/styles/twitter_image/public/gettyimages-848815714.jpg?itok=yM5RB-Hi", "type": "image/jpeg", "width": 1200, "height": 630}}, "twitter": {"card": "summary_large_image", "site": {"identifier": "@RecordingAcad", "id": 17243213}, "url": "https://www.grammy.com/grammys/news/donald-glover-makes-history-emmy-win", "description": "GRAMMY nominee Donald Glover makes history at the Emmys.", "title": "Donald Glover Makes History With Emmy Win", "image": {"src": "https://www.grammy.com/sites/com/files/styles/twitter_image/public/gettyimages-848815714.jpg?itok=yM5RB-Hi", "width": 1200, "height": 630}}, "article": {"published_time": "2017-09-18T10:32:31-07:00", "modified_time": "2019-02-26T04:03:41-08:00"}}, "movies": ["https://www.youtube.com/embed/R0_U8ca4040"], "publish_date": 1505755951.0, "source": "https://www.grammy.com", "summary": ""}