{"url": "https://www.justgiving.com/Tom-Hardy6", "text": "Thanks for taking the time to visit my JustGiving page.\n\nAs a Londoner and as a human being, it is impossible to be unaffected by the harrowing, unnecessary loss of life, injury, sorrow and the continuing desperate and disturbing situation facing those that were residents of Grenfell Tower, Latimer Road West London. It is impossible not to feel deep, profound shock and just stand by and not make the effort to help those who are innocent victims of a seemingly gross negligence. It is impossible not to commend the local community for their response of coming together to support those immediately affected by this tragedy at this time, and I am asking you to please help me raise funds to assist those who are suffering and their families.\n\nFor me, culpability and accountability falls entirely on those responsible for providing secure, safe housing for those who live in public housing and the citizens/residents of the UK who are vulnerable. It is shameful. There must be a dramatic change. Tonight, all of the people who lived in Grenfell Tower and survived have lost their homes and are displaced with uncertainty and suffering. Many traumatised are still in hospitals throughout the capital recovering from this tragedy. Many are in a critical condition. And many men, women, and children have lost their lives as a direct result of this gross negligence. This disaster feels like it could have been undoubtedly avoided. It is unacceptable in this day and age that men, women, and children are not safe in their homes - homes that are provided by public/social housing - because those homes were not adequately maintained to a correct and appropriate standard. It is shameful.\n\nMy heart goes out to those who have lost their lives and their loved ones. My thoughts are with the innocent families who are suffering - those who have lost their homes and possessions, their friends, families, relatives, children and their lives in a disaster which could have been avoided. People who now have literally nothing within a matter of hours due to what appears to be a man-made mistake and a gross act of negligence which demands an INQUEST. WHICH IS NOT THE SAME as a PUBLIC ENQUIRY. A public enquiry is government lead and government controlled; ***it is easier for the government to internally come up with a resolution without the public being able to ask questions and without being under the same scrutiny as an inquest; the residents and the public deserve answers to their questions and justice. Those found guilty should be held responsible and to account for gross and criminal negligence.\n\nIn the meantime, there are families and children in crisis that desperately need our help and support, both now and ongoing. I made a separate donation, and here is a way to join me in helping them however we can.\n\nEvery little helps.\n\nThankyou in advance.\n\n\n\n\n\nI searched for appropriate charities where the funds raised would go directly to victims and families.\n\nThis is some info I have gathered on the charity fund above:\n\n— This is the fund that both the Kensington & Chelsea Council and Mayor of London have asked people to donate to, as well as the London Emergency Trust Fund and London Funders.\n\n— 100% of all donations go directly to victims/families (their core costs are covered separately), so can have confidence in how money used.\n\n— Their team is very knowledgeable about the area and the community, as well as how families can be helped (for instance, they were the only one that informed me that since the Grenfell Tower is social housing, it’s up to the Council to oversee finding new housing, which the Foundation is also talking directly to.)\n\n— Other local charities have been coming to them for advice on how best to administer funds to meet immediate needs, and they will also be assembling a meeting with the various local charities in the area so they can efficiently work together to coordinate efforts.\n\n— Planning to make first round of cash donations in the next 48-72 hours.\n\n\n\n\n\nThankyou for your time. And your support.\n\n\n\n\n\nTom H\n\n\n\n\n\n\n\n\n\nDonating through JustGiving is simple, fast and totally secure. Your details are safe with JustGiving - they'll never sell them on or send unwanted emails. Once you donate, they'll send your money directly to the charity. So it's the most efficient way to donate - saving time and cutting costs for the charity.", "images": ["https://images.jg-cdn.com/image/c65fed5b-5be5-458f-8797-21ce5cb02fb1.jpg?template=fundraisingpagegallerym", "https://images.jg-cdn.com/image/78c7bd89-af2e-4084-8a0d-6eb60d96febb.jpg?template=size1200x630face", "https://www.jg-cdn.com/chrome/3e7a4dc9d866fda15331414a9072da97.svg", "https://images.jg-cdn.com/image/78c7bd89-af2e-4084-8a0d-6eb60d96febb.jpg?template=FundraisingPageHeroImageM", "https://www.justgiving.com/fundraising/images/user-profile/19579840", "https://images.jg-cdn.com/image/78c7bd89-af2e-4084-8a0d-6eb60d96febb.jpg?template=fundraisingpagegallerym", "https://images.jg-cdn.com/image/f8b533d7-b602-4cfd-bb64-5905070bc569.jpg?template=Size90x90", "https://images.jg-cdn.com/image/ea1aea73-eac9-4918-b085-6e7b94a27823.jpg?template=fundraisingpagegallerym", "https://images.jg-cdn.com/image/bcd49c2f-46b2-4ada-92fd-8f729b8be6ac.jpg?template=Size90x90"], "top_img": "https://images.jg-cdn.com/image/78c7bd89-af2e-4084-8a0d-6eb60d96febb.jpg?template=size1200x630face", "keywords": [], "authors": [], "canonical_link": "https://www.justgiving.com/Tom-Hardy6", "title": "Edward Hardy is fundraising for Kensington & Chelsea Foundation", "meta_data": {"author": "JustGiving", "description": "JustGiving - the easiest way to fundraise and donate to charity online", "keywords": "charity*, donat*, fundrais*, sponsor*, research*, treatment, prevention, risk, all clear, cancer, appeal, give, help*, hospital*, church*, school*, compan*, csr, corporate social responsibility", "al": {"iphone": {"url": "justgiving://?pageShortName=Tom-Hardy6", "app_store_id": 365315851, "app_name": "JustGiving"}, "web": {"url": "https://www.justgiving.com/Tom-Hardy6"}}, "fb": {"app_id": 113010648761829}, "og": {"title": "Read Edward's story", "image": "https://images.jg-cdn.com/image/78c7bd89-af2e-4084-8a0d-6eb60d96febb.jpg?template=size1200x630face", "url": "https://www.justgiving.com/Tom-Hardy6", "description": "Edward is raising money to help Kensington & Chelsea Foundation", "type": "jgdonation:fundraising_page"}, "jgdonation": {"fundraiser": "Edward Hardy", "charity": "https://www.justgiving.com/kandcfoundation", "event": "Support and Aid for Victims of the Disaster at Grenfell Tower"}, "twitter": {"card": "summary_large_image", "site": "justgiving", "title": "Donate to Edward Hardy's JustGiving page", "description": "Edward is fundraising for Kensington & Chelsea Foundation on JustGiving", "image": {"src": "https://images.jg-cdn.com/image/78c7bd89-af2e-4084-8a0d-6eb60d96febb.jpg?template=size280x280"}, "domain": "justgiving.com", "app": {"country": "GB", "name": {"iphone": "JustGiving", "ipad": "JustGiving"}, "id": {"iphone": 365315851, "ipad": 365315851}, "url": {"iphone": "justgiving://?pageShortName=Tom-Hardy6", "ipad": "justgiving://?pageShortName=Tom-Hardy6"}}}, "apple-mobile-web-app-title": "JustGiving", "application-name": "JustGiving", "msapplication-TileColor": "#ac29b5", "theme-color": "#ac29b5", "viewport": "width=device-width, initial-scale=1.0, user-scalable=no", "format-detection": "telephone=no"}, "movies": [], "publish_date": null, "source": "https://www.justgiving.com", "summary": ""}