{"url": "http://beautybeatbox.com/say-whaaat-taraji-p-henson-swears-by-this-cleansing-bar/", "text": "Skin | August 21, 2017\n\nTaraji. P. Henson’s new hair is making noise (and we love it!) but her skin is always on point. So, we were scrolling through the ‘gram and there it was — an Urban Skin Rx goody bag just for Henson. And when she said she “swears by” the goods inside, we took note!\n\n@Tarajiphenson let us in on her secret with this Instagram post.\n\nThe even tone cleansing bar that Henson is talking about here is the Urban Skin Rx Cleansing Bar ($28, urbanskinrx.com). It’s a 3-in-1 bar that is full of kojic acid and azelaic acid, both known to fade dark spots that prevent you from achieving that even skin tone we all desire. It also has coconut oil in it (and let’s face it, isn’t coconut oil good for just about everything?). The Urban Skin Rx line was created by Charlotte, North Carolina based, licensed medical aesthetician, Rachel Roff. It was specifically made with melanin in mind, so it’s effective for all skin tones. It’s no wonder it works so well on Taraji and fellow glow mavens, Eva Marcille and singer, Fantasia, who are both brand ambassadors for the line.\n\nFans of the cleanser rave about the two sponges included in the jar, too. No slippery bar here. You just dab some of the cleanser on the sponge, create a slight lather, and massage onto your face. For most, skin tone improvement is seen in about a week and an improvement in dark spots is visible within three weeks. Show us how it’s done Eva!\n\nALSO IN THE BEAUTY MIX:\n\nHello Beauties. Sign up for our newsletter above! And follow us on Instagram, Twitter and Facebook, too.", "images": ["http://beautybeatbox.com/wp-content/uploads/2014/01/subscribe.png", "http://beautybeatbox.com/wp-content/uploads/2017/08/taraji-Urban-Skin-Rx.jpg", "http://beautybeatbox.com/images/Logo.png", "http://beautybeatbox.com/wp-content/uploads/2017/08/Keratin-40-off-271x300.jpg", "http://beautybeatbox.com/wp-content/uploads/2017/08/even-tone-cleansing-bar-urban-skin-rx-2.jpg", "http://beautybeatbox.com/wp-content/uploads/2017/08/applying-lipstick-Final-pick-200x300.jpg", "http://beautybeatbox.com/wp-content/uploads/2017/08/Sanaa-274x300.png", "http://beautybeatbox.com/wp-content/uploads/2017/08/taraji-.png", "http://beautybeatbox.com/wp-content/themes/bbb/favicon.ico"], "top_img": "http://beautybeatbox.com/wp-content/themes/bbb/favicon.ico", "keywords": [], "authors": [], "canonical_link": "http://beautybeatbox.com/say-whaaat-taraji-p-henson-swears-by-this-cleansing-bar/", "title": "Say Whaaat? Taraji P. Henson Swears By This Cleansing Bar!", "meta_data": {"viewport": "width=device-width, initial-scale=1", "generator": "WordPress 5.1.1"}, "movies": [], "publish_date": null, "source": "http://beautybeatbox.com", "summary": ""}