{"url": "http://query.nytimes.com/gst/fullpage.html?res=940DEFDD133AF933A25755C0A962958260&sec=&spon=&partner=permalink&exprod=permalink", "text": "The politics of immigration is different in New York. Immigration and burden are two words that do not appear often -- or without raising a furor -- in the same sentence. Whatever their legal status, immigrants are considered a fact of life, a point of pride and an integral part of New York City's identity. Many New Yorkers know well that their own forebears arrived without papers.\n\n\"So many of the Irish, so many of the Italians who came when my parents came, were technically illegal,\" Mr. Cuomo said.\n\nBecause of New York City's size, new immigrants are absorbed without as much fuss as elsewhere. Often, they are responsible for revitalizing dying neighborhoods -- like Crown Heights in Brooklyn and Flushing, Queens -- and New Yorkers know it.\n\nIllegal immigrants in New York City confound the national stereotype of a young Mexican man sneaking across the border. Italians are the largest group, followed by Ecuadoreans, Poles, Dominicans and Trinidadians. European, Caribbean, Latin American and Asian, they blend into the city without radically altering its racial and ethnic makeup. So the racism that often compounds anti-immigrant sentiment is not as stark in New York.\n\nAnd against the backdrop of such tolerance, it does not jibe with the image of a New York politician, Democrat or Republican, to speak too long or too loudly about immigrants as a drag -- unless the immigrants are convicted felons.\n\nFlorida's lawsuit, announced by Gov. Lawton Chiles in a March news conference on the sand in Key Biscayne, describes a \"virtual 'invasion' of the state of Florida by aliens.\" Such loaded language is anathema in New York. No Lament on the Beach\n\n\"You won't see Mario Cuomo standing on the beach in Far Rockaway and evoking images of how vulnerable New York is,\" said Frank Sharry, director of the National Immigration Forum, a national advocacy group in Washington. \"That just doesn't play.\"\n\nAdvertisement Continue reading the main story\n\nGovernor Chiles, a Democrat, filed suit on April 11 to recoup $1 billion that Florida calculates it spends on social services for illegal immigrants. Gov. Pete Wilson of California, a Republican, sued the Federal Government on April 30 for $2 billion to cover the cost of jailing illegal immigrants, and promised further suits on other costs.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You will receive emails containing news content , updates and promotions from The New York Times. You may opt-out at any time. You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nBoth Governors are running for re-election, and evidently believe that voters want them to stand tough on illegal immigration. For Mr. Wilson, the denial of all services and rights to illegal immigrants is central to his campaign.\n\nMr. Cuomo, who is also up for re-election, first weighed joining Florida's suit, which is so broad as to combine the costs of legal and illegal immigrants. He also considered a separate suit by New York State, estimating the cost to New York at $1 billion, largely for the education of immigrant children. But at the same time, he began pressuring the Clinton Administration to help the states. 'Anti-Immigrant Rhetoric'\n\nIn April, the Administration asked Congress to appropriate $350 million to compensate states for the cost of incarcerating illegal-immigrant felons. After that, Mr. Cuomo postponed his plans for a lawsuit.\n\n\"I'm sure Governor Cuomo is reluctant to use a tactic made famous by the inflammatory anti-immigrant rhetoric of Pete Wilson -- even if he agrees with the objective of having the Federal Government assist the high-immigrant states,\" said Lucas Guttentag, director of the Immigrants' Rights Project for the American Civil Liberties Union.\n\nThere are 3.85 million illegal immigrants in the country, according to Robert Warren, chief of statistics for the Immigration and Naturalization Service. California has the greatest number, with about 1.6 million. New York is a distant second, with 510,000, followed by Texas, with 405,000, and Florida, with 373,000.\n\nNo one knows just what illegal immigrants cost states. Immigration experts criticize the states' estimates as one-sided fiscal calculations that ignore illegal immigrants' economic contributions. Many are taxpayers; most are customers; some are even entrepreneurs. All Americans Cost More\n\nThe states' estimates also focus on immigrants who have just arrived in this country, which gives a misleading picture of their lifetime contribution. Over time, many illegal immigrants become legal, earn more money and pay more taxes. The average household income of legal immigrants surpasses that of natives after 10 years in this country, according to a recent study by the Urban Institute.\n\nStill, illegal immigrants do cost the states money, as do native-born Americans. Americans happen to cost more than they pay in taxes. Most of the illegal immigrants' cost lies in education for their children, followed by emergency medical care and prison costs. Texas, which plans to sue the Federal Government soon, is the only state that subtracted estimated tax payments from its cost calculations. Texas estimates that illegal immigrants contribute $290 million to the state and cost $456 million.\n\nAdvertisement Continue reading the main story\n\nEven in New York, a state that frowns on portraying immigrants negatively, it is more than acceptable to talk about illegal-immigrant felons as a burden.\n\nBut even on this issue, New York, for the moment, does not go as far as California and Florida. It wants the Federal Government to pay the cost of illegal immigrants who have served their sentences but linger in state prisons awaiting deportation. U.S. Speeds Deportations\n\nNew York State sued the Federal Government in 1992 to force it to take custody of those ex-convicts, and a Federal judge ordered New York to keep housing them.\n\nBut the Justice Department, in a pilot program with New York, has recently started expediting deportations. In the program's first eight weeks, 180 orders of deportation have been issued to illegal-immigrant prisoners compared with 270 in all 1992. It is a sign that the Administration is prepared to work with the states, Mr. Cuomo said.", "images": ["https://s1.nyt.com/timesmachine/pages/1/1994/06/10/352888_360W.png"], "top_img": "https://s1.nyt.com/timesmachine/pages/1/1994/06/10/352888_360W.png", "keywords": [], "authors": ["Deborah Sontag"], "canonical_link": "https://www.nytimes.com/1994/06/10/nyregion/new-york-officials-welcome-immigrants-legal-or-illegal.html", "title": "New York Officials Welcome Immigrants, Legal or Illegal", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "sourceApp": "nyt-v5", "applicationName": "article", "robots": "noarchive", "hdl_p": "New York Officials Welcome Immigrants, Legal or Illegal", "genre": "News", "articleid": 1994061000000352888, "usageTerms": "https://help.nytimes.com/hc/en-us/articles/115014893968-Terms-of-sale", "hdl": "New York Officials Welcome Immigrants, Legal or Illegal", "col": 1994, "pdate": 19940610, "utime": 19940610010000, "ptime": 19940610010000, "DISPLAYDATE": "June 10, 1994", "dat": "June 10, 1994", "msapplication-starturl": "http://www.nytimes.com", "cre": "The New York Times", "slug": "new-york-officials-welcome-immigrants-legal-or-illegal", "article": {"collection": "https://static01.nyt.com/services/json/sectionfronts/nyregion/index.jsonp", "published": "1994-06-10T01:00:00-04:00", "modified": "1994-06-10T01:00:00-04:00", "section": "N.Y. / Region", "section-taxonomy-id": "C4DC8C0C-E148-4201-BF10-82F1C903DBFB", "section_url": "https://www.nytimes.com/section/nyregion", "top-level-section": "nyregion", "author": "https://www.nytimes.com/by/deborah-sontag", "tag": "IMMIGRATION AND REFUGEES"}, "sectionfront_jsonp": "https://static01.nyt.com/services/json/sectionfronts/nyregion/index.jsonp", "og": {"url": "https://www.nytimes.com/1994/06/10/nyregion/new-york-officials-welcome-immigrants-legal-or-illegal.html", "type": "article", "title": "New York Officials Welcome Immigrants, Legal or Illegal", "image": "https://s1.nyt.com/timesmachine/pages/1/1994/06/10/352888_360W.png"}, "fb": {"app_id": 9869919170, "pages": 993603507345855}, "twitter": {"site": "@nytimes", "url": "https://www.nytimes.com/1994/06/10/nyregion/new-york-officials-welcome-immigrants-legal-or-illegal.html", "title": "New York Officials Welcome Immigrants, Legal or Illegal", "image": "https://s1.nyt.com/timesmachine/pages/1/1994/06/10/352888_360W.png", "card": "summary"}, "author": "Deborah Sontag", "tone": "news", "isFullText": 1, "pdfUrl": "https://timesmachine.nytimes.com/svc/tmach/v1/refer?res=940DEFDD133AF933A25755C0A962958260&pdf=true", "resKey": "940DEFDD133AF933A25755C0A962958260", "byl": "By DEBORAH SONTAG", "PT": "article", "CG": "nyregion", "SCG": "full-text", "PST": "News", "tom": "News", "edt": "Late Edition - Final", "geo": "NEW YORK CITY", "per": "GIULIANI, RUDOLPH W", "des": "IMMIGRATION AND REFUGEES", "keywords": "NEW YORK STATE,NEW YORK CITY,CUOMO  MARIO M,GIULIANI  RUDOLPH W,ILLEGAL ALIENS,IMMIGRATION AND REFUGEES", "dfp-ad-unit-path": "nyregion", "dfp-amazon-enabled": "false"}, "movies": [], "publish_date": null, "source": "http://query.nytimes.com", "summary": ""}