{"url": "https://www.brides.com/story/shanina-shaik-and-dj-ruckus-wedding-photos", "text": "Congrats are in order for Shanina Shaik and Gregory “DJ Ruckus” Andrews ! The couple—she's a model, he's an in-demand DJ—married this past Saturday on the island of Eleuthera in the Bahamas. The pair first met in 2015, when Shanina found herself sans entourage during Coachella. \"Just before I was going to leave, Greg noticed that I was alone and came over to speak with me,\" she recalls. \"We had the most wonderful conversation.\" From that moment on, the bride says, she was sure he was \"the one.\" Greg was sure, too, and they dated for just eight months before he proposed. \"When you know, you know,\" Shanina adds. To propose, Greg planned a tropical Christmas vacation with Shanina and her mother at his family's place in the Bahamas. The day after the holiday, he organized an impromptu beach trip with Shanina and his cousin—or so she thought! Greg's cousin, of course, never showed up, and he instead popped the question in front of the crystal blue waters. And that's not all: Greg proposed with not one but two Lorraine Schwartz rings! \"He asked me to choose my favorite ring , and, unfortunately, I could only choose one,\" she says, with a laugh.\n\nAfter an engagement like that, it's no surprise that Shanina and Greg decided to marry in the Bahamas as well. In fact, they decided to say \"I do\" on the exact stretch of sand where they were engaged. \"I've always dreamt of marrying on the beach,\" says the bride, who grew up in Australia. The stunning setting—the Other Side in Eleuthera—became their inspiration for the day, and the couple enlisted the help of Little Island Design to create a tropical-inspired wedding there. \"Our wedding reflected our personal style (simple and elegant) with the added touch of a bohemian vibe as well,\" explains the bride.\n\nKeep reading to see more of Gregory “DJ Ruckus” Andrews and Shanina Shaik 's island celebration, as photographed by the talented Sara Lobla . Trust us: You'll be more than inspired—especially when you see the bride's stunning Ralph & Russo gown!\n\nPinterest Photo by Sara Lobla\n\nPinterest Photo by Sara Lobla\n\nThe couple invited their friends and family for a weekend's worth of festivities. The events started on Friday night with a rehearsal dinner on a terrace overlooking the beach. Shanina wore a long-sleeved white dress and wedges by Zimmermann for the occasion. The groom wore a bright shirt that match the party's floral arrangements.\n\nPinterest Photo by Sara Lobla\n\nFor the rehearsal dinner, the couple selected a color palette that complemented the island's natural landscape. Bamboo folding chairs and wicker place mats acted as a neutral base, while arrangements of local flowers added pops of orange and pink to the decor.\n\nPinterest Photo by Sara Lobla\n\nAfter dinner, guests moved over to the beach, where a casual lounge area was set up with tiki torches, lanterns, and low seating arrangements in the sand.\n\nPinterest Photo by Sara Lobla\n\nPinterest Photo by Sara Lobla\n\nOn the big day, the bride got ready with her bridesmaids, including Nicole Williams, Nadine Leopold, Natalie Halcro, Jasmine Tookes, and Olivia Pierson. The women wore matching robes for a photo op and were joined by an additional mini guest: a dog dressed in a tux!\n\nPinterest Photo by Sara Lobla\n\nPinterest Photo by Sara Lobla\n\nShanina paired her hexagon-shaped engagement ring with two coordinating bands, all by Lorraine Schwartz. As a wedding-gift, a close friend helped select her bridal shoes. \"She took me to Harrods, to the private shopping suite,\" she says. \"After looking at so many amazing options, I decided to go with a stunning pair of Aquazzura shoes.\" The bride later changed into a second heel—this time by Jimmy Choo—when she slipped into a second dress for dancing.\n\nPinterest Photo by Sara Lobla\n\nFor her wedding gown, Shanina turned to the husband-and-wife design team at Ralph & Russo , who helped create her dream dress over the course of eight months. \"I wanted it to be simple, bohemian, and elegant,\" she says. \"I love a boho style and I wanted to give it a little twist by incorporating lace.\" The result? A gorgeous off-the-shoulder creation featuring delicate lace and an increasingly sheer fabric toward the hem.\n\nThe bride wore a stunning statement necklace of pink and white diamonds by Lorraine Schwartz, who also designed her engagement ring. She carried a bouquet of baby's breath.\n\nPinterest Photo by Sara Lobla\n\nThe back of Shanina's dress featured a scooped back and a long train.\n\nPinterest Photo by Sara Lobla\n\nWhen creating her dress, Shanina told the designers at Ralph & Russo that she wanted a gown that would vibe well with the tropical beach setting. (Take this photo as evidence, and we'd say that they more than succeeded!)\n\nPinterest Photo by Sara Lobla\n\nPinterest Photo by Sara Lobla\n\nThe groom looked dapper in a classic tux by Tom Ford. He gave his groomsmen—including Evan Ross and Dallas Austin—a bottle of Don Julio before they walked down the aisle.\n\nPinterest Photo by Sara Lobla\n\nThe couple gave their guests a dress code of \"neutral Pantone tones\" to ensure that everyone blended in with the environment. The youngest guests did not adhere to the uniform, but they looked especially adorable in their wedding attire.\n\nPinterest Photo by Sara Lobla\n\nThe ceremony took place on the beach, where wooden benches were arranged around an altar covered in greenery. The bride walked down a plank-covered aisle lined with more greenery garlands.\n\nPinterest Photo by Sara Lobla\n\nJoseph Simmons, commonly known as \"Rev Run,\" officiated the oceanfront vows.\n\nPinterest Photo by Sara Lobla\n\nPinterest Photo by Sara Lobla\n\nThe bride admits that she had a mix of emotions during the ceremony. “I was nervous, excited, and overwhelmed with joy,\" she says. \"I have dreamt of this day with Gregory for so long and it felt surreal that we finally made it to that moment. I couldn’t wait to hear that we were husband and wife!\"\n\nPinterest Photo by Sara Lobla\n\nFollowing the ceremony, the wedding party recessed down the aisle. The bridesmaids wore custom dresses by Zimmermann, an Australian fashion label. Shanina worked with the brand's designers Nicky and Simone to select a specific silhouette and tone for each girl. Shanina's matron of honor, Nicole Williams of WAGS, wore a special gown by Michael Castello.\n\nPinterest Photo by Sara Lobla\n\nThe newlyweds selected \"Electric\" by Alina Baraz for their first dance, but created a mix that led into \"Remember the Time\" by Michael Jackson. \"After we met and started dating, I had to spend a lot of time in Australia for work and Greg sent me the most amazing flowers and a card that said, 'Do you remember the time we first fell in love? I miss you,' ” Shanina explains. \"Since then, 'Remember the Time' has been our song.\"\n\nPinterest Photo by Sara Lobla\n\nA dinner tent was pitched by the beach, where two long tables were also set for dinner. The top of the tent was decorated with cafe lights and hanging lanterns to capture the boho atmosphere the bride was after. Below, tabletops were dressed with greenery, candles, and accents of lilies, the bride's favorite flower.\n\nPinterest Photo by Sara Lobla\n\nPinterest Photo by Sara Lobla\n\nThe newlyweds sat together at a sweetheart table during a locally-inspired dinner of fresh seafood, jerk chicken, and conch fritters. Guests toasted with Mumm champagne, Don Julio tequila, and plenty of rum!\n\nPinterest Photo by Sara Lobla\n\nThe couple cut into a semi-naked, bourbon-flavored cake accented with bundles of baby's breath .\n\nPinterest Photo by Sara Lobla\n\nPinterest Photo by Sara Lobla\n\nAfter dinner, a Bahamian carnival group led the bride (then wearing a custom Michael Costello dress), groom, and their guests to the dance floor. There, the groom had a special surprise: A performance by DJ Rev Run! He also had friends DJ KISS and DJ Politik play sets throughout the action-packed night. Looking back, the bride says the reception was so fun because she was able to finally let loose and celebrate with family and friends. She adds, \"I was so happy to be surrounded with so much love and my newlywed husband!\"\n\nVenue & Catering: The Other Side || Planning: Alice Spitalny, Ben Simmons, and Charlotte Simmons of Little Island Design || Bride's Rehearsal Dinner Dress: Zimmermann || Bride's Wedding Dress: Ralph & Russo || Bride's Reception Dress: Michael Costello || Bride's Shoes: Aquazzura , Jimmy Choo || Groom's Attire: Tom Ford || Hair: Jennifer Yepez using Kevin Murphy || Makeup: Rae Morris || Fragrance: Giorgio Armani Beauty || Skincare: Kora Organics , Dior || Jewelry: Lorraine Schwartz || Bridesmaids' Attire: Zimmermann , Michael Costello || Officiant: Rev Run || Invitations: Paperless Post || Calligraphy: Fawn Lettering || Decor & Menus: Kea Thien of The K. Simone Group || Entertainment: DJ Kiss , DJ Politik || Photography: Sara Lobla", "images": ["https://media.brides.com/photos/5bec9143c6ac5e0609c87f05/1:1/w_125/sam-and-nate-wedding01.jpg", "https://media.brides.com/photos/5ae8858900521c0bf79ece1b/1:1/w_767/shanina-shaik-and-gregory-andrews-wedding01.jpg", "https://media.brides.com/photos/5bbbc8665b10b72e03cc1037/1:1/w_125/kevin-and-deanna-wedding01.jpg", "https://media.brides.com/photos/5ae8858900521c0bf79ece1b/master/pass/shanina-shaik-and-gregory-andrews-wedding01.jpg", "https://www.brides.com/images/brides-logo.svg", "https://media.brides.com/photos/5bf303d935c5b62d6a1c16bf/1:1/w_125/haley-and-brandon-wedding01.jpg"], "top_img": "https://media.brides.com/photos/5ae8858900521c0bf79ece1b/master/pass/shanina-shaik-and-gregory-andrews-wedding01.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.brides.com/story/shanina-shaik-and-dj-ruckus-wedding-photos", "title": "Shanina Shaik and DJ Ruckus's Stunning Bahamas Wedding Photos", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=no, width=device-width, initial-scale=1, maximum-scale=1", "description": "Shanina Shaik and DJ Ruckus hosted a celebrity-filled wedding weekend on the small island of Eleuthera in the Bahamas on Saturday.", "og": {"description": "The model and DJ married in the Bahamas on Saturday.", "image": "https://media.brides.com/photos/5ae8858900521c0bf79ece1b/master/pass/shanina-shaik-and-gregory-andrews-wedding01.jpg", "title": "Exclusive: Go Inside the Stunning Tropical Wedding of Shanina Shaik and DJ Ruckus!", "url": "https://www.brides.com/story/shanina-shaik-and-dj-ruckus-wedding-photos", "site_name": "brides", "type": "article"}, "twitter": {"description": "The model and DJ married in the Bahamas on Saturday.", "image": "https://media.brides.com/photos/5ae8858900521c0bf79ece1b/master/pass/shanina-shaik-and-gregory-andrews-wedding01.jpg?mbid=social_retweet", "title": "Exclusive: Go Inside the Stunning Tropical Wedding of Shanina Shaik and DJ Ruckus!", "url": "https://www.brides.com/story/shanina-shaik-and-dj-ruckus-wedding-photos", "card": "summary_large_image", "creator": "@brides", "site": "brides"}, "fb": {"page_id": 50416192591, "admins": "648235154,789168297,688620285"}, "keywords": "Real Weddings", "news_keywords": "Real Weddings,Real Weddings"}, "movies": [], "publish_date": null, "source": "https://www.brides.com", "summary": ""}