{"url": "https://en.wikipedia.org/wiki/Esteban_Loaiza", "text": "Mexican baseball player\n\nLoaiza and the second or maternal family name is Veyna. This article uses Spanish naming customs : the first or paternal family name isand the second or maternal family name is\n\nEsteban Antonio Loaiza Veyna [lo-EYE-sa] (born December 31, 1971) is a Mexican retired professional baseball pitcher. He played in Major League Baseball for the Pittsburgh Pirates, Texas Rangers, Toronto Blue Jays, Chicago White Sox, New York Yankees, Washington Nationals, Oakland Athletics, and Los Angeles Dodgers. Loaiza was the American League's (AL) starting pitcher in the 2003 All-Star Game. That year, he led the AL in strikeouts.\n\nIn August 2018, Loaiza pleaded guilty to federal drug charges in California; he was sentenced to three years in jail.[1]\n\nEarly career [ edit ]\n\nA graduate of Mar Vista High School in Imperial Beach, California, Loaiza was signed by the Pittsburgh Pirates as an undrafted free agent on March 21, 1991. With the Gulf Coast Pirates in the Rookie leagues he started five games in 1991, finishing with a 5–1 record and a 2.26 earned run average (ERA). He moved through the Pirates farm system with stops at Augusta (class A – 1992), Salem (class A – 1993) and Carolina (class AA – 1993-1994). He also played for the Mexico City Red Devils of the Mexican Summer League during the 1993 season. He has played with the Mexicali Aguilas of the Liga Mexicana Del Pacifico.\n\nMajor Leagues [ edit ]\n\nPittsburgh Pirates [ edit ]\n\nLoaiza moved to a big league club in 1995, making his major league debut on April 29, 1995, for the Pirates against the Philadelphia Phillies. He worked 4​2⁄ 3 innings in the game, giving up five hits and one unearned run to achieve the first major league win of his career. He finished his rookie season with an 8–9 record and a 5.16 ERA in 31 starts.\n\nHe began the 1996 season back in the minors with the Triple-A Calgary Cannons, but was recalled to the majors on June 7.\n\nThe Pirates traded Loaiza to the Texas Rangers on July 17, 1998, in exchange for Todd Van Poppel and Warren Morris.[2]\n\nTexas Rangers [ edit ]\n\nHe spent the next two seasons with Texas, pitching both as a starter and a reliever for the Rangers.\n\nToronto Blue Jays [ edit ]\n\nThe Rangers traded Loaiza to the Toronto Blue Jays on July 19, 2000 for Michael Young and Darwin Cubillán.[3] He pitched with the Blue Jays through 2002.\n\nChicago White Sox (2003–2004) [ edit ]\n\nAfter signing with the Chicago White Sox as a free agent, Loaiza enjoyed a career season in 2003, leading American League pitchers in strikeouts (207), and was second in wins (21) and strikeouts per nine innings (8.23); third in ERA (2.90), and sixth in innings pitched (226.3). Considered for the Cy Young Award, Loaiza finished second behind Roy Halladay, ahead of Pedro Martínez and Tim Hudson. He was an All-Star selection both in 2003 and 2004. Loaiza's 21 wins in 2003 are tied for the most ever in a season for a Mexican pitcher; Fernando Valenzuela won 21 games in 1986.\n\nChicago White Sox, New York Yankees [ edit ]\n\nIn 2004, Loaiza was elected to the All-Star game as a member of the White Sox. Soon after his appearance in the All-Star game, he was traded to the New York Yankees mid-season for José Contreras.[4][5] He did not perform well in New York and was moved to the bullpen during the regular season. During the ALCS against the Boston Red Sox, he pitched well in two relief outings despite recording the loss in Game 5.\n\nWashington Nationals [ edit ]\n\nFollowing the 2004 season, he signed a one-year deal with the Washington Nationals as a free agent. He went 12–10 with a 3.77 ERA for the Nationals in 2005.\n\nOakland Athletics [ edit ]\n\nJust prior to the 2006 season, Loaiza signed a three-year, $21.4 million contract with the Oakland Athletics.[6] He had a disastrous start to his Oakland career, which led many fans to question his acquisition. Loaiza went 0–3 in April with an 8.35 ERA and opponents batted .385 against him. His early season troubles reached a nadir on April 29 when he gave up 10 runs in two innings to the Kansas City Royals, who had the worst record in baseball at the time; the game was not official since it was later rained out, or his statistics would have been even worse. Loaiza's poor performance was at least partly due to injury, as he seemed to have very little velocity on his fastball early in the season (throwing it at as little as 82–83 mph)[7] and was placed on the disabled list with back and shoulder problems on May 2. When he returned on June 8, he was inconsistent, but appeared to be much healthier, due to his ability to demonstrate a much harder 95 mph fastball.[8] On June 25, 2006, Loaiza pitched his first complete game in over two years in a 10–4 victory over the San Francisco Giants. Loaiza finished the 2006 regular season with a 4.89 ERA and a record of 11 wins and 9 losses.[9] His injuries may have played a role in his sub-par ERA for that season.\n\nDuring the 2007 regular season, Loaiza spent a large amount of time[clarification needed] on the disabled list due to spasms in his right trapezius. The A's activated him and moved him back to the 25-man roster on August 22, 2007.\n\nLos Angeles Dodgers [ edit ]\n\nOn August 29, 2007, the Los Angeles Dodgers claimed Loaiza off waivers from the Athletics. Instead of trading for Loaiza, the Dodgers purchased the remainder of his contract.[10]\n\nHe made an impressive debut for the Dodgers, working seven innings and getting the win in an 11–4 victory over the Chicago Cubs, but struggled during the rest of the season, losing his last four decisions.\n\nGoing into the 2008 season, he had fully recovered from his injuries and regained his spot as the fifth starter in the Dodgers rotation. Loaiza struggled at the beginning of the season, and as a result lost his starting position to lefty Hong-Chih Kuo. After a stint on the DL, Loaiza was designated for assignment on May 24 and subsequently released.\n\nChicago White Sox (2008) [ edit ]\n\nOn June 4, 2008, Loaiza was signed by the Chicago White Sox.[11] After 3 relief appearances and 6 weeks on the disabled list, he was released.[12]\n\nPersonal life [ edit ]\n\nFamily [ edit ]\n\nIn 2010, Loaiza married Mexican-American singer Jenni Rivera. He made several appearances on her family's reality television show, I Love Jenni. Divorce papers were filed on October 1, 2012. A statement, released by Rivera's representatives, stated that the divorce was due to \"irreconcilable differences on behalf of both parties derived from private circumstances that occurred during the lapse of their two-year marriage.\" Rivera died on December 9, 2012, when her private plane crashed, before the divorce was finalized.[13]\n\nLegal troubles [ edit ]\n\nOn June 14, 2006, Loaiza was arrested after being pulled over by police who clocked his Ferrari at 120 mph (190 km/h) on a California freeway near San Lorenzo. He subsequently failed a sobriety test. He appeared in court on July 14, 2006. After the incident, Athletics general manager Billy Beane banned alcohol in both the home and visitor clubhouse, citing liability issues.[14]\n\nLoaiza was arrested on February 9, 2018, in San Diego, California, with over 20 kilograms (44 lb) of cocaine, according to the San Diego County Sheriff's Department. He was charged with felony counts of possession or purchase of narcotics and transportation or sale of narcotics.[15][16] Loaiza pleaded guilty to the charges in August, and was sentenced on March 8, 2019, to serve a three-year prison sentence. [1]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/Dodgers_Pitchers.jpg/300px-Dodgers_Pitchers.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Loaizaprint.jpg/1200px-Loaizaprint.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/99/Question_book-new.svg/50px-Question_book-new.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bf/Esteban_Loaiza_2005.jpg/200px-Esteban_Loaiza_2005.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Loaizaprint.jpg/220px-Loaizaprint.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Loaizaprint.jpg/1200px-Loaizaprint.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Esteban_Loaiza", "title": "Esteban Loaiza", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.13", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Loaizaprint.jpg/1200px-Loaizaprint.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}