{"url": "https://www.trustedreviews.com/news/iphone-8-vs-iphone-8-plus-3286235", "text": "iPhone 8 vs iPhone 8 Plus: Which Apple phone is the better iPhone 7 upgrade?\n\nSign Up to Amazon Prime Become an Amazon Prime Member and Get a 30 Day Free Trial Amazon Prime Day 2019 has been announced and will be 48 hours of madness across the 15 and 16 July. Now is the time to sign up to Prime and benefit from 30 days free to benefit from the exclusive deals.\n\nSign-Up for Amazon Prime 12 month membership Amazon Prime Day 2019 has been announced and will be 48 hours of madness across the 15 and 16 July. In light of this, Amazon are slashing £20 off the 12 month membership. Deal expires 16th July. 30 Day Free Trial If you would prefer to try before you buy, sign up here and get 30 days free to benefit from the exclusive deals.\n\nRelated: Amazon Prime Day 2019\n\nWe didn’t hide our opinion that last year’s iPhone 7 was one of Apple’s most disappointing releases in recent memory. Despite having Apple’s famous chic and wealth of top-end hardware, the device was let down by one of the worst battery lives we’ve seen in a flagship smartphone. As a result, we mainly recommended buyers who could afford it to go for Apple’s pricier and larger iPhone 7 Plus phablet.\n\nThis year Apple seems to have learned from its mistakes and thrown everything but the kitchen sink at its latest trio of smartphones, the iPhone 8, iPhone 8 Plus and anniversary-edition iPhone X. Featuring top tech, Apple’s soon-to-be-released iOS 11 software, and pretty much every feature fans have wished for over the last 12 months, all the iPhones look set to be contenders for Phone of the Year.\n\nBut with the iPhone priced out of most regular buyers’ budget and the other two being at first glance very similar, knowing which iPhone is best for you is a tricky question to answer. Here to help we’ve created a definitive guide, breaking down what’s different between the iPhone 8 and iPhone 8 Plus.\n\nRelated: Amazon Prime Day Smartphone Deals\n\nO2 Tariff Offers\n\nTrusted Reviews has partnered with O2 to offer you tariff deals for must have products.\n\nBuy Now: Apple iPad Pro 10.5 (2GB) from £40/month, upfront £29.99 at O2\n\nBuy Now: Apple iPad 9.7 (2GB) from £27/month, upfront £5.99 at O2\n\nTrusted Reviews Exclusive iPhone XS Deal Apple iPhone XS – 60GB, £49pm with £175 upfront on O2 Giving you a crazy amount of data for the low price of just £49 a month, this monthly contract with O2 is an incredible deal that can't be missed if you want to be one of the first people to own an iPhone XS.\n\niPhone 8 vs iPhone 8 Plus: What’s the difference?\n\nFrom a distance both iPhones look pretty similar. Both have a reworked mixed-material design, featuring a custom glass back and front and aluminium sides. Some people may bemoan the move to glass, fearing the ever-present threat of cracking that an accidental drop poses, but Apple claim the iPhone 8 and iPhone 8 Plus’ skin is “the most durable glass in a smartphone” thanks to the use of a special laser-welded steel-and-copper reinforcing structure.\n\nWe’re not sure we’d want either to have an accidental meeting with a pavement, but glass definitely looks nice and has also let Apple build the Qi open wireless charging standard into both iPhones, which is supported in many airports.\n\nUnlike the iPhone X which has a close to a bezel-less, button-free design, both iPhone 8s have a physical home button and fingerprint scanner. Once again they both don’t feature a 3.5mm headphone jack, which will remain an annoyance for audiophiles.\n\nSadly, unlike their pricier iPhone X sibling, neither new iPhone has made the switch to an OLED panel, and use the same IPS screen tech as older iPhones.\n\nRelated: Best smartphones\n\nThe only major differences between the two is that the iPhone 8 has a smaller 4.7-inch Retina display and single-lens camera setup, while the iPhone 8 Plus has a larger 5.5-inch Retina display and dual-lens system.\n\nThe iPhone 8 will have a standalone 12-megapixel rear camera, while the iPhone 8 Plus will have a more impressive dual-lens rear camera with OIS that pairs a 12-megapixel ƒ/1.8 lens with a telephoto ƒ/2.8 lens.\n\nApple claims it’s managed to improve the iPhone 8’s image quality using a new ISP processor for photography that will let it capture 80% more light than the old iPhone. But the 8 Plus’ extra tech means it will likely be much better in difficult lighting conditions and has a few custom camera features you won’t get on the basic iPhone 8.\n\nThe coolest looking of these is a new Portrait Lighting mode. Available in the Portrait menu of the camera app, the mode maps a subject’s face using the two lenses and then you can adjust settings to create a variety of advanced lighting effects.\n\niPhone 8 Plus\n\nBoth iPhones will be sold with identical 64GB and 256GB storage options. There’s no word on how big each phones’ battery is.\n\nRelated: Best phablet\n\niPhone 8 vs iPhone 8 Plus: Which phone is more powerful?\n\nApple never discloses its iPhones’ full specifications at launch, so we can’t fully comment on which is more powerful. But from what little we know both phones should be a lot faster than their predecessors, thanks to their use of Apple’s brand-spanking-new A11 Bionic CPU. Both the iPhone 8 and iPhone 8 Plus run using the new 64-bit CPU which has a slightly atypical hexa-core design that pairs two high-performance cores with four high-efficiency cores. Apple claims the cores are 70% faster than the A10’s and is significantly more power efficient.\n\nThe iPhone 8 and 8 Plus also feature a new Apple-designed three-core GPU that the company claims is three times faster than the A10’s graphics. If any of the performance claims ring true the two phones should be serious performers and deal with everything from hardcore gaming to 4K video recording and multi-tab web browsing hassle-free. The only potential performance differentiation between the two will be memory. In the past the Plus iPhone variants have always had more RAM than their smaller siblings.\n\nRelated: iPhone 9\n\nFor a full spec comparison, check out the table below:\n\niPhone 8 iPhone 8 Plus Screen 4.7-inch Retina Display 5.5-inch Retina Display Display Resolution 1334 x 750 1920 x 1080 Aspect Ratio 16:9 16:9 Primary Camera 12-megapixel rear camera, ƒ/1.8 Dual lens rear camera: 12MP, ƒ/1.8 with telephoto, ƒ/2.8 (OIS) Secondary Camera TBA TBA Chipset A11 Bionic A11 Bionic RAM TBA TBA Storage 64GB/256GB 64GB/256GB Battery Capacity TBA TBA Waterproof? Yes Yes Fingerprint Scanner? Yes Yes Headphone Jack? No No Primary Port Lightning Lightning Iris Scanner? No No Wireless Charging? Yes Yes Micro SD Slot? No No Dimensions TBA TBA Weight TBA TBA Software iOS 11 iOS 11\n\nRelated: Best iPhone\n\niPhone 8 vs iPhone 8 Plus Summary\n\nBoth the iPhone 8 and iPhone 8 Plus follow the same format as their predecessors. Featuring a larger screen, more advanced camera, the iPhone 8 Plus will likely be a better choice for phablet fans and people who care about camera tech, but with pricing starting at $799, it’s $100 more expensive than the basic iPhone 8.\n\nWith the added allure of the even more swanky iPhone X further complicating things, this could make the basic iPhone 8 the default choice for most buyers where budget is a concern, though we won’t know this until we’ve had a chance to test all the new iPhones.\n\nWhat do you think of the iPhone 8 and iPhone 8 Plus? Let us know in the comments.\n\nSign up for the Trusted Reviews Newsletter News, competitions and exclusive offers direct to your inbox Sign Up Show More", "images": ["https://ksassets.timeincuk.net/wp/uploads/sites/54/2017/09/iphone-8-3.png", "https://www.trustedreviews.com/wp-content/themes/simba-theme/assets/images/placeholder.png", "https://ksassets.timeincuk.net/wp/uploads/sites/54/2018/10/tr-logo-large-1.png"], "top_img": "https://ksassets.timeincuk.net/wp/uploads/sites/54/2017/09/iphone-8-3.png", "keywords": [], "authors": ["Alastair Stevenson"], "canonical_link": "https://www.trustedreviews.com/news/iphone-8-vs-iphone-8-plus-3286235", "title": "iPhone 8 vs iPhone 8 Plus: Which should you pick?", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "iPhone 8 vs iPhone 8 Plus: We compare the specs, feature, price and release date to reveal which new iPhone is the best upgrade from your old iPhone 7.", "robots": "noodp", "og": {"locale": "en_US", "type": "article", "title": "iPhone 8 vs iPhone 8 Plus: Which should you pick?", "description": "iPhone 8 vs iPhone 8 Plus: We compare the specs, feature, price and release date to reveal which new iPhone is the best upgrade from your old iPhone 7.", "url": "https://www.trustedreviews.com/news/iphone-8-vs-iphone-8-plus-3286235", "site_name": "Trusted Reviews", "updated_time": "2018-09-26T15:49:13+01:00", "image": {"identifier": "https://ksassets.timeincuk.net/wp/uploads/sites/54/2017/09/iphone-8-3.png", "width": 938, "height": 486}}, "article": {"publisher": "https://www.facebook.com/TrustedReviews/", "tag": "iPhone", "section": "Tech news", "published_time": "2017-09-17T14:05:21+01:00", "modified_time": "2018-09-26T15:49:13+01:00"}, "twitter": {"card": "summary_large_image", "description": "iPhone 8 vs iPhone 8 Plus: We compare the specs, feature, price and release date to reveal which new iPhone is the best upgrade from your old iPhone 7.", "title": "iPhone 8 vs iPhone 8 Plus: Which should you pick?", "site": "@trustedreviews", "image": "https://ksassets.timeincuk.net/wp/uploads/sites/54/2017/09/iphone-8-3.png", "creator": "@monkeyguru"}, "eagle_website": "trusted-reviews", "eagle_env": "production", "eagle_version": "2.25.26", "eagle_uid": "post-3286235", "eagle_category": "mobile-phones", "eagle_brand": "Apple", "eagle_price": "{\"GBP\":\"\"}", "eagle_page_type": "post", "eagle_content_id": 3286235, "eagle_page_date": 1505657121, "fb": {"pages": 38275114220}, "msapplication-TileImage": "https://ksassets.timeincuk.net/wp/uploads/sites/54/2017/07/cropped-trusted-reviews-icon-3-270x270.png"}, "movies": [], "publish_date": 1505653521.0, "source": "https://www.trustedreviews.com", "summary": ""}