{"url": "https://en.wikipedia.org/wiki/GLOW_(TV_series)", "text": "American comedy-drama television series\n\nGLOW is an American comedy web television series created by Liz Flahive and Carly Mensch.[1] The series revolves around a fictionalization of the characters and gimmicks of the 1980s syndicated women's professional wrestling circuit, the Gorgeous Ladies of Wrestling (or GLOW) founded by David McLane.[2] The first season consists of 10 episodes[3] and was released on Netflix on June 23, 2017.[4] On August 10, 2017, Netflix renewed the series for a second season of 10 episodes, which premiered on June 29, 2018.[5] The series was renewed on August 20, 2018 for a third season, which is scheduled to premiere on August 9, 2019.[6]\n\nPremise [ edit ]\n\nIn Los Angeles in 1985, Ruth Wilder, a struggling actress, auditions along with many other women in a fledgling professional wrestling promotion called the Gorgeous Ladies of Wrestling (GLOW). She is at odds with GLOW's director Sam Sylvia due to her tendency to overact. When Ruth's former best friend, retired soap opera actress Debbie Eagan, arrives at the ring, their confrontation promises to either make or break the show.\n\nCast [ edit ]\n\nMain [ edit ]\n\nRecurring [ edit ]\n\nGuest [ edit ]\n\nElizabeth Perkins as Birdie\n\nIn addition to Kia Stevens (who has wrestled as Awesome Kong in TNA, and as Kharma in WWE) in a main role, several professional wrestlers made cameos throughout the seasons. These include John Hennigan as Salty \"The Sack\" Johnson, a trainer who appeared in the first episode of Season 1; Tyrus and Carlos Edwin, who played Carmen's wrestler brothers; Joey Ryan as a wrestler known as \"Mr. Monopoly\", and Ryan's real-life wife and wrestler Laura James played his valet, \"Crystal\"; Alex Riley played a wrestler known as \"Steel Horse\"; Brooke Hogan as night club manager Amber Fredrickson; Chavo Guerrero Jr. as Chico Guapo; and Christopher Daniels and Frankie Kazarian as unnamed wrestlers. Hulk Hogan, Ric Flair, and Gorgeous George appear in archived video footage in episodes 1 and 4.\n\nProduction [ edit ]\n\nThe idea for the series came when Flahive and Mensch, who at the time were looking to make a new female-centric show, came across the 2012 documentary GLOW: The Story of the Gorgeous Ladies of Wrestling.[18][19] Before this, neither woman had heard of the GLOW wrestling promotion, and they became intrigued by the premise of producing a fictionalized version of it.[19] Both women found the storyline intriguing as a way of exploring the aftermath of the 1970s Woman's Liberation Movement, with Flahive telling Rolling Stone, \"We wanted to look back on the 1970s, coming out of the women's movement, and into the 1980s, and ask the question: Did it work? Did things get better?\"[18] To this end, it was important for the series to maintain a tension between whether the league was exploiting women or empowering them.[18]\n\nUrsula Hayden, the owner of the GLOW company, served as a consultant on the series and helped Flahive and Mensch with creating the show. Hayden was also on the original 1980s promotion as Babe, the Farmer's Daughter.[20]\n\nChavo Guerrero Jr. of the famous Guerrero wrestling family also served as a consultant on the series and helped train the actresses. His uncle Mando Guerrero had served in the same role for the original series.[21]\n\nFilming [ edit ]\n\nThe series was shot on several locations in Los Angeles; mainly in the San Fernando Valley. Chavo's Boxing Gym, which is GLOW's training grounds, was a combination of two locations: the interior was a studio set while the exterior was the rear of the San Fernando Masonic Lodge. The Pink Motel in Sun Valley was used as a stand-in for The Dusty Spur Motel, GLOW's sleeping quarters. Other notable locations include the Mayan Theater and the Hollywood Palladium.[22]\n\nPrincipal production on season 2 commenced in October 2017.[23]\n\nMarketing [ edit ]\n\nFor the Spain Market, Netflix España released a series of promo videos featuring singers Marta Sánchez and Vicky Larraz. The first video, titled \"No Controles\", features Sánchez imitating Ruth's imaginary wrestler scene from the first episode. The second video has Sánchez and Larraz squaring off in the ring.[24][25]\n\nFor the Brazil market, Netflix Brasil released a promo video featuring singers Gretchen and Rita Cadillac auditioning for GLOW.[26]\n\nFunko will release Pop! Vinyl figures of Ruth and Debbie in mid-2018.[27]\n\nSoundtrack [ edit ]\n\nThe series features several songs from the 1980s, as well as tracks from the 1950s, 1960s, and 1970s.[28] The episode 1 opening theme for Seasons 1-2 is \"The Warrior\" by Scandal.\n\nSeason 1 songs\n\nSeason 2 songs\n\nQuiet Riot's cover of \"Cum On Feel the Noize\" was used for the Season 1 trailer, while \"Maniac\" by Michael Sembello was used for the Season 2 trailer. Songs covered by the cast include the Thompson Twins' \"Hold Me Now\" and Barbra Streisand's \"This Is One of Those Moments\".[28]\n\nEpisodes [ edit ]\n\nSeason Episodes Originally released 1 10 June 23, 2017 ( ) 2 10 June 29, 2018 ( )\n\nSeason 1 (2017) [ edit ]\n\nNo.\n\noverall No. in\n\nseason Title Directed by Written by Original release date 1 1 \"Pilot\" Jesse Peretz Liz Flahive & Carly Mensch June 23, 2017 ( ) Ruth Wilder, an actress struggling to find work, receives an invitation for an audition from her casting director. She arrives at an old boxing gym, where she and dozens of other women are auditioning for Gorgeous Ladies of Wrestling (GLOW). On the first day of tryouts, Ruth is dismissed by director Sam Sylvia when her acting skills come into conflict with the training; her day worsens when her purse is snatched by a group of skateboarders. With nowhere else to go, she begins watching professional wrestling videos to develop her persona and returns to the gym for another shot at the audition. Things go awry when her best friend Debbie Eagan confronts her after discovering that she has been having an affair with her husband Mark. Their legitimate catfight in the ring inspires Sam to keep Ruth in the program. 2 2 \"Slouch. Submit.\" Wendey Stanzler Liz Flahive & Carly Mensch June 23, 2017 ( ) During the second week of tryouts, Sam tests the candidates' personalities. He then leaves the training to Cherry Bang while he goes out to try and get Debbie to be the star of his promotion. Tensions arise in the ring when Melrose reveals Cherry's previous affair with Sam and Cherry locks her in a sleeper hold. Melrose further mocks Cherry by faking a miscarriage with a bottle of ketchup. Sam uses the incident and Ruth's affair with Mark to brainstorm on a storyline in the ring. At the end of the day, Sam promises Cherry double her pay if the promotion pulls through. Ruth discovers that Sam will cast her as Debbie's evil arch-nemesis, much to her chagrin. 3 3 \"The Wrath of Kuntar\" Claire Scanlon Nick Jones June 23, 2017 ( ) The ladies meet their producer Sebastian \"Bash\" Howard while Sam hands them a script for them to work on, with Ruth reading stage directions. After the script reading session, Bash invites everyone to a party at his Malibu mansion, with Debbie riding in his helicopter. There, Bash brings the ladies to his dressing room to help them further develop their in-ring personas while Ruth puts a drunk Debbie in a taxi back home. As the ladies flaunt their new outfits, Sam and Bash argue over the direction they want the promotion to go. Following the argument, Sam agrees to work with Bash's vision of giving the girls stereotypical gimmicks. The girls pass on their persona tests except for Ruth, who leaves Sam and Bash clueless over her character. 4 4 \"The Dusty Spur\" Melanie Mayron Sascha Rothchild June 23, 2017 ( ) With five weeks left before shooting GLOW's pilot episode, Sam and Bash announce that the ladies will stay at The Dusty Spur motel in Van Nuys as part of their training. As Ruth struggles to find her character, she is assigned to work with Sheila the She-Wolf. Training is interrupted by Carmen's father Goliath Jackson and her two brothers, who urge her to go home instead of pursuing a wrestling career. After Goliath slaps Sam, Carmen agrees to leave the gym, but Bash fakes an affair with her to convince Goliath to let Carmen make her own decisions. The ladies and Cherry's husband Keith watch one of Sam's old horror films, only to discover his find-a-date video recorded over it. Meanwhile, Ruth gets into an argument with Sheila after discovering a dead squirrel in her bed while Debbie moves into the motel after another quarrel with Mark. 5 5 \"Debbie Does Something\" Phil Abraham Rachel Shukert June 23, 2017 ( ) As the ladies continue their training, Sam and Bash have a meeting with K-DTV executive Glen Klitnick, who offers GLOW a Saturday morning timeslot and a potential sponsor in the form of indoor/outdoor lifestyle store chain Patio Town. Debbie has her parents take care of her son while she continues her training. Dawn and Stacey spend the night making prank calls to everyone in the motel while Justine is heavily attracted to pizza delivery boy Billy Offal. Ruth and Rhonda travel to Patio Town's new Calabasas branch to meet CEO Patrick O'Towne, who declines to sponsor GLOW until Sam convinces him to reconsider by staging a vignette with Ruth during the ribbon cutting ceremony. It is here that Ruth develops her Soviet gimmick, but shortly learns of Sam's affair with Rhonda. Meanwhile, Melrose joins Debbie and Carmen to watch a local wrestling show, where Debbie discovers the thin line between wrestling and soap operas. 6 6 \"This Is One of Those Moments\" Kate Dennis Jenji Kohan June 23, 2017 ( ) Sam calls in Ruth and Debbie early morning at the gym to build them both as main eventers. Ruth sells an idea for the match, but Debbie walks out, still refusing to work with her former best friend. To further develop her character, Ruth asks for help from Gregory, the motel's Russian manager, who takes her to a Russian Jewish family party. When Michael, the bris celebrant, overhears Ruth talking about Yentl, he asks her to sing one of Barbra Streisand's songs. Meanwhile, Debbie is having difficulty taking in-ring storylines while Justine confronts Sam over him using GLOW as his personal casting couch. After much convincing by Sam, Debbie finally decides to start a program with Ruth. Later that night, Justine sneaks into Sam's office and steals his camera. 7 7 \"Live Studio Audience\" Jesse Peretz Rachel Shukert June 23, 2017 ( ) As the ladies gear up for their first show on Friday, Sam and Bash argue over production costs, especially after Sam's camera was stolen. In order to make the best possible main event, Ruth and Debbie begin training with Carmen's brothers. Meanwhile, Sam discovers that Rhonda found his camera in her locker, but he knows that Justine was trying to frame her. On the night of the show, Carmen experiences stage fright and passes out after leaving the gym. The scheduled tag team match goes awry when Dawn and Stacey wear Ku Klux Klan outfits in the ring. After coming to, Carmen discovers that Bash has been cut off financially by his mother after spending over $600,000 on developing GLOW. Debbie and Ruth's training pays off as they both get over the crowd on their main event, but Debbie suddenly walks out of the match when she sees Mark and argues with him backstage before he hands her the divorce papers. Rhonda saves the show by getting the other ladies to rap with her in the ring. 8 8 \"Maybe It's All the Disco\" Sian Heder Nick Jones June 23, 2017 ( ) Sam takes Ruth to the Mayan Theater[22] as a potential venue for GLOW's next show. Mark admits to Debbie that he never meant to serve the divorce paper to her and that he has been taking therapy sessions to help fix their marriage. Meanwhile, the ladies celebrate Sheila's birthday by taking her to a roller disco, Rhonda breaks up with Sam, and Ruth secretly undergoes an abortion after her pregnancy test comes out positive. 9 9 \"The Liberal Chokehold\" Lynn Shelton Liz Flahive & Carly Mensch June 23, 2017 ( ) While most of America is focused on the TWA Flight 847 hijacking, K-DTV executives present Sam and Bash the timeslot for GLOW (following Dr. Gene Scott, a 1970s staple of KHOF-TV), but Sam discovers that Bash is strapped for cash. In order to raise the $9,000 to secure the venue, the ladies host a bikini car wash at the motel. When they collect only $287 and change from their car wash, Bash brings them to his mother's anti-drug charity event to speak as former drug addicts using wrestling as a reformation tool. Their act convinces Bash's mother to allow them to use their ballroom at the Hayworth Hotel. Meanwhile, after confiding with Justine over his failed projects, including the loss of the venue reservation, Sam discovers that she is his illegitimate daughter. 10 10 \"Money's in the Chase\" Tristram Shapeero Liz Flahive & Carly Mensch June 23, 2017 ( ) As the ladies pack up for the Hayworth, a drunk Sam returns to the motel to try and mend things with Justine while Debbie bails out to move back in with Mark. Ruth puts herself in charge of the event. With hardly any attendance in the ballroom, Tammé, Melrose, and Sheila pay several moviegoers from the Hollywood Palladium[22] across the street to watch their show. Glen informs Cherry that she got the lead role in the station's upcoming cop drama series, but she has to quit GLOW in the process. The opening match goes out of control when the crowd does not take kindly to Arthie's \"Beirut the Mad Bomber\" gimmick and Rhonda is hit in the head with a beer can thrown by an audience member. Carmen overcomes her stagefright when her father starts cheering for her. The main event is a tag team match with Ruth and Jenny defeating Dawn and Stacey, only for Ruth to double-cross Jenny and pin her to win the GLOW Crown. Her coronation is suddenly interrupted when Debbie challenges her to a match. Debbie finishes off Ruth with a flying cross body to become the GLOW Champion. Tammé, however, steals the Crown as part of Sam's plan to continue the storyline.\n\nSeason 2 (2018) [ edit ]\n\nNo.\n\noverall No. in\n\nseason Title Directed by Written by Original release date 11 1 \"Viking Funeral\" Lynn Shelton Liz Flahive & Carly Mensch June 29, 2018 ( ) As the ladies prepare for their next episode, they discover that a new member named Yolanda has replaced Cherry in the role of Junkchain. They are also given new contracts by Sam and Bash. While Sam oversees the set construction at the gym, Ruth borrows new cameraman Russell and has the ladies shoot scenes at the mall for the show's title sequence. Meanwhile, Debbie tells Ruth that she will divorce Mark. Later that night, Debbie and Mark invite Glen over dinner and renegotiate the terms of her contract. The next morning, an infuriated Sam confronts Ruth over the title sequence and fires Reggie when she defends Ruth's decision to direct the sequence and the pilot episode. Debbie then reveals to Sam that she is now a producer of the show. 12 2 \"Candy of the Year\" Mark A. Burley Nick Jones June 29, 2018 ( ) The taping of the episode proves to be disastrous, with matches going too long in front of a bored audience. To solve this issue, Sam has the ladies audition matches for him to select the best three for the next episode. Ruth is assigned to work with Yolanda, who still does not have any in-ring experience, but they quickly bond when Yolanda teaches her breakdancing. Debbie arranges to have a producers' meeting with Sam and Bash at her home, but when they do not show up, Tammé comes in uninvited and keeps her company. Meanwhile, at Billy's band's concert, Justine gets in a fight with a crowd member and is kicked out of the venue. Sam slowly forms his father-daughter relationship with her by having her go to school. The next morning, Debbie, Sam, and Bash oversee the auditions. Dawn and Stacy steal Arthie's character change idea to evolve their Beatdown Biddies persona into \"The Toxic Twins\". Ruth and Yolanda's dance-off makes the cut, despite Sam's continued animosity towards Ruth. 13 3 \"Concerned Women of America\" Kate Dennis Sascha Rothchild June 29, 2018 ( ) When K-DTV receives complaints from the Concerned Women of America over GLOW's content, Bash and Debbie propose to produce a wholesome PSA spot to appease the group. Debbie and Ruth brainstorm on ideas for the PSA and come up with one about teen pregnancy. Meanwhile, Cherry struggles with her new starring role in Chambers and Gold, especially after the director decides to cut her lines and have her change her hair. Keith urges Sam to help Cherry in her situation. Sam realizes that Cherry's background in stunt work never prepared her for acting, and he talks Glen into bringing her back to GLOW. The ladies host a party at the motel to have sex with the male crew. Russell asks Ruth out on a date, but Debbie forces her to work overtime to finish the PSA, making her miss her date with Russell. 14 4 \"Mother of All Matches\" Mark A. Burley & John Cameron Mitchell Kim Rosenstock June 29, 2018 ( ) After receiving a phone call from Mark's new secretary over the brand of her bed, Debbie decides to sell off the bed and all the furniture in the house to spite her ex-husband. Tammé visits her son Ernest at Stanford University for parents' weekend, but when he becomes concerned about her new career, he insists on traveling with her back to L.A. for the next taping. In the main event, Debbie defeats Tammé to regain the GLOW Championship. The crowd suddenly turns on Debbie after Tammé is humiliated during the post-match segment and walks out of the ring. To get the crowd to support Debbie again, Ruth grabs a girl from the audience, announcing her as Liberty Belle's daughter Savannah Rose and issues a rematch to win her back. After the taping, Tammé explains to an upset Ernest her decision to join GLOW while Mark confronts Debbie at her now empty house. 15 5 \"Perverts Are People, Too\" Claire Scanlon Rachel Shukert June 29, 2018 ( ) The show experiences a setback when Patio Town pulls its sponsorship due to the chair incident during the main event and disagreements with the PSA, as well as low viewership ratings. While reading their fan mail, the ladies decide to set up a meet-and-greet table after the show. Sam, Debbie, and Bash explore story ideas to follow up the kidnapping angle, but leave Ruth out of the meeting. After a falling out with Florian over a bounced check, Bash, Carmen, and Rhonda look for Florian at a gay bar. Ruth meets with K-DTV president Tom Grant to discuss her future in the show, only to be sexually harassed by him before walking out on him. Bash goes to Birdie's home, where her butler Gary tells him that Florian stopped by a few days ago to borrow money for travel expenses. Gary then offers to help Bash with his bookkeeping. The next day, the producers discover that the show has been rescheduled to a 2:00 a.m. time slot. Ruth explains to Debbie that this is likely Grant's way of getting back at her, but Debbie berates her, telling her she should have had sex with him to save the show. 16 6 \"Work the Leg\" Lynn Shelton Marquita J. Robinson June 29, 2018 ( ) After learning that their original time slot has been given to a men's wrestling show, Sam and Bash tell the ladies to work harder. Tensions rise during training as the ladies vent their frustrations over their personal issues with each other until Carmen straightens them out. Later that night, Ruth and Sam attend a horror film festival that is playing one of his films, and they shortly resolve their issues before she tells him about her encounter with Grant. The next morning, Sam goes to K-DTV and destroys Grant's car. After encountering Mark's new lover, a frustrated Debbie is offered by Sam to use his office to change her clothes; there, she discovers his stash of cocaine. During the show, Debbie suddenly becomes aggressive and breaks Ruth's ankle. 17 7 \"Nothing Shattered\" Sian Heder Liz Flahive & Carly Mensch & Sascha Rothchild June 29, 2018 ( ) Ruth is rushed to the hospital while tensions rise between Sam and Russell after the latter drops his camera to help her out of the ring. After the ladies go home, Debbie pays Ruth a visit and they learn that Ruth has a fracture that will keep her out of commission for at least eight weeks, leading to a heated argument between the both of them. Sam confesses to Ruth that he cannot do the show without her, and Debbie returns to apologize to her. Before Ruth is discharged from the hospital, Sam agrees to her request to rehire Reggie, seeing that the show will be cancelled anyway. 18 8 \"The Good Twin\" Meera Menon Nick Jones & Rachel Shukert June 29, 2018 ( ) A pastiche of a GLOW on-air broadcast, complete with sketches, vignettes, wrestling matches, and music videos. Zoya's identical twin sister Olga (also played by Ruth) travels with her goat to America to help Liberty Belle rescue Savannah Rose from Zoya. Cherry returns to the ring as the voodoo practitioner \"Black Magic\", who dupes Britannica into sacrificing her brain to bring her love mannequin Thomas to life. The ladies get together to record a song about child kidnapping. Liberty Belle storms through the evil fortress and is challenged by Vicky the Viking. She overcomes the triple-team of Vicky, Fortune Cookie, and Beirut to finally rescue her daughter. Meanwhile, Justine's mother Rosalie watches the broadcast only to discover that her daughter is involved with the show. 19 9 \"Rosalie\" Phil Abraham Liz Flahive & Carly Mensch & Kim Rosenstock June 29, 2018 ( ) As the show reaches its finale, the ladies prepare to move out of the motel while Jenny hands out application forms for possible job openings. This results in a dilemma for Rhonda, as she has been working without a social security number all this time. Rosalie storms into Sam's home in an attempt to take Justine back home. Sam and Ruth convince Rosalie to allow Justine to go to a school dance with Billy. At the dance, Sam talks Justine out of moving with Billy to New York, and Justine decides to move back with her mother. Ruth limps out of the dance when Sam attempts to kiss her. Meanwhile, Debbie and Bash attend a cable TV convention and plot an elaborate scheme to attract other producers' attention to GLOW. Their plan works, as they receive calls from interested network producers. When Rhonda reveals that she has been marked as an illegal alien, Carmen proposes to save her from deportation by having her marry Cupcake, her biggest fan, in the show's final episode. Ruth goes to Russell's apartment to start a relationship with him. Bash is notified that Florian has passed away from AIDS. 20 10 \"Every Potato Has a Receipt\" Jesse Peretz Liz Flahive & Carly Mensch June 29, 2018 ( ) Justine says goodbye to Sam before going back to Sacramento with Rosalie. Sam makes Ruth the show's co-director while Bash struggles to come to terms with Florian's death. Later, Sam discovers that Arthie has developed a romance with Yolanda. Before Rhonda and Cupcake exchange their vows, Bash suddenly objects to the marriage and proposes to her. Rhonda agrees to marry Bash, and Cupcake is immediately ejected from the ring. Bash then makes a battle royal out of the bouquet throwing ceremony for the GLOW Crown. Debbie, Carmen, and Sheila are the last ones standing when Big Kurt Jackson and Chico Guapo interrupt the match. The three ladies teach the men a lesson by throwing them out of the ring before resuming the fight for the bouquet. Ruth zip-lines from the ceiling to eliminate the trio and win the battle royal. After the show, Glen reveals that GLOW is property of K-DTV, preventing other networks from picking them up. However, Ray, the owner of a strip club chain, offers to have GLOW do its shows at the Riviera in Las Vegas. Ruth and Debbie say goodbye to their loved ones before they board the bus with the other ladies.\n\nReception [ edit ]\n\nGLOW was praised by critics upon its release; with Season 1 receiving a 95% approval rating from review aggregation site Rotten Tomatoes, the site's consensus being \"With spot-on 1980s period detail, knockout writing, and a killer cast, GLOW shines brightly.\"[29] Season 2 has a 98% approval rating, the site's consensus being \"Fearlessly led by its excellent ensemble, GLOW's second season adds a new layer of drama without sacrificing its self-effacing, delightfully silly humor.\"[30] The series has a Metacritic score of 81 out of 100, based on 37 critics.[31] Darren Franich of Entertainment Weekly gave the first season an A rating, calling it \"a silly-smart masterpiece, with an ensemble cast entirely made up of breakout characters\".[32] Sophie Gilbert of The Atlantic said, \"...it’s just a blast to watch women having so much fun. GLOW fully owns its campiness and its showy aesthetics, but it’s smart and subversive underneath the glitter.\"[33]\n\nThe series received mixed reactions from some of the original GLOW wrestlers. Jeanne Basone, who wrestled in the promotion as \"Hollywood\", commented that \"Some of the training and the gym and the outfits they get correct.\" Patricia Summerland, who played \"Sunny the California Girl\" in the promotion, saw Marc Maron's character Sam Sylvia as a stark contrast to original GLOW director Matt Cimber. Eileen O'Hara, who was known as \"Melody Trouble Vixen (MTV)\", felt that the series did not properly represent the promotion.[34] Lisa Moretti, who competed as \"Tina Ferrari\" and would go on to the greatest fame among GLOW alumni as Ivory in the WWF/WWE as a three-time WWF Women's Champion during the Attitude Era, said that she was relieved that the series isn't a documentary because it was more entertaining to have a mix between fact and fiction.[35]\n\nMore positive reception came from mainstream wrestling figures including Kurt Angle.[36] Ethan Sapienza of Slate noted accurate comparisons between the series and WWE as well as the various regional promotions that made up the National Wrestling Alliance during its heyday.[37]\n\nAccolades [ edit ]\n\nComic book [ edit ]\n\nOn December 5, 2018, IDW Publishing announced that a four-issue comic book series based on the show will be released in March 2019. The GLOW comic book series will be written by Tini Howard and illustrated by Hannah Templer.[53][54][55][56]\n\nIn media [ edit ]\n\nSydelle Noel, Britney Young, Kia Stevens, and Jackie Tohn made a cameo appearance as their GLOW characters in the music video for the 2017 Katy Perry song \"Swish Swish\".[57]\n\nReferences [ edit ]", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/1/17/Glow_TV_show_logo.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/GLOW_(TV_series)", "title": "GLOW (TV series)", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.13", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}