{"url": "https://www.cinemablend.com/television/1740080/riverdale-stars-join-jimmy-fallon-for-hilarious-peanuts-spoof", "text": "Riverdale Stars Join Jimmy Fallon For A Hilarious Peanuts Spoof Mick Joest Random Article Blend In just two seasons, Riverdale has transformed from a bizarre Archie spin-off that some instantly wrote off to The CW's second most-watched show. The drama's success likely has more than just Netflix executives curious about what other seemingly innocent characters can be successfully rebooted with a dark twist, and The Tonight Show Starring Jimmy Fallon has already pushed another one out to the masses, complete with Riverdale's cast. Can Jimmy Fallon's Peanuts spoof be the next big thing in teen-oriented programming? Only one way to find out, blockheads. Facebook\n\n\n\n\n\ncinemablend\n\n\n\nEmail Whoever wrote up that sketch for The Tonight Show needs a raise ASAP, as that was ridiculously hilarious. Jimmy Fallon played a great modern take on Charlie Brown, although he didn't get insulted nearly as much as the Charlie Brown we all know from back in the day. This take on Charlie Brown was a lot closer to KJ Apa's brooding portrayal as Archie Andrews, and yes, that does include writing songs and showing them to friends. For those that don't watch Riverdale, Archie also had a romantic affair with his teacher, although the Riverdale adults are a lot more intelligible than the Peanuts elders. Considering how often the RHS teens listen, though, the adults might as well be speaking gibberish! Perhaps the most hilarious thing about thisTonight Show sketch is how closely it follows Season 1 of Riverdale. The dead teen, the school dance, the constant mist, the dramatic asides that invade personal space -- it's all pretty consistent with The CW's hit series. Sadly, none of the actual cast members of Riverdale were seen until the tail end of the sketch, which is a real shame since Cheryl Blossom actress Madelaine Petsch would've made a killer Peppermint Patty. Hopefully, this isn't the last parody The Tonight Show does of Riverdale, since there's more than enough craziness happening in Season 2 to warrant Jimmy Fallon's reprisal as Charlie Brown for Round 2 next year. Just the thought of a short sketch in which Charlie Brown consults Lucy at the therapy booth about the town's serial killer in town should be enough to get some pens scratching paper in The Tonight Show writers room. If it isn't meant to be, at least Riverdale fans got more than a few chuckles out of this hilarious parody. The Tonight Show airs weeknights on NBC at 11:35 p.m. ET, and Riverdale's midseason finale airs Wednesday, December 13, at 8:00 p.m. ET. For more on other television that have yet to premiere in 2017, visit our fall premiere guide. For a look at some shows that will be coming to television in 2018, our midseason premiere guide is a great resource to bookmark. Those wanting to see what shows weren't so lucky in 2017, visit our cancellation guide. Why Stephen Amell Wanted Arrow to End with Season 8 Blended From Around The Web\n\nBack to top", "images": ["data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR4nGNaOxMAAfwBSW8IE8UAAAAASUVORK5CYII=", "https://ct.pinterest.com/v3/?tid=YourTagID&noscript=1", "https://i.imgur.com/EmLcl1s.gif", "https://sp.analytics.yahoo.com/spp.pl?a=1000772689113&.yp=431002", "https://img.cinemablend.com/quill/8/c/5/3/9/5/8c53958681a53dafe58a8eaa702ca0ff7c670b6c.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=21229662&cv=2.0&cj=1"], "top_img": "https://img.cinemablend.com/quill/8/c/5/3/9/5/8c53958681a53dafe58a8eaa702ca0ff7c670b6c.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.cinemablend.com/television/1740080/riverdale-stars-join-jimmy-fallon-for-hilarious-peanuts-spoof", "title": "Riverdale Stars Join Jimmy Fallon For A Hilarious Peanuts Spoof", "meta_data": {"msapplication-TileColor": "#f5aa06", "msapplication-config": "/static/browserconfig.xml", "theme-color": "#ffffff", "article": {"tag": "riverdale", "publisher": "https://www.cinemablend.com/", "published_time": "2017-12-13T19:39:31+00:00", "modified_time": "2018-10-08T21:17:50+00:00", "section": "television"}, "CinemaBlend": 10042, "page": "story", "description": "Riverdale and Peanuts collide for a moody parody anyone can enjoy.", "robots": "all", "msvalidate.01": "9AA1A3C35B6D716AE80C1B615C6E8FE8", "fb": {"pages": 90893081682, "app_id": 956050344476201, "admins": 585420252}, "og": {"title": "Riverdale Stars Join Jimmy Fallon For A Hilarious Peanuts Spoof", "url": "https://www.cinemablend.com/television/1740080/riverdale-stars-join-jimmy-fallon-for-hilarious-peanuts-spoof", "image": {"identifier": "https://img.cinemablend.com/quill/8/c/5/3/9/5/8c53958681a53dafe58a8eaa702ca0ff7c670b6c.jpg", "width": 600, "height": 350}, "description": "Riverdale and Peanuts collide for a moody parody anyone can enjoy.", "type": "article", "site_name": "CINEMABLEND"}, "twitter": {"title": "Riverdale Stars Join Jimmy Fallon For A Hilarious Peanuts Spoof", "description": "Riverdale and Peanuts collide for a moody parody anyone can enjoy.", "image": "https://img.cinemablend.com/quill/8/c/5/3/9/5/8c53958681a53dafe58a8eaa702ca0ff7c670b6c.jpg", "card": "summary_large_image", "site": "@cinemablend", "url": "https://www.cinemablend.com/television/1740080/riverdale-stars-join-jimmy-fallon-for-hilarious-peanuts-spoof"}}, "movies": ["https://www.youtube.com/embed/tUBLW5bCqfM?start=None"], "publish_date": 1513193971.0, "source": "https://www.cinemablend.com", "summary": ""}