{"url": "https://rollingout.com/2017/12/01/trouble-paradise-3-best-moments-platinum-life-episode-7/", "text": "“The Platinum Life” series follows the first-class lifestyle of beautiful, savvy women and their superstar spouses. Can the girls vow to have a good time on their trip and leave the drama behind in Los Angeles? Things go south of the border after Asiah invites this spicy group to support her at a very important photoshoot campaign in Mexico. Check out the top highlights of episode seven below.\n\nNazanin Mandi and Lola Monroe cancel on the girls’ trip\n\nAsiah Collins, model, and wife of Kid Ink, invites all the girls to Cancun. However, Nazanin Mandi has to withdraw her RSVP. After pushing back her nuptials to R&B crooner, Miguel she chooses to focus on the completion her own upcoming EP. Lola Monroe also chooses to secure the bag over the girls’ trip. She stays behind to work on her music project and listening party that she has to put together for media and record executives—it’s the beginning of her comeback. Asiah is a bit disappointed because Naz and Lola Monroe are the mediators amongst the crew and she has a strong feeling she will need their help just in case the ladies get out of control.\n\nShantel and La’Myia finally settle their feud\n\nThe girls arrive in Cancun to a beautiful villa and first things first, they attempt to bring La’Myia Good and Shantel Jackson together after feuding in Las Vegas. These two finally sit down and discuss the previous weeks full of dramatics that seemed out of character for both of them who’ve known each other for a while. After hearing Shantel’s explanation, La’Myia quickly realizes that someone has been in Shantel’s ear spreading false info. They agree that there is no longer any bad blood and decide to push their issues aside and turn up properly at the beautiful Mexican resort.\n\nDrama erupts on the beach\n\nBack at the villa, wife of Neyo, Crystal Smith and her tag-along friends from back home discuss the tension between her and Alycia Bella. Fast-forward, while Asiah rocks out at her Ethika swimsuit shoot on the beach, she hears Crystal’s friends yelling expletives and throwing up gang signs directed towards her. In the midst of anger and confusion, words fly fast as the crew has to stop filming and drag Asiah off the set before it gets too rowdy … so much for a paradise getaway. After the incident, the crew had no choice but to stop filming completely. However, the drama continued back in the villa and it’s the girl’s vs Crystal all over again. Crystal’s belligerent behavior results in her being sent home immediately — the group agrees that she has been the continuous cause of drama between everyone for a long time. Bye, Felicia!", "images": ["https://rollingout.com/wp-content/uploads/2017/12/e-online-Shantel-Asiah-and-Alycia-look-on-as-Crystals-friends-cause-drama-at-the-Ethika-Photo-shoot.jpg?x12879", "https://rollingout.com/wp-content/uploads/2017/12/crystal-listens-as-asiah-checks-her-for-talking-bad-about-Blanca-960x540.jpg?x12879", "https://rollingout.com/wp-content/uploads/2017/11/Sharde-Monet_avatar_1509984385-164x164.jpg?x12879", "https://rollingout.com/wp-content/uploads/2017/12/shantel-and-lamiya-phot-collage-via-eonline-960x712.jpg?x12879", "https://rollingout.com/wp-content/uploads/2018/06/ro-logo-18.png?x12879", "https://rollingout.com/wp-content/uploads/2019/06/fcclub.jpg?x12879", "https://rollingout.com/wp-content/uploads/2019/05/sws2b.jpg?x12879", "https://rollingout.com/wp-content/uploads/2018/06/ro-logo-18-100.png?x12879", "https://rollingout.com/wp-content/uploads/2017/12/hqdefault-eonline.jpg", "https://www.facebook.com/tr?id=666484143716324&ev=PageView\r\n&noscript=1", "https://rollingout.com/wp-content/uploads/2017/12/eonline-lola-monroe-960x712.jpg?x12879"], "top_img": "https://rollingout.com/wp-content/uploads/2017/12/hqdefault-eonline.jpg", "keywords": [], "authors": ["Sharde Monet"], "canonical_link": "https://rollingout.com/2017/12/01/trouble-paradise-3-best-moments-platinum-life-episode-7/", "title": "Trouble in paradise: 3 best moments from ‘The Platinum Life’ episode 7", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, user-scalable=1", "google-site-verification": "0Yj3tUrHdnc2yWCwimJKlw92aQSuA-NlLsRRxJ8FFOI", "dailymotion-domain-verification": "dmo4qzl4r7iqtl9wm", "og": {"title": "Trouble in paradise: 3 best moments from ‘The Platinum Life’ episode 7", "description": "“The Platinum Life” series follows the first-class lifestyle of beautiful, savvy women and their superstar spouses. Can the girls vow to have a good time on their trip and leave the drama behind in Los Angeles? Things go south of the border after Asiah invites this spicy group to support her at a very…", "image": "https://rollingout.com/wp-content/uploads/2017/12/hqdefault-eonline.jpg", "url": "https://rollingout.com/2017/12/01/trouble-paradise-3-best-moments-platinum-life-episode-7/"}, "twitter": {"card": "summary_large_image", "description": "“The Platinum Life” series follows the first-class lifestyle of beautiful, savvy women and their superstar spouses. Can the girls vow to have a good time on their trip and leave the drama behind in Los Angeles? Things go south of the border after Asiah invites this spicy group to support her at a very…", "title": "Trouble in paradise: 3 best moments from ‘The Platinum Life’ episode 7 - Rolling Out", "site": "@rollingoutnews", "image": "https://rollingout.com/wp-content/uploads/2017/12/hqdefault-eonline.jpg", "creator": "@ShardeMonet"}, "generator": "WordPress 5.2.1"}, "movies": [], "publish_date": 1512104400.0, "source": "https://rollingout.com", "summary": ""}