{"url": "https://www.pastemagazine.com/articles/2018/01/the-50-best-movies-on-hbo-go-and-hbo-now-january-2.html?p=2", "text": "25. The Old Man & the Gun\n\nYear: 2018\n\nDirector: David Lowery\n\nOf the many things that David Lowery’s The Old Man & the Gun does right, staying fixated on Redford’s face is the smartest. Redford, in what he has said is his last performance (though he’s since backtracked from that), plays Forrest Tucker, who, we learn at a calm, leisurely pace, is a lifelong bank robber. And I really mean lifelong: He’s still at it in his eighties in the year 1981, with a small, equally elderly crew (played by Danny Glover and Tom Waits!), hitting banks across the Southwest with precision, intelligence and, more than anything else, a disarming politeness. (All his victims keep remarking how friendly he is.) Meanwhile, a Texas cop (Casey Affleck), dissatisfied with his career, trails him and becomes part of a cat-and-mouse game, with Tucker leaving him playful notes and even, in one terrific scene, popping in on him in the bathroom. The lifelong rogue, who has spent most of his life being sentenced to prison and then busting out, also comes across a widow named Jewel (Sissy Spacek), and they have a gentle, wistful courtship. He clearly cares for her … but he’s a bank robber, and he’s never going to stop. Lowery pushes the story on with a style that’s both lively and laconic, like his star himself; the movie has the rhythm of a fun ’70s laid-back thriller but a certain undeniable mournfulness about the passage of time, of growing old, of lessons learned. (There’s a scene with Redford and Spacek talking on the porch about how their younger lives feel like different people all together that leaves a warm haze that never lifts for the rest of the film.) Lowery wrote the script, and it shares several thematic similarities to his last film, A Ghost Story, also starring Affleck. That film was obsessed with the passage of time, to the point that time itself became almost the main character of its story, eternity’s indifference both awing and moving in equal measure. This film is much lighter and straightforward than that movie, but that idea of identity, and how it evolves and stays constant throughout the decades, is foregrounded here, as well. The story of both is the story of time, how it tricks us, and jolts us, and moves us, the person we are the same we have always been, but also not. The Old Man & the Gun is a jaunty joyride, a valedictory for a beloved American icon and a giddy true story. But Lowery ties it all together at the end: It’s a story about how the years go by, and who we are. It’s a story about all of us. —Will Leitch\n\n24. Teen Titans Go! to the Movies\n\nYear: 2018\n\nDirectors: Aaron Horvath, Peter Rida Michail\n\nWith Teen Titans Go! to the Movies, the long-running Cartoon Network series joins the ranks of still-running animated series that were deemed popular enough to get a movie of their very own. Much like The Simpsons Movie and South Park: Bigger, Longer & Uncut, the show’s creators use the opportunity to distill and put on display what has made the show so popular in the first place. The result is one of the funniest “superhero” films of the year, and one that allows Robin and company to join Deadpool—Statler and Waldorf style—on the balcony poking fun at the clichés, blindspots and foibles of the current Big Genre on Campus. When Teen Titans Go! debuted on Cartoon Network in 2013, its chibi design, juvenile humor and overall zany approach drew mixed reactions from fans of the source material. For some, it stemmed from the disappointment of not getting a renewed “serious” series. (The original Teen Titans animated series had ended seven years earlier.) For others, the succession of booty jokes—or any joke hammered at relentlessly for 10-11 minutes—quickly grew tiresome. In Teen Titans Go! to the Movies, creators Michael Jelenic and Aaron Horvath pull off what we’ll call a “reverse-Hobbit,” showing how the characters from those 11-minute bursts of mayhem stand up just fine to the “rigor” of an 88-minute theatrical release. (Granted, they have more than 200 episodes to draw from and no dearth of tired tropes to target.) The premise of “Robin wants his own movie. What must he do to get one?” is all the framework directors Horvath and Peter Rida Michail need to support a sustained skewering of the current frenzy of superhero moviemaking. —Michael Burgin\n\n23. O.G.\n\nYear: 2019\n\nDirector: Madeleine Sackler\n\nA man who’s committed a terrible crime faces a daunting re-entry into the world outside the walls. In prison he’s been a force, a guy who runs the place. He’s also been a penitent who wishes he could take it all back, and who’s learned the hard way to focus on “dignity, self-respect, and grace,” as he tells a newbie he finds under his wing. But we know, and so does he, that the power dynamics are about to change when he has to reintegrate. An ode to the tight close-up, Madeleine Sackler’s film O.G. stars Jeffrey Wright as Louis, an incarcerated man at the end of a 24-year prison term in Indiana. Shot in an active maximum-security prison and with many incarcerated men and prison staff taking their first turn in front of the camera, O.G. is nonetheless not about filming less-than-conventional actors in a gimmicky way; it’s naturalistic and tempered and organic. It’s committed to a plot-by-accretion, character-driven style, but it’s spare, tightly paced, and contains zero beard-stroking nonsense. It’s visually sophisticated, with subdued colors and bright panes of sunlight and beautifully rendered transitions and lavish close-ups. (Wright does a majority of the acting without saying a word.) Louis, under a veneer of detached calm, is in fact a pretty emotional man. He cares. About his family. About the pain he caused someone else’s family. About doing better, being better. He’s not a bodhisattva; there’s tremendous anger in him, and resentment, and wrath and defensiveness and humiliation. And, it seems—as his release draws closer and as he agrees to a confrontation with his victim’s sister—considerable fear he would rather not make visible. Fear of something happening to jeopardize his freedom, and perhaps greater fear of attaining it. This vivid emotional palette arises almost entirely between the lines in those amazing, lingering shots of Wright’s face. O.G. is an even-handed film in which the eruptions of violence in prison are not handled in a macho determination to be “edgy” or “gritty” or sensationalistic, and because of that it feels realistic. It is a delicate treatment of tough guys and a nonjudgmental look at a broken system, more focused on how men adapt to it than on taking audiences to school about why it’s unfair. The film assumes you know it’s unfair. It’s not going to bother patronizing you about it; it’s going to tell you a story about a decision that permanently altered the course of someone’s life. —Amy Glynn\n\n22. Traffic\n\nYear: 2000\n\nDirector: Steven Soderbergh\n\nAs long as the U.S. keeps demanding copious amounts of drugs, and Latin America keeps providing them, Traffic will remain relevant. Steven Soderbergh’s brutally honest (and therefore grim) ensemble drama about the lucrative-for-some, destructive-for-most drug trade between both halves of our continent plays out like a Cocaine Cowboys version of The Battle of Algiers. As in Gillo Pontecorvo’s masterpiece, Soderbergh employs a raw docudrama aesthetic with an even-handed narrative approach to sympathize with and scorn both sides of the issue in equal measure. Catherine Zeta-Jones’s drug kingpin might be a ruthless killer, but Stephen Gaghan’s script, based on a miniseries by Simon Moore, doesn’t shy away from establishing the economic desperation that pushes her to the edge. Michael Douglas’s conservative (and possibly alcoholic) drug czar might talk a good game in public about the U.S.’s no tolerance policy against drugs, but he can’t do anything but witness his daughter’s (Erika Christensen) descent into addiction. Soderbergh shot Traffic himself, and employed a clear blue-vs-yellow color palette between American and Mexican scenes, supporting his themes with clear visual cues. The yellows of Mexico, while warmer and naturalistic, communicate constant danger; the blues of the U.S. convey relative safety, but also moral coldness and emotional distance. Instead of offering any clear answers, Soderbergh and Gaghan stress the immediacy of the issue; their warnings remain unheard to this day. —Oktay Ege Kozak\n\n21. Leaving Neverland\n\nYear: 2019\n\nDirector: Dan Reed\n\nIt’s all heartbreaking. The damage to the psyches of children, certainly, but everything else is sad as hell, too: the endless voracious need for approval at any cost, the radioactive half-life of a lie, the emptiness at the center of fame, the way child abuse is a perpetual motion machine that infects one generation after another. In an oblique way, HBO’s Leaving Neverland is a reminder that the monstrous people who sexually abuse children do not simply drop out of the skies. They are forged. Created. Usually by abusers of their own. You look at Michael Jackson—his collapsing, bleaching face; his skinny little body; his soft, mealy speaking voice—and you can see a victimizer who was also a victim. If we could hold that perception and really understand it, would it change anything? The desire to withhold forgiveness from such people is deep and tenacious, and it’s more than understandable why that’s the case. No one tests the limits of forgiveness quite like someone who has molested children.\n\nThe four hours of Leaving Neverland are characterized by a cavernous sense of aural and visual space. The sound editing is almost uncomfortably intimate; I squirmed at the audible swallowing and breathing sounds in the interview segments. There’s also the way archival photo images are centered deeply in the frames—small, surrounded by black space, static. It’s elliptical, allusive. And effective. The testimony of the two alleged victims (and their mothers and their wives) is uncontested, and they do not affirmatively prove anything, but their stories strike so many of the same chords that you’d have to be awfully spaced out not to notice. The seduction of the boys’ star-struck and ambitious mothers. (Wade Robson’s mom relocated him from Australia to Hollywood, splitting up her family on the promise of Jackson’s mentorship and help.) The extended, extensive grooming process. Manipulative generosity. (A passage where James Safechuck describes Michael taking him to a jeweler to buy him a ring is especially creepy; apparently, Jackson had an elaborate story that James was helping him select something for a woman friend, and the kid’s delicate little fingers were the right size.) Creating a shared secret. We say people who hurt children don’t deserve to be forgiven, but just as it’s a mistake to see Leaving Neverland as a film about Michael Jackson, so is it a distraction to conflate forgiveness with releasing people from accountability. It doesn’t demand that viewers make a call on any of that, which is as it should be. It tells a piercingly sad and highly disturbing story that might or might not change how you feel about Michael Jackson, but will almost certainly draw a haunting, highly detailed sketch of the legacy of damage that ensues when someone violates children. —Amy Glynn\n\n20. Going Clear: Scientology and the Prison of Belief\n\nYear: 2015\n\nDirector: Alex Gibney\n\nAlex Gibney’s up-close examination of Scientology, its practices and the controversies that surround the religion founded by science-fiction writer L. Ron Hubbard is also a stirring portrait of eight former adherents, who tell their stories of how they came to practice Scientology and their reasons for leaving the church. While much of the ideological content in Gibney’s film has circulated on the Internet for years, there was still a number of items to be learned from watching the film and hearing from the men who made it. While Going Clear is part exposé and part condemnation of a controversial religion, director Gibney has said that he was most interested in “the journey of the key characters in the film”—and how people got lost in the ‘prison of belief.’” —Christine N. Ziemba\n\n\n\n19. Paradise Lost: The Child Murders at Robin Hood Hills\n\nYear: 1996\n\nDirectors: Joe Berlinger, Bruce Sinofsky\n\nIf you’ve never heard of the West Memphis Three, do some research before you begin—you’ll want to be prepared. Within only a minute of the film’s opening, as Metallica’s “Welcome Home (Sanitarium)” noodles forebodingly over pixelated camcorder videos, intolerable images taken straight from police evidence glance across frame, so quickly and frankly you’ll immediately question if they are, in fact, real. Of course, they are—they are images no person should ever have to see, and yet Joe Berlinger and Bruce Sinofsky use them only to expose the unbelievable horror at the heart of the appropriately named Paradise Lost. What unfolds over the following two and a half hours is just as heartbreaking: a trio of teenage boys (one with an IQ of 72) is put on trial for the brutal murders of three prepubescent boys, the only evidence against them a seemingly forced confession by the young kid with the below-average IQ, and laughably circumstantial physical proof. The film explores the context of West Memphis, its blindly devoted Christian population and how the fact that these teenagers dressed in black and listened to Metallica somehow led to their predictable fates at the hands of a comprehensively broken justice system. With surprising access to everyone involved in the trial, as well as a deft eye for the subtle exigencies of any criminal case such as this, Paradise Lost is a thorough, infuriating glimpse of the kind of mundane evil that mounts in some of America’s quietest corners. Welcome home. —Dom Sinacola\n\n18. Won’t You be My Neighbor?\n\nYear: 2018\n\nDirector: Morgan Neville\n\nMorgan Neville’s winning portrait Won’t You Be My Neighbor? withholds darkness. Which makes sense since the Oscar-winning director of 20 Feet From Stardom has turned his attention to Fred Rogers, a kindly TV personality who entertained a couple generations of kids with his benign PBS program Mister Rogers’ Neighborhood. Rogers died in 2003 at the age of 74, and this year marks the 50th anniversary of his landmark show, so expect plenty of tributes over the next several months. Appropriately, as an official chronicling of the man’s life and legacy, Won’t You Be My Neighbor? isn’t remotely innovative. We get polished interviews from colleagues, family members and Rogers’ widow. There are plenty of clips from his show, as well as other archival material. There’s a gimmick-y recurring use of animation to illustrate parts of his story that’s the only truly cloying element of a film that mostly eschews mawkishness. And yet, Won’t You Be My Neighbor? is a stunningly moving film that also feels just the teensiest bit radical. That word will be used a lot during this golden anniversary for Mister Rogers’ Neighborhood, as his fans remind everyone that, rather than starring a smiling square who couldn’t have looked less manly, the show was actually a pretty progressive program that frankly discussed everything from race relations to John F. Kennedy’s assassination. Neville accentuates Rogers’ unembarrassed sweetness as an example of his principled stand against bigotry and injustice, making the case with conviction and gusto.\n\nAt my True/False screening, the audience was warned before Won’t You Be My Neighbor? that we ought to have Kleenex in hand to prepare for what we were going to experience. I’m an unashamed movie crier, but I resent being prepped for how I should feel about a movie I’m about to see. And yet, the warning was warranted: The tears elicited from Won’t You Be My Neighbor? are a testament to Neville’s tasteful, loving (but not fawning) depiction of a decent, unassuming man. The movie’s not just a balm in the age of Trump—it’s an opportunity for viewers to reconnect with their own decency, and Neville’s gentle skill at arguing for goodness ends up being a minor miracle. —Tim Grierson\n\n17. Bessie\n\nYear: 2015\n\nDirector: Dee Rees\n\nIt may have taken 20 years to make it, but when Bessie finally arrived, she came, she saw and she conquered. The HBO film has garnered 12 well-deserved Emmy nominations, with Queen Latifah, co-stars Michael Kenneth Williams and Mo’Nique, and director Dee Rees all getting the nod. One scene in particular—with the reverse paper bag test—is one of Bessie’s finest moments, as it encompasses all that makes the HBO film so wonderful. There’s Queen Latifah in all her glory, finally setting up her own tour and making sure everyone knows who’s boss. There’s the hilarity when she lets down one of the hopefuls auditioning—“You must be darker than the bag to be in my show!” After all, Bessie is an incredibly funny movie at times. And there’s the whole inversion of the brown paper bag test. Where Bessie Smith grew up in a world that demanded black women performing back-up be lighter than a brown paper bag, Bessie makes up a new rule that gives her back some agency and sets a different tone (literally and figuratively) for her showcase. Bessie was, in no way, your average blues performer and for that reason Lili Fini Zanuck and her husband Richard D. Zanuck knew they couldn’t just deliver your average black-performer-who-grew-up-poor-and-made-it-big biopic. The familiar story of a talented woman done in by a man (or many men), or childhood tragedies, or her own celebrity was not Bessie’s story—she wasn’t lighter than a brown paper bag, and, thankfully, wasn’t presented as such. —Shannon M. Houston\n\n\n\n16. American Splendor\n\nYear: 2003\n\nDirectors: Robert Pulcini, Shari Springer Berman\n\nHarvey Pekar’s “American Splendor” books are fascinating: Pekar believed that even the most mundane and seemingly uncomplicated lives were worth documenting. American Splendor showcases this theory by combining real footage of Pekar, fictionalized versions of characters from his life—maintaining both stylized caricatures and naturalistic drama—and even animated segments pulled from the comics to create a cohesive whole that presents an ordinary life as a fascinating experience. —Ross Bonaime\n\n\n\n15. Crimes and Misdemeanors\n\nYear: 1989\n\nDirector: Woody Allen\n\n“Is there a God? And if so, is He watching?” Woody Allen’s somber meditation on this variant of the Big Question centers on two, vaguely interrelated stories: A successful ophthalmologist (Martin Landau) takes drastic measures to deal with an increasingly threatening mistress (Anjelica Huston) while a married filmmaker (Allen) finds himself attracted to the assistant (Mia Farrow) of his egotistical brother-in-law (Alan Alda). The events that follow leave the viewer uncomfortably aware of just how unanswerable some questions can be. This philosophical discomfort has only been heightened in the years since as it’s become much harder for some—and impossible for many—to enjoy Allen’s films in light of the accusations that have been leveled against him. This has especially been the case in films where Allen writes his stand-in character—often Allen himself—exhibiting the same school of misbehavior he’s accused of in real life. (See Manhattan.) In Crimes and Misdemeanors, this autobiographical gloss has additional resonance, as the script wrestles with whether misbehavior, even the most egregious, truly gets punished (and implies, if not, why not behave as you will?). It’s hard not to read the initial guilt, then relief and return to normalcy of Martin Landau’s character as, on some level, authorial wish fulfillment. —Michael Burgin\n\n\n\n14. Amélie\n\nYear: 2001\n\nDirector: Jean-Pierre Jeunet\n\nDelicate and delicious, Amélie is an easily, exceedingly lovable little French trifle. With the face of an angel, the heart of a child and the haircut of a Parisian pixie, Amélie Poulain (Audrey Tautou) sweeps us clean off our feet while Tautou launches herself into the American consciousness as the do-gooding waitress who sends her secret crush photos and riddles, masking her identity in order to make their first encounter—and first kiss—the most romantic moment of her life. Her fantastical adventures—in the name of idealized, even cinematic, coupling—unfold in flights of magical realism, Jean-Pierre Jeunet holding up love itself as both realistically magical and magically realistic. —Nick Marino\n\n13. The Tale\n\nYear: 2018\n\nDirector: Jennifer Fox\n\nJennifer Fox has just done something utterly brilliant, and you need to see it. Be prepared to feel uncomfortable, because The Tale, adapted from her narrative memoir of the same name, will do a number on your head, in the way that a particularly vivid nightmare sometimes can, whether you personally have a childhood sexual abuse story or not. This film was made three years ago. It’s not a response to or the property of any movement, any hashtag; it’s not finally, finally pulling back the veil on the terrible stories no one ever told until now. We have always told these stories. They have always existed and we have always told them. We just didn’t do it with hashtags. To even characterize this film as “a story about sexual abuse” would be a shallow read on a very deep work of art. The Tale is, at a certain level, “about” sexual abuse. But focus on that for too long and you’ll miss the astonishing, courageous, gorgeous mosaic of ways in which it is deliberately, doggedly and totally not. This is a film about the morphing quicksand terrain of human memory and it’s about the stories we tell ourselves in order to stay sane and most of all it’s about the Plinian, volcanic power of emotional honesty. If you want to talk about the spirit of the moment, the guiding spirit of the times, maybe we need to pan back from anything as specific as sexual abuse of girls and women and talk about why being honest is the ultimate act of revolution. Plenty of people make autobiographical films. The Tale is so deeply and specifically autobiographical that it almost becomes something else. Fox as director and writer puts her documentarian’s tools to work to create a meta-textual tapestry depicting the ways in which our memories inform (and misinform) our self-concept. And this beautiful, gripping, disturbing film deserves to be looked at with as much nuance as it offers. It manages to dive so deeply into the personal that it explodes into something universal. —Amy Glynn\n\n12. Drugstore Cowboy\n\nYear: 1989\n\nDirector: Gus Van Sant\n\nGus Van Sant’s sophomore feature film was the filmmaker’s huge breakout, earning him near-universal critical acclaim. And it’s ridiculously easy to understand why: Drugstore Cowboy is a propulsive, gripping slice of cinema. Based on a semi-autobiographical novel by James Fogle, Cowboy features an electric lead performance in Matt Dillon as Bob, a junkie who, along with girlfriend Diane (Kelly Lynch), friends Rick (James LeGros) and Nadine (a young Heather Graham), robs pharmacies while getting high on their supply in and around Portland, Ore. in 1971. The film veers wildly between bleak drug-addled hellscape, paranoid delusions and pitch-black comedy. That it does so in a way that is perfectly in service with—even elevating—the story being told is the best testament to the talent and discipline of Van Sant as a writer/director. And, really, who could resist a movie featuring both funny and tragic drug overdoses that actually casts William S. Burroughs as a junkie priest? —Scott Wold\n\n11. The Prestige\n\nYear: 2006\n\nDirector: Christopher Nolan\n\nIn The Prestige, two competing magicians try to outdo each other, but are really trying to achieve a brand of immortality. They are competing for the same audience’s faith, and they need all of it, because it is not something that can be shared (many religious institutions hold similar dogma for similar reasons). Each wants to invoke utter and absolute belief in their audiences, much like Nolan wants to do in his own, as if that achievement grants the doer divinity, whether or not it is built on tricks and illusions. Nolan begins the film with a trick, in fact, a shot of top hats littering the forest floor, with the voice-over asking, “Are you watching closely?” It is a shot out of time and place from the rest of the film, Nolan once again doing as he pleases, manipulating our perception of what we’re seeing and when so as to emulate the pledge, turn and prestige of the “magic” acts the film portrays. Our faith is built on lies we tell ourselves and others, Nolan seems to posit, and it’s a thesis on which he elaborates with his Dark Knight trilogy, insinuating that symbols are sacred not for their truth, but simply for what they inspire. —Chad Betz\n\n\n\n10. Deadwood: The Movie\n\nYear: 2019\n\nDirector: Daniel Minihan\n\nA decade has passed in Deadwood between the show’s finale and Deadwood: The Movie, and longer has come and gone in the real world. Beloved characters have vacated the town, passed away with the beloved actors behind them. Deadwood isn’t used to that much temporal space. The longest narrative gap it ever weathered over the course of its 2004-2006 run was a seven month stretch hastening an affair and a bonanza gold mine. It’s a show where events and episodes occur over hours, where the threat of even minor change can send its entrenched group of outcasts to the brothel-worn mattresses. As South Dakota looks to enter the United States, Deadwood is about to finish the painful pubescence it began during the show and finally grow up. It left off with seething, begrudging closure—the kind found after a lopsided armistice—when gold magnate George Hearst (Gerald McRaney) strong-armed Alma Garret (Molly Parker) into selling her lucrative claim by, among other things, having her husband murdered. With all parties in that conflict returning to town to celebrate this new statehood, irredentism and its dictatorial opposite come into conflict. Hearst may own the town, but nobody stays bitter like a Deadwood resident. Tragic reunions, new beginnings, and those signature beatings—all the run-ins, disappointments, and excitements good fan service requires are included in its wide-ranging story. And the funerals have gotten way more elaborate since Seth Bullock (Timothy Olyphant) and Sol Star (John Hawkes) buried the murderer Ned Mason in the show’s second episode.\n\nEveryone, including the protagonistic owners of the hardware store, gets a life update. Community leader, killer, and brothel/bar operator Al Swearengen (Ian McShane) is on a jaundiced decline as law enters the land. Calamity Jane (Robin Weigert) has somehow survived her alcoholism, but is even more death-obsessed than she was after Wild Bill Hickok’s murder. Some get more detail than others, like Joanie Stubbs (Kim Dickens) or Mr. Wu (Keone Young), who merely drop by for familiarity’s sake and to help the characters actually doing something during the movie. Some of these developments are propped up by flashbacks that could be clip show-ish; others more delicate and wistful recollections whose images reignite the pain we haven’t seen these characters experience in 10 years. They’re obsessive fragments, moments of time snipped, captured, and replayed like a haunting tune stuck in their heads. The focus on memory feels natural, but it’s perhaps even more understandable when taking into account the Alzheimer’s diagnosis of show creator David Milch (who also wrote the film). The “curiosity, bitterness, and incredulity” of mental decline meets the “unflinching dignity” of idealism, something seen in every corner of Deadwood’s hard, angry, honorable inhabitants. Time, and the perspective its passage brings, is new for the show. But its addition only serves to cement its legacy as one of the best ever. As a series capper, the movie is a satisfying, loving end that fulfills old Deadwood’s imperfect promises while mostly avoiding the pitfalls of nostalgia. —Jacob Oller\n\n9. Capturing the Friedmans\n\nYear: 2003\n\nDirector: Andrew Jarecki\n\nThis is the story of Arnold Friedman and his son Jesse, convicted of multiple counts of child molestation that supposedly took place in the basement of their home in a quiet New York suburb during the ’80s. In Capturing the Friedmans, filmmaker Andrew Jarecki interviews the victims and prosecutors, but never reaches a conclusion as to the veracity of the charges, tacitly acknowledging that guilt and innocence are fluid concepts in such sensational and shameful circumstances. Instead, he documents the implosion of the family and the destruction of an already tenuous marriage. Surely, the details of the abuse are disturbing, but almost as unsettling is the cruelty with which the two older Friedmans reject their mother in blind loyalty to their shamefaced father and numb younger brother, further facilitating the family’s emotional separation. —Emily Reimer\n\n8. BlacKkKlansman\n\nYear: 2018\n\nDirector: Spike Lee\n\nBlacKkKlansman begins, in vintage Spike fashion, with a big Oliver Stone-esque set piece featuring a racist “scholar” named Dr. Kennebrew Beaureguard (Alec Baldwin) delivering a demented, bigoted speech straight to the camera, but then, for a brief while, the movie settles down to tell its real-life story. In 1970s Colorado, a man named Ron Stallworth (John David Washington, son of Denzel) joins the police department and, after dealing with discrimination within the force itself, decides to go undercover and take down the local chapter of the Ku Klux Klan, talking to its members on the phone while using his white, Jewish partner Flip (Adam Driver) to serve as his in-person representative. The two slowly infiltrate the Colorado KKK and end up corresponding with the KKK’s grand wizard, David Duke (Topher Grace), who becomes so infatuated with Ron that he comes to Colorado to meet him. Meanwhile, Ron falls for a local radical (Laura Herrier) and attempts to figure out whether he can square the circle of being a good police office and a conscientious, vigilant black man. This is a Spike Lee movie, so the straightforward story you might have gotten from Get Out’s Jordan Peele—who was originally going to make this film as his follow up but instead produces here—keeps taking all sorts of detours, mostly with the intent of reminding you that there’s a direct line between the shithead Klansmen of this time period and the shitheads in Charlottesville…and the White House itself. Lee shook himself out of his brief academic torpor with 2015’s Chi-Raq, a wildly unfocused but deeply passionate movie, and he evolves further here, his outrage and sadness seeping out of every frame. It can be a little on the nose sometimes—one discussion of racism in the Oval Office is so overt you half expect the word “TRUMP” to just start flashing on the screen—but Spike Lee is at his best when he’s on the nose. Lee is too urgent, too furious, to have time to lull you in with subtlety and nuance: When the house is on fire, you don’t worry about what kind of hoses you have, you just spray that shit with everything you have. Lee is shaking with rage at what he sees in the world right now, and for crissakes, he should be. His excesses don’t just seem powerful; they’re necessary. You can sort out all the particulars later: The house is on fire right now. —Will Leitch\n\n7. Isle of Dogs\n\nYear: 2018\n\nDirector: Wes Anderson\n\nIsle of Dogs may be the closest Wes Anderson will ever get to a sci-fi film. Of course he would use stop-motion animation to make it. Set 20 years from now, amidst the ultra-urban monoliths of Megasaki City—a Japanese metropolis that also seems to be Japan, or at least a Westernized idea of the small island nation—the film begins care of a decree by Mayor Kobayashi (Kunichi Nomura), a boulder of a man with equal ties to an ancient lineage of cat-loving aristocrats and to, based on the elaborate back tattoo we glimpse atop his tight little butt in a quick bath scene, an archetype of organized crime and political corruption. Due to a vaguely described epidemic of \"dog flu\" (or \"snout fever\"), Kobayashi bans all dogs to Trash Island, a massive byproduct of technology and futurism, beginning with Spots (Liev Schreiber), the guard dog of 12-year-old Atari (Koyu Rankin), who also happens to be the Mayor’s ward after Atari’s parents died in a horrible accident. Since Bottle Rocket in 1996, the more manicured Anderson’s films have become—his obsessive control over his frames broadening into grander and grander worlds—the more we may be apt to extol his accomplishments rather than get invested in his stories. And it’s probably never been easier to do that than with Isle of Dogs, so rife with meticulousness and imagination, as is Anderson’s brand, and so unconcerned with steering this ostensible children’s movie towards actual children. For a director who pretty much defined a generation’s cinematic fetishization for symmetry (and quirky hipster nonsense) to then fetishize a country to which Westerners mainly relate through fetishization? So much of this beautiful movie just sort of eats itself. Still, the emotional weight of Isle of Dogs depends on knowing exactly what that bond between dog and human can mean, how deeply and irrationally it can go. At the core of Isle of Dogs is that kind of best-friendship: No matter how far we advance as a civilization, how disastrously we atomize and digitalize our lives, we’ll always have the devoted dependence of a dog, our immutable companion across the vast wasteland of human history. —Dom Sinacola\n\n6. Mean Girls\n\nYear: 2004\n\nDirector: Mark Waters\n\nBefore Tina Fey got stubborn—before sometimes thoughtful critiques of her occasionally limited perspective encouraged the reactionary, heel-in-ground attitude about the politics of identity and changing social norms—she was one of the most thoughtful writers and creators to engage with both of those subject matters, and how we talk about them. A crucial part of what made 30 Rock one of the smartest sitcoms in history was its investigation of what we talk about when we talk about identity politics. A lot of that sharpness has its origins in Fey’s 2004 screenplay debut, Mean Girls, a dark comedy in the vein of Heathers and Clueless, scrutinizing the social dynamics of high school and, in particular, how young women treat one another and themselves. Through the eyes of new kid, formerly homeschooled Cady Harron (Lindsay Lohan), the film submerges the audience in the nasty politics of “girl world” as she tries to make friends, schemes against the popular girls, and loses sight of herself in the process. Adapted from Rosalind Wiseman’s nonfiction book Queen Bees and Wannabes: Helping Your Daughter Survive Cliques, Gossip, Boyfriends, and Other Realities of Adolescence , Mean Girls has its own unique edge apart from 30 Rock, not just as a high school movie, but as a movie that dives into the operations of hierarchical systems. And for Fey, language is the key to unlocking how these high school cliques work. Fey’s lauded for her film’s memorable lines (quotes like “stop trying to make fetch happen” and “too gay to function” live on, at least in meme form), but Mean GIrls is an impressive example of translating Rosalind Wiseman’s nonfiction, sociological approach into narrative and fictive application. When Janis (Lizzy Caplan) and Damien (Daniel Franzese) introduce her to the various lunch room groups, they give her the vocabulary to describe them from then on. Taxonomical breakdowns of high school are almost blasé at this point, but director Mark Waters and Fey give a potency to the language of that social environment.\n\nAs Cady socializes into 2004-era high school life and finds her image growing in popularity, she must continually learn the nomenclature of high school and, effectively, of white femininity. Regina George (Rachel McAdams), a social leader of sorts, plays that game with her: “So you agree? You think you’re really pretty?” Regina jabs, establishing what the correct conversational and syntactical routine should be when someone compliments you. Later, the titular Girls—Regina, Gretchen (Lacey Chabert), Karen (Amanda Seyfried) and Cady—all look at themselves in the mirror pointing out their flaws. But the significance of this scene isn’t merely that Cady engages with the body politics of white womanhood, it’s that she is given the language with which to do so. Essentially, Mean Girls focuses on how the high schoolers codify social dynamics—how they articulate where they or other people fall taxonomically—via class, gender and race. As time passes, Mean Girls’s imitators seem flaccid by comparison. The film’s unpacking of the cruelty of internalized misogyny has, over the course of nearly a decade and a half, grown more acidic, its schemes and backtalking as scalding as it ever was. —Kyle Turner\n\n5. In the Bedroom\n\nYear: 2001\n\nDirector: Todd Field\n\nBased on a story by Andre Dubus, Todd Field’s In the Bedroom is a quiet, understated and devastating exploration of grief in the aftermath of a happy family torn apart by the murder of Frank Fowler (Nick Stahl) by his girlfriend Natalie’s (Marisa Tomei) ex (William Mapother). Of course, Nick’s parents (Sissy Spacek and Tom Wilkinson) handle the loss of their son in very different ways, inevitably alienating themselves from each other, compounding their isolation and profound loss. Field’s directorial debut is an arresting (and emotionally exhausting) work, combining elements of romance, drama and the taut tension of a very good thriller to reveal and unfold the story at the core of the film, which is Spacek and Wilkinson’s joint and individual journeys to contend with the utterly life-shattering experience of unexpectedly losing a child. The shifts from grief to anger and blame to guilt to need are incredibly real, and Spacek and Wilkinson deliver stellar, deeply nuanced performances. Field was critically lauded for the restrained style of the film, and for good reason: This is a riveting character study, the deepest, fathomless of dives into the psychology of family in the midst of loss. —Amy Glynn\n\n\n\n4. Paddington 2\n\nYear: 2018\n\nDirector: Paul King\n\nA sequel to 2014’s Paddington, Paddington 2 picks up where its predecessor left off, with Paddington Brown (né Bear and voiced by Ben Whishaw) living contentedly with his human family, including Hugh Bonneville (Downton Abbey) and a newly name-recognizable Sally Hawkins (The Shape of Water), joined by that British A-Lister of yore Hugh Grant, dramatic heavyweight Brendan Gleeson, and many others. (In fact, one of the simple joys for parents watching the film lies in recognizing this or that British actor.) A simple, commendable desire to find a good gift for his Aunt Lucy (currently spending her days in a nice retirement home for bears in Lima, Peru, natch) leads Paddington to set his eyes on a certain antique pop-up book as the perfect present. When that scoundrel and fading thespian Phoenix Buchanan (Grant) also sets his sights on the same book, well, hijinks, misunderstandings and adventure ensue. Paddington 2 reminds us how difficult it can be to pull off a sweetly tempered, gently moving children’s movie by doing exactly that, and doing it so well. —Michael Burgin\n\n3. Collateral\n\nYear: 2004\n\nDirector: Michael Mann\n\nAgainst the prelapsarian streets of LA, awash in neon gray and all but devoid of life, Michael Mann tells of urban loneliness and the powerful inconsequentiality of modern life. His Collateral breathes that amorality—not nihilism, just the acceptance that belief and associated ethical choices fail to survive the pointlessness of the day-to-day—and in turn at times both looks like shit (cinematographers Dion Beebe and Paul Cameron shot mostly in digital, occasionally in 35 mm) and aches painfully with the pristine coldness of enduring that shit. Max (Jamie Foxx), a cabbie with big dreams he’s relegated to a frayed postcard, picks up Vincent (Tom Cruise), a cross between Karl Lagerfeld and the T-1000, who draws Max into a long night of murder, threatening the mild-mannered driver into chaffeuring him, impressive hitman, from one job to another. That simple plan of course devolves into a thriller buoyed by two titanic performances—Foxx a slope-shouldered nebbish still trying to convince himself he’s more than a cab driver, and Cruise as an impeccable psychopath—but Mann never loses sight of the vacuum, of the empty melancholy, at the heart of his story: That in the City of Angels, no one is looking out for us. —Dom Sinacola\n\n2. When the Levees Broke: A Requiem in Four Acts\n\nDirector: Spike Lee\n\nYear: 2006\n\nPart indictment of FEMA and the U.S. Army Corps of Engineers, part celebration of the unfailingly resilient spirit of New Orleans, Spike Lee’s four-hour-long look at “The City That Care Forgot” a year after the near-obliteration of Hurricane Katrina is an exhausting, comprehensive, worthwhile experience. There’s a reason so many residents refer to the catastrophe as the “Federal flood” and not Katrina itself—Lee’s Peabody-winning doc examines the systemic failure at all levels of government to maintain the storm barriers and deal with the consequences of their negligence. It’s political, it’s racial, it’s accusatory and it’s utterly compelling viewing. It’s also inspiring, thanks to the resolute locals shown struggling to survive and rebuild in the disaster’s aftermath. This is very much a Spike Lee joint; don’t expect anyone in the Dubya administration to come away without a tongue-lashing. But the heart and soul of the doc is the people of New Orleans, and they won’t let you down—on the contrary. —Amanda Schurr\n\n1. Annie Hall\n\nYear: 1977\n\nDirector: Woody Allen\n\nThe sole best picture winner in Woody Allen’s canon—or whatever amounts to his legacy nowadays—Annie Hall succeeds in many forms, not the least as a great romantic comedy, simply because it patiently takes the time to reveal a relationship’s many moments, major and not so much—the wide spectrum of happy and sad, of bittersweet and just plain bitter. From fighting over which movie to see, to laughing while chasing down lobsters in the kitchen, Allen’s film grasps the delicacy of how such a bond can shift imperceptibly from bliss to something else entirely. It doesn’t hurt that Allen’s wit and humor is perfectly matched (even challenged) by Diane Keaton, in her iconic, Oscar-winning performance. However his films have soured sense, Annie Hall remains an enduring classic. —Jeremy Medina\n\n", "images": ["https://cdn.pastemagazine.com/www/articles/A-Star-Is-Born-header.jpg", "https://cdn.pastemagazine.com/images/master-header-logo.png"], "top_img": "https://cdn.pastemagazine.com/www/articles/A-Star-Is-Born-header.jpg", "keywords": [], "authors": ["Paste Movies Staff", "Dom Sinacola", "Jim Vorel", "Allison Keene", "Cole Henry", "Savannah Sicurella", "Shane Ryan", "Christine Fernando", "Garrett Martin", "Paste Staff"], "canonical_link": "https://www.pastemagazine.com/articles/2018/01/the-50-best-movies-on-hbo-go-and-hbo-now-january-2.html?p=2", "title": "The 50 Best Movies on HBO Right Now", "meta_data": {"title": "The 50 Best Movies on HBO Right Now - Paste Magazine", "description": "Here are the best movies HBO has to offer this month.", "keywords": ", The 50 Best Movies on HBO Right Now, Lists, Lists, Articles, Paste", "fb": {"admins": 1185614656, "app_id": 127550380613969, "pages": 18512903240}, "apple-mobile-web-app-title": "Paste Magazine", "og": {"image": {"identifier": "https://cdn.pastemagazine.com/www/articles/A-Star-Is-Born-header.jpg", "width": 633, "height": 356}, "type": "article", "url": "https://www.pastemagazine.com/articles/2018/01/the-50-best-movies-on-hbo-go-and-hbo-now-january-2.html", "title": "The 50 Best Movies on HBO Right Now", "site_name": "pastemagazine.com", "description": "Here are the best movies HBO has to offer this month."}, "twitter": {"card": "summary_large_image", "site": "@pastemagazine", "title": "The 50 Best Movies on HBO Right Now", "description": "Here are the best movies HBO has to offer this month.", "image": "https://cdn.pastemagazine.com/www/articles/A-Star-Is-Born-header.jpg"}, "p": {"domain_verify": "8f36922bc91ba221f10d82c407d8b6a9"}, "viewport": "viewport-fit=cover, width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.pastemagazine.com", "summary": ""}