{"url": "https://fanfest.com/2017/05/02/taken-recap-review-for-season-finale-i-surrender/", "text": "Bryan has learned this season that it’s better to ask forgiveness than permission. He never gets permission, but he always gets forgiven if his reckless behavior gets results. So in “I Surrender” Bryan goes AWOL after Mejia. In a series of quick leaps and bounds, Mejia, Asha, Bryan and the ODNI team end up on Mexico.\n\nWe open with ODNI being briefed on Asha’s kidnapping. They finally know a little about Bryan’s personal life. Then we see Bryan hitching a ride on backroads. The woman who picks him up, imagines herself a contestant on a tv talent show. She mistakes Bryan’s explanation, “Someone took my girlfriend,” as a melancholy Country/Western theme. (Here is another personality, like Leah, who we are instantly drawn to, but we’ll never see again.)\n\nAs Bryan hitchhikes across country to stay off the grid, we need reminding of what Bryan is after, with an escape attempt by his damsel and a phone call.\n\nBryan then strong arms Mejia’s business contacts to find out where Mejia might seek help. He then manipulates Mejia’s ex-wife to give him information on the tunnels leading to Mexico.\n\nBryan is further delayed when Hart’s team shows up and tries talking him down.\n\nEven though Bryan’s journey would take longer than Mejia – who had a head start, had people helping him, and knew exactly where he was going – somehow Bryan ends up in the tunnel at the same time as Mejia.\n\nGranted, Asha’s lackluster attempts at escaping may have eaten up two minutes of screen time, but I don’t think it would make up for the difference in time Bryan would have needed to get in the tunnels at that exact moment.\n\nInside the tunnel Bryan shoots Elena, who falls into a wall. Apparently Elena’s ninety-pound frame falling against the wall is enough to collapse the tunnel. The team then catches up to Bryan in the tunnels. In a speech involving more words than the writers have given Bryan since the pilot, Bryan insists he isn’t coming back to ODNI. (Seriously, I’d almost forgotten how good Clive Standen’s American accent was because we rarely hear anything but, “I’m good.”) The team decides they’ll help Bryan, even though they wanted to bring him in before the last commercial break.\n\nHart still doesn’t completely trust Bryan’s thinking, but Christina respects John’s opinion, so she flip flops again.\n\nThey learn from Agent Salt of an illegal arms operation in Juarez, Mexico set up by the Deputy Director of the FBI. Discovering and procuring guns takes all of thirty seconds. And it takes another five seconds to determine Mejia’s location. (Bryan at least forces his team to think on their toes and cut red tape this season. Didn’t Hart say it took hundreds or thousands of man hours for these operations? This one took 35 seconds.)\n\nThe action is slowed to a crawl, as the team looks around corners, opens doors, and quietly takes out Mejia’s bumbling guards. It may have created a realistic feel, to have us hearing the fiesta music in the background, but it made the scene even less suspenseful.\n\nAsha makes a run for it when Mejia learns of the authorities and shoots his cousin. He tells everyone they all betrayed him. The idea that Mejia would be betrayed, only comes from Mejia’s rantings and a quick mention from Bryan earlier. The writers could have built up the betrayal, and some actual tension, with some spicy cat and mouse conversation over dinner in Mejia’s court, instead of having us watch Asha attempt to simply walk out the front door. (smh)\n\nChaos ensues as the party breaks up. Asha stops in the kitchen when Mejia shoots. Then for some unknown reason, Mejia puts his gun away.\n\nThis allows Asha time to attack Mejia with a knife, instead of RUNNING. And since she has already proven to have none of Bryan’s skills, Mejia wrestles the knife to her throat as Bryan arrives. Bryan watches as Mejia slices her throat telling Bryan, “You choose. Me or her.”\n\nThis promised to be a great scene. I actually held my breath. Instead, Bryan has the option of leaving Asha in John’s trusting hands. Bryan doesn’t know if she will survive, but John scoops her up to an awaiting medivac, destroying any suspense for me. Bryan bumps into Mejia at the end of the line, both cornered by Mexican forces.\n\nAfter some tense staring, Bryan is triggered by Mejia’s, “I surrender. Goodbye.” Bryan shoots Mejia clean in the head, and is shot himself, in his bullet proof vest. Bryan is taken by the Mexican authorities. The last scene is Bryan raising his head in a prison cell.\n\nThis was the season finale of an action series, yet the only action in this episode, is Bryan slamming into a car’s windshield and hopping out of a ground level window – hopping – while being chased by a colleague who is of no threat to him WHATSOEVER. Asha by contrast had four failed escape scenes that lacked any suspense or drama.\n\nWill ‘Taken’ be renewed? For his sake I hope Bryan doesn’t rot in television purgatory. My take on the season as a whole, is that it was different and exciting, but it lost its rhythm after the first few episodes. When Bryan tells the truck driver he “can cook,” it underscores that we still know very little about his, or any character on the show. Some episodes were so fast paced that the audience couldn’t breathe or follow the plot jumps. Lulls in action were filled with melodramatic pauses, the development of characters we never see again(at least we saw Salt again this week), or the reiteration of obvious storylines. Do the writers assume the audience is brain dead at 10pm? Granted many did tune in after two hours of a tv talent contest.\n\nIf ‘Taken’ is renewed, I hope a rewrite and better time slot are “taken” into consideration.\n\nCatch up on the recaps for all of Season One of ‘Taken’ HERE!\n\npicture source: http://www.nbc.com", "images": ["https://i1.wp.com/fanfest.com/wp-content/uploads/2019/07/super-6.png?resize=110%2C85&ssl=1", "https://i1.wp.com/fanfest.com/wp-content/uploads/2017/05/10.Cell_.jpg?resize=600%2C272", "https://www.facebook.com/tr?id=1577730285878022&ev=PageView&noscript=1", "https://i1.wp.com/fanfest.com/wp-content/uploads/2017/01/ProfilePhoto.jpg?resize=150%2C150&ssl=1", "https://i2.wp.com/fanfest.com/wp-content/uploads/2017/05/5.back_.jpg?resize=600%2C600", "https://i0.wp.com/fanfest.com/wp-content/uploads/2017/05/6.GunC_.jpg?resize=600%2C292", "https://i2.wp.com/fanfest.com/wp-content/uploads/2017/05/2.Phone_.jpg?resize=600%2C600", "https://i2.wp.com/fanfest.com/wp-content/uploads/2017/05/4.Outrun.jpg?resize=600%2C600", "https://i2.wp.com/fanfest.com/wp-content/uploads/2019/07/ST3-Production-Still-2-e1562878230455.jpg?resize=110%2C85&ssl=1", "https://i1.wp.com/fanfest.com/wp-content/uploads/2017/05/1.torture.jpg?resize=600%2C600", "https://fanfest.com/wp-content/uploads/2018/10/Fan-Fest-NEWS-logo_3.png", "https://www.facebook.com/tr?id=496263363914918&ev=PageView&noscript=1", "https://i2.wp.com/fanfest.com/wp-content/uploads/2017/05/6.Boss-lady.jpg?resize=600%2C600", "https://i2.wp.com/fanfest.com/wp-content/uploads/2017/05/9.Cornered.jpg?resize=295%2C300", "https://i0.wp.com/fanfest.com/wp-content/uploads/2017/05/0.title_.jpg?resize=940%2C529", "https://i2.wp.com/fanfest.com/wp-content/uploads/2017/05/7.No-skill.jpg?resize=600%2C600", "https://i1.wp.com/fanfest.com/wp-content/uploads/2018/09/heroes-fanfest-dec.jpg?fit=500%2C500&ssl=1", "https://fanfest.com/wp-content/uploads/2018/03/FanFest-170x54.png", "https://i1.wp.com/fanfest.com/wp-content/uploads/2017/05/3.Hope_.jpg?resize=600%2C600", "https://i1.wp.com/fanfest.com/wp-content/uploads/2017/05/10.Showdown-1024x456.jpg?resize=688%2C306", "https://www.facebook.com/tr?id=801210429981178&ev=PageView&noscript=1", "https://i0.wp.com/fanfest.com/wp-content/uploads/2018/11/TWD9_NATURE_Lauren_0072_RT.jpg?resize=110%2C85&ssl=1", "https://i1.wp.com/fanfest.com/wp-content/uploads/2019/03/31770460078_f0b66b2ede_k.jpg?resize=110%2C85&ssl=1", "http://fanfest.com/wp-content/uploads/2017/05/0.title_.jpg"], "top_img": "http://fanfest.com/wp-content/uploads/2017/05/0.title_.jpg", "keywords": [], "authors": [], "canonical_link": "https://fanfest.com/2017/05/02/taken-recap-review-for-season-finale-i-surrender/", "title": "‘Taken’ Recap & Review for Season Finale “I Surrender” - Fan Fest", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "og": {"locale": "en_US", "type": "article", "title": "‘Taken’ Recap & Review for Season Finale “I Surrender” - Fan Fest | For Fans, By Fans", "description": "Bryan has learned this season that it’s better to ask forgiveness than permission. He never gets permission, but he always gets forgiven if his reckless behavior gets results. So in “I Surrender” Bryan goes AWOL after Mejia. In a series of quick leaps and bounds, Mejia, Asha, Bryan and the ODNI team end up on …", "url": "https://fanfest.com/2017/05/02/taken-recap-review-for-season-finale-i-surrender/", "site_name": "Fan Fest | For Fans, By Fans", "updated_time": "2017-05-04T14:53:17+00:00", "image": "http://fanfest.com/wp-content/uploads/2017/05/0.title_.jpg"}, "article": {"tag": "taken", "section": "Featured", "published_time": "2017-05-02T10:00:05+00:00", "modified_time": "2017-05-04T14:53:17+00:00"}, "twitter": {"card": "summary_large_image", "description": "Bryan has learned this season that it’s better to ask forgiveness than permission. He never gets permission, but he always gets forgiven if his reckless behavior gets results. So in “I Surrender” Bryan goes AWOL after Mejia. In a series of quick leaps and bounds, Mejia, Asha, Bryan and the ODNI team end up on […]", "title": "‘Taken’ Recap & Review for Season Finale “I Surrender” - Fan Fest | For Fans, By Fans", "image": "http://fanfest.com/wp-content/uploads/2017/05/0.title_.jpg"}, "google-site-verification": "uEm9b82iAxmanjrlzv2VUxrIEE6EDW7xE2_3GYmDg7U", "generator": "Powered by Visual Composer - drag and drop page builder for WordPress.", "msapplication-TileImage": "https://i1.wp.com/fanfest.com/wp-content/uploads/2018/11/cropped-fan-fest-favicon.jpg?fit=270%2C270&ssl=1"}, "movies": [], "publish_date": 1493697600.0, "source": "https://fanfest.com", "summary": ""}