{"url": "https://www.independent.co.uk/news/uk/home-news/meghan-markle-instagram-facebook-twitter-delete-social-media-accounts-a8150641.html", "text": "Meghan Markle has closed her social media accounts, Kensington Palace confirmed.\n\nMarkle, who spent Tuesday afternoon visiting a Brixton community radio station with fiance Prince Harry, shut down her Twitter, Facebook and Instagram accounts.\n\nThe palace said she was \"grateful to everyone who has followed her social media accounts over the years\" but had closed them \"as she has not used these accounts for some time\".\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe decision to close her social media accounts is in line with her changing status, as she will soon become a member of the royal family when she marries Harry in May.\n\nSenior members of the monarchy have official Twitter and Instagram accounts, run by the social media teams of their households, which do not normally feature personal tweets or posts.\n\nThe exception is the Duke of York who sometimes writes tweets himself but signs them \"AY\".\n\nMarkle will come under Kensington Palace after her wedding and social media postings will be made on her behalf by its communications staff.\n\nIn December 2017, the US actress had 1.9 million people following her posts on Instagram, and more than 350,000 Twitter followers.\n\nHer Facebook page had almost 800,000 likes, according to BBC Online.\n\nShape Created with Sketch. UK news in pictures Show all 50 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. UK news in pictures 1/50 12 July 2019 Giant Panda, Yang Guang, exploring his new home at Edinburgh Zoo after moving in last week RZSS/PA 2/50 11 July 2019 England's captain Eoin Morgan, left, celebrates with teammate Joe Root after winning their Cricket World Cup semi-final match against Australia at Edgbaston in Birmingham. The host nation blew away their rivals by 8 wickets with 107 balls remaining AP 3/50 10 July 2019 Andy Murray and Serena Williams talk as they play Bruno Soares and Nicole Melichar during their mixed doubles third round match of the Wimbledon Championships. The star-studded pair went out in three sets to the top seeds AFP/Getty 4/50 9 July 2019 Musician and composer Hero Douglas poses as she records the sounds of nature in around Llyn Mymbyr in Snowdonia Getty Images 5/50 8 July 2019 Fifteen-year-old Cori \"Coco\" Gauff serves to Romania's Simona Halep in a women's singles match during day seven of the Wimbledon Tennis Championships in London. The youngest woman to qualify for Wimbledon in the open era defeated Venus Williams in her opening match and made if through to week two. Halep ended the teenagers dream run at the tournament in their round 16 match, 6-3, 6-3 AP 6/50 7 July 2019 A competitor takes part in the Red Bull Soapbox Race in Alexandra Park, London. The soapbox race is an international event in which amateur drivers race homemade soapbox vehicles on a downhill course PA 7/50 6 July 2019 Members of the Lesbian, Gay, Bisexual and Transgender (LGBT) community take part in the annual Pride Parade in London AFP/Getty Images 8/50 5 July 2019 Andy Murray fives mixed doubles partner Serena Williams at a practice session during day five of Wimbledon Getty Images 9/50 4 July 2019 Chelsea's newly appointed head coach Frank Lampard gives a thumbs up as he poses at Stamford Bridge. The Blues confirmed a dramatic return for one of the club's greatest ever players. He has signed a three-year contract with the Premier League club, where he spent 13 years and became the team's all-time leading scorer with 211 goals AFP/Getty 10/50 3 July 2019 A grey seal named after Sir David Attenborough is released back into the wild after months being treated at RSPCA East Winch Wildlife Centre in Norfolk after it was found with a plastic frisbee disc embedded in its neck PA 11/50 2 July 2019 The Kirby Estate in London is decorated with St George flags ahead of the Women's World Cup semi-final match between England and the USA PA 12/50 1 July 2019 People sleep as Glastonbury Festival 2019 comes to an end SWNS 13/50 30 June 2019 The crowd enjoys the atmosphere as Years & Years perform on the Pyramid Stage during day five of the Glastonbury Festival at Worthy Farm, Pilton on June 30, 2019 in Glastonbury, England Getty 14/50 29 June 2019 A couple make their way across the sand with their belongings as people enjoy the sunshine and hot weather on Bournemouth Beach in Dorset. PRESS ASSOCIATION Photo. Picture date: Saturday June 29, 2019 PA 15/50 28 June 2019 A lion-tailed macaque stays cool in the hot weather by eating frozen treats with fruit at Camperdown Wildlife Centre, Dundee Katielee Arrowsmith / SWNS 16/50 27 June 2019 A festival goer dance with LED hula hoops on the second day of Glastonbury Festival 2019 PA 17/50 26 June 2019 Festival goers warm up prior to the gates opening at 8am on the first day of Glastonbury 2019 Adam Gray / SWNS 18/50 25 June 2019 An early glimpse of this year's Glastonbury Festival is given in this picture taken by a local who glided over the site in their paramotor James Pearce / SWNS 19/50 24 June 2019 The interior roof of a Tesco shop collapses under the torrential rain in Stirling, Scotland on 24 June James Charity 20/50 23 June 2019 Steph Houghton celebrates with teammates after scoring England's first goal during the Women's World Cup round of 16 match against Cameroon at the Stade du Hainaut stadium in Valenciennes, France AP 21/50 22 June 2019 Pride marchers at a rally outside the Scottish Parliament in Edinburgh PA 22/50 21 June 2019 The sun rises between the stones and over crowds at Stonehenge where people gather to celebrate the dawn of the longest day in the UK. The neolithic Wiltshire monument is built along the solstice alignment of the summer sunrise and the winter sunset. On the longest day of the year, the sun rises behind the Heel Stone, the ancient entrance to the Stone Circle, and rays of sunlight are channeled into the centre of the monument PA 23/50 20 June 2019 Frankie Dettori celebrates with the trophy after winning the 4.20 Gold Cup on Stradivarius as Queen Elizabeth looks on Action/Reuters 24/50 19 June 2019 Endangered Amur tiger cub Makari plays with a pinata which was given to him and brothers Dmitri and Czar as they celebrate their first birthday this week at Whipsnade Zoo in Dunstable PA 25/50 18 June 2019 Eoin Morgan celebrates his century with Joe Root during England's ICC Cricket World Cup match against Afghanistan at Old Trafford in Manchester. Morgan hit 17 sixes and set a new record in one-day international cricket, which saw his side win by 150 runs Getty 26/50 17 June 2019 Worcestershire County Cricket Club's New Road ground fully submerged by floodwater following heavy rainfall in the area. Worcestershire switched next week's County Championship home game with Sussex to Kidderminster due to the threat of flooding at the ground PA 27/50 16 June 2019 Dominic Raab (left) and Rory Stewart during the live television debate on Channel 4 for the candidates for leadership of the Conservative party, at the Here East studios in Stratford, east London PA 28/50 15 June 2019 Great Britain celebrate their first place on the podium during the Accenture World Triathlon Mixed Relay at Nottingham Embankment PA 29/50 14 June 2019 Mayor of London Sadiq Khan speaks at a service of remembrance at St Helens church, London, to mark the two-year anniversary of the Grenfell Tower block fire PA 30/50 13 June 2019 Community member Desi Cranenburgh attaches her latest homemade tribute near to the site of Grenfell Tower in London, a day before the second anniversary of the fire which killed 72 people Getty 31/50 12 June 2019 Boris Johnson during the launch of his campaign to become leader of the Conservative and Unionist Party and Prime Minister at the Royal Academy of Engineering in central London PA 32/50 11 June 2019 Strip club dancer Celia Lister protests with other demonstrators to oppose moves to close a branch of Spearmint Rhino in Sheffield. Dancers marched through the city centre after a row developed over whether to renew Spearmint Rhino's licence for the premises. The debate deepened after reports a video had been filmed by private investigators of sex acts taking place in the club PA 33/50 10 June 2019 A peregrine falcon chick calls out during ringing and data collection by RSPB expert handlers in the tower at Salisbury Cathedral. Four newly hatched birds of prey are nesting along with mum and dad on the South tower. PA 34/50 9 June 2019 England's forward Ellen White celebrates after scoring during the France 2019 Women's World Cup Group D football match between England and Scotland. White's goal was England's second of the match, which they went on to win 2-1 AFP/Getty 35/50 8 June 2019 Jason Roy celebrates his century with Joe Root. He went on to hit 153 as England scored their highest Cricket World Cup total of 386. The hosts beat Bangladesh by 106 runs to bounce back from defeat to Pakistan in their previous match Action/Reuters 36/50 7 June 2019 Labour Party leader Jeremy Corbyn celebrates with newly elected labour MP Lisa Forbes at Cathedral Square, Peterborough following her victory in the Peterborough by-election. The newly-formed Brexit Party lost out to Labour by 683 votes PA 37/50 6 June 2019 Veterans observe a two minute silence at the National Memorial Arboretum at Alrewas, in Staffordshire, for a service to mark the 75th anniversary of the D-Day landings PA 38/50 5 June 2019 French President Emmanuel Macron, British Prime Minister Theresa May, Britain's Prince Charles, Queen Elizabeth II, President Donald Trump, first lady Melania Trump and Greek President Prokopis Pavlopoulos, front row from left, watch a fly past at the end of an event to mark the 75th anniversary of D-Day in Portsmouth AP 39/50 4 June 2019 Anti-Donald Trump protesters gather with a Trump baby blimp flying over Parliament Square for a protest against the US president's state visit to the UK EPA 40/50 3 June 2019 Queen Elizabeth II views a display of US items of the Royal collection with US President Donald Trump and US First Lady Melania Trump at Buckingham palace AFP/Getty 41/50 2 June 2019 Liverpool's players celebrate with the Champions League trophy on board a parade bus after winning the final against Tottenham Hotspur, in Madrid the night before Getty 42/50 1 June 2019 Fans gather in Madrid ahead of the all-English club Champions League Final between Tottenham and Liverpool Reuters 43/50 31 May 2019 Racegoers during Ladies Day of the 2019 Investec Derby Festival at Epsom Racecourse, Epsom. PA 44/50 30 May 2019 Jofra Archer celebrates taking the wicket of South Africa's Aiden Markram during England's opening ICC Cricket World Cup match at the Kia Oval in London. The hosts beat South Africa by 104 runs Action/Reuters 45/50 29 May 2019 The Red Arrows in the Apollo formation while performing a full display at Chalkoutsi, Greece. The aerobatic display team have been granted formal approval on Wednesday to perform for audiences, known as Public Display Authority (PDA), to mark the official start of the Red Arrows' 55th display season Cpl Ashley Keates/PA 46/50 28 May 2019 British Environment Secretary Michael Gove returns to his home following a run in London. EPA 47/50 27 May 2019 Participants throw themselves down Cooper's Hill for the annual cheese rolling in Brockworth, Gloucestershire PA 48/50 26 May 2019 Jason Pearce and Chris Solly lift the League One play-off trophy following Charlton's victory against Sunderland. They will be promoted to the Championship after three years in the third tier Getty Images 49/50 25 May 2019 Giant kites are flown by expert kite flyers during the English Heritage Kite Festival at Scarborough Castle in North Yorkshire PA 50/50 24 May 2019 Prime Minister Theresa May reacts as she announces her resignation in London Reuters 1/50 12 July 2019 Giant Panda, Yang Guang, exploring his new home at Edinburgh Zoo after moving in last week RZSS/PA 2/50 11 July 2019 England's captain Eoin Morgan, left, celebrates with teammate Joe Root after winning their Cricket World Cup semi-final match against Australia at Edgbaston in Birmingham. The host nation blew away their rivals by 8 wickets with 107 balls remaining AP 3/50 10 July 2019 Andy Murray and Serena Williams talk as they play Bruno Soares and Nicole Melichar during their mixed doubles third round match of the Wimbledon Championships. The star-studded pair went out in three sets to the top seeds AFP/Getty 4/50 9 July 2019 Musician and composer Hero Douglas poses as she records the sounds of nature in around Llyn Mymbyr in Snowdonia Getty Images 5/50 8 July 2019 Fifteen-year-old Cori \"Coco\" Gauff serves to Romania's Simona Halep in a women's singles match during day seven of the Wimbledon Tennis Championships in London. The youngest woman to qualify for Wimbledon in the open era defeated Venus Williams in her opening match and made if through to week two. Halep ended the teenagers dream run at the tournament in their round 16 match, 6-3, 6-3 AP 6/50 7 July 2019 A competitor takes part in the Red Bull Soapbox Race in Alexandra Park, London. The soapbox race is an international event in which amateur drivers race homemade soapbox vehicles on a downhill course PA 7/50 6 July 2019 Members of the Lesbian, Gay, Bisexual and Transgender (LGBT) community take part in the annual Pride Parade in London AFP/Getty Images 8/50 5 July 2019 Andy Murray fives mixed doubles partner Serena Williams at a practice session during day five of Wimbledon Getty Images 9/50 4 July 2019 Chelsea's newly appointed head coach Frank Lampard gives a thumbs up as he poses at Stamford Bridge. The Blues confirmed a dramatic return for one of the club's greatest ever players. He has signed a three-year contract with the Premier League club, where he spent 13 years and became the team's all-time leading scorer with 211 goals AFP/Getty 10/50 3 July 2019 A grey seal named after Sir David Attenborough is released back into the wild after months being treated at RSPCA East Winch Wildlife Centre in Norfolk after it was found with a plastic frisbee disc embedded in its neck PA 11/50 2 July 2019 The Kirby Estate in London is decorated with St George flags ahead of the Women's World Cup semi-final match between England and the USA PA 12/50 1 July 2019 People sleep as Glastonbury Festival 2019 comes to an end SWNS 13/50 30 June 2019 The crowd enjoys the atmosphere as Years & Years perform on the Pyramid Stage during day five of the Glastonbury Festival at Worthy Farm, Pilton on June 30, 2019 in Glastonbury, England Getty 14/50 29 June 2019 A couple make their way across the sand with their belongings as people enjoy the sunshine and hot weather on Bournemouth Beach in Dorset. PRESS ASSOCIATION Photo. Picture date: Saturday June 29, 2019 PA 15/50 28 June 2019 A lion-tailed macaque stays cool in the hot weather by eating frozen treats with fruit at Camperdown Wildlife Centre, Dundee Katielee Arrowsmith / SWNS 16/50 27 June 2019 A festival goer dance with LED hula hoops on the second day of Glastonbury Festival 2019 PA 17/50 26 June 2019 Festival goers warm up prior to the gates opening at 8am on the first day of Glastonbury 2019 Adam Gray / SWNS 18/50 25 June 2019 An early glimpse of this year's Glastonbury Festival is given in this picture taken by a local who glided over the site in their paramotor James Pearce / SWNS 19/50 24 June 2019 The interior roof of a Tesco shop collapses under the torrential rain in Stirling, Scotland on 24 June James Charity 20/50 23 June 2019 Steph Houghton celebrates with teammates after scoring England's first goal during the Women's World Cup round of 16 match against Cameroon at the Stade du Hainaut stadium in Valenciennes, France AP 21/50 22 June 2019 Pride marchers at a rally outside the Scottish Parliament in Edinburgh PA 22/50 21 June 2019 The sun rises between the stones and over crowds at Stonehenge where people gather to celebrate the dawn of the longest day in the UK. The neolithic Wiltshire monument is built along the solstice alignment of the summer sunrise and the winter sunset. On the longest day of the year, the sun rises behind the Heel Stone, the ancient entrance to the Stone Circle, and rays of sunlight are channeled into the centre of the monument PA 23/50 20 June 2019 Frankie Dettori celebrates with the trophy after winning the 4.20 Gold Cup on Stradivarius as Queen Elizabeth looks on Action/Reuters 24/50 19 June 2019 Endangered Amur tiger cub Makari plays with a pinata which was given to him and brothers Dmitri and Czar as they celebrate their first birthday this week at Whipsnade Zoo in Dunstable PA 25/50 18 June 2019 Eoin Morgan celebrates his century with Joe Root during England's ICC Cricket World Cup match against Afghanistan at Old Trafford in Manchester. Morgan hit 17 sixes and set a new record in one-day international cricket, which saw his side win by 150 runs Getty 26/50 17 June 2019 Worcestershire County Cricket Club's New Road ground fully submerged by floodwater following heavy rainfall in the area. Worcestershire switched next week's County Championship home game with Sussex to Kidderminster due to the threat of flooding at the ground PA 27/50 16 June 2019 Dominic Raab (left) and Rory Stewart during the live television debate on Channel 4 for the candidates for leadership of the Conservative party, at the Here East studios in Stratford, east London PA 28/50 15 June 2019 Great Britain celebrate their first place on the podium during the Accenture World Triathlon Mixed Relay at Nottingham Embankment PA 29/50 14 June 2019 Mayor of London Sadiq Khan speaks at a service of remembrance at St Helens church, London, to mark the two-year anniversary of the Grenfell Tower block fire PA 30/50 13 June 2019 Community member Desi Cranenburgh attaches her latest homemade tribute near to the site of Grenfell Tower in London, a day before the second anniversary of the fire which killed 72 people Getty 31/50 12 June 2019 Boris Johnson during the launch of his campaign to become leader of the Conservative and Unionist Party and Prime Minister at the Royal Academy of Engineering in central London PA 32/50 11 June 2019 Strip club dancer Celia Lister protests with other demonstrators to oppose moves to close a branch of Spearmint Rhino in Sheffield. Dancers marched through the city centre after a row developed over whether to renew Spearmint Rhino's licence for the premises. The debate deepened after reports a video had been filmed by private investigators of sex acts taking place in the club PA 33/50 10 June 2019 A peregrine falcon chick calls out during ringing and data collection by RSPB expert handlers in the tower at Salisbury Cathedral. Four newly hatched birds of prey are nesting along with mum and dad on the South tower. PA 34/50 9 June 2019 England's forward Ellen White celebrates after scoring during the France 2019 Women's World Cup Group D football match between England and Scotland. White's goal was England's second of the match, which they went on to win 2-1 AFP/Getty 35/50 8 June 2019 Jason Roy celebrates his century with Joe Root. He went on to hit 153 as England scored their highest Cricket World Cup total of 386. The hosts beat Bangladesh by 106 runs to bounce back from defeat to Pakistan in their previous match Action/Reuters 36/50 7 June 2019 Labour Party leader Jeremy Corbyn celebrates with newly elected labour MP Lisa Forbes at Cathedral Square, Peterborough following her victory in the Peterborough by-election. The newly-formed Brexit Party lost out to Labour by 683 votes PA 37/50 6 June 2019 Veterans observe a two minute silence at the National Memorial Arboretum at Alrewas, in Staffordshire, for a service to mark the 75th anniversary of the D-Day landings PA 38/50 5 June 2019 French President Emmanuel Macron, British Prime Minister Theresa May, Britain's Prince Charles, Queen Elizabeth II, President Donald Trump, first lady Melania Trump and Greek President Prokopis Pavlopoulos, front row from left, watch a fly past at the end of an event to mark the 75th anniversary of D-Day in Portsmouth AP 39/50 4 June 2019 Anti-Donald Trump protesters gather with a Trump baby blimp flying over Parliament Square for a protest against the US president's state visit to the UK EPA 40/50 3 June 2019 Queen Elizabeth II views a display of US items of the Royal collection with US President Donald Trump and US First Lady Melania Trump at Buckingham palace AFP/Getty 41/50 2 June 2019 Liverpool's players celebrate with the Champions League trophy on board a parade bus after winning the final against Tottenham Hotspur, in Madrid the night before Getty 42/50 1 June 2019 Fans gather in Madrid ahead of the all-English club Champions League Final between Tottenham and Liverpool Reuters 43/50 31 May 2019 Racegoers during Ladies Day of the 2019 Investec Derby Festival at Epsom Racecourse, Epsom. PA 44/50 30 May 2019 Jofra Archer celebrates taking the wicket of South Africa's Aiden Markram during England's opening ICC Cricket World Cup match at the Kia Oval in London. The hosts beat South Africa by 104 runs Action/Reuters 45/50 29 May 2019 The Red Arrows in the Apollo formation while performing a full display at Chalkoutsi, Greece. The aerobatic display team have been granted formal approval on Wednesday to perform for audiences, known as Public Display Authority (PDA), to mark the official start of the Red Arrows' 55th display season Cpl Ashley Keates/PA 46/50 28 May 2019 British Environment Secretary Michael Gove returns to his home following a run in London. EPA 47/50 27 May 2019 Participants throw themselves down Cooper's Hill for the annual cheese rolling in Brockworth, Gloucestershire PA 48/50 26 May 2019 Jason Pearce and Chris Solly lift the League One play-off trophy following Charlton's victory against Sunderland. They will be promoted to the Championship after three years in the third tier Getty Images 49/50 25 May 2019 Giant kites are flown by expert kite flyers during the English Heritage Kite Festival at Scarborough Castle in North Yorkshire PA 50/50 24 May 2019 Prime Minister Theresa May reacts as she announces her resignation in London Reuters\n\nRoyal watchers were alerted to the growing importance of her relationship with Harry when Markle's social media postings began to trail off during 2017.\n\nIn April last year she shut down her lifestyle website The Tig.", "images": ["https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/01/09/22/meghan-markle-brixton.jpg", "https://trc.taboola.com/1036135/log/3/unip?en=page_view"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/01/09/22/meghan-markle-brixton.jpg", "keywords": [], "authors": ["Staff"], "canonical_link": "https://www.independent.co.uk/news/uk/home-news/meghan-markle-instagram-facebook-twitter-delete-social-media-accounts-a8150641.html", "title": "Meghan Markle deletes her Facebook, Instagram, and Twitter accounts", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#db3739", "og": {"url": "http://www.independent.co.uk/news/uk/home-news/meghan-markle-instagram-facebook-twitter-delete-social-media-accounts-a8150641.html", "title": "Meghan Markle has suddenly deleted all her social media accounts", "description": "Palace statement says the actress is 'grateful to everyone who has followed her'", "updated_time": "2018-01-10T09:58:29+00:00", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/01/09/22/meghan-markle-brixton.jpg", "site_name": "The Independent", "type": "article", "locale": "en_GB"}, "ia": {"markup_url": "https://www.independent.co.uk/pwamp/fbi/8150641"}, "description": "Meghan Markle has closed her social media accounts, Kensington Palace confirmed. Markle, who spent Tuesday afternoon visiting a Brixton community radio station with fiance Prince Harry, shut down her Twitter, Facebook and Instagram accounts. The palace said she was \"grateful to everyone who has followed her social media accounts over the years\" but had closed them \"as she has", "keywords": "Meghan Markle, Prince Harry, Home News, UK, News", "fb": {"pages": 13312631635, "admins": 729735830, "app_id": 235586169789578}, "article": {"tag": "Meghan Markle", "published_time": "2018-01-09T23:05:00Z", "modified_time": "2018-01-10T09:58:29+00:00", "section": "Home News", "author_name": "Staff and agencies", "content_type": "story", "word_count": 260, "image_count": 2, "video_count": 0, "embed_count": 0, "internal_link_count": 3, "external_link_count": 0}, "twitter": {"title": "Meghan Markle has suddenly deleted all her social media accounts", "description": "Meghan Markle has closed her social media accounts, Kensington Palace confirmed. Markle, who spent Tuesday afternoon visiting a Brixton community radio station with fiance Prince Harry, shut down her", "card": "summary_large_image", "site": "@independent"}, "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Independent"}, "movies": [], "publish_date": 1515539100.0, "source": "https://www.independent.co.uk", "summary": ""}