{"url": "https://www.vanityfair.com/style/2017/09/meghan-markle-cover-story", "text": "As in the 1957 Marilyn Monroe-Laurence Olivier film, The Prince and the Showgirl, a feeding frenzy surrounds royal-and-nonroyal couplings. Though Markle is extremely pretty and she stars in a TV show, you would never call her a “showgirl.” She is too serious, too well brought up. (And outside of Vegas, who’s called a “showgirl” anymore?) “Grounded” is the word that is often used to describe her. “I was born and raised in Los Angeles, a California girl who lives by the ethos that most things can be cured with either yoga, the beach, or a few avocados,” she once wrote. Until recently, she maintained a popular lifestyle blog called The Tig. She is a self-described foodie, a passion, incidentally, given to her character on Suits. “I mean, this bread is so good!” she enthuses over the delicious meal she prepared. “It’s that perfect crunch and then the softness. They call it the ‘crumb,’ all of these little holes—oh!” Suits, in which Markle plays ambitious paralegal turned lawyer Rachel Zane, first brought the actress to wide attention. (Before that she’d appeared briefly in the movies A Lot Like Love and Horrible Bosses and had minor roles on television in the science-fiction drama Fringe and the soap opera General Hospital, among others.) I asked the boyishly attractive, 36-year-old actor Patrick J. Adams, who plays the likable but fraudulent lawyer Mike Ross, Rachel’s love interest on Suits, to describe the series and its popularity. ROYAL TREATMENT\n\n“I’ve never defined myself by my relationship,” says Markle, who adds that she and Prince Harry were “quietly dating for about six months before it became news.” Photograph by Peter Lindbergh. Styled by Jessica Diehl. “Getting to 100 episodes is pretty surreal,” Adams says. “I never thought that a story about six people working in a law firm in New York City would be something that would capture people’s interest all over the globe. I was backpacking through New Zealand a couple of years ago and stopped to help a Swedish guy who had twisted his ankle. He looked up at me, and his eyes went wide, and all he could talk about was how badly he wanted Mike and Rachel to figure things out.” Mike Ross’s relationship with Rachel Zane is one of those long, simmering teases that take several episodes to come to a boil, but it was clear from their first meeting that they were meant to be together. “I think Mike and Rachel are a classic Romeo-and-Juliet story,” Adams believes. “They come from totally different sides of the tracks. Rachel has taken the path well traveled, worked hard, and followed the rules of the game. Mike is a naturally gifted, brilliant guy but has followed exactly none of the rules.” When it came to casting Rachel Zane, “we needed somebody in the role that was absolutely engaging, relatable, young enough, who is beautiful in a non-traditional way, and who had an authenticity,” says Bonnie Hammer, chairman of NBCUniversal Cable Entertainment Group. Aaron Korsh, the show’s creator, recalls that Rachel Zane was particularly challenging to cast because the role required “toughness and attitude while still being likable. . . . We all looked at each other [after Markle’s screen test] like, Wow, this is the one! I think it’s because Meghan has the ability to be smart and sharp but without losing her sweetness.” When she auditioned for the role, Markle showed up in black jeans, a plum-colored spaghetti-strap top, and heels. It suddenly occurred to her that for the screen test she needed to look less casual and more like a lawyer. She dashed into an H&M and bought a little black dress for $35. Sure enough, she was asked to change into the dress, which she hadn’t even tried on. Thank God it fit. “My parents had been so supportive,” she told V.F., “watching me audition, trying to make ends meet, taking all the odds-and-ends jobs to pay my bills. I was doing calligraphy, and I was a hostess at a restaurant—and all those things that actors do. My father knew how hard it is for an actor to get work, so he above all people was so proud that I was able to beat the odds.” One of the strongest bonds Prince Harry and Markle share is their philanthropy. For Markle, it began at an early age. Her mother, Doria Ragland, made sure that her little girl knew about the greater world and its political and economic challenges when she was growing up in Los Angeles. FIT FOR A PRINCE\n\n“The people who are close to me anchor me in knowing who I am,” Markle says. “The rest is noise.” Photograph by Peter Lindbergh. Styled by Jessica Diehl. Meghan’s father, Thomas Markle, was a successful lighting director in Hollywood; he lit the popular sitcom Married . . . with Children and, for 35 years, General Hospital. Markle recalled, “Every day after school for 10 years, I was on the set of Married . . . with Children, which was a really funny and perverse place for a little girl in a Catholic-school uniform to grow up.” Markle says, “What’s so incredible, you know, is that my parents split up when I was two, [but] I never saw them fight. We would still take vacations together. My dad would come on Sundays to drop me off, and we’d watch Jeopardy! eating dinner on TV trays, the three of us. . . . We were still so close-knit.” When she turned 18, she left for Northwestern University, in Evanston, Illinois—becoming the first person in her family to graduate from college—and double-majored in theater and international relations. In line with her international-relations major, Markle worked at the U.S. Embassy in Argentina her senior year, “so I had been in a completely different world and then suddenly jumped into this one.” Markle thinks her social awareness began during the South-Central riots, in Los Angeles, sparked by the police beating of Rodney King, in 1991, and the subsequent riots in 1992, when she was 11 years old. “They had let us go home [from school] during the riots and there was ash everywhere.” As the ash from street fires sifted down on suburban lawns, Markle remembers, she said, “Oh, my God, Mommy, it’s snowing!” “No, Flower, it’s not snow,” Doria answered. “Get in the house.”\n\nMarkle’s friends, family, and fellow actors on Suits are respectful of her relationship with Prince Harry, which has come under harsh criticism in the U.K. Tabloids report that Queen Elizabeth will be hesitant to sanction such a match for her grandson, following the ancient rule barring Catholics, commoners, and divorcées. Though not raised Catholic, Markle graduated from a Catholic high school and was married for almost two years to producer Trevor Engelson, and she adds a new wrinkle: her mother is black, her father white. Criticism of Markle has been snob-ridden, racist, and uninformed. The trolls have really gone after her. Last November, the Daily Star Online announced, “Prince Harry could marry into gangster royalty—his new love is from a crime ridden Los Angeles neighborhood”; “the royal’s future mother-in-law still lives in Crenshaw, surrounded by bloodbath robberies and drug-induced violence.” “I told her, ‘You’ve got to be who you are, Meghan. You can’t hide,’ ” says Serena Williams. How does Markle handle the tabloid nonsense about her and Harry? “I can tell you that at the end of the day I think it’s really simple,” she says. “We’re two people who are really happy and in love. We were very quietly dating for about six months before it became news, and I was working during that whole time, and the only thing that changed was people’s perception. Nothing about me changed. I’m still the same person that I am, and I’ve never defined myself by my relationship.” The media frenzy seems to bother the prince more than it does Markle. The official statement issued from Kensington Palace by his communications secretary read, in part, “Meghan Markle has been subject to a wave of abuse and harassment. . . . Prince Harry is worried about Ms. Markle’s safety and is deeply disappointed that he has not been able to protect her.” As for Markle, she prefers what the British call “ostriching.” She says, “I don’t read any press. I haven’t even read press for Suits. The people who are close to me anchor me in knowing who I am. The rest is noise.” Photograph by Peter Lindbergh. Styled by Jessica Diehl.\n\nMarkle’s parents “crafted the world around me to make me feel like I wasn’t different, but special,” as she wrote in a 2015 essay for Elle. As dolls in the 1980s were generally sold in sets of black and white, for Christmas one year her father bought “a black mom doll, a white dad doll, and a child in each color. My dad had taken the sets apart and customized my family.” Problems began in the seventh grade, when she had to complete a mandatory census by checking one of four boxes: “white, black, Hispanic, or Asian.” The pale, freckled, curly-haired Markle felt that to choose either white or black would be a rejection of one of her parents. Her teacher told her to check “Caucasian” because she looked white, but she couldn’t. She ended up leaving the boxes unchecked. “I left my identity blank—a question mark, an absolute incomplete—much like how I felt,” she once said. Because she is light-skinned and has not made an issue of being bi-racial—though she has embraced it—she has auditioned for white as well as black and Latina roles. There was widespread disbelief among viewers in Season Two of Suits when her black father, a high-powered lawyer played by the charismatic actor Wendell Pierce (of Treme fame), first appeared on the show—most people didn’t think her character, or the actress playing her, was bi-racial. One thing Markle noticed about how she was perceived was that “at almost every photo shoot they would airbrush out” her freckles. “I’ve always loved my freckles,” she now says, so when she was photographed for V.F., she was “thrilled to work with Peter [Lindbergh] because he rarely retouches and he believes in such little makeup. I gave him a big hug and said, ‘I am so excited to work with you because I know we will finally be able to see my freckles!’ ”\n\nMore important, what does Queen Elizabeth think of the prospect of a marriage between her grandson and the American divorcée? When asked if she thought the Queen opposed the match, Sally Bedell Smith, who has written biographies of Queen Elizabeth, Princess Diana, and most recently Prince Charles, said, “The stakes are obviously lower in the case of Harry because he is now fifth in line to the throne [in descending order, the others are Prince Charles, Prince William, Prince George, and Princess Charlotte]. They have to be concerned—William and Harry will always have a special place because, whatever you think of Diana, she has a magical aura that continues. The fact that Harry and William are half Diana . . . that will never go away.” “The Queen is remarkably open-minded and she’s very tolerant,” Smith observes. William was allowed to cohabit with Kate (Middleton), even though she’s the daughter of “a very middle-class family. The Queen just looked at who Kate was and that she was in love with her grandson, and that she knew how to conduct herself with dignity and discretion, and that was the most important thing. I would imagine that the Queen’s view of this would be: if they’re in love and they’re well suited, then they should proceed.” “At the end of the day I think it’s really simple,” Markle says. “We’re two people who are really happy.” Bonnie Hammer expressed her concern about Markle’s sudden, international fame. “She isn’t somebody who was already a celebrity, who had paparazzi tracking her day and night in Hollywood or New York or Toronto. She’s going through something that should be the most glorious and open time in her life, to be able to share, but because of circumstances, that’s very hard.” Markle credits the rock-solid support from her close friends for helping to sustain her. The international tennis great Serena Williams (who recently graced the cover of V.F.) is one of those friends. The two met about seven years ago at the Super Bowl. “Her personality just shines,” Serena said about Markle, who asked her advice on how to handle some of the more extreme results of fame, such as paparazzi showing up at her house and chasing her. “I told her, ‘You’ve got to be who you are, Meghan. You can’t hide.’ ” Another close friend is the Bahrain-born fashion designer Misha Nonoo. They met in Miami through a mutual friend and immediately bonded. “Her greatest strength is her compassion for others,” says Nonoo. “Much of the work she does is unseen by the public.” Another close friend is the actress Abigail Spencer, who has been a Suits cast member. When asked why she thinks Harry was drawn to Markle, Spencer says, “She’s got warm elegance, though her style is hard to pin down. It’s classy and timeless. When you’re talking to her, you feel like you’re the only person on the planet. And it’s just wonderful to see her so in love.” STRONG SUITS\n\n“It’s just wonderful to see her so in love,” says actress Abigail Spencer, a close friend. Photograph by Peter Lindbergh. Styled by Jessica Diehl.", "images": ["https://media.vanityfair.com/photos/59a96825e025da666cd492e9/master/w_1600%2Cc_limit/meghan-markle-1017-ss04.jpg", "https://media.vanityfair.com/photos/5d2a0d105438e40008b3beb3/1:1/w_350%2Ch_350%2Cc_limit/meghan-kate-pippa-wimbledon.jpg", "https://media.vanityfair.com/photos/59a96825e025da666cd492e7/master/w_1600%2Cc_limit/meghan-markle-10-17-cover.jpg", "https://media.vanityfair.com/photos/59a96825f472d37f5e2f7265/16:9/w_1280%2Cc_limit/meghan-markle-1017-ss01.jpg", "https://media.vanityfair.com/photos/59a96825106117712f34f887/master/w_1600%2Cc_limit/meghan-markle-1017-ss03.jpg", "https://media.vanityfair.com/photos/5d00d2faef4f5d685d3a408e/1:1/w_350%2Ch_350%2Cc_limit/Tibi%2520RS18%25200909.jpg", "https://media.vanityfair.com/photos/5908b35e16779f27abc0a375/1:1/w_350%2Ch_350%2Cc_limit/t-meghan-markle-style.png", "https://www.vanityfair.com/verso/static/vanity-fair/assets/logo-header.b6748104d0d362745b508aebea5a86c913809200.svg", "https://www.vanityfair.com/verso/static/vanity-fair/assets/logo-reverse.6ef96ab8686439a35176e2ff8b2c4487e92fbaae.svg", "https://media.vanityfair.com/photos/59a968254a3663211bf43089/master/w_1600%2Cc_limit/meghan-markle-1017-ss02.jpg", "https://media.vanityfair.com/photos/59a968264ef611786ce8c2e1/16:9/w_1280,c_limit/t-meghan-markle-10-17-cover.jpg", "https://media.vanityfair.com/photos/5d05048028d8add457470b77/1:1/w_350%2Ch_350%2Cc_limit/taylor-swift-stonewall-pride.jpg", "https://media.vanityfair.com/photos/5824deca364154776b0ba9d3/1:1/w_350%2Ch_350%2Cc_limit/t-kate-middleton-meghan-markle.jpg", "https://media.vanityfair.com/photos/5d29f71b5438e40008b3beb1/1:1/w_350%2Ch_350%2Cc_limit/friends-pottery-barn.jpg", "https://media.vanityfair.com/photos/59a96826600c2752b9cb62d3/master/w_1600%2Cc_limit/meghan-markle-1017-ss05.jpg"], "top_img": "https://media.vanityfair.com/photos/59a968264ef611786ce8c2e1/16:9/w_1280,c_limit/t-meghan-markle-10-17-cover.jpg", "keywords": [], "authors": ["Condé Nast", "Josh Duboff", "Kevin Fitzpatrick", "Sam Kashne", "Peter Lindberg", "Jessica Dieh"], "canonical_link": "https://www.vanityfair.com/style/2017/09/meghan-markle-cover-story", "title": "Cover Story: Meghan Markle, Wild About Harry!", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Condé Nast", "copyright": "Copyright (c) Condé Nast 2019", "description": "Battered by the tabloids—to the point where her boyfriend, Prince Harry, issued a statement defending her—actress and activist Meghan Markle has largely ignored the media storm. And as Markle tells *Vanity Fair* about her bi-racial background, her romance, and her hit series, *Suits,* it seems that this 36-year-old American may be just the woman for Britain’s iconoclastic royal.", "keywords": "meghan markle,suits,tv,royals,prince harry,cover story", "robots": "index, follow", "og": {"description": "Battered by the tabloids—to the point where her boyfriend, Prince Harry, issued a statement defending her—actress and activist Meghan Markle has largely ignored the media storm. And as Markle tells *Vanity Fair* about her bi-racial background, her romance, and her hit series, *Suits,* it seems that this 36-year-old American may be just the woman for Britain’s iconoclastic royal.", "image": "https://media.vanityfair.com/photos/59a968264ef611786ce8c2e1/16:9/w_1280,c_limit/t-meghan-markle-10-17-cover.jpg", "site_name": "Vanity Fair", "title": "Cover Story: Meghan Markle, Wild About Harry!", "type": "article", "url": "https://www.vanityfair.com/style/2017/09/meghan-markle-cover-story"}, "twitter": {"card": "summary_large_image", "description": "Battered by the tabloids—to the point where her boyfriend, Prince Harry, issued a statement defending her—actress and activist Meghan Markle has largely ignored the media storm. And as Markle tells *Vanity Fair* about her bi-racial background, her romance, and her hit series, *Suits,* it seems that this 36-year-old American may be just the woman for Britain’s iconoclastic royal.", "domain": "https://www.vanityfair.com", "image": {"src": "https://media.vanityfair.com/photos/59a968264ef611786ce8c2e1/16:9/w_1280,c_limit/t-meghan-markle-10-17-cover.jpg?mbid=social_retweet"}, "site": "@VanityFair", "title": "Cover Story: Meghan Markle, Wild About Harry!"}, "fb": {"app_id": 305927716147259, "pages": 8810407571}}, "movies": [], "publish_date": null, "source": "https://www.vanityfair.com", "summary": ""}