{"url": "https://www.hollywoodreporter.com/news/obit-dorothy-mengering-dead-795160", "text": "Letterman put his elderly mother from Indiana to work, and her bits were always funny and heartwarming.\n\nDorothy Mengering, a masterful pie-maker from a small town in Indiana who “covered” three Winter Olympics for her mischievous son, David Letterman, has died. She was 95.\n\nMengering, who for years made regular appearances on Letterman’s Late Show before Thanksgiving and Mother’s Day, died Tuesday at her modest home in Carmel, Ind., according to a rep for the former late-night host.\n\nSeen via satellite from the kitchen of her modest home, Mengering was at her comic best for the feature “Guess Mom’s Pies,” in which Letterman had to pick which one of his many favorites she had lovingly prepared for the holidays.\n\nHer first on-camera appearance on the CBS show came during the 1994 Winter Olympics in Lillehammer, Norway, when she offered to bring ice skater Nancy Kerrigan hot chocolate and asked Hillary Clinton if the first lady could get the speed limit adjusted in Connecticut.\n\n“After Lillehammer, I couldn’t believe how it all took off,” she told The New York Times in 1996. “I think it’s about the idea of mom and of a family. People are eager for families to be like they used to be. Even though there are lots of working moms and single-parent families now, you can still be a family in spite of the size and form it takes.”\n\nMengering reprised her role as a Late Show “correspondent” for the next two Winter Games in Nagano, Japan and Salt Lake City, and she taped segments from London for Dave as well.\n\nStephen Colbert, who took over for Letterman on The Late Show in 2015, tweeted out his condolences on Tuesday: \"I'm so sorry to hear of Dorothy Mengering's death, and so grateful that Dave shared her with us.\"\n\nMengering published a 1996 cookbook, Home Cookin’ With Dave’s Mom. In it were recipes for “Dave’s Fried Baloney Sandwich,” “Jan’s Sauerkraut Balls” and “Gretchen’s Salad Dressing” — tributes to her son and two daughters — and instructions for how to make pies like blueberry, sour cherry, pecan molasses and chocolate chiffon.\n\nThe eldest of three children, Dorothy Hofert was born on July 18, 1921, in Linton, Ind. She studied at Indiana University, and in 1942, she married Harry Joseph Letterman, who had a florist shop. He died of a heart attack in 1973. (Dave’s son, Harry, is named after him.)\n\nTen years later, she wed Hans P. Mengering, a retired structural engineer for an Indianapolis architectural firm. The World War II veteran died in March 2013.\n\nIn the interview with The Times, she told a story about how her young son, while working at a local supermarket, once stacked a bunch of cans all the way to the ceiling. Taking one would send them all crashing to the floor.\n\n“I had one of the schoolteachers tell me after Dave got famous that the kids get by with a lot more now,” Mengering said, “because they can see it’s not out of meanness, just mischievousness.”", "images": ["https://cdn1.thr.com/sites/default/files/2017/04/dorothy_mengering_david_letterman_0.jpg", "https://assets.hollywoodreporter.com/assets/1562102990/images/brand/thr-logo-white.svg?a0259e7bd063a50286c0", "https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/03/writerimage-thr.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1"], "top_img": "https://cdn1.thr.com/sites/default/files/2017/04/dorothy_mengering_david_letterman_0.jpg", "keywords": [], "authors": ["Mike Barnes", "Mike.Barnes Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/news/obit-dorothy-mengering-dead-795160", "title": "Dorothy Mengering, David Letterman's Mom and 'Late Show' Personality, Dies at 95", "meta_data": {"viewport": "width=device-width", "description": "Letterman put his elderly mother from Indiana to work, and her bits were always funny and heartwarming.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/news/obit-dorothy-mengering-dead-795160", "domain": "https://www.hollywoodreporter.com/", "title": "Dorothy Mengering, David Letterman's Mom and 'Late Show' Personality, Dies at 95", "description": "Letterman put his elderly mother from Indiana to work, and her bits were always funny and heartwarming.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2017/04/dorothy_mengering_david_letterman_0.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "Dorothy Mengering, David Letterman's Mom and 'Late Show' Personality, Dies at 95", "description": "Letterman put his elderly mother from Indiana to work, and her bits were always funny and heartwarming.", "url": "https://www.hollywoodreporter.com/news/obit-dorothy-mengering-dead-795160", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2017/04/dorothy_mengering_david_letterman_0.jpg", "width": 1280, "height": 720, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "Dorothy Mengering, David Letterman's Mom and 'Late Show' Personality, Dies at 95", "sailthru.description": "Letterman put his elderly mother from Indiana to work, and her bits were always funny and heartwarming.", "sailthru.author": "Mike Barnes", "sailthru.vertical": "Television", "sailthru.date": "2017-04-11 19:36:12", "sailthru.tags": "Television,David Letterman,Obituaries"}, "movies": [], "publish_date": 1491953772.0, "source": "https://www.hollywoodreporter.com", "summary": ""}