{"url": "https://web.archive.org/web/20180606091614/http://www.nola.com:80/tv/index.ssf/2018/06/southern_charm_new_orleans_sea.html", "text": "That's a wrap for \"Southern Charm New Orleans.\" Sunday night's episode of the unscripted Bravo series marked the finale of its first season -- and, one has to believe, probably the finale of the series as a whole.\n\nOf course, the Bravo suits could always surprise us and renew it for a sophomore season. But the fact of the matter is that the show had trouble building a steady audience from the beginning. In fact, after debuting April 25 to more than 1 million viewers, it didn't build at all, posting a viewership decline with nearly every episode, according to figures from ShowBuzz Daily.\n\nLast week's penultimate episode marked the low-water mark, drawing fewer viewers -- 640,000 -- than any other episode so far this season. Nothing charming about that. (Viewership figures on Sunday's eighth and final episode were not available.)\n\nBy comparison, the \"Southern Charm\" mother ship, from which \"SoCharm NOLA\" was spun off, has yet to register fewer than 1 million voters in any of the nine episodes that have aired so far as part of its fifth season.\n\nSo, while there will certainly be some people who will mourn the end of \"Southern Charm New Orleans\" should Bravo decide to pass on a second season, I've got a feeling most people won't miss it -- because they apparently stopped watching pretty early on.\n\nThe reason behind the erosion of interest in the show is pretty simple to nail down: It was boring, built around limp writing and clumsily staged attempts at drama.\n\nGranted, no reality show is actually \"real.\" But if a producer wants his or her show to draw a reliable base of return viewers, they've got to help those viewers buy into the illusion. That was seldom the case with \"Southern Charm New Orleans.\"\n\nIf there's an upside to it all, it's that the show was not the pox on local culture that many feared. In fact, its New Orleansness seemed to get more and more watered-down with nearly every episode, eventually reduced to little more than Chamber of Commerce images flashed between scenes, with an occasional bowl of gumbo thrown in. That's just as well, given that the show's efforts at including local culture in early episodes was ham-handed at best.\n\nEven then, though, with so few people watching, it's hard to get too terribly worked up about it. As they say: No harm, no foul.\n\nFor those few who did watch regularly, producers were kind enough to wrap up most of the show's loose narrative threads in Sunday's finale. Below find a recap of the high points (and low points) of the Season 1 finale of \"Southern Charm New Orleans.\"\n\nThe title: \"Better Late Than Pregnant.\"\n\nThe centerpiece drama of the week: In what was perhaps the show's cheapest stunt yet -- and its most manufactured -- producers pulled a full-on okey-doke on viewers, in the form of a pregnancy scare for cast member Reagan Charleston.\n\nThat particular plot point was teased during the closing moments of the previous episode, but before getting to it in Episode 8, producers had hubby Jeff Charleston express his eagerness to become a father -- followed by Raegan informing him that she's not quite ready yet to be a mom. The next thing we know, her period is conveniently late.\n\nSo, she does what anybody would do: She takes a pregnancy test. At a huge season-ending party thrown by fellow cast member Jon Moody. And using a pregnancy test that was a gag gift at an adult Easter egg hunt from Episode 7.\n\nAnd after all that? Spoiler alert: She ain't preggers.\n\nThat's right, \"Southern Charm New Orleans\" fans. You just got punk'd.\n\nIn all honestly, it's probably for the best, as on Monday (June 4) -- the day after the finale aired -- Reagan and Jeff announced they are separating.\n\nThe libation of the week: A French 75, ordered at breakfast by Tamica Lee.\n\nThe New Orleans cliche of the week: From a practical standpoint, the idea of throwing a party to end the season was a pretty good one, giving producers the opportunity to get everybody together one last time -- and decked out in their Sunday best -- to wrap up the season's myriad dramas.\n\nThat being said, it's nothing short of shameless that they framed it as a \"Jazz Fest launch party.\" The show, and the episode has nothing to do with Jazz Fest. The cast never went to Jazz Fest. In fact, music has played a minor role in the series at best.\n\nThe honest question of the week: Speaking of the show's lack of focus on music, why didn't producers pick a local musician or two when they were casting the show? Not only would they have gotten some great music out of it, but the real behind-the-scenes dramas that play out on the local music scene have got to be better than the fake ones that played out on Season 1 of \"Southern Charm New Orleans.\"\n\nIf there's one thing that could get me interested in a second season, that would probably be it.\n\nThe real moment of the week: Of all the lose threads tied up in the season finale, easily the most touching was the reconciliation between cast member Tamica Lee and her daughter, third-grader Rani, with whom she butted heads in a previous episode -- and who has struggled with the fact that she's the only black kid at her school.\n\nAfter sitting down for a heart-to-heart with the help of supporting cast member Susan Henry, Tamica and Rani hugged it out -- and cried it out -- in what was probably the sweetest moment of the season.\n\nGranted, it all happened during a staged radio interview at local station WBOK, but this is one case where the end justifies the means. On a related note: If there's an MVP of the season, it's Rani, as far as I'm concerned.\n\nThe manufactured moment of the week: Raegan's pregnancy scare. (See \"The centerpiece drama,\" above.)\n\nThe quote of the week: \"We're just having some conversations.\" -- Justin, to mother Dottie Reese, after she walked in on a heated conversation between Justin and girlfriend Kelsey.\n\nI don't know why, but that line cracked me up. In fact, it's not just the quote of the week. It might be the quote of the whole season. I'm think I'm going to start using it whenever anybody butts into a conversation I'm having with somebody else.\n\nThem: \"What are you guys talking about?\"\n\nMe: \"We're just having some conversations.\" (Exits.)\n\nThe winner: The King Firm, where cast member Justin Reese's day job is. Every episode this season, they've bought airtime during the show for a commercial that prominently features Justin -- and which never fails to fool me into thinking the show is back on, thus prompting me to stop fast-forwarding through the commercials.\n\nGranted, I start fast-forwarding again immediately upon realizing it's a commercial, but I know the firm's name now, whereas I didn't' before.\n\nNicely played, King Firm. Nicely played.\n\nThe loser: Me, for actually sitting through all eight episodes.\n\nOn the plus side, it's all been documented through the following stories, so future generations can remember the season that was.\n\nAs for me, I'm going to start trying to forget it, starting now.\n\n[Who are these \"Southern Charm New Orleans\" people, anyway?]\n\n[\"Southern Charm New Orleans\" Episode 1 recap]\n\n[\"Southern Charm New Orleans\" Episode 2 recap]\n\n[\"Southern Charm New Orleans\" Episode 3 recap]\n\n[\"Southern Charm New Orleans\" Episode 4 recap]\n\n[\"Southern Charm New Orleans\" Episode 5 recap]\n\n[\"Southern Charm New Orleans\" Episode 6 recap]\n\n[\"Southern Charm New Orleans\" Episode 7 recap]", "images": ["https://web.archive.org/web/20180606091614im_/https://expo.advance.net/img/97d731ec85/width960/fe7_southerncharmneworleansseason1010.jpg", "https://web.archive.org/web/20180606091614im_/http://static.advance.net/static/common/img/ad_choices_arrow_transparent.png", "https://web.archive.org/web/20180606091614im_/http://static.advance.net/static/nola/static/img/footer-logo-nola-inc.png"], "top_img": "https://web.archive.org/web/20180606091614im_/https://expo.advance.net/img/97d731ec85/width960/fe7_southerncharmneworleansseason1010.jpg", "keywords": [], "authors": ["Mike Scott", "Nola.Com", "The Times-Picayune"], "canonical_link": "https://web.archive.org/web/20180606091614/http://www.nola.com/tv/index.ssf/2018/06/southern_charm_new_orleans_sea.html", "title": "Goodbye, 'Southern Charm New Orleans'", "meta_data": {"fb": {"admins": 100000302287435, "app_id": 132415560104656}, "viewport": "width=device-width,initial-scale=1", "vf": {"owner": "cookie:2227", "unique_id": "e47f2882eb97b491de235a8c4462aaaf", "section": "www"}, "title": "Goodbye, 'Southern Charm New Orleans'", "article_publication_name": "NOLA.com", "article_author": "Mike Scott", "article_date_original": "Monday, June 04, 2018, 11:24 AM", "article_date_updated": "Monday, June 04, 2018, 10:42 PM", "news_keywords": "barry smith, entertainment, frontpage, homepage, jeff charleston, jon moody, justin reese, raegan charleston, southern charm, southern charm new orleans, tamica lee, tv, life-and-culture", "article": {"author": "https://www.facebook.com/profile.php?id=1252122523", "modified_time": "2018-06-05T03:42:14Z"}, "twitter": {"card": "summary_large_image", "description": "Season 1 finale of the Bravo reality series could also be the series finale.", "image": "https://web.archive.org/web/20180606091614im_/https://expo.advance.net/img/97d731ec85/width960/fe7_southerncharmneworleansseason1010.jpg", "title": "Goodbye, 'Southern Charm New Orleans'", "site": "@nolanews", "creator": "@MoviegoerMike"}, "og": {"title": "Goodbye, 'Southern Charm New Orleans'", "description": "Season 1 finale of the Bravo reality series could also be the series finale.", "site_name": "NOLA.com", "url": "https://web.archive.org/web/20180606091614/http://www.nola.com/tv/index.ssf/2018/06/southern_charm_new_orleans_sea.html", "type": "article", "image": {"identifier": "https://web.archive.org/web/20180606091614im_/https://expo.advance.net/img/97d731ec85/width960/fe7_southerncharmneworleansseason1010.jpg", "width": 960, "height": 720}}, "Description": "Season 1 finale of the Bravo reality series could also be the series finale."}, "movies": [], "publish_date": 1528125840.0, "source": "https://web.archive.org", "summary": ""}