{"url": "https://www.denofgeek.com/tv/29456/10-great-tv-shows-for-geek-parents-to-watch-with-their-kids", "text": "“Urgh, I’m so hungover. I’m going to sit in my pants and watch movies all day”\n\nSo invariably goes at least one entry on my Twitter feed every Saturday or Sunday morning. Yes, lying about all day watching TV is great but nine times out of ten when someone writes something like this, I can guarantee that they don’t have kids. For those of us with small children, the television we regularly watch throughout the day comes from a vastly different landscape. To the childless, names such as Makka Pakka, Tree Fu Tom and Yo Jo Jo may mean very little. To some us though they’ve become household names, as our lives are filled with the colourful characters we now encounter via our TV screens on a daily basis. And any parent who comes out with the immortal line “Oh, I don’t let my kids watch television” is, I’m sorry, a liar.\n\nWhen we were younger, pre-school TV was pretty much confined to seeing which window we’d go through today on Playschool but now in the age of hundreds of channels, there’s a wealth of programmes for the under-fives, and some of them are really rather good. Some are so good in fact, that as adults we sometimes find ourselves continuing to watch after our offspring have left the room. This list then is dedicated to those shows:\n\nBen & Holly’s Little Kingdom\n\n\n\nWhy kids love it: Ben & Holly’s Little Kingdom is, like many pre-school shows, based on friendship and getting into trouble, but here there’s added magic. Like a reception class version of The Hobbit, there are elves, one of whom is Ben, and fairies, one of whom is Princess Holly. The elves don’t like magic and blow trumpets every time they announce themselves while the fairies love magic, often with disastrous results that involve floods of jelly. Add to this their friendship with the human Lucy and vibrant characters such a Ben’s pet ladybird Gaston, who thinks he’s a dog, and it makes for a magical package.\n\nWhat’s in it for the grown ups? There are really two words to sum this up – Nanny Plum. Brilliantly voiced by Sarah Ann Kennedy, Nanny Plum is housekeeper to Princess Holly’s parents, King and Queen Thistle. Often sarcastic, often casting spells that invariable go wrong (to replace a priceless frozen bird sculpture she uses the spell “Make me a bird, ice thingy”) and frequently hilarious, Plum is the highlight of Ben & Holly. The writing in the show is so tight that there’s often some very funny, sitcom-style bantering going on between the adult characters and it’s never better than when Nanny Plum is involved. King Thistle probably adds the most entertainment next as the hapless and grumpy king who is happy as long as he can get his bath. The creators of Ben & Holly have produced a show that while enthralling for children, has all the hallmarks of a great British comedy. A delight for adult viewers too was this trailer, which ran ahead of recent episodes and paid tribute to Game of Thrones.\n\nCharlie & Lola\n\n\n\nWhy kids love it: Based on Lauren Child's books, which she began writing in 2000, imagination and sibling love/frustration are the key themes of this great brother and sister show. As Charlie informs us at the beginning of every episode “I have this little sister Lola. She is small and very funny”. Lola then invariably gets up to something or has an idea about something she wants to do, and Charlie has to guide her. As Lola is four years old, she’s immediately identifiable for the kids watching the show as she’s discovering many of the same things as her audience. Like boys and girls her age too, she often doesn’t understand the consequences of her actions but learns through her imaginative adventures.\n\nWhat’s in it for the grown ups? Charlie and Lola is very funny. The good-natured battles between the two characters are highly amusing for anyone who has grown up with brothers and sisters. The episode in which Lola ruins Charlie’s Birthday party by opening all his presents is bound to stir some memories for many people. The show is so well-observed that you really do feel like you’re watching a genuine sibling relationship. It also delivers a great deal of humour from the perspective of a parent. A lot of the things Lola says, or can’t believe, are familiar to what our own children come out with, and being a parent can be the funniest thing in the world.\n\nOld Jack’s Boat\n\n\n\nWhy kids love it: This is a bit of a mixed one. On the one hand it’s the story of a wise old fisherman (Bernard Cribbins) and the assortment of oddballs who populate his seaside town, and on the other it’s a Jackanory-type affair with Jack telling a tale of his adventures at sea with his dog, Salty. Much like James Bolam in the inferior Grandpa in my Pocket, Cribbins presents to the kids a grandparent figure, who will sit and tell them a story. The stories themselves often involve pirates and mermaids, both of which children typically love, while the whole show is presented in a collection of vibrant colours. The dog is also a big draw as my daughter just told me her favourite thing about the show is \"when the dog lost her biscuit.”\n\nWhat’s in it for the grown ups? Well, come on, it’s Bernard Cribbins telling stories? What more could you ask for? The man is a national treasure. If that wasn’t enough though, Old Jack’s Boat features his fellow Doctor Who alumnus Freema Agyeman as Shelly Periwinkle. She owns a café, does a very sexy wink in the opening titles, AND she can make cakes by magic. Making up the cast is the always fun to watch Helen Lederer as a yuppie type with her mobile permanently attached to her ear.\n\nThe show is filmed in the North Yorkshire village of Staithies and it looks every bit the idyllic location, and must conjure up some summer holiday memories for many of us adults who visited similar places. The programme also has the mostly insanely catchy theme tune, performed by Cribbins himself.\n\nSarah & Duck\n\n\n\nWhy kids love it: Sarah is seven years old and her best friend is a duck, called Duck. It’s not unlike a relationship a younger child may have with a soft toy, as Sarah cares for Duck and they have little adventures together that range from conducting music on a set of pipes to climbing inside a bouncy ball machine, from practising the bobsleigh with their friend Scarf Lady to helping their friend Jon (whose best friend is a flamingo) get over his fear of stairs. Sarah converses with the narrator, voiced by Game of Thrones’ Magister Illyrio Mopatis, Roger Allam, in super-cute vocabulary that kids love to mimic.\n\nWhat’s in it for the grown ups? This show is adorable. It’s presented and written in such a sweet way that you just can’t help but fall in love with it. It seems to take place in a wonderful fantasy world, the animal companions for the children not being unlike those in Philip Pullman’s His Dark Materials. The key themes of the show are friendship and problem solving but there are also some great moments of humour. The always-excellent Andy Nyman voices Bag, a character who is, well, a bag, belonging to the forgetful Scarf Lady. He is often grumpy and likes to correct her in a slightly scathing way. Each episode of Sarah & Duck comes in at only seven minutes but every one is an absolute joy of weird characters and jokes. It’s the Twin Peaks of CBeebies.\n\nTommy Zoom\n\n\n\nWhy kids love it: If kids are going to have an early introduction to superheroes then they could do worse than Tommy Zoom. Part live-action, part animation, Tommy Zoom is an environmental friendly superhero who each episode, with the help of his canine sidekick and narrator Daniel, saves the world, or the three people who seem to live in it) from a scheme of the evil Polluto. The show is good for little ones because it’s bright and it’s got a talking dog in it. In fact, it’s never really cleared up in whose imagination the animated superhero adventure part of the show actually takes place. As Daniel, voiced by Jerome Flynn, narrates the show then Tommy Zoom could be unique as the only programme to partly take place entirely in a dog’s mind.\n\nWhat’s in it for the grown ups? This is one of those shows that borders on being annoying yet is somehow compelling. Daniel the dog may be overly self-righteous but his moralistic ramblings are more than made up for by the character of Polluto. Every superhero needs their arch nemesis and Polluto is like a tweenie version of James Bond villain. He even has a cat, called Smog, and emits an evil cackle when detailing his latest plan for world domination.\n\nPeppa Pig\n\n\n\nWhy kids love it: Bright colours, talking animals, catchy music and short episodes – Peppa Pig ticks a lot of boxes for kids and when you add to that there's a theme park and an insane amount of merchandise you can be assured that once it's introduced; it'll be a mainstay for years. Sharing the same creative team and much of the same voice talent to the aforementioned Ben & Holly's Little Kingdom, it covers several of the same themes but without the bonus of magical shenanigans. Unless of course you consider anthropomorphic animals magical, in which case there's tons of it. Like many kids' shows, Peppa Pig focuses on the importance of friendship and family, and even if Peppa herself is something of a bossy little runt there are many characters that provide positive examples.\n\nWhat's in it for the grown ups? If you appreciate bass-voiced male figures doing the best they can there's a fair bit of that. As a father of a daughter I like that there are plenty of positive female role models in the show who demonstrate a very strong work ethic and hold down multiple jobs at the same time. Typically, the female characters fare much, much, better than their male counterparts which is refreshing to see. The show addresses single-parent families and the differences in species is occasionally used to as a way to promote acceptance between races which again is a very positive aspect.\n\nPingu\n\n\n\nWhy kids love it: Again, another classic anthropomorphic animal, albeit this time without the use of a recognisable language. Pingu is a mischievous penguin who lives in the south pole with his family and frequently gets into all sorts of mischief which results in slapstick shenanigans. It's a show that has stood the test of time and for good reason; it's funny and at times quite insane.\n\nWhat's in it for the grown ups? I mentioned Pingu's insanity above and I had one particular episode in mind when I did; an episode that scared the bejeezus out of my daughter when she first watched it. I later learned that the episode, Pingu's Dream, was once banned because of just this talent for freaking kids out. It features a giant walrus that terrorises Pingu in a similar way to Freddy Kruger; he haunts his dreams, chases and tortures him. Traumatic nightmare-monsters aside, Pingu is good clean family fun that hits the double whammy of introducing your child to stop-motion animation (why not use it as a nice stepping stone to the works of Ray Harryhausen?). There's also plenty of toilet humour in Pingu; numerous moments when I look up and he's urinating everywhere. Whilst this is no doubt funny, perhaps give these episodes a miss whilst potty training eh?\n\nTrotro\n\n\n\nWhy kids love it: This will be the last of the anthropomorphic animal entries, I promise. It's one my daughter stumbled on whilst browsing Netflix and seems to have been something of a hit. Trotro is a small donkey boy who's equally as obnoxious as Peppa Pig but tends to get shown up for it more often than not. It's what you'd expect; brightly coloured fun delivered in short bursts with a catchy theme tune.\n\nWhat's in it for the grown ups? It's a French animated show based on a popular series of books by Bénédicte Guettier so you can view it as an introduction to foreign cinema for your little one. Perhaps think of it as Blue is the Warmest Colour for kids, but with donkeys instead of people and er, the naughtiness removed.\n\nAdventure Time\n\n\n\nWhy kids love it: For very much the same reason that adults love it; Adventure Time is awesome. It may seem slightly out of place when listed with some of the shows on this list, and you may question how responsible it is to show it to a toddler, but it's worth pointing out that I watched RoboCop at eight and I turned out Okay(ish). Adventure Time is the creation of Pendleton Ward and follows Finn the human and Jake the dog, who has magical powers as they find themselves in a series of, well, adventures in the land of Ooo. Brightly coloured, action-packed and very funny, Adventure Time is one of the finest animated shows around. Admittedly, it has lead to my two-and-a-half-year-old daughter saying “dude” a lot of late, but I can live with that.\n\nWhat's in it for the grown ups? As if you're not sold on this already. Okay, fine; again, it's brilliant, hilarious and insane. Jake is possibly one of the most gifted but ultimately lazy heroes I've seen. Like a talking dog version of Bill Murray, there's the strong sense that if Jake wasn't spurring him on nothing would get done. It's a show that will prove a hit with your child and one that you can watch and enjoy in a different way given that much of the humour is pitched at adults. It's brilliant, buy everything.\n\nYo Gabba Gabba!\n\n\n\nWhy kids love it: As big a hit as many of the aforementioned shows have been with my daughter, if I had to pick one that she's watched and enjoyed more than any other it would be Yo Gabba Gabba! Since before she was walking, the bright colours, characters and musical sequences captivated her and now she dances and sings along, which has been great to see. The brainchild of Christian Jacobs (Lead Singer of The Aquabats) and Scott Schultz who worked together as teens on skateboarding videos and after becoming fathers set out to make an entertaining kids show showcasing real artists and performers, and very much achieved that. Episodes move at a brisk pace and focus on particular themes as the inhabitants of Gabba Land (Brobee, Plex, Muno, Foofa, Toodee) under the guidance of DJ Lance Rock, learn life lessons and become better people through play, song and dance with the action being broken up with guest musical performances from some big names, short cartoons and 8-bit video game clips.\n\nWhat's in it for the grown ups? When you become a parent there are a number of questions you have to ask; once you've got the big ones out of the way like name, breast or bottle-feed, re-useable or disposable nappies etc you soon get to arguably the biggest questions of all; do I want Devo's Mark Mothersbaugh to be my child’s art teacher? And do I want Biz Markie to teach my kid how to beat box? The answer to both is obviously yes.\n\nTo list the cool guest stars both musical and not would take far too long so I suggest you quickly look them up; it's really an embarrassment of riches that you'll get as much out of as your kids. As cool as some of the musical guest stars are, some of the original songs composed for the show are also outstanding. There's a song titled Think Happy Thoughts in the Sleep episode which in my mind is the finest to feature in a show primarily aimed at kids since Rainbow Connection (incidentally performed on a later show by Paul Williams), it's really that good. If you're looking to pick two episodes to see if they stick I'd suggest Sleep and Differences are particularly strong.\n\n(Full disclosure, I should point out that when I first saw the show I absolutely hated it; it seemed to be migraine-induced hipster nonsense but I was soon won over. The show's heart is in the right place, it promotes messages in an effective and not too preachy way and is also loads of fun. Unfortunately the handling of the show in the UK seems to have been a little troubled from what I've heard (I own all eps imported) but there are DVDs available. It's well worth seeking out.)\n\nSpecial mention: To pretty much anything on CBeebies a channel that produces a vast range of quality kids' television that more than justifies the licence fee for any parent. We praised the work of Justin Fletcher a while back, and that celebration very much remains justified. There are also great shows such as Mr Bloom, I Can Cook etc that remain fun and present easy activities to do with all the family.\n\nFollow our Twitter feed for faster news and bad jokes right here. And be our Facebook chum here.", "images": ["https://cdn-static.denofgeek.com/sites/denofgeek/files/styles/popular_block_thumbs/public/2019/07/dexter_fletcher_1280_gettyimages-599523240.jpg?itok=Mn4n7J35", "https://cdn-static.denofgeek.com/sites/denofgeek/files/styles/16x9_300/public/2019/07/comic-movies-collage.jpg?itok=Rx-a3U6V", "https://cdn-static.denofgeek.com/sites/denofgeek/files/styles/article_width/public/adventure_time_1.jpg?itok=nw5cSKQY", "https://cdn-static.denofgeek.com/sites/denofgeek/files/styles/article_width/public/peppa_pig.jpg?itok=sTQMHWUo", "https://cdn-static.denofgeek.com/sites/denofgeek/files/styles/article_width/public/old_jacks_boat.jpg?itok=3u3JkpoZ", "https://cdn-static.denofgeek.com/sites/denofgeek/files/styles/popular_block_thumbs/public/walking-dead-comic-dante-image-comics.jpg?itok=ChbydD8J", "https://cdn-static.denofgeek.com/sites/denofgeek/files/styles/article_width/public/charlie_lola.jpg?itok=vFgvmqdp", "https://cdn-static.denofgeek.com/sites/denofgeek/files/styles/article_width/public/trotro.jpg?itok=uS4SEpJ1", "https://cdn-static.denofgeek.com/sites/denofgeek/files/styles/16x9_300/public/2019/04/rise-of-skywalker.jpg?itok=rqa5nvnK", "https://cdn-static.denofgeek.com/sites/denofgeek/files/styles/popular_block_thumbs/public/2019/06/criminal_david_tennant_netflix_0.jpg?itok=g4cGyHJe", "https://cdn-static.denofgeek.com/sites/denofgeek/files/styles/popular_block_thumbs/public/2019/07/taskmaster_series_9.jpg?itok=b-Y_Zgas", "https://cdn-static.denofgeek.com/sites/denofgeek/themes/denofgeek_uk/logo.png", "https://cdn-static.denofgeek.com/sites/denofgeek/files/styles/popular_block_thumbs/public/2019/07/gettyimages-630421358_-_h_2017.jpg?itok=St5Fsd-Q", "https://cdn-static.denofgeek.com/sites/denofgeek/files/styles/popular_block_thumbs/public/2019/07/another-life.jpg?itok=XZVJEVXI", "https://sb.scorecardresearch.com/p?c1=2&c2=6036152&c3=&c4=https%3A//www.denofgeek.com/tv/29456/10-great-tv-shows-for-geek-parents-to-watch-with-their-kids&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn-static.denofgeek.com/sites/denofgeek/files/styles/article_width/public/ben_and_holly.jpg?itok=-4pn3gcy", "https://cdn-static.denofgeek.com/sites/denofgeek/files/styles/main_wide/public/adventure_time_1.jpg?itok=y716ih9x", "https://cdn-static.denofgeek.com/sites/denofgeek/files/styles/popular_block_thumbs/public/2019/07/stranger_things_3_soup_monster.jpg?itok=TyRrWJza", "https://cdn-static.denofgeek.com/sites/denofgeek/files/styles/popular_block_thumbs/public/2019/07/sith-trooper-hot-toys-sdcc-2019_1.jpg?itok=MkjpxZd8", "https://cdn-static.denofgeek.com/sites/denofgeek/files/styles/16x9_300/public/2019/07/the_week_in_geek_quiz_1.jpg?itok=P7wDYiWp", "https://cdn-static.denofgeek.com/sites/denofgeek/files/styles/article_width/public/yo_gabba_gabba.jpg?itok=nEAFRP6x", "https://cdn-static.denofgeek.com/sites/denofgeek/files/styles/popular_block_thumbs/public/2019/07/sandman_large.jpg?itok=KOmYIooY", "https://cdn-static.denofgeek.com/sites/denofgeek/files/styles/article_width/public/pingu.jpg?itok=URna6oxW", "https://cdn-static.denofgeek.com/sites/denofgeek/files/styles/article_width/public/tommy_zoom.jpg?itok=SZJ4olJ2", "https://cdn-static.denofgeek.com/sites/denofgeek/files/styles/article_width/public/sarah_and_duck.jpg?itok=iynVg4-g", "https://cdn-static.denofgeek.com/sites/denofgeek/files/styles/popular_block_thumbs/public/2019/07/baldurs_gate_3.jpeg?itok=PCUWVCUW", "https://cdn-static.denofgeek.com/sites/denofgeek/files/adventure_time_1.jpg", "https://cdn-static.denofgeek.com/sites/denofgeek/files/styles/16x9_300/public/2018/09/avatar-1440x810.jpg?itok=CRPAG_3w"], "top_img": "https://cdn-static.denofgeek.com/sites/denofgeek/files/adventure_time_1.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.denofgeek.com/tv/29456/10-great-tv-shows-for-geek-parents-to-watch-with-their-kids", "title": "10 great TV shows to enjoy with your kids", "meta_data": {"twitter": {"url": "https://www.denofgeek.com/tv/29456/10-great-tv-shows-for-geek-parents-to-watch-with-their-kids", "site": {"identifier": "@denofgeek", "id": 19543893}, "card": "summary", "description": "“Urgh, I’m so hungover.  I’m going to sit in my pants and watch movies all day”", "title": "10 great TV shows to enjoy with your kids"}, "og": {"site_name": "Den of Geek", "title": "10 great TV shows to enjoy with your kids", "description": "From Adventure Time to Old Jack's Boat, James and Glen talk us through ten modern kids' TV shows that geek parents can enjoy too...", "image": "https://cdn-static.denofgeek.com/sites/denofgeek/files/adventure_time_1.jpg", "url": "https://www.denofgeek.com/tv/29456/10-great-tv-shows-for-geek-parents-to-watch-with-their-kids", "type": "article"}, "HandheldFriendly": "true", "format-detection": "telephone=no", "viewport": "user-scalable=yes, width=device-width, maximum-scale=1.6, initial-scale=1.0", "copyright": "Dennis Publishing Limited, licensed by Felden", "apple-mobile-web-app-capable": "yes", "generator": "Drupal 7 (http://drupal.org)", "description": "From Adventure Time to Old Jack's Boat, James and Glen talk us through ten modern kids' TV shows that geek parents can enjoy too..."}, "movies": [], "publish_date": null, "source": "https://www.denofgeek.com", "summary": ""}