{"url": "https://web.archive.org/web/20180421024404/https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/04/20/smallville-actress-allison-mack-arrested-for-recruiting-women-for-sex-cult-leader/", "text": "\n\nAllison Mack arrives at the Hollywood FX Summer Comedies Party in Los Angeles in June 2012. (Gus Ruelas/Reuters)\n\nActress Allison Mack, best known for her decade on TV’s “Smallville,” and Keith Raniere, the leader of what authorities allege is a sex cult, were indicted Friday in New York on federal charges of sex trafficking and conspiracy to commit forced labor, the Albany Times-Union reported.\n\nRaniere and Mack are each charged with multiple counts, and could face a minimum of 15 years in prison. Mack was arrested in New York City on Friday and will be held pending a bail hearing Monday. Raniere has been in custody since he was arrested in Mexico in March.\n\nRaniere is the founder of NXIVM, which bills itself as a self-help and empowerment organization, but is described by authorities as a cultlike group whose members recruited women to be sex slaves, and branded their pubic regions with Raniere’s initials.\n\nThe Rochester Democrat & Chronicle said Mack was indicted “for her role in DOS, a group … that purported to be a women’s empowerment sorority. Prosecutors, however, say DOS was actually a sex-slave ring led by Raniere, with women known as ‘slaves’ who reported to ‘masters’ who ultimately reported to Raniere himself. Mack is an alleged co-conspirator, reporting directly to Raniere.”\n\nMack, 35, is alleged by prosecutors to have recruited slaves for pay, forcing the women to have sex with Raniere, and using explicit photos and damaging information to ensure their compliance.\n\nAccording to the Associated Press, prosecutors said Mack told recruits that they were joining a female mentorship group.\n\n“Mack and other … masters recruited … slaves by telling them that they were joining a women-only organization that would empower them and eradicate purported weaknesses the NVIVM curriculum taught were common in women,” prosecutors said.\n\nBut “the victims were then exploited, both sexually and for their labor to the defendants’ benefit,” said U.S. Attorney Richard P. Donoghue of the Eastern District of New York in Brooklyn.\n\nAssistant U.S. Attorney Moira Kim Penza also said in court that “under the guise of female empowerment,” Mack “starved women until they fit her co-defendant’s sexual ideal,” the AP wrote.\n\nMack starred in the CW Network series as Chloe Sullivan from 2001 to 2011, and has been in a handful of television series roles since, according to her IMDB page.\n\nAccording to CBS News:\n\nFormer NXIVM publicist Frank Parlato told Inside Edition that Mack is “completely enamored with Raniere and completely under his thrall.” He also said that Mack and her “Smallville” co-star, Kristin Kreuk, were used as “poster girls for normalizing the group.” Kreuk says she left NXIVM years ago and commended the women who exposed DOS.\n\n[Feds say self-help guru coerced followers into sex, had them branded with a cauterizing pen]\n\nRaniere, 57, known to his followers as ‘the Vanguard’ — was living in a villa in Puerto Vallarta with several women, according to federal prosecutors, before he was apprehended in March. Mexican authorities took him into custody and delivered him to Texas; he’s now in federal custody in Brooklyn. As Raniere was taken from the villa, The Post’s Kyle Swenson wrote, citing prosecutors, the women chased after authorities in their own car at high speed.\n\n“In my opinion, NXIVM is one of the most extreme groups I have ever dealt with in the sense of how tightly wound it is around the leader,” cult expert Rick Ross told the Times-Union in 2012.\n\nThe U.S. Attorney’s Office in Brooklyn last week wrote in court documents that Rainere has “a decades-long history of abusing women and girls,” and accused him of having sex with minors.\n\nIn a statement attributed to Raniere on NXIVM’s website, he proclaimed his innocence and said he believed the justice system would prevail. He also denied affiliation with DOS, the sorority.\n\nThe Times-Union, however, wrote that “federal court records indicate emails seized from Raniere’s private messaging accounts support the conclusion that Raniere created the club, which was known as ‘Dominus Obsequious Sororium,’ which means ‘Master Over the Slave Women.’ ”\n\nRead more:\n\nHe dressed as Spider-Man and washed windows at a hospital. Turns out he’s a child pornographer.\n\nA father gets 60 years in prison for trying to sell his daughter for sex. She was 4.\n\nA teen helped police find his missing friend’s body. Detectives now suspect he’s the killer.", "images": ["https://web.archive.org/web/20180421024404im_/https://www.washingtonpost.com/resizer/A3Aq4Ve4wbuTcRYToskz031zJEE=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/67UREMBPLM2NDKXFY4XM4KGD4Q.jpg", "https://web.archive.org/web/20180421024404im_/https://www.washingtonpost.com/pb/resources/img/thewashingtonpost-white-2x.png", "https://web.archive.org/web/20180421024404im_/https://www.washingtonpost.com/pb/resources/img/TWPLogos-twp_black-268x.png", "https://web.archive.org/web/20180421024404im_/https://www.washingtonpost.com/resizer/Z4_Z0yKFFbmP-DiYI3sFtt2_LCo=/180x180/s3.amazonaws.com/arc-authors/washpost/eb36a92f-632b-489a-aafc-7aa939f469f7.png", "https://web.archive.org/web/20180421024404im_/https://sb.scorecardresearch.com/p?c1=2&c2=3005617&cv=2.0&cj=1", "https://web.archive.org/web/20180421024404im_/https://www.washingtonpost.com/resizer/pUK-BhE3RHKQJAmSu4vo-XO9_v8=/480x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/P6BW3PHMNQ3DPAMQVHT6I4QWIM.jpg", "https://web.archive.org/web/20180421024404im_/https://me.effectivemeasure.net/em_image"], "top_img": "https://web.archive.org/web/20180421024404im_/https://www.washingtonpost.com/resizer/A3Aq4Ve4wbuTcRYToskz031zJEE=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/67UREMBPLM2NDKXFY4XM4KGD4Q.jpg", "keywords": [], "authors": ["Keith Mcmillan", "After Spending Nearly Years As An Editor In Sports With The Post", "Is A Deputy Editor On The General Assignment Desk."], "canonical_link": "https://web.archive.org/web/20180421024404/https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/04/20/smallville-actress-allison-mack-arrested-for-recruiting-women-for-sex-cult-leader/", "title": "‘Smallville’ actress Allison Mack accused of recruiting women for sex-cult leader", "meta_data": {"object-hash": 1524272608, "viewport": "width=device-width, initial-scale=1.0, user-scalable=yes, minimum-scale=0.5, maximum-scale=2.0", "referrer": "unsafe-url", "keywords": "Allison Mack, Keith Raniere, NXIVM, DOS, sex trafficking, Smallville, sex cult,", "news_keywords": "Allison Mack, Keith Raniere, NXIVM, DOS, sex trafficking, Smallville, sex cult,", "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "creator": "@D3Keith"}, "og": {"type": "article", "site_name": "Washington Post", "url": "https://web.archive.org/web/20180421024404/https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/04/20/smallville-actress-allison-mack-arrested-for-recruiting-women-for-sex-cult-leader/", "image": "https://web.archive.org/web/20180421024404im_/https://www.washingtonpost.com/resizer/A3Aq4Ve4wbuTcRYToskz031zJEE=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/67UREMBPLM2NDKXFY4XM4KGD4Q.jpg", "title": "‘Smallville’ actress Allison Mack accused of recruiting women for sex-cult leader", "description": "Federal prosecutors allege that the actress was a top lieutenant to \"cult\" leader Keith Rainere, who is also indicted for sex trafficking and forced labor."}, "article": {"publisher": "https://www.facebook.com/washingtonpost", "content_tier": "metered"}, "fb": {"app_id": 41245586762, "admins": 500835072}, "zeusAds": "true", "description": "Federal prosecutors allege that the actress was a top lieutenant to \"cult\" leader Keith Rainere, who is also indicted for sex trafficking and forced labor.", "robots": "index,follow", "theme": "normal"}, "movies": [], "publish_date": 1524196800.0, "source": "https://web.archive.org", "summary": ""}