{"url": "https://www.washingtonpost.com/news/reliable-source/wp/2017/12/16/an-snl-cast-member-got-a-hillary-clinton-tattoo-on-his-leg-she-says-shes-honored/", "text": "\n\nPete Davidson of “Saturday Night Live,” pictured at a Comedy Central roast in 2015, recently showcased his Hillary Clinton tattoo. (Chris Pizzello/Invision/AP)\n\n“Saturday Night Live” cast member Pete Davidson recently unveiled a new tattoo to his Instagram followers — and boy, was it a talker.\n\nThe 24-year-old comedian posted a picture Friday of the latest addition to his leg: a tattoo of 2016 Democratic presidential nominee Hillary Clinton.\n\n“Wanted to get @hillaryclinton a Christmas gift so I got a tattoo of my hero,” Davidson wrote in the caption. “Thanks for being such a badass and one of the strongest people in the universe.”\n\nHe added a heart emoji and tagged New York tattoo artist Jon Mesa.\n\nIn the span of a day, tens of thousands of people liked the post, and several thousand commented on it. Predictably, the feedback was sharply divided, with some admiring Davidson’s new ink and others lambasting his “awful” choice.\n\nMesa, the tattoo artist tagged in Davidson’s post, uploaded a picture of the same tattoo Friday night on his own Instagram account.\n\nA call to Mesa’s tattoo shop, No Idols Tattoo in Manhattan’s Chinatown, confirmed that the Instagram posts were not a joke or part of some elaborate SNL setup: Davidson did in fact get inked with a mini portrait of Clinton on his right leg Thursday night, a woman who answered the phone at the shop Saturday told The Washington Post. (The woman relayed brief messages shouted across the parlor by Mesa, who was not immediately available for comment because he was busy tattooing another client, she said.)\n\n[Pete Davidson, the SNL comic famous for weed jokes, announces he is sober ‘for the first time in 8 years’]\n\nIt’s unclear what led to Davidson’s decision or the artistic process that prompted Mesa to draw Clinton with slightly longer-than-usual hair and a structured, button-down suit jacket. But among the fans of the new tattoo was apparently Clinton herself.\n\n“Thanks, @petedavidson. This makes it significantly less awkward that I’ve had a Pete Davidson tattoo for years,” the former secretary of state wrote in a comment on Davidson’s Instagram post. “But seriously, I’m honored. Merry Christmas my friend.”\n\nDavidson simply replied: “OMG WHAAAAAAAAT!!!!” according to an image of the exchange captured by Entertainment Weekly’s Jillian Sederholm.\n\nA spokesman for Clinton confirmed the exchange was real — and that she was, in fact, joking about also having a tattoo of Davidson.\n\n“[Clinton] saw Pete’s Instagram post on a flight back from L.A. to New York and replied from her account,” Clinton spokesman Nick Merrill told The Post in an email. “And that is correct, while she is fond Pete Davidson, she has no tattoos of him … yet.”\n\nIn 2014, Davidson became one of the youngest cast members on SNL when he joined the show at age 20. The comic, who frequently joked about marijuana in SNL sketches, made headlines earlier this year when he announced he was sober “for the first time in 8 years.”\n\nThis post has been updated.\n\nRead more:\n\nIs Ivanka trying to wrangle an invitation to the royal wedding?\n\nAt Washington screening for ‘The Post,’ Tom Hanks and Steven Spielberg find parallels to Nixon era\n\n‘He is a bully’: Gillibrand hits back at Trump over demeaning tweet\n\nSNL cold open: Kids wonder whether Al Franken, Roy Moore and Trump are on Santa’s naughty list", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=3005617&cv=2.0&cj=1", "https://www.washingtonpost.com/resizer/4Nen-kO5ek_Qv5NohGzW6EuGM8U=/960x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ILFVAEGIU45NXLLQA6QEOTWY7I.jpg", "https://www.washingtonpost.com/resizer/yAFxThroW-CI5t-yu8Q6FsF7kHI=/1x1/www.washingtonpost.com/pb/resources/img/spacer.gif", "https://me.effectivemeasure.net/em_image", "https://www.washingtonpost.com/resizer/zeWoVYF8rVJXufnMzxq0TmQq_bk=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/EDYCEJBTWU2GFCGZCGHV4G2A3M.jpg"], "top_img": "https://www.washingtonpost.com/resizer/zeWoVYF8rVJXufnMzxq0TmQq_bk=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/EDYCEJBTWU2GFCGZCGHV4G2A3M.jpg", "keywords": [], "authors": ["Amy B Wang", "National Politics Reporter Covering Presidential Campaigns", "December", "Amy B Wang Is A National Politics Reporter Covering Presidential Campaigns. She Joined The Washington Post In As A General Assignment Reporter After Seven Years With The Arizona Republic."], "canonical_link": "https://www.washingtonpost.com/news/reliable-source/wp/2017/12/16/an-snl-cast-member-got-a-hillary-clinton-tattoo-on-his-leg-she-says-shes-honored/", "title": "An SNL cast member got a Hillary Clinton tattoo on his leg. She says she’s ‘honored.’", "meta_data": {"object-hash": 1519602485, "viewport": "width=device-width, initial-scale=1.0, user-scalable=yes, minimum-scale=0.5, maximum-scale=2.0", "referrer": "unsafe-url", "keywords": "SNL, Hillary Clinton tattoo, Pete Davidson, Saturday Night Live, Jon Mesa, No Idols Tattoo", "news_keywords": "SNL, Hillary Clinton tattoo, Pete Davidson, Saturday Night Live, Jon Mesa, No Idols Tattoo", "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "creator": "@amybwang"}, "og": {"type": "article", "site_name": "Washington Post", "url": "https://www.washingtonpost.com/news/reliable-source/wp/2017/12/16/an-snl-cast-member-got-a-hillary-clinton-tattoo-on-his-leg-she-says-shes-honored/", "image": "https://www.washingtonpost.com/resizer/zeWoVYF8rVJXufnMzxq0TmQq_bk=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/EDYCEJBTWU2GFCGZCGHV4G2A3M.jpg", "title": "An SNL cast member got a Hillary Clinton tattoo on his leg. She says she’s ‘honored.’", "description": "The tattoo shop confirmed Pete Davidson's newest ink was real."}, "article": {"publisher": "https://www.facebook.com/washingtonpost", "content_tier": "metered"}, "fb": {"app_id": 41245586762, "admins": 500835072}, "zeusAds": "true", "description": "The tattoo shop confirmed Pete Davidson's newest ink was real.", "robots": "index,follow", "theme": "normal"}, "movies": [], "publish_date": 1513400400.0, "source": "https://www.washingtonpost.com", "summary": ""}