{"url": "https://en.wikipedia.org/wiki/Lisa_Bonet", "text": "Lilakoi Moon (born Lisa Michelle Bonet, November 16, 1967)[2][3][4] is an American actress. Bonet is best known for her role as Denise Huxtable on the NBC sitcom The Cosby Show, which originally aired from 1984 to 1992, and later originally starring in its spinoff comedy, A Different World, for its first season (1987–1988).[5]\n\nEarly life [ edit ]\n\nBonet was born in San Francisco, California,[6] the daughter of Arlene (née Litman), a music teacher, and Allen Bonet, an opera singer. Her father, from Texas, was African-American, and her mother is Jewish.[7][8][9][2][4] She has several younger half-siblings. Bonet attended Birmingham High School in Van Nuys, California.[10] She attended the Celluloid Actor's Studio in North Hollywood where she majored in acting.[11]\n\nCareer [ edit ]\n\nAfter being in beauty competitions and appearing in guest spots on television series as a child, Bonet landed the role of Denise Huxtable on The Cosby Show alongside Bill Cosby and Phylicia Rashad[12]. In 1987 she briefly left The Cosby Show to star in the spin-off series A Different World, which focused on Denise's life at college. That year, Bonet, then 19, appeared in the role of 17-year-old Epiphany Proudfoot in the movie Angel Heart opposite Mickey Rourke, directed by Alan Parker.[13]\n\nIn the film, several seconds of an explicit scene she shared with Rourke (filmed when she was 18) were edited to ensure an R rating.[14] It was followed by a topless centerspread in Interview magazine.[15] After announcing her pregnancy during the run of A Different World, Bonet left the series.[16] She returned to The Cosby Show the following year, but was fired in April 1991 because of \"creative differences\".[17]\n\nAfter The Cosby Show, Bonet appeared in straight-to-video releases and made-for-television movies. In September 1992 she hosted Why Bother Voting?, an election special focusing on the concerns and apathy of young voters. In 1998 she had a supporting role in Enemy of the State with Will Smith, and in 2000 she appeared in the film High Fidelity with John Cusack. In 2003 she played the role of Queenie in Biker Boyz, which reunited her with former co-star Kadeem Hardison of A Different World.[18]\n\nBonet also co-starred in the film Whitepaddy in 2006, alongside Sherilyn Fenn, Hill Harper, Debra Wilson, Karen Black, and Kareem Abdul-Jabbar. Two years later she appeared in the United States adaptation of the British television series Life on Mars.[19][20]\n\nPersonal life [ edit ]\n\nOn November 16, 1987, her 20th birthday, Bonet eloped with American rock singer Lenny Kravitz in Las Vegas. Bonet recalled of their relationship:\n\nIt was interesting when we were first finding out about each other, that our backgrounds were so similar. When I first told him my mom was Jewish, and he said 'So's my dad,' I thought that was both unusual and enchanting. I felt like, 'Okay, here's someone who really knows how it is.' And I think I trusted him a little more with my feelings and let him inside a little more than I ordinarily would have.[21][22]\n\nBonet gave birth to their daughter Zoë Isabella Kravitz on December 1, 1988.[23] She and Kravitz separated in 1993. In 1995 Bonet legally changed her name to Lilakoi Moon, although she still uses the name Lisa Bonet professionally.[1]\n\nIn 2005 she began a relationship with actor Jason Momoa. Although it was widely believed that Momoa and Bonet married on November 15, 2007, it was not made official until October 2017.[24] In July 2007 Bonet gave birth to her second child, her first daughter with Momoa. The couple had a son in December 2008.[25]\n\nBonet believes in anti-vaccine theories: \"[Vaccines] introduce alien microorganisms into our children’s blood which could potentially have serious long-term effects\", she has said. Of vaccinating her children, she said, \"It’s very scary and it’s very serious, and I think because I felt wrong doing it, that’s why I didn’t do it\".[26]\n\nFilmography [ edit ]\n\nFilm\n\nTelevision\n\nMusic video director\n\nAwards and nominations [ edit ]\n\nReferences [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/5/57/Denise_Huxtable_A_Different_World.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/5/57/Denise_Huxtable_A_Different_World.png/220px-Denise_Huxtable_A_Different_World.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/5/57/Denise_Huxtable_A_Different_World.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Lisa_Bonet", "title": "Lisa Bonet", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.13", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/5/57/Denise_Huxtable_A_Different_World.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}