{"url": "https://www.cinemablend.com/new/Quentin-Tarantino-Absolutely-Doesn-t-Hate-Women-According-His-Leading-Lady-99637.html", "text": "Quentin Tarantino Absolutely Doesn't Hate Women, According To His Leading Lady Gregory Wakeman Random Article Blend Facebook\n\n\n\n\n\ncinemablend\n\n\n\nEmail\n\n\n\nThe Hudsucker Proxy actress worked with the Reservoir Dogs, Kill Bill, Pulp Fiction, and Inglorious Basterds director for the first time on\n\n\n\nBecause of the brutal way that her character is treated in The Hateful Eight, He's about the most un-misogynistic person I've ever met. He loves women. He writes the best parts for women around, really.\n\nCalls of misogyny against Quentin Tarantino are a tad perplexing, considering some of the iconic roles that he has created for women. Sure, women are reduced to bit-parts in Reservoir Dogs, but Pulp Fiction’s promotional campaign was mostly built around the iconic image of\n\n\n\nQuentin Tarantino then followed this up with four films that were each led by women too, with Jackie Brown, Kill Bill: Volume 1, Kill Bill: Volume 2, and Death Proof. In each of these films the female characters were written in a strong, complex and original style.\n\n\n\nIn fact, over the last two decades Quentin Tarantino has probably been the most prolific director for giving women leading roles in mainstream American cinema. OK, they might get themselves into some scraps along the way, but that’s always going to be the case since Quentin Tarantino’s film worlds consist of heavy amounts of violence.\n\n\n\nJennifer Jason Leigh’s Daisy Domergue is the victim of some particular abuse, especially from Kurt Russell’s John Ruth \"The Hangman,\" but that’s only par for the course with The Hateful Eight’s story. And Leigh’s reactions and performance in response to this abuse are either outrageous or shocking, and always entertaining. In fact, she’s so scene-stealingly fantastic in The Hateful Eight that she rivals Samuel L. Jackson for its star performer. It's not just those two who excel though, as everyone in The Hateful Eight is superb. Jennifer Jason Leigh has leapt to the defense of Quentin Tarantino insisting that the director is \"the most un-misogynist person\" that she’s ever met.The Hudsucker Proxy actress worked with the Reservoir Dogs, Kill Bill, Pulp Fiction, and Inglorious Basterds director for the first time on The Hateful Eight . And the two brought the best out of each other, because not only is Jennifer Jason Leigh stupendously compelling as the captured fugitive Daisy Domergue, but Quentin Tarantino clearly enjoys putting her in increasingly violent and gory situations.Because of the brutal way that her character is treated in The Hateful Eight, The Hollywood Reporter decided to ask Jennifer Jason Leigh for her thoughts on whether Quentin Tarantino is a misogynist. And she was rather emphatic with her response:Calls of misogyny against Quentin Tarantino are a tad perplexing, considering some of the iconic roles that he has created for women. Sure, women are reduced to bit-parts in Reservoir Dogs, but Pulp Fiction’s promotional campaign was mostly built around the iconic image of Uma Thurman’s Mia Wallace wearing black, laying on a bed, and seductively smoking a cigarette.Quentin Tarantino then followed this up with four films that were each led by women too, with Jackie Brown, Kill Bill: Volume 1, Kill Bill: Volume 2, and Death Proof. In each of these films the female characters were written in a strong, complex and original style.In fact, over the last two decades Quentin Tarantino has probably been the most prolific director for giving women leading roles in mainstream American cinema. OK, they might get themselves into some scraps along the way, but that’s always going to be the case since Quentin Tarantino’s film worlds consist of heavy amounts of violence.Jennifer Jason Leigh’s Daisy Domergue is the victim of some particular abuse, especially from Kurt Russell’s John Ruth \"The Hangman,\" but that’s only par for the course with The Hateful Eight’s story. And Leigh’s reactions and performance in response to this abuse are either outrageous or shocking, and always entertaining. In fact, she’s so scene-stealingly fantastic in The Hateful Eight that she rivals Samuel L. Jackson for its star performer. It's not just those two who excel though, as everyone in The Hateful Eight is superb. Jennifer Jason Leigh didn’t stop there with her praise for Quentin Tarantino though, because when she was asked to praise the filmmaker in just three words in the same interview she called him a \"genius\" as well as \"enthusiastic\" and then insisted that he was \"loving\" too. You’ll get to experience their lovein' yourself when The Hateful Eight is finally released on Christmas Day. Blended From Around The Web\n\nBack to top", "images": ["data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR4nGNaOxMAAfwBSW8IE8UAAAAASUVORK5CYII=", "https://ct.pinterest.com/v3/?tid=YourTagID&noscript=1", "https://img.cinemablend.com/cb/6/4/3/a/d/a/643adae18f54668b7449bd6338ae483408e1299efbe9684d3141e1ff276ee5aa.jpg", "https://i.imgur.com/EmLcl1s.gif", "https://img.cinemablend.com/filter:scale/cb/6/4/3/a/d/a/643adae18f54668b7449bd6338ae483408e1299efbe9684d3141e1ff276ee5aa.jpg?mw=600", "https://sp.analytics.yahoo.com/spp.pl?a=1000772689113&.yp=431002", "https://sb.scorecardresearch.com/p?c1=2&c2=21229662&cv=2.0&cj=1"], "top_img": "https://img.cinemablend.com/cb/6/4/3/a/d/a/643adae18f54668b7449bd6338ae483408e1299efbe9684d3141e1ff276ee5aa.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.cinemablend.com/new/Quentin-Tarantino-Absolutely-Doesn-t-Hate-Women-According-His-Leading-Lady-99637.html", "title": "Quentin Tarantino Absolutely Doesn't Hate Women, According To His Leading Lady", "meta_data": {"msapplication-TileColor": "#f5aa06", "msapplication-config": "/static/browserconfig.xml", "theme-color": "#ffffff", "article": {"tag": "The Hateful Eight", "publisher": "https://www.cinemablend.com/", "published_time": "2015-12-11T22:27:20+00:00", "modified_time": "2018-10-08T21:15:01+00:00", "section": "news"}, "CinemaBlend": 10042, "page": "story", "description": "Jennifer Jason Leigh has leapt to the defense of Quentin Tarantino after being asked whether the director is a misogynist.", "robots": "all", "msvalidate.01": "9AA1A3C35B6D716AE80C1B615C6E8FE8", "fb": {"pages": 90893081682, "app_id": 956050344476201, "admins": 585420252}, "og": {"title": "Quentin Tarantino Absolutely Doesn't Hate Women, According To His Leading Lady", "url": "https://www.cinemablend.com/new/Quentin-Tarantino-Absolutely-Doesn-t-Hate-Women-According-His-Leading-Lady-99637.html", "image": {"identifier": "https://img.cinemablend.com/cb/6/4/3/a/d/a/643adae18f54668b7449bd6338ae483408e1299efbe9684d3141e1ff276ee5aa.jpg", "width": 600, "height": 300}, "description": "Jennifer Jason Leigh has leapt to the defense of Quentin Tarantino after being asked whether the director is a misogynist.", "type": "article", "site_name": "CINEMABLEND"}, "twitter": {"title": "Quentin Tarantino Absolutely Doesn't Hate Women, According To His Leading Lady", "description": "Jennifer Jason Leigh has leapt to the defense of Quentin Tarantino after being asked whether the director is a misogynist.", "image": "https://img.cinemablend.com/cb/6/4/3/a/d/a/643adae18f54668b7449bd6338ae483408e1299efbe9684d3141e1ff276ee5aa.jpg", "card": "summary_large_image", "site": "@cinemablend", "url": "https://www.cinemablend.com/new/Quentin-Tarantino-Absolutely-Doesn-t-Hate-Women-According-His-Leading-Lady-99637.html"}}, "movies": [], "publish_date": 1449872840.0, "source": "https://www.cinemablend.com", "summary": ""}