{"url": "http://www.goerie.com/entertainment/20180913/american-horror-story-apocalypses-leslie-grossman-tells-murder-house-and-coven-fans-to-be-patient", "text": "American Horror Story is known for its scene-stealing performances, particularly from stars like Jessica Lange, Sarah Paulson and Evan Peters. But now it seems there's another actress poised to join their ranks. After making her American Horror Story debut last year in Cult, Leslie Grossman quickly established herself as a standout within the politically driven season. Now, with her second American Horror Story role in Apocalypse, Grossman seems to be solidifying her place as a true Horror Story fan favorite.\n\nIn Apocalypse, Grossman plays the incredulously named Coco St. Pierre Vanderbilt, a wealthy wannabe Instagram influencer whose family's millions bought her and her assistant Mallory (Billie Lourd) tickets into Outpost 3, a nuclear fallout shelter run by the clandestine organization The Cooperative. Coco's hilarious one-liners and dedication to the superficial even in the face of dystopia made her one of the MVPs of Wednesday's season premiere, and we have a feeling the fandom's love of Coco -- and Grossman -- is only going to grow as the season progresses.\n\nTV Guide hopped on the phone with Grossman to discuss Coco's singular sense of humor, whether or not there's a good person lurking beneath her selfishness and what the hell Michael Langdon (Cody Fern) is up to at the Outpost.\n\nMary Cherry is iconic, but Coco St. Pierre Vanderbilt is just a perfect name. When you found out your character's name were you like, \"Yup. I know exactly who this woman is\"?\n\nLeslie Grossman: Of course! I died laughing. [Creator] Ryan [Murphy] has a real gift with naming characters, and I think this is no exception. You know who she is just by reading her name, don't you? It's brilliant. I was thrilled.\n\nI know you're a big Real Housewives fan. Did you take any inspiration from any Housewives in crafting this entitled rich female character?\n\nGrossman: Well you're good because I absolutely did. I have to say, I did think a lot about [Real Housewives of New York star] Tinsley [Mortimer] when I was doing this character. I don't see Tinsley as ruthless as Coco is, but just the sort of adult woman who still lives like kind of a little kid. I want to just preface it by saying I love Tinsley, I think she's adorable, but I did have her in the back of my mind when playing Coco.\n\nThe American Horror Story: Apocalypse Premiere Was Light on Familiar Characters but Still a Killer Good Time\n\nI totally see that actually now that you've pointed it out.\n\nGrossman: Right? It's pretty good.\n\nAs long as you don't start crying over a picture of your frozen eggs.\n\nGrossman: [Laughs] That was one of the most iconic moments in Housewives history. That was one of the funniest things I've ever seen in my life: crying over eggs. It was great.\n\nCoco has her own assistant Mallory, the Sweetie to Coco's Kim Zociak. But Coco doesn't treat Mallory very well, so should we expect that behavior come back to bite Coco down the line?\n\nGrossman: Well, this is American Horror Story and I'm not allowed to give you even one spoiler. You know that I will go to American Horror Story jail and I don't wanna go there. I will tell you that things get very interesting. And the thing that I love about this show is you never know what direction it's going to take. And we don't know either. We get the scripts and have no idea in advance of what's going to happen. We're still shooting right now, so I'm still in the middle of not knowing what's going to happen. So, all I will say is things get interesting. I know that's so annoying and I know that's so non-specific, but I can't really give you any more than that.\n\nYou and Billy Eichner played a married couple with their share of issues in Cult, and now Coco left Brock to die in Santa Monica. Why do you think Ryan Murphy keeps casting you and Billy as doomed couples?\n\nGrossman: You know, I'm not quite sure why, but I'm very here for it. Billy Eichner is one of my most favorite people on the face of the planet. And unfortunately in that first episode we don't work together; we're over the phone with each other. But anytime I can be connected to Billy Eichner, I'm thrilled to do it. I don't know. I guess Ryan thinks we have good chemistry together and he likes the two of us together, which I'm thrilled [by] because I adore Billy.\n\nObviously this wasn't the last we will have seen of Brock. If he somehow survived the apocalypse, do you think it's possible for someone to be at all understanding of the situation Coco was in when she left him to die?\n\nGrossman: [Laughs] I think that Coco is very focused on her own survival and did what she felt like she had to do. Listen, if people were running toward you on a tarmac with guns and wrenches and they were going to kill you to get your plane, you know in that moment, you might say, \"Well, look. Brock's not here. Why should I die because he's not here yet?\" So, she has her hairdresser.\n\nI think she did the right thing.\n\nGrossman: You know, look, Coco is ruthless. At this point in the game, Coco will do anything to make sure she survives. So we'll have to wait and see what happens.\n\nCoco is definitely ruthless. She didn't even care that Stu died because he was boring and was taking up their food. Given all that, do you think Coco is a good person?\n\nGrossman: No. Absolutely not! I don't think that Coco is burdened by any sort of conscience. I think she's conscience-free, which allows her to make all of these decisions and I think she's heavily focused on just making sure that she's okay. So at this point, I don't think we have any reason to think that Coco is a good person, do we?\n\nCoco is already becoming a bit of a fan-favorite character. She really was the comic relief in the premiere and you had so many great one-liners. Do you enjoy being the one who gets to lighten the mood and get those jokes in?\n\nGrossman: I mean, here's the thing: You know, Coco's amazing lines have Ryan Murphy's fingerprints all over them. I think that it's really fun for him to write for her character. And I know that there are some fans of the show who want us to be straight horror and don't like any humor, even if it's dark humor, coming in. I love it. I think it adds a certain flavor. It's a strong flavor. I hope people like it. I know that it's something that Ryan really, really loves and I'm thrilled that I get to be a part of it. I'm telling you, I open the script and it's the funniest stuff ever, ever, ever and I just love that I get to say stuff like that and to speak to people in a way that I would never, ever, for a second, ever speak to in real life. So it's a chance to get to be pure id, you know? Say whatever horrible things come into your head! So it's fun to play that at work.\n\nBy the end of the premiere, Coco has been in Outpost 3 for 18 months now. Has she grown particularly close with any of the residents over this time?\n\nGrossman: I think that Coco has probably been lying on her bed thinking about how hungry she is. I think that she is probably still incredibly self-focused. I don't know if she's really there to develop friendships. I think she really cares about Evan's character. I think she really, really cares about him. But only to the end that he's there to do her hair, so he proves a very important service to her. So, she cares about him as much as she can because he's servicing her hair, which is very important to her. But I think Coco's very self-focused and not really interested in making deep friendships.\n\nAfter Michael Langdon arrives, he says he's going to evaluate the residents at Outpost 3 to determine who will live and who will die. What will that process look like, and how will Coco will respond?\n\nGrossman: You know, I have to be very careful with how I parse my words out here. I always feel terrible in these interviews because I want to just tell you everything and I can't, but I think that Michael Langdon is going to expose lots of layers in the characters. I think his arrival really deepens what we learn about each person that's in that house and what the future is going to hold for them. I know that sounds cagey, but we're going to learn a lot through Michael Langdon's interview process. I think a lot will be revealed. That's my tag on it: Through the interview process, a lot will be revealed! That's where I'm going to leave it.\n\nMichael's arrival was the first real direct connection between Murder House and Coven. Were you a fan of those seasons before Apocalypse?\n\nGrossman: Oh my god! Loved. Loved, loved, loved. I really loved Murder House a lot and I just thought Coven was so fantastic and so fun. And I know that people were like, \"What is this? I was told it was going to be a Coven and Murder House crossover!\" You have to be patient with Ryan's vision of what this is going to be. And I can promise you that the dots are going to connect and it's going to be really satisfying. But it's also a new take on a story, so I think it's going to be a really satisfying payoff for fans, and I would hope that they could just let the story unfold and see the journey that we're being taken on, because it's going to be very, very satisfying and really clever and really smart in a way that they're piecing this together. There's a reason for everything.\n\nAmerican Horror Story: A Definitive Timeline\n\nWhen you found out this was going to be a Murder House-Coven crossover season, did you have a wish list of characters you wanted to interact with?\n\nGrossman: Oh my god, first of all, every one of them. But I love Ms. Myrtle Snow [Frances Conroy]. She is a genius. Emma [Roberts], of course, as Madison is so iconic and hilarious and fantastic. I love [Gabourey Sidibe], I love Taissa [Farmiga]. It's really fun because I'm a fan. It's amazing to get to be on set with them as those characters, you know? It's sort of mind blowing. I play it cool, but inside I'm like, \"Oh my god! This is really exciting!\" And it's going to be really, really fun for people to see how we revisit these characters.\n\nI know this is a long shot, but I have to ask. In Hotel we saw Billie Dean in the year 2022 and the world clearly still existed. Will the timeline and how this season lines up with the rest of the American Horror Story universe be explained within the season?\n\nGrossman: Want to hear a totally truthful answer? I have no idea. [Laughs] I still don't know what's going to happen. None of the actors know what's going to happen, so my honest answer is I don't know. And I'm interested to see. Do you understand that when I get scripts, I'm reading it as a fan. So I read stuff and I'm like, \"No way, that's crazy!\" Like, it's just as fun for me as it is anyone else to find out what's going to happen. So I don't know but that's a very, very good question.\n\nAmerican Horror Story: Apocalypse airs Wednesdays at 10/9c on FX.\n\nOther Links From TVGuide.com American Horror Story: ApocalypseLeslie Grossman", "images": ["http://b.scorecardresearch.com/p?c1=2&c2=9289482&cv=2.0&cj=1", "https://www.goerie.com/storyimage/ZZ/20180913/ENTERTAINMENT/309139900/AR/0/AR-309139900.jpg&MaxH=200&MaxW=200", "https://www.goerie.com/Global/images/head/nameplate/goerie_logo.png", "https://api.pymx5.com/v1/sites/track?event_type=PAGE_VIEW&noscript=1", "https://www.goerie.com/storyimage/ZZ/20180913/ENTERTAINMENT/309139900/AR/0/AR-309139900.jpg"], "top_img": "https://www.goerie.com/storyimage/ZZ/20180913/ENTERTAINMENT/309139900/AR/0/AR-309139900.jpg", "keywords": [], "authors": ["Tv Guide"], "canonical_link": "http://www.tvguide.com/news/american-horror-story-apocalypse-leslie-grossman-coco/?rss=breakingnews&partnerid=gatehouse&profileid=breaking", "title": "American Horror Story: Apocalypse's Leslie Grossman Tells Murder House and Coven Fans to \"Be Patient\"", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "og": {"site_name": "GoErie.com", "image": {"identifier": "https://www.goerie.com/storyimage/ZZ/20180913/ENTERTAINMENT/309139900/AR/0/AR-309139900.jpg", "width": 2070, "height": 1380}, "title": "American Horror Story: Apocalypse's Leslie Grossman Tells Murder House and Coven Fans to \"Be Patient\"", "type": "article", "description": "American Horror Story is known for its scene-stealing performances, particularly from stars like Jessica Lange, Sarah Paulson and Evan Peters. But now it"}, "msvalidate.01": "7E15F9269E2CE66F2A488ABB04B5015E", "apple-itunes-app": "app-id=700897580?at=1000lkC&ct=sb-goerie", "google-play-app": "app-id=com.ghm.goerie", "description": "American Horror Story is known for its scene-stealing performances, particularly from stars like Jessica Lange, Sarah Paulson and Evan Peters. But now it seems there's another actress poised to join their ranks. After making her American Horror Story debut last year in Cult, Leslie Grossman quickly established herself as a standout within the politically driven season. Now, with her second American Horror Story role in Apocalypse, Grossman seems to be solidifying her place as a true Horror", "vf": {"unique_id": "siteZZ-pub4514-8007CCBD-85F0-430C-BA61-1E03E3C72D26"}, "tout": {"article": {"id": "art-8007CCBD-85F0-430C-BA61-1E03E3C72D26-pub4514"}}, "bt": {"pubDate": "20180913T18:23:14Z", "modDate": "20180913T18:23:00Z", "author": "TV Guide"}, "twitter": {"card": "summary_large_image", "image": "https://www.goerie.com/storyimage/ZZ/20180913/ENTERTAINMENT/309139900/AR/0/AR-309139900.jpg&MaxW=1200&MaxH=630", "site": "@GoErie", "title": "American Horror Story: Apocalypse's Leslie Grossman Tells Murder House and Coven Fans to \"Be Patient\"", "description": "American Horror Story is known for its scene-stealing performances, particularly from stars like Jessica Lange, Sarah Paulson and Evan Peters. But now it seems there's another actress poised to join their ranks. After making her American Horror Story debut last year in Cult, Leslie Grossman quickly established herself as a standout within the politically driven season. Now, with her second American Horror Story role in Apocalypse, Grossman seems to be solidifying her place as a true Horror"}, "author": "TV Guide"}, "movies": [], "publish_date": 1536811200.0, "source": "http://www.goerie.com", "summary": ""}