{"url": "https://heightline.com/meg-ryan-bio-plastic-surgery-net-worth/", "text": "Meg Ryan is an iconic American actress who doubles as a producer; best known for her top-notch performances in films and television series. She came into the limelight following her impressive performance as the lead actress in the romantic comedy titled When Harry Met Sally in 1989. Since then, she has continued to wow her many fans with her exceptional acting prowess. Learn more about her biography, net worth, husband, and other interesting facts below.\n\nMeg Ryan Biography\n\nThe amazing actress was born Margaret Mary Anne Hyra in Connecticut, USA on November 19, 1961. Her mother is a former actress cum English teacher named Susan Jordan, while her father is a maths teacher named Harry Hyra. Meg grew up along with her parents and three siblings in Fairfield, Connecticut. She completed her high school education at Bethel High School in 1979 and further enrolled at the University of Connecticut where she studied journalism. She later transferred to the New York University where she obtained a bachelor’s degree in journalism.\n\nHer Acting Career\n\nRyan began her acting career while she was in college; she made her first film appearance in the movie titled Rich and Famous, after which she joined the cast of the television series titled As the World Turns in 1982 and left in 1984. Her impressive performances made way for the fast-rising actress to land bigger roles. Subsequently, he featured in other television series including Promise Land, Armed and Dangerous, Amityville, and Charles in Charge. Following her brilliant performance in Promise Land, the amazing actress got her first award nomination in 1987. Later on, she appeared in Top Gun, Innerspace, and Presidio.\n\nMeg got her breakthrough in 1989, following her excellent performance as the lead actress in the film titled When Harry Met Sally. The film earned her a golden globe award nomination. During the ’90s, she appeared in movies such as The Doors in 1991, and Sleepless in Seattle in 1993. Her next movie When a Man Loves a Woman recorded commercial success and earned Ryan her first Screen Actors Guild Award. Later on, she appeared in I.Q., City of Angels, Anastasia, Addicted to Love, Courage Under Fire, and French Kiss.\n\nDuring the early 2000s, Meg Ryan featured in several movies which include Proof of Life, Hanging Up, Kate & Leopold, In the Cut, Against the Rocks, and Rocky. She took a break from acting in 2004, returning in 2007, Meg featured in In the Land of Women, after which she starred in The Deal, The Graduate, and My Mom’s New Boyfriend. She later featured in the lifetime drama titled Lives of The Saints; as well as, Long Time Gone, Half the Sky, How I Met Your Dad, Fan Girl, and Web Therapy, among others. Meg has been nominated for three Golden Globe Awards and many others out of which she has recorded a few in her name.\n\nNet Worth: How Much is Meg Ryan Worth?\n\nMeg Ryan has appeared in several movies and television series, her exceptional acting prowess has kept her in the limelight for a long time. Accordingly, she has earned a huge amount of money from her acting career as well as other endeavours. Ryan currently has a staggering net worth of $45 million. In addition, she has gained wide recognition and is regarded as one of the most successful actresses in the American movie industry.\n\nPlastic Surgery\n\nDuring the Tony Awards held in June 2016; Meg Ryan appeared on the event red carpet having a new and jaw-dropping look. Her looks raised several eyebrows and after a while, rumours began to fly around that the amazing actress had a cosmetic surgery. While some people believed she had a total facelift; Ryan, on the other hand, has never confirmed if the rumours are true or not. Even if she does, she sure looks very smart and gorgeous considering her age. The beautiful actress has never failed to use every opportunity to wow her many fans with her gorgeous dress sense.\n\nHer Husband and Relationships\n\nWondering if Meg Ryan is married or not? Well, the answer is both yes and no. She was previously married to a famous American actor named Dennis Quaid who is notable for his dynamic roles in television series and films including The Day After Tomorrow; The Rookie, Soul Surfer, Far from Heaven and D.O.A, among others. The pair met each other on the set of the American crime thriller titled D.O.A where they featured opposite each other. Afterwards, they started their relationship and three years later; they exchanged marital vows at a small wedding held on February 14, 1991. The following year, they welcomed their first bundle of joy, a son named Jack Quaid in April 1992.\n\nThe love between them continued to grow as their bond became stronger; however, after ten years of successful marriage, Ryan filed for a divorce, citing her husband’s infidelity as the reason behind it. Their divorce process was finalized in July 2001 and the duo went their separate ways. They both share equal custody of their son.\n\nAfter their divorce, Meg had a fling with another actor named Russell Crowe in the same year. She went on to adopt a 14-month-old baby named Daisy True from China. Later on, she was rumoured to be having an affair with Matthew Perry in 2007 and Graham King in 2009.\n\nIn 2010, Meg Ryan started a relationship with the famous American musician known as John Mellencamp. The duo has been together for over seven years. Although they might have plans of getting married, they have not disclosed such details to the media.", "images": ["https://heightline.com/wp-content/uploads/meg1.png", "https://images.dmca.com/Badges/_dmca_premi_badge_4.png?ID=fdb65fc6-af63-4791-bfb9-e3620d5a2604", "https://heightline.com/wp-content/uploads/meg-640x360.png", "https://heightline.com/wp-content/uploads/meg.png", "https://heightline.com/wp-content/uploads/heightline.-logo.png"], "top_img": "https://heightline.com/wp-content/uploads/meg.png", "keywords": [], "authors": [], "canonical_link": "https://heightline.com/meg-ryan-bio-plastic-surgery-net-worth/", "title": "Meg Ryan Biography, Plastic Surgery, Net Worth, Husband, Relationships", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "og": {"image": {"identifier": "https://heightline.com/wp-content/uploads/meg.png", "secure_url": "https://heightline.com/wp-content/uploads/meg.png", "width": 640, "height": 360}, "locale": "en_US", "type": "article", "title": "Meg Ryan Biography, Plastic Surgery, Net Worth, Husband, Relationships", "description": "Meg Ryan is an iconic American actress and producer; best known for her excellent performances in the 1989 series When Harry Met Sally...Learn more...", "url": "https://heightline.com/meg-ryan-bio-plastic-surgery-net-worth/", "site_name": "Heightline - Celebrity Biographies, Height, Weight, Bios of Famous People"}, "description": "Meg Ryan is an iconic American actress and producer; best known for her excellent performances in the 1989 series When Harry Met Sally...Learn more...", "article": {"tag": "Ikenna", "section": "Actresses", "published_time": "2018-07-26T12:12:35+00:00"}, "twitter": {"card": "summary", "description": "Meg Ryan is an iconic American actress and producer; best known for her excellent performances in the 1989 series When Harry Met Sally...Learn more...", "title": "Meg Ryan Biography, Plastic Surgery, Net Worth, Husband, Relationships", "image": "https://heightline.com/wp-content/uploads/meg.png"}, "ahrefs-site-verification": "91f07342d9124b6525702cd86729d5dd6bb1e6c5e3332258e008f1ba6c1e5807"}, "movies": [], "publish_date": 1532607155.0, "source": "https://heightline.com", "summary": ""}