{"url": "https://www.brit.co/the-bachelorette-just-isnt-fun-anymore-and-the-reasons-why-are-depressing/", "text": "The newest season of The Bachelorette is upon us, and what better way to distract ourselves from our humdrum lives than by watching America’s most attractive, eligible real estate agents and personal trainers bare their hearts and embarrass themselves on national television? From the cringe-inducing first episode — as contestants one-up each other to make the most memorable first impression with over-the-top romantic gestures, pickup lines, and (this season) one contestant’s miniature mannequin of himself — to the surreality of the hometown dates, the show, like the whole of the Bachelor franchise, makes for incredible entertainment. But the fairy-tale fantasy of The Bachelorette is becoming more difficult to escape into as in recent seasons, the issues and traumas of the real world have crept into the formerly protective confines of the Bachelor Mansion.\n\nWhen The Bachelor premiered in 2002, it became an instant hit — even Jennifer Aniston names the show as a guilty pleasure. The format hasn’t changed much since: Between 25 and 31 beautiful, accomplished women vie for the heart of a conventionally handsome, invariably white man through a series of competitions and staged dates, with on- and off-camera white wine spritzers fueling catfights and tear-filled breakdowns.\n\nThe Bachelorette followed a year later in 2003 — an attempt to flip the sexist premise on its head by giving the romantic upper hand to the woman, with 30 handsome suitors to compete for her affections. Unfortunately, even in the fantasyland of Bachelor Nation, true equality would take more than a simple gender flip — these women are still products of the real world, conditioned to be gracious and self-effacing.\n\nBachelorettes gracefully endure overenthusiastic romantic attention from often drunk contestants ranging from creepy (this season’s Tickle Monster and his gigantic fake hands) to annoying (Lucas Yancey, whose stated occupation was “Whaboom!”) to aggressively macho (countless rejected contestants returning to demand their Bachelorettes stroke their bruised egos). Season nine Bachelorette Kaitlyn Bristowe visibly fell for her eventual choice Shawn B. almost immediately, then struggled with feelings of guilt as the conceit of the show required her to romance other men in front of him. That same season, Kaitlyn was bombarded with abuse and death threats from viewers for sleeping with “villain” Nick Viall outside the hallowed Fantasy Suite, her sexual agency only acceptable within the rigid framework of the show.\n\nIn a combined 34 seasons, the franchise has only now cast its first black lead, Dallas lawyer Rachel Lindsay. Future Bachelors/Bachelorettes are chosen from the previous season’s top runners-up, which as NPR’s Linda Holmes pointed out functions as an extremely apt metaphor for white privilege. As conversations about race in America proliferate, and the Black Lives Matter movement reverberates throughout the country, producers did not miss the opportunity to exploit this by inviting a virulent racist into a competition stacked with articulate, intelligent black men. The systematic racism of the real world has infiltrated the walls of the Mansion, and racial tension has provided an ugly and traumatic storyline for this season and its contestants.\n\nBachelor in Paradise pushes the franchise to its logical extreme, transporting past seasons’ most dramatic and reviled also-rans to a tropical island, then engaging them in a game of sexual musical chairs to pair up or get voted off the island. The show is an admitted romp, the equivalent of getting two sexy bugs drunk, then putting them in a jar and shaking it to get them to make out. Along with the image of a gentlemanly or ladylike Bachelor / Bachelorette, the “right reasons” are arguably thrown out with the bathwater: Drama appears to be encouraged, hookups mandatory, and contestants’ raucous antics seem to literally be their job. If The Bachelor / The Bachelorette is a refereed boxing match, Bachelor in Paradise is a no-holds-barred street fight.\n\nThe upcoming season of Bachelor in Paradise hasn’t even made it to air before scandal is threatening to derail it. Details are scarce, and as both of the contestants involved have signed iron-clad releases, the actual facts of the case may never come to light. Filming has since resumed, but for those triggered by allegations of misconduct, the damage may already be done.\n\nScandal aside, the way the series portrays issues of consent can be troubling. Fred is lightly mocked for having asked if he may kiss Rachel before respectfully planting one on her when she says yes. Rachel herself seemed fazed by the gesture, remarking, “Most men just go for it.” As one contestant is teased for respecting her right to consent, is it any surprise that another might — hypothetically — go too far?\n\nDespite the best efforts of the network to place The Bachelor franchise in a safe and innocent fantasy world, the show is morphing from a guilty pleasure into making us feel just plain guilty. This season’s drama is recognizable and resonant with viewers — we recognize sexual harassment, racism, the burden of emotional labor in our own lives. There is no joy in witnessing these traumas exploited by producers and inflicted on contestants, regardless of what those contestants knew they were signing up for. Reality has finally caught up with reality TV, and we are reminded of the very traumas that we watch the show to escape.\n\nLaura-Louise Tobin is a producer and writer living in Toronto.\n\nTell us how you feel about this season’s Bachelorette on Twitter @BritandCo.\n\n(Photos via Michael Yada + Noel Vasquez/ Getty)", "images": ["https://images.britcdn.com/wp-content/uploads/2017/09/relationships_header.jpg?h=160&auto=format", "https://bourbon.britcdn.com/assets/menu-icon.svg", "https://images.britcdn.com/wp-content/uploads/2017/06/rach-645x967.jpg?auto=format&q=50", "https://images.britcdn.com/wp-content/uploads/2017/08/Style_Content-Hub_1920x260_v4_lighter-version.jpg?h=160&auto=format", "https://images.britcdn.com/wp-content/uploads/2017/08/Issues_header_1920x5001.jpg?h=160&auto=format", "https://components.britcdn.com/assets/images/logo.svg", "https://images.britcdn.com/wp-content/uploads/2017/10/beauty_1024.jpg?h=160&auto=format", "https://images.britcdn.com/wp-content/uploads/2017/06/Screen-Shot-2017-06-26-at-7.28.51-PM-645x645.png?auto=format&q=50", "https://images.britcdn.com/wp-content/uploads/2017/06/GettyImages-691303966-645x430.jpg?auto=format&q=50", "https://components.britcdn.com/assets/images/logo_condensed.svg", "https://images.britcdn.com/wp-content/uploads/2017/11/food_header.jpg?h=160&auto=format", "https://images.britcdn.com/wp-content/uploads/2017/10/home_header_1920x500.jpg?h=160&auto=format", "https://bourbon.britcdn.com/assets/x-icon.svg", "https://images.britcdn.com/wp-content/uploads/2017/06/Screen-Shot-2017-06-26-at-7.28.51-PM.png"], "top_img": "https://images.britcdn.com/wp-content/uploads/2017/06/Screen-Shot-2017-06-26-at-7.28.51-PM.png", "keywords": [], "authors": ["Brit", "Co Community Voices", "The Brit", "Co Community Voices Series Aims To Showcase A Variety Of Viewpoints Our Diverse Audience In Their Own Words. If You Have A Strong Perspective", "Please Email Us", "Subject", "B C Op-Ed"], "canonical_link": "https://www.brit.co/the-bachelorette-just-isnt-fun-anymore-and-the-reasons-why-are-depressing/", "title": "The Bachelorette Just Isn’t Fun Anymore, and the Reasons Why Are Depressing", "meta_data": {"theme-color": "#EB4934", "viewport": "width=device-width, initial-scale=1, minimum-scale=1", "description": "The show used to be a guilty pleasure, but now it just feels guilty.", "pinterest": "nohover", "p": {"domain_verify": "b66f54e58c7141947933cb99f95162a9"}, "google-site-verification": "My0dxPpgNIRXqBChZ9wS0LdvnGR2o8aTvLupLpVk2bg", "og": {"locale": "en_us", "url": "https://www.brit.co/the-bachelorette-just-isnt-fun-anymore-and-the-reasons-why-are-depressing/", "title": "The Bachelorette Just Isn’t Fun Anymore, and the Reasons Why Are Depressing", "description": "The show used to be a guilty pleasure, but now it just feels guilty.", "type": "article", "image": "https://images.britcdn.com/wp-content/uploads/2017/06/Screen-Shot-2017-06-26-at-7.28.51-PM.png", "site_name": "Brit + Co"}, "fb": {"app_id": 178746098878561}, "breadcrumb": "issues::current-events", "last-modified": "2017-06-27T14:16:27+00:00", "twitter": {"card": "summary_large_image", "site": "@britandco", "title": "The Bachelorette Just Isn’t Fun Anymore, and the Reasons Why Are Depressing", "description": "The show used to be a guilty pleasure, but now it just feels guilty.", "image": {"src": "https://images.britcdn.com/wp-content/uploads/2017/06/Screen-Shot-2017-06-26-at-7.28.51-PM.png"}, "domain": "brit.co", "app": {"name": {"iphone": "Brit + Co", "ipad": "Brit + Co", "googleplay": "Brit + Co"}, "url": {"iphone": "britco://post/the-bachelorette-just-isnt-fun-anymore-and-the-reasons-why-are-depressing"}, "id": {"iphone": "id557670399", "ipad": "id557670399"}}}}, "movies": [], "publish_date": null, "source": "https://www.brit.co", "summary": ""}