{"url": "http://time.com/money/5117815/richest-real-housewives/", "text": "A few things are constant on Bravo’s hugely popular Real Housewives reality shows: bitter fights, excessive alcohol consumption, and luxurious wealth. The latter is at least as much a strategic appearance as it is a financial fact for many of the stars. Some have been dealt serious blows to their investment portfolios, as when the housing crisis memorably hit the women of The Real Housewives of Orange County, the franchise’s original program. But others, from Beverly Hills’ unapologetically extravagant Lisa Vanderpump to Atlanta’s legendary musician member Kandi Burruss, have the assets and bank statements to back up their swagger.\n\nDaily Money Sign up to receive the latest updates and the smartest advice. View Sample Sign Up Now\n\nMONEY compiled reporting on the estimated net worths of all the current regular stars of the Real Housewives shows. We should note: any “net worth site” should be taken with a grain of salt, but using them we can get a picture of who are the richest housewives on each installment, ranked from the the richest to the merely rich.\n\nThe Real Housewives of Beverly Hills: Lisa Vanderpump\n\n(L-R) Eden Sassoon, Lisa Vanderpump. Nicole Weingart/Bravo.\n\nEstimated net worth: $75 million\n\nThe stars of RHOBH are not shy about flaunting their wealth. They do so in ways that make other casts in the franchise look downright humble. That’s especially true of Lisa Vanderpump, who reportedly has the highest net worth of all the current U.S. Housewives stars and has seemed indomitable over all eight seasons of the Beverly Hills show.\n\nThough castmates like Kyle Richards and Erika Jayne are doing more than well for themselves, Vanderpump rules over an opulent mansion with everything one could imagine (there was that time she even bought two miniature horses for her backyard and made it seem almost kind of normal). Together with her husband Ken Todd, she runs an enviable restaurant empire, including the Los Angeles hotspots SUR, Pump, and Villa Blanca, all of which get plenty of publicity on RHOBH. In addition to a reported salary of $500,000 per season of that show, her business is the center of the Bravo spinoff Vanderpump Rules, following her absurdly dramatic serving staff, for which she serves as an executive producer. The perpetually calm Vanderpump, meanwhile, is taking it all the way to the bank.\n\nThe Real Housewives of New York City: Carole Radziwill\n\n\"The Politics of Friendship\" Episode 905 with Carole Radziwill Heidi Gutman/Bravo.\n\nEstimated net worth: $50 million\n\nJournalist may not seem like the most likely career for a Real Housewife, but RHONY’s Radziwill has received numerous accolades over a long career in broadcast news. She worked as a producer at ABC News and even won a Peabody for her work, which included being stationed in Iraq during the Gulf War. She also married a man of nobility, Prince Anthony Radziwill, which certainly accounts for her stunning net worth. Sadly, he died in 1999, an event she has written about in bestselling books including the memoir What Remains.\n\nThe Real Housewives of Atlanta: Kandi Burruss\n\n-R) Todd Tucker and Kandi Burruss Wilford Harewood/Bravo. (L\n\nEstimated net worth: $35 million\n\nEven if you don’t recognize Burruss, you know her work. The singer-songwriter is a member of the popular R&B group Xscape, and was one of the songwriters credited on TLC’s massive hit “No Scrubs.” The Grammy winner has had no problem finding success in her music career, but she’s also pulling in a reported $450,000 per season of RHOA, which she joined in the second season. The label triple threat doesn’t even do her justice.\n\nThe Real Housewives of Orange County: Shannon Beador\n\n\"Mystic Mistake\" Episode 1215 — with Shannon Beador Nicole Weingart/Bravo.\n\nEstimated net worth: $20 million\n\nBeador may be the butt of some jokes on RHOC thanks to her New Agey personality and intense dedication to alternative medicine, but she has plenty of money to burn on her odd hobbies. Having joined the show during the ninth season, she’s had public ups and downs with her husband, David Beador, the owner of a successful construction company. They announced a separation at the end of 2017, but it’s unclear if they’ve finalized a divorced. Even if they do, it’s clear she’ll still make out okay, as Beador’s company reportedly pulls in more than $20 million in annual revenue.\n\nThe Real Housewives of Dallas: Stephanie Hollman\n\nTHE REAL HOUSEWIVES OF DALLAS with Stephanie Hollman Peter Larsen/Bravo\n\nEstimated net worth: $18 million\n\nThe other rookie in the Real Housewives lineup is RHOD, but its stars reported net worths can hold their own against the other entries. Born in a small town in Oklahoma, Hollman now reigns queen in Dallas, at least on this show. Her husband Travis owns and operates the Hollman locker company, which has been in his family since 1976 and counts among its clients the Chicago Cubs, the Los Angeles Lakers, the Dallas Mavericks, American Express, Facebook, and SoulCycle.\n\nThe Real Housewives of New Jersey: Teresa Giudice\n\n. Bravo—NBCU\n\nEstimated net worth: $11 million\n\nGiudice has been present through all eight seasons of RHONJ, despite having a bumpy road. She spent nearly a year in prison for a fraud conviction and was released in 2015. But she had already proved her perseverance. During her run on the show, she’s become a New York Times bestselling author with cookbooks inspired by her Italian heritage, including Skinny Italian and Fabulicious!. Between her publishing career and being a media personality, along with other sources of income, she’s beat out her castmates to reach eight figures.\n\nThe Real Housewives of Potomac: Karen Huger\n\nTHE REAL HOUSEWIVES OF POTOMAC with Karen Huger Larry French/Bravo—NBCU Photo Bank via Getty Images\n\nEstimated net worth: $10 million\n\nOne of the new entries in the ever-expanding Real Housewives universe, RHOP’s stars may not be as famous as their counterparts, but one at least has pulled in serious cash. Huger’s husband Raymond is a software executive, whom she’s referred to as “the black Bill Gates.” But it’s not all necessarily rosy for the couple, as Raymond and his company reportedly owe millions in back taxes.", "images": ["https://timedotcom.files.wordpress.com/2017/09/money-newsletter-tout-footer.png", "http://subscription-assets.timeinc.com/current/1012_top1_205_thumb.jpg", "https://moneydotcomvip.files.wordpress.com/2018/01/180126-real-housewives-lisa-vanderpump.jpg", "https://moneydotcomvip.files.wordpress.com/2018/01/180126-real-housewives-karen-huger.jpg", "https://moneydotcomvip.files.wordpress.com/2018/01/180126-real-housewives-richest.jpg?quality=85", "https://moneydotcomvip.files.wordpress.com/2018/01/180126-real-housewives-carole-radziwill.jpg", "https://moneydotcomvip.files.wordpress.com/2018/01/180126-real-housewives-shannon-beador.jpg", "http://time.com/images/newsletter-money.png", "http://subscription-assets.timeinc.com/current/1012_top2_205_thumb.jpg", "https://moneydotcomvip.files.wordpress.com/2018/01/180126-real-housewives-kandi-burruss.jpg", "https://moneydotcomvip.files.wordpress.com/2018/01/180126-real-housewives-stephanie-hollman.jpg", "https://moneydotcomvip.files.wordpress.com/2018/01/180126-real-housewives-teresa-giudice.jpg"], "top_img": "https://moneydotcomvip.files.wordpress.com/2018/01/180126-real-housewives-richest.jpg?quality=85", "keywords": [], "authors": ["Paul Schrodt"], "canonical_link": "http://money.com/money/5117815/richest-real-housewives/", "title": "A Ranking of the Richest Real Housewives From Every Season", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "celebrity", "news_keywords": "real housewives, real housewives of beverly hills, real housewives of orange county, lisa vanderpump", "description": "Which stars of 'The Real Housewives' series are the richest? A look at the popular Bravo franchise.", "og": {"title": "A Ranking of the Richest Real Housewives From Every Season", "type": "article", "site_name": "Money", "url": "http://money.com/money/5117815/richest-real-housewives/", "description": "From 'Beverly Hills' to the 'Potomac.'", "image": {"identifier": "https://moneydotcomvip.files.wordpress.com/2018/01/180126-real-housewives-richest.jpg?quality=85", "width": 1024, "height": 683}}, "pinterest": {"url": "http://money.com/money/5117815/richest-real-housewives/", "description": "Which stars of 'The Real Housewives' series are the richest? A look at the popular Bravo franchise.", "media": "https://moneydotcomvip.files.wordpress.com/2018/01/180126-real-housewives-richest.jpg?quality=85"}, "twitter": {"card": "summary_large_image", "url": "http://money.com/money/5117815/richest-real-housewives/", "title": "A Ranking of the Richest Real Housewives From Every Season", "description": "From 'Beverly Hills' to the 'Potomac.'", "site": "@MONEY", "image": "https://moneydotcomvip.files.wordpress.com/2018/01/180126-real-housewives-richest.jpg?quality=85"}, "fb": {"app_id": 53177223193, "pages": 119930514707114}, "google-site-verification": "5w1rl4iwAR7kN1jfJEXz5hqEVP7X_HAasGoC7R_LpDE"}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}