{"url": "https://tech2.org/botswana/within-the-desperate-search-of-prince-harry-to-find-love/", "text": "Two years later However, Mom could not save Harry from the habits of his party. When Bonas neglected to join Harry at the Memphis wedding of his friend, nightclub entrepreneur Guy Pelly and hotel heiress Elizabeth Wilson in May 2014 – \"There was a dispute over how much it was costing her, \"says Nicholl, who left in what she calls\" a little cranky. \" And to deal with his frustrations, he turned to Miami, where he and his longtime friend Amanda Sheppard spent a night dancing in the VIP lounge of the Fountainebleau Miami Beach Hotel, celebrated by celebrities. Because Harry always had what Nicholl describes as \"a flirtatious relationship\" with Sheppard, when Bonas learned of his closeness on the dance floor, she was not happy. \"They agreed to meet when Harry came back from Memphis to talk about things,\" Nicholl writes, \"but Cressida had already decided that the relationship had run its course.\"\n\nDespite Harry's best efforts, he could not do it. Do not convince her to restart it. \"Harry did not want things to end, he was in love with her and he tried to convince her they could make it work, but Cressida's mind was made,\" says Nicholl. \"I think it really broke his heart.\"\n\nIn an effort to fix it, Harry returned to his other serious love. In the summer of 2015, Davy was fresh out of an affair with the jeweler Charles Goode . Then, when Harry, in Africa for his philanthropic work, asked him to meet in Cape Town, he accepted. But although their date was romantic, it was not the beginning of a lasting union. While Nicholl writes that the couple still had \"deep feelings\" for each other, Davy still knew that she was not ready for life in The Firm, the brazen name that Harry and his brother Prince William use to his family. \"Harry was still a prince,\" says Nicholl, \"and it was not the life that Chels wanted.\"", "images": ["https://akns-images.eonline.com/eol_images/Entire_Site/2018018/rs_1024x759-180118122116-1024-meghan-markle-earrings.jpg?fit=inside|900:auto&output-quality=100", "https://akns-images.eonline.com/eol_images/Entire_Site/20171125/rs_1024x759-171225071200-1024-Kate-Middleton-Prince-William-Meghan-Markle-Prince-Harry-Christmas-JR-122517.jpg?fit=inside|900:auto&output-quality=100", "https://akns-images.eonline.com/eol_images/Entire_Site/2018212/rs_600x600-180312154909-600-meghan-markle-prince-harry.jpg?fit=around", "https://tech2.org/botswana/wp-content/themes/sahifa/favicon.ico"], "top_img": "https://tech2.org/botswana/wp-content/themes/sahifa/favicon.ico", "keywords": [], "authors": [], "canonical_link": "https://tech2.org/botswana/within-the-desperate-search-of-prince-harry-to-find-love/", "title": "Within the desperate search of Prince Harry to find love – TECH2", "meta_data": {"og": {"title": "Within the desperate search of Prince Harry to find love - TECH2", "type": "article", "description": "[ad_1] Desiring to settle permanently, Prince Harry agreed to fly blind. After a split in 2014 of th", "url": "https://tech2.org/botswana/within-the-desperate-search-of-prince-harry-to-find-love/", "site_name": "TECH2"}, "generator": "WordPress 5.2.2", "viewport": "width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://tech2.org", "summary": ""}