{"url": "http://coveteur.com/2018/05/28/karla-welch-white-tee-styling-tips-justin-bieber-stylist/", "text": "One may assume it was the room service iced coffee that had Karla Welch jumping on the bed when we photographed her in New York City (fresh off a red-eye from L.A., no less), but having chatted with the powerhouse stylist, we think it was the high from having just launched her Hanes x karla line that was responsible. “I haven’t had enough time to properly reflect on it, but I’m really proud,” Welch said between takes. And for good reason. Inspired by the longline white tee she designed with Hanes for Justin Bieber—a signature piece during the Believe tour and a wardrobe staple of Bieber’s ever since—the seven-shirt collection includes classic, cropped, and sleeveless styles, and is already being worn by Zendaya, Karlie Kloss, and Tracee Ellis Ross, among a slew of Welch’s other celeb clients. Oh, and did we mention the campaign? Starring Bieber, Kaia Gerber, and Joan Smalls, it was a literal labor of love shot by Welch’s husband, Matthew. “[We] worked together the whole process, and I was so grateful to him,” Welch says. “I couldn’t wait for everyone to see the images.” Here at Coveteur HQ, we couldn’t wait to see how Welch would style her shirts. This is, after all, the woman who dressed Ruth Negga in that impeccable Valentino for the Oscars, put Sarah Paulson in plunging custom Prada at the Emmys, and landed at number one on The Hollywood Reporter’s 25 Most Powerful Stylists in Hollywood list—so yes, we were taking notes. Our afternoon was a deep dive into optimal white-tee dressing, but also one that included talk of Welch’s former career as a maître d’, her love of Instagram, and what she’s working on next.\n\nHer thoughts on her Hollywood Reporter nod: “I’m super pragmatic, so I was like, ‘OK, great!... Now I have a job to prep.’ But I’m super proud of the year that I’ve had, and the [Hollywood Reporter party] was such a fun night because I got to be with all of my peers. There’s a group of us that are really close. We’re competitive because you want to get the girl or the job, but there’s so much room for everyone, so it was just a great celebration.” The best part about her job: “I love fashion, and I think designers are artists—I know they are. To be able to work closely and develop relationships with Pierpaolo [Piccioli] or Nicholas [Ghesquière], and to have a dress made for a client—I’ll never get over it. I make sure my girls understand how baller and special it is, and to not ever take it for granted. I think that my favorite part of the job is that I get to be a conduit for designers—to make sure [my work] is how they envision their look to be.”\n\nWhat her personal white tee collection looks like: “I fully cleaned out my closet, and I only own my own white tees now! But I probably had like, 50 before. And they were all trash, but I kept holding on to them. So now I have two of each of mine to start.” How Hanes x Karla came about: “When I created xKarla, the idea was that I didn’t want to wait for a brand to come to me and say, ‘Hey, do you want to be an ambassador?’ I feel like it’s a new way to collaborate where I say, ‘I want to make this, I’m going to find someone who it makes sense for me to make it with.’ So that’s what this is.” Her tips on caring for a Hanes x Karla tee: “I’m so hard with [mine]. I just wear them, wear them, wear them. If it’s not dirty, I’m not going to wash it, so I don’t wash after every wear. I think you should wear stuff and let it bag out a bit. And then machine-wash. Sometimes I air-dry, sometimes I just throw [them] in the dryer. They’re tough. You can beat these ones up.”\n\nWhat she learned from working in the service industry: “I was a maître d’ and a sommelier at a restaurant in Vancouver, and I loved it. I think you meet someone and you know they’ve been a waiter or a server. There’s something that makes you a better person, and you just have a better understanding of things. Service is important.” Why she loves social media: “I love teasing my husband because for the longest time he told me, ‘You need to be on Instagram.’ I was late to it, but now I love Instagram so much that he’s always telling me to put my phone down. It’s fun to share. Especially for me, because I’m an introvert, but I’m an extroverted introvert, and there is such a thing as that. It’s this amazing way to [talk] to people who I’d probably be too shy to say hi to. For better or worse, online is very much where our community is, and that’s how we get our news and connect with other people.”", "images": ["http://coveteur.com/wp-content/uploads/2017/08/Karla_Welch-20-627x940.jpg", "http://coveteur.com/wp-content/uploads/2017/08/Karla_Welch-1-835x1253.jpg", "http://coveteur.com/wp-content/uploads/2019/05/Shiseido_Colorgel-5-homepage-250x250.jpg", "http://coveteur.com/wp-content/uploads/2017/08/Karla_Welch-13-835x1253.jpg", "http://coveteur.com/wp-content/uploads/2017/08/Karla_Welch-23-835x1253.jpg", "http://coveteur.com/wp-content/uploads/2017/08/Karla_Welch-12-835x1253.jpg", "http://coveteur.com/wp-content/uploads/2017/08/Karla_Welch-18-627x940.jpg", "http://coveteur.com/wp-content/uploads/2017/08/Karla_Welch-24-835x1253.jpg", "http://coveteur.com/wp-content/uploads/2017/08/Karla_Welch-2-835x1253.jpg", "http://coveteur.com/wp-content/uploads/2017/08/Karla_Welch-21-835x1253.jpg", "http://coveteur.com/wp-content/uploads/2017/08/Karla_Welch-2-2-835x557.jpg", "http://coveteur.com/wp-content/uploads/2017/08/Karla_Welch1-homepage.gif", "http://coveteur.com/wp-content/uploads/2017/08/Karla_Welch-3-627x940.jpg", "http://coveteur.com/wp-content/uploads/2017/08/Karla_Welch-8-627x940.jpg", "http://coveteur.com/wp-content/uploads/2017/08/Karla_Welch-15-835x1253.jpg", "http://coveteur.com/wp-content/uploads/2017/08/Karla_Welch-4-835x1253.jpg", "https://www.facebook.com/tr?id=1112425415570790&ev=PageView &noscript=1", "http://coveteur.com/wp-content/uploads/2019/06/Karen_Elson-6-18-summer-dresses-in-our-cart-homepage-250x250.jpg", "http://coveteur.com/wp-content/uploads/2017/08/Karla_Welch-16-835x1253.jpg", "http://coveteur.com/wp-content/uploads/2019/06/Montauk_Market_Story-8-shop-clothes-accessories-pack-for-vacation-sq-250x250.jpg", "http://pixel.quantserve.com/pixel/p-f3byk8QdGee2w.gif", "http://b.scorecardresearch.com/p?c1=2&c2=16440169&cv=2.0&cj=1"], "top_img": "http://coveteur.com/wp-content/uploads/2017/08/Karla_Welch1-homepage.gif", "keywords": [], "authors": [], "canonical_link": "http://coveteur.com/2018/05/28/karla-welch-white-tee-styling-tips-justin-bieber-stylist/", "title": "Hollywood’s Most Powerful Stylist Shows Us How to Wear a White Tee", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=4, user-scalable=1", "p": {"domain_verify": "6e7b9aef6e0a4a3be6ccfd54229329b5"}, "og": {"title": "Justin Bieber’s Stylist, Karla Welch, Shares White Tee Styling Tips", "description": "Our afternoon with Karla Welch was spent chatting about white tee styling tips, her love of Instagram, and what she’s working on next.", "url": "http://coveteur.com/2018/05/28/karla-welch-white-tee-styling-tips-justin-bieber-stylist/", "image": "http://coveteur.com/wp-content/uploads/2017/08/Karla_Welch1-homepage.gif", "type": "article", "site_name": "Coveteur", "locale": "en_US", "updated_time": "2018-05-28T13:35:58-04:00"}, "description": "Our afternoon with Karla Welch was spent chatting about white tee styling tips, her love of Instagram, and what she’s working on next.", "article": {"publisher": "https://www.facebook.com/coveteur", "section": "Fashion", "published_time": "2018-05-28T12:00:11-04:00", "modified_time": "2018-05-28T13:35:58-04:00"}, "fb": {"app_id": 1246323488804172}, "twitter": {"card": "summary_large_image", "description": "Our afternoon with Karla Welch was spent chatting about white tee styling tips, her love of Instagram, and what she’s working on next.", "title": "Justin Bieber’s Stylist, Karla Welch, Shares White Tee Styling Tips", "site": "@coveteur", "creator": "@coveteur"}, "pubexchange": {"title": "Hollywood’s Most Powerful Stylist Shows Us How to Wear a White Tee"}, "wp-parsely_version": "1.10.2"}, "movies": [], "publish_date": 1527480000.0, "source": "http://coveteur.com", "summary": ""}