{"url": "https://www.bbc.com/news/world-australia-36052243", "text": "Media playback is unsupported on your device Media caption Johnny Depp and his wife Amber Heard expressed remorse in a video message made public by the Australian Department of Agriculture\n\nActress Amber Heard has avoided a conviction for illegally taking her dogs into Australia.\n\nMs Heard, married to actor Johnny Depp, had pleaded guilty in court to making a false statement on her immigration card about the couple's Yorkshire terriers.\n\nBut the Queensland judge gave her a one-month good behaviour bond with no conviction recorded. If she breaks the bond she must pay A$1,000 ($770; £540).\n\nThe authorities also released an unusual video apology from the couple.\n\nIn the video, which was shown in court and made public by the Department of Agriculture, the couple expressed remorse and advised travellers to respect Australian quarantine laws.\n\nBizarre video apology sparks online mockery\n\nAustralia gripped by Terriergate\n\n#WarOnTerrier: How Australia reacted to Depp's dogs\n\nMs Heard and Mr Depp both attended Southport Magistrate's Court in Queensland state, amid a media scrum.\n\nHer guilty plea meant Mr Depp was excused from giving evidence to the court.\n\nTwo illegal importation charges against her were dropped earlier.\n\nThey had carried a maximum penalty of 10 years in jail or fines of up to A$265,000.\n\nJon Donnison, BBC News, Southport\n\nImage copyright ABC/Happy Dogz Image caption Pistol and Boo's presence in Australia last year was discovered when a picture was posted of them at grooming parlour\n\nIt had been dubbed Australia's War on Terrier. In the end it concluded rather more amicably.\n\nJohnny Depp and Amber Heard arrived in court looking relaxed, if a little jet lagged, having reportedly flown in by private jet from Hawaii. It was a long way to come for a very short court case.\n\nAt the time the incident provoked a war of words with Australia's then-agriculture minister Barnaby Joyce (now deputy prime minister), who said the dogs should \"bugger off back to the United States\" or risk being put down. Mr Depp fired back referring to Mr Joyce as some kind of \"sweaty, big-gutted man from Australia\".\n\nIn court, though, proceedings were much more civil and perhaps even dull. Mr Depp appeared close to dozing off on several occasions.\n\nAs the sentencing was read out, the couple embraced, perhaps with relief. Ms Heard got off relatively lightly.\n\nAnd after a case that has likely cost hundreds of thousands of dollars in legal fees, some will be asking if it was all really worth it.\n\nMs Heard brought the dogs, Pistol and Boo, to Queensland in a private jet in May 2015 to visit Mr Depp, who was filming Pirates of the Caribbean: Dead Men Tell No Tales.\n\nImage copyright Getty Images Image caption A huge media contingent was on hand when Mr Depp and Ms Heard arrived at Southport Magistrate's Court\n\nThe dogs' presence in the country was noticed after a local dog groomer posted a photo of them on social media.\n\nMs Heard, 29, had pleaded guilty to declaring \"No\" on her immigration card under the section asking if she was bringing anything, including animals, into the country.\n\nHer lawyer argued that the actress had done so because she thought Mr Depp's assistants had already sorted out the dogs' travel documents.\n\nThe dogs were quickly taken out of the country and Ms Heard vowed never to return to Australia.\n\nAustralia's tough quarantine laws are designed to keep disease at bay. Dogs entering from the US must spend 10 days in quarantine.\n\nAustralia's quarantine laws", "images": ["https://a1.api.bbc.co.uk/hit.xiti?&col=1&from=p&ptag=js&s=598253&p=world::australia::news.world.australia.story.36052243.page&x1=[urn:bbc:cps:8b4f2ef6-b453-0c47-a812-f53141e77eed]&x2=[responsive]&x3=[bbc_website]&x4=[en]&x7=[article]&x8=[reverb-0.9.1-nojs]&x10=[NEWS_GNL]&x11=[NEWS]", "https://ssc.api.bbc.com/?c1=2&c2=19293874&ns_site=bbc&name=", "https://ichef.bbci.co.uk/news/1024/branded_news/856E/production/_89285143_89285142.jpg"], "top_img": "https://ichef.bbci.co.uk/news/1024/branded_news/856E/production/_89285143_89285142.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bbc.com/news/world-australia-36052243", "title": "Depp's wife Amber Heard avoids Australia dog-smuggling conviction", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "Actress Amber Heard, who is married to Johnny Depp, avoids a conviction for illegally taking their dogs into Australia last year after pleading guilty.", "x-country": "us", "x-audience": "US", "CPS_AUDIENCE": "US", "CPS_CHANGEQUEUEID": 276265579, "og": {"title": "Heard avoids dog-smuggling conviction", "type": "article", "description": "Actress Amber Heard, who is married to Johnny Depp, avoids a conviction for illegally taking their dogs into Australia last year after pleading guilty.", "site_name": "BBC News", "locale": "en_GB", "url": "https://www.bbc.com/news/world-australia-36052243", "image": {"identifier": "https://ichef.bbci.co.uk/news/1024/branded_news/856E/production/_89285143_89285142.jpg", "alt": "BBC News. Actors Johnny Depp and Amber Heard have returned to Australia to face dog smuggling charges"}}, "article": {"author": "https://www.facebook.com/bbcnews", "section": "Australia"}, "fb": {"pages": "1143803202301544,317278538359186,1392506827668140,742734325867560,185246968166196,156060587793370,137920769558355,193435954068976,21263239760,156400551056385,929399697073756,154344434967,228735667216,80758950658,260212261199,294662213128,1086451581439054,283348121682053,295830058648,239931389545417,304314573046,310719525611571,647687225371774,1159932557403143,286567251709437,1731770190373618,125309456546,163571453661989,285361880228,512423982152360,238003846549831,176663550714,260967092113,118450564909230,100978706649892,15286229625,122103087870579,120655094632228,102814153147070,124715648647,153132638110668,150467675018739", "app_id": 1609039196070050, "admins": 100004154058350}, "twitter": {"card": "summary_large_image", "site": "@BBCWorld", "title": "Heard avoids dog-smuggling conviction", "description": "Actress Amber Heard, who is married to Johnny Depp, avoids a conviction for illegally taking their dogs into Australia last year after pleading guilty.", "creator": "@BBCWorld", "image": {"src": "https://ichef.bbci.co.uk/news/1024/branded_news/856E/production/_89285143_89285142.jpg", "alt": "Actors Johnny Depp and Amber Heard have returned to Australia to face dog smuggling charges"}, "domain": "www.bbc.com"}, "apple-itunes-app": "app-id=364147881, app-argument=https://www.bbc.com/news/world-australia-36052243?utm_medium=banner&utm_content=apple-itunes-app", "apple-mobile-web-app-title": "BBC News", "application-name": "BBC News", "msapplication-TileImage": "BBC News", "msapplication-TileColor": "#bb1919", "mobile-web-app-capable": "yes", "robots": "NOODP,NOYDIR", "theme-color": "#bb1919"}, "movies": [], "publish_date": null, "source": "https://www.bbc.com", "summary": ""}