{"url": "https://www.hollywoodreporter.com/lists/emmy-parties-2017-inside-a-list-emmy-parties-events-updating-1039631", "text": "Party: Hulu\n\nPlayers: Margaret Atwood; Emmy winners Elisabeth Moss, Ann Dowd with the entire Handmaid's Tale cast\n\nPlace: Otium\n\nSpread: Sliders and rose macaroons\n\nInside Dish:\n\n\"Historic.\" That's the word of the night at Hulu's Emmy party at Otium on downtown L.A. Hulu head of originals Beatrice Springborn tells THR she lost her peripheral vision when The Handmaid's Tale — which she developed — became the first streaming show to win best drama, beating competition from Netflix and its $6 billion originals budget. \"It feels historic and that we did it with my favorite writer, Margaret Atwood, is amazing.\"\n\nCloaked Handmaid's lined the entrance to the party, which filled up rapidly ahead of the cast and creative team's arrival from the Governor's Ball. Springborn says the \"wheels are rolling on season two\" of Handmaid's, though she offered a fun \"TBD\" on facing off with Game of Thrones at the 2018 Emmys. Hulu senior vp Craig Erich called the win “a defining moment for the company” and newly appointed content chief Joel Stillerman said he was “proud to be a small, peripheral part” of the show, which was developed before he arrived at the streamer.\n\nActor Jon Hamm stopped by the party, arriving after Chief Content Officer Joel Stillerman, who left AMC for Hulu. \"I'd work with him again in a heartbeat,\" Hamm said of the victorious chief of the streaming service. According to Stillerman, who sees similarities between his time at AMC and now at Hulu, \"The trick is to take advantage of all the momentum.\"\n\n\"Down!\" That's actress in drama series winner Elisabeth Moss' immediate plans for where she plans to put her pair of Emmy statuettes. The actress, who couldn't go two feet at the jam-packed party, was hauling a pair of heavy trophies with her as she worked her way inside the festivities where longtime friend and former co-star Hamm was waiting.\n\nThe Mad Men grad, who won his fair share of Emmy gold, told THR he texted Moss immediately after she won for best drama actress. \"I congratulated her and then told her to get right back out there because I had a feeling the show would win, too.\" Hamm — who watched the ceremony from home — said he jumped for joy when Moss took home her first-ever Emmy.\n\nWinner Ann Dowd had already slipped off her shoes by the time well-wishers swarmed to congratulate her inside the party. The actress, who was recognized for her work as Aunt Lydia in the dystopian drama, was still clutching her Emmy (and was still barefoot) when she made an early exit. Another guest who drew big crowds was Handmaid’s Tale author Atwood, who had received a standing ovation inside Microsoft Theater earlier that evening.\n\n\"We leaned into the theme of hope, which a lot of people were really looking for at the time. Regardless of the election, which clearly had some effect on the show, people were looking for the theme of hope and that was part of the universal theme that people really held on to,\" Springborn added. \"The train is moving on season two and it's already being developed. But yes, next year so it will be eligible.\"\n\nOn the momentous win for the streaming service, Stillerman adds: \"Streaming is the new way of life. To the extent that firsts are important, this is a big one for Hulu. We have our work cut out for us to continue to build the business. The world is clearly moving in a streaming direction and I'm glad we're among the few who have a nice head-start on it.\"\n\nIt was a festive mood throughout the evening, as several dance parties broke out among executives and talent. While CEO Mike Hopkins was savoring the wins, he told THR, “we’re just getting started.”\n\nBruce Miller also kept his festive mood going at the party, walking in carrying his two Emmys — one for best drama series and the other for outstanding writing, marking his first wins from his first nominations. \"It's a little overwhelming,\" he tells THR. \"I'm proud of my people, they worked so hard and threw themselves into the project from the very beginning. To see Elisabeth up there, having been nominated seven times, I'm so proud of all of them and the work that we did together. ... The most historic part of it is that it was done the way that you do all television: you try to tell a good, interesting story and Hulu embraced that. They didn't complicate it, they just put it on TV. The historic part is the stuff that we do is not changing that much.\"", "images": ["https://cdn1.thr.com/sites/default/files/2017/09/GettyImages848753364H2017.jpg", "https://www.hollywoodreporter.com/sites/default/files/custom/Annie/THR_emmys17-embed2x.png", "https://cdn1.thr.com/sites/default/files/imagecache/list_square_270x270/2019/07/annsarnoff_illo.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/list_landscape_960x541/2017/09/gettyimages-848776454_-_h_2017.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/list_square_270x270/2017/09/h091517a-1206a-h_2017.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/list_square_270x270/2019/06/easy_rider_-_h_-_1969.jpg", "https://assets.hollywoodreporter.com/assets/1562102990/images/brand/thr-logo-white.svg?a0259e7bd063a50286c0", "https://cdn1.thr.com/sites/default/files/imagecache/list_landscape_960x541/2017/09/GettyImages848753364H2017.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1"], "top_img": "https://cdn1.thr.com/sites/default/files/2017/09/GettyImages848753364H2017.jpg", "keywords": [], "authors": ["Ramona Saviss Chris Gardner", "Ramona Saviss", "Chris Gardner"], "canonical_link": "https://www.hollywoodreporter.com/lists/emmy-parties-2017-inside-a-list-emmy-parties-events-updating-1039631", "title": "Emmy Parties 2017: Inside the A-List Events", "meta_data": {"viewport": "width=device-width", "description": "THR staffers are on the scene at all the A-List parties celebrating TV's biggest night.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/lists/emmy-parties-2017-inside-a-list-emmy-parties-events-updating-1039631", "domain": "https://www.hollywoodreporter.com/", "title": "Emmy Parties 2017: Inside the A-List Events", "description": "THR staffers are on the scene at all the A-List parties celebrating TV's biggest night.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2017/09/GettyImages848753364H2017.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "Emmy Parties 2017: Inside the A-List Events", "description": "THR staffers are on the scene at all the A-List parties celebrating TV's biggest night.", "url": "https://www.hollywoodreporter.com/lists/emmy-parties-2017-inside-a-list-emmy-parties-events-updating-1039631", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2017/09/GettyImages848753364H2017.jpg", "width": 1296, "height": 730, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "Emmy Parties 2017: Inside the A-List Events", "sailthru.description": "THR staffers are on the scene at all the A-List parties celebrating TV's biggest night.", "sailthru.author": "Ramona Saviss,Chris Gardner", "sailthru.vertical": "Awards", "sailthru.date": "2017-09-15 19:33:36", "sailthru.tags": "Awards,Emmy Awards,Red Carpet,Events"}, "movies": [], "publish_date": 1505518416.0, "source": "https://www.hollywoodreporter.com", "summary": ""}