{"url": "https://tech2.org/canada/meghan-markle-under-fire-why-is-the-future-princess-the-subject-of-so-much-scrutiny/", "text": "It began, as do most of these family scandals, with an exhibition in The Daily Mail . One of Markle's childhood friends not only shared (and probably sold) a real boat full of private photos, ranging from school games to family vacations or his first wedding, but he gave a revealing interview, and some would say completely disloyal The theme ranged from the relatively innocent, such as how they became inseparable in elementary school and how it was for the private school for girls, to even more damaging revelations like the fact that this friend believes that fame \"changed\" Meghan. Even a headline circulated that the friend \"blamed\" Markle for the destruction of his first marriage.\n\nTo add insult to injury, Markle's stepsister, Samantha Markle, has been telling everyone, well, anything and everything they want to know about future royalty. It is widely known that the two women are not close (it is unknown the last time they spoke) and it is worth mentioning that she has plans to launch a book called The diary of the sister of Princess Pushy so that the timing of these interviews is anything but random. Samantha talked about whether Meghan will ask her father to take her down the hall and admitted that the relationship with Harry \"created a gap\" in the family.\n\nThe uncle of the future princess has also welcomed the photographers in her house and talked about the upcoming nuptials, although her comments were decidedly more positive and not at all derogatory, it still represents a phenomenon that all those who experience fame Almost instantaneous they have Supported: When someone you've met or spoken of leaves the carpentry shop for their own 15 minutes (or 15 seconds) of fame.", "images": ["https://tech2.org/canada/wp-content/themes/sahifa/favicon.ico", "https://akns-images.eonline.com/eol_images/Entire_Site/2017111/rs_634x1024-171201104935-634.Meghan-Markle-Blue-Coat-Flowers.jl.120117.jpg", "https://akns-images.eonline.com/eol_images/Entire_Site/2017111/rs_600x600-171201104523-600.Meghan-Markle-Blue-Coat.jl.120117.jpg?downsize=450:*&crop=450:350;left,top"], "top_img": "https://tech2.org/canada/wp-content/themes/sahifa/favicon.ico", "keywords": [], "authors": [], "canonical_link": "https://tech2.org/canada/meghan-markle-under-fire-why-is-the-future-princess-the-subject-of-so-much-scrutiny/", "title": "Meghan Markle Under Fire: Why is the future princess the subject of so much scrutiny? – TECH2", "meta_data": {"og": {"title": "Meghan Markle Under Fire: Why is the future princess the subject of so much scrutiny? - TECH2", "type": "article", "description": "[ad_1] Jeremy Selwyn - WPA Pool / Getty Images A lot for the honeymoon phase. Just a week ago Prince", "url": "https://tech2.org/canada/meghan-markle-under-fire-why-is-the-future-princess-the-subject-of-so-much-scrutiny/", "site_name": "TECH2"}, "generator": "WordPress 5.2.2", "viewport": "width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://tech2.org", "summary": ""}