{"url": "https://www.thequiz.com/how-well-do-you-know-the-bachelorette-rachel-lindsay/", "text": "How Well Do You Know The Bachelorette, Rachel Lindsay? by Kaline Forrester\n\n– on Jul 26th\n\nin Movies and TV\n\n317 Shares\n\nAmerica's first black Bachelorette is nearing the end of her journey to find love, and it is at the point in her journey that is getting very emotionally difficult. She is down to just a few men, and as they all do, she is struggling to understand her feelings for multiple men and make the best decision for her life. As she has said several times, she is looking for a fiancé, not a boyfriend, and she is taking this process very seriously, as she should be. How close have you been paying attention to her this season and last season when she was a contestant on The Bachelor? Whether she was one of your favorite picks and you were excited to have her as The Bachelorette, or if you could take her or leave her, a true member of Bachelor Nation will have paid attention and know all there is to know about our current leading lady. So as Rachel Lindsay's season comes to an end and she is getting oh-so close to choosing her future husband, let's put your knowledge to the test when it comes to our lovely Bachelorette. How well do you know Rachel?\n\nQuestion 1 What is Rachel's job? Journalist Lawyer Teacher Reporter Rachel Lindsay was picked to be The Bachelorette for many reasons, other than just the obvious. Of course there is her physical beauty, and the sweet, outgoing personality that makes her so likeable to audiences. But she is more than just a pretty face, and in fact has worked hard to make a career for herself. During her time on The Bachelor, her career was one of the more serious ones (as opposed to \"Twin\" or \"Tickle Monster\"), and it is something she is respected for.\n\nQuestion 2 How old is Rachel? 29 30 31 32 Rachel was one of the older contestants on the last season of The Bachelor, who was 36 at the time. Usually, there is a good mix of contestants vying for the heart of The Bachelor or The Bachelorette in terms of age. The age group is generally between early 20's and mid-30's. It makes sense that Rachel was one of the older girls on that season since she exudes such a cool confidence and never engaged in any cattiness, but remained mature. How old is she?\n\nQuestion 3 Where is she from? Texas Tennessee California Illinois Do you remember Rachel's hometown date with Nick and where she took him? If not, do you remember any of the times she has spoken to her suitors this season about her life? There have been several instances where Rachel has referenced her hometown, family, etc. It would be surprising for a Bachelor fan to not know where their current Bachelorette hails from. She will likely be going back there soon, to bring her final few men home to meet the family.\n\nQuestion 4 How far did she make it on The Bachelor? Fourth place Third place Runner-Up Winner Rachel's journey to find love on The Bachelor did not end the way she had hoped it would. In hindsight, I am sure she would say it actually ended up better, since she won the coveted role of The Bachelorette. Still, to get to that point meant a hard breakup, public heartbreak, and having to get over those feelings rather quickly to get ready to film her own season. That is a lot to take in, but she handled herself gracefully both during and after the breakup with Nick, and throughout her own season.\n\nQuestion 5 What is her physical trademark? Thick eyebrows Mole Dimples Gapped teeth Some women are blessed with a physical trademark of beauty that they are known for having, their own special feature that makes them stand out. Rachel Lindsay is without a doubt beautiful, but do you know what her trademark is? Like Cara Delevingne's eyebrows, Miranda Kerr's dimples, Cindy Crawford's mole, and Brooke Shields' brows, Rachel too has her own beauty trademark that makes her stand out. In fact, she shares this attribute with one of her remaining men, and they even jokingly bonded over it earlier on in the season!\n\nQuestion 6 She blames her insecurities on ____. Her older sister An ex-boyfriend Her parents Herself Even a woman as secure and confident as Rachel Lindsay feels insecure sometimes. Every girl does, even the most beautiful supermodels on the earth. They are not always insecurities about beauty (although many are), but other things in life too- achievements (or lack thereof), feeling like a disappointment, not liking something about yourself whether it be mental or physical, etc. Rachel is just like every other woman on the face of the earth in that respect, so do you remember where she said her own insecurities come from?\n\nQuestion 7 Rachel's final four men were made up primarily of what race? White Black Hispanic Asian Race has played a large role in this season of The Bachelorette, as Rachel is the first African American Bachelorette in the show's history, which is an even bigger deal since there has also never been a black Bachelor. Usually, the cast is made up of several races and ethnicities, and toward the end of the show when only a few contestants remain, those contestants have been predominantly white. In Rachel's season of The Bachelorette, has she followed suit, or has she selected mostly men of her own race?\n\nQuestion 8 Rachel says she grew up in a white community, and has mostly dated ____ men. White Black Hispanic Asian According to the Bachelorette, Rachel was raised in a predominantly white community. She has made comments in the past about having mostly dated a certain race. Of course, love is not about how someone looks on the outside, and Rachel has not selected her suitors based on their race or anything other than her connection to them. Still, it is interesting to see the first black Bachelorette whittle down her crop of men to just a few. Do they match the kind of men she has generally dated before?\n\nQuestion 9 Who caused the most drama on Rachel's season? Eric and Whaboom Whaboom and Kenny Kenny and Lee Lee and Josiah Although there were plenty of candidates for \"most dramatic\" on Rachel's season, two of them take the cake. From the get-go, these guys seemed to be more into arguing with each other and making each other look bad than they were into Rachel. And as any true Bachelor fan knows, those bad seeds are usually weeded out pretty quickly. In this case, they stuck around longer than most people would have liked, but it didn't take Rachel long to see their true colors. Who were they?\n\nQuestion 10 What did Rachel buy Bryan in Switzerland? Concert tickets A watch Expensive whiskey Leather Shoes On their one-on-one date in Geneva, Switzerland, Rachel and Bryan spent a romantic day together in the old city. At this time, there were just six suitors left, three of whom got one-on-one dates, and the other three of whom had a little mini-group date. But arguably, Bryan got one of the best dates of all, because it came along with a pretty nice gift. It didn't come as much of a surprise, then, that he was advanced into the final four.\n\nQuestion 11 On hometown dates, who did Rachel have to comfort because he was nervous? Dean Eric Peter Bryan For three out of the four hometown dates (and for mostly all hometown dates, ever), it was the Bachelorette herself that was racked with nerves. Usually the contestant is excited and proud to be bringing home his new love to meet his family, and to show off where he grew up. But this was not the case with one of Rachel's final four men, whom she had to comfort before they went inside his father's house. It was a sweet moment, though.\n\nQuestion 12 How does Rachel feel about Corinne Olympios? She loves her She hates her She is indifferent She doesn't know her Corinne Olympios has become quite infamous since her time on The Bachelor. She was competing for Nick Viall's love right alongside Rachel, and made it pretty far. But people either love her or hate her, including her fellow contestants. Some of them could not stand her (we'll see if that changes in Paradise this summer), others were indifferent or found her amusing, and others still even liked her. So where did Rachel fall on this spectrum of love and hate for Corinne?\n\nQuestion 13 Rachel said, I don't have a physical type, except for _____.\" Big muscles Nice hair A great smile A six-pack On The Ellen DeGeneres Show before The Bachelorette premiered, Rachel shared with the television host exactly what she was looking for in a man. While it remains to be seen if she found it, she told Ellen, \"I really don't have a physical type, except for ____... I'm looking for a guy who can make me laugh. I'm looking for a guy who knows exactly what he wants, who's ambitious, ready to start a family and ready to get married, because I'm at that phase in my life.\"\n\nQuestion 14 What pet does Rachel have? A cat named Rosie A dog named Copper A fish named Goldie A ferret named Lila You may have heard Rachel reference her pet in conversation here and there on both The Bachelor and The Bachelorette, especially on her hometown date with Nick last season. We will see if she mentions him or her even more on upcoming episodes when Rachel goes home with her final two or three men. So what kind of person does Rachel strike you as? A dog person, cat person, fish person, or one of those people who appreciates a stranger animal like a ferret?\n\nQuestion 15 According to Rachel, what is one of her flaws? She is always late She is indecisive She hates cleaning She is impatient Yes, even the seemingly perfect Rachel Lindsay has flaws, but that she is aware of them and wants to change them makes her even more impressive than she already is. It would seem that there is not much that could be wrong with her- she is successful, beautiful, and now famous. The only thing she was missing in life was love, and obviously that is no longer an issue. But when it comes to personality, there is one thing Rachel admits to having as a flaw.\n\nQuestion 16 Who tried to come back after Rachel asked him to leave The Bachelorette? Iggy Diggy DeMario Kenny This is the same man who caused all the uproar in Paradise and because of his and another contestant's behavior, production in Mexico had to be shut down. But before all that, he was creating drama while trying to date Rachel. She was having none of it, and told him to leave in the middle of a group date pretty early on in the season. But in the very next episode he showed back up at the mansion, hoping for a second chance. Rachel told him off, and he was sent packing for good.\n\nQuestion 17 Before law school. Rachel got a degree in Kinesiology and Sports Management from which school? University of Texas Texas Baptist University Texas Women's University Baylor University Before Rachel ever went to law school, she of course had to first earn her undergraduate degree. Being the kind of go-getter person that she is, she had not only one major but a double major in Kinesiology and Sports Management. Luckily for her, there are tons of universities and colleges in her home state of Texas that she had to choose from, so which school did she end up going to for her undergraduate degrees in her earliest college years?\n\nQuestion 18 What is her biggest regret? Getting married when she was young Focusing too much on her career Not spending more time with her nephew Not going to school even longer It may seem like Rachel Lindsay has it all together, and for the most part, she does. Women who are selected for the coveted role of The Bachelorette are generally well-spoken and well put-together in every way. But they like anyone else are humans with flaws, and thus have made mistakes or missed out on things in their lives that they later regret. For Rachel, as happy as she is in her current place in life, there is one thing she wishes, given the chance, that she would have done differently.\n\nQuestion 19 How many siblings does Rachel have? Zero One Two Three If you watched the hometown episode on Nick's season of The Bachelor, you would know the answer to this question. On that day, Nick and Rachel visited her hometown of Dallas, Texas. After visiting her church, they met her family for dinner at their house. Between this episode and various conversations Rachel has had with Nick and her own contestants, and through interviews, she has made clear that she has ___ siblings. Are they sisters, brothers, both? Or is she an only child?\n\nQuestion 20 What is her father's profession? He is a college professor He is retired Army He is a preacher He is a judge Rachel's father was notably absent from the hometown date dinner with Nick, and that is because of his \"work conflict\". Show host Chris Harrison later revealed in his blog that because of his career he could not appear on a television show, although he did get to speak with Nick before he left that night, off camera. Rachel's father's name is Sam A. Lindsay, and he is both famous and controversial in his own right. It is too bad he was not able to participate in the hometown date on camera.\n\nQuestion 21 Besides being the first black Bachelorette, she was also the first black ____. Recipient of the first one-on-one date \"Winner\" of the two-on-one date Recipient of a hometown date Recipient of the First Impression Rose Rachel sure has a lot of \"first\" titles under her belt! But she is deserving of them, and has done an exemplary job as the Bachelorette, regardless of race. But before being the Bachelorette was ever even a thought in her mind, she received something else that in the moment, was quite exciting. Nothing could probably be as exciting as being named The Bachelorette, but in the midst of living in the Bachelor Mansion and competing with the other girls, winning this must have made her feel elated, especially being the first black woman to do so.\n\nQuestion 22 Rachel has already revealed what about the end of her Bachelorette journey? She is engaged. She picked no one. She \"pulled a Mesnick\". She was engaged but they have already broken up. Anytime you have a reality show like this, people like Reality Steve and others who get their hands on the outcome like to put out the spoilers for those who care to know. But even Rachel herself has given us a tidbit of information about how her journey to love ended. Of course she did not reveal the name of the winner if there was one (remember good ol' Brad Womack?), but she did do some sharing in interviews since the filming for the show wrapped up a few months ago.\n\nQuestion 23 Which date with Nick did Rachel describe as a \"fairytale\"? Wisconsin New Orleans Finland St. Thomas The date with Nick that Rachel described as a \"fairytale\" was, of course, a one-on-one date. Her exact words were, \"I don’t believe in fairytales, but I believe in today and today was a fairytale.\" The date included visiting an open-air market and eating beignets, hot sauce, and oysters. They attended a concert and had dinner, and Nick described their connection as \"explosive chemistry.\" They were both super into each other on the date, and even though Rachel had worried his first impression of her would not last, it clearly did.\n\nQuestion 24 What was her biggest pet-peeve on The Bachelor? Traveling so much Competing with other women for one man Living in a house full of women Having to live in front of a camera This self-described girly-girl and former sorority girl was probably the perfect candidate to live in a house full of women (all dating the same man) and live to tell the tale. But that was not the only struggle of being on The Bachelor by far. Besides sharing her boyfriend with her roommates, she was also living out of a suitcase, living with a bunch of catty crazies, and living her life in front of a camera. I think I would have at least one pet-peeve, too.\n\nQuestion 25 How did Rachel know her suitor, Fred? They were high school sweethearts She was his camp counselor He was her brother's friend They were neighbors growing up Remember Fred? He was sweet, but did not make it very far with Rachel. She actually sent him home in the middle of a group date after her professed his deep feelings for her because she knew she could not return his feelings. But Rachel and Fred had known each other prior to being on the show together. It would have been such a cute story for them to have had some sort of previous relationship in life only to meet up again later on The Bachelorette and fall in love. Oh, well- Rachel just wasn't feeling it.", "images": ["https://www.thequiz.com/public/build/images/bg-logo-full-white.8242bbb9.svg", "https://www.thequiz.com/public/build/images/tt-logo-full-white.04a6f0d4.svg", "https://www.thequiz.com/public/build/images/sr-logo-full-white.b0cc2b44.svg", "https://www.thequiz.com/public/build/images/cb-logo-full-white.afca2e29.svg", "https://www.thequiz.com/public/build/images/tq-logo-full-white.7436bde3.svg", "https://www.thequiz.com/public/build/images/th-logo-full-white.7684e614.svg", "https://www.thequiz.com/public/build/images/tv-logo-full-white.642d3d01.svg", "https://q.quora.com/_/ad/91f52889f6a04390a65ad2591c59986e/pixel?tag=ViewContent&noscript=1", "https://static3.thequizimages.com/wordpress/wp-content/uploads/2017/07/43f24789-b223-4a66-a238-ffdb753563fd-e1501000533121.jpg", "https://www.facebook.com/tr?id=847620415402239&ev=PageView&noscript=1", "https://www.thequiz.com/public/build/images/mm-logo-full-white.fe72c74c.svg", "https://www.thequiz.com/public/build/images/tr-logo-full-white.090c581a.svg", "https://www.thequiz.com/public/build/images/hc-logo-full-white.5f66cfe4.svg", "https://www.thequiz.com/public/build/images/tg-logo-full-white.fc9e742a.svg", "https://www.thequiz.com/public/build/images/ts-logo-full-white.54beb4cf.svg", "http://b.scorecardresearch.com/p?c1=2&c2=21868715&cv=2.0&cj=1"], "top_img": "https://static3.thequizimages.com/wordpress/wp-content/uploads/2017/07/43f24789-b223-4a66-a238-ffdb753563fd-e1501000533121.jpg", "keywords": [], "authors": ["Kaline Forrester"], "canonical_link": "https://www.thequiz.com/how-well-do-you-know-the-bachelorette-rachel-lindsay/", "title": "How Well Do You Know The Bachelorette, Rachel Lindsay?", "meta_data": {"viewport": "user-scalable=yes, initial-scale=1.0, width=device-width", "twitter": {"card": "summary_large_image", "site": "@thequiz_com"}, "og": {"title": "Are You The Bachelorette, Rachel Lindsay's Biggest Fan? Prove It!", "type": "article", "image": {"identifier": "https://static3.thequizimages.com/wordpress/wp-content/uploads/2017/07/43f24789-b223-4a66-a238-ffdb753563fd-e1501000533121.jpg", "width": 1500, "height": 750}, "url": "https://www.thequiz.com/how-well-do-you-know-the-bachelorette-rachel-lindsay/", "locale": "en_US", "description": "Let's put your knowledge to the test when it comes to our lovely Bachelorette. How well do you know Rachel?", "site_name": "TheQuiz"}, "article": {"published_time": "2017-07-26T15:07:41Z", "section": "Movies and TV"}, "fb": {"app_id": 1888896051351709}}, "movies": [], "publish_date": 1501081661.0, "source": "https://www.thequiz.com", "summary": ""}