{"url": "https://en.wikipedia.org/wiki/A_Christmas_Prince", "text": "A Christmas Prince is a 2017 American Christmas romantic comedy film directed by Alex Zamm, written by Karen Schaler and Nathan Atkins and stars Rose McIver, Ben Lamb, Tom Knight, Sarah Douglas, Daniel Fathers, Alice Krige and Tahirah Sharif. The film was released on Netflix on November 17, 2017.[1][2] A sequel, titled A Christmas Prince: The Royal Wedding, was released in 2018.\n\nPlot [ edit ]\n\nAn aspiring young American magazine journalist, Amber Moore, is sent to the foreign nation of Aldovia to cover a press conference with the crown prince Richard, who is set to take the throne following his father's recent death. Richard is alleged to be an irresponsible playboy and is also rumored to be planning to abdicate. Amber hopes her work in Aldovia will lead to a big break and she heads to the royal family's palace for the press conference, but the prince fails to appear, frustrating the assembled journalists. Amber decides to snoop around the palace and while doing so is mistaken for young Princess Emily's new tutor, Martha Anderson. Amber takes the opportunity to go undercover to investigate the rumors of abdication.\n\nEmily, who has spina bifida, intentionally tries to prank Amber into quitting, but soon warms up to her after Amber treats her like a normal girl. Amber also meets Richard, whom she is embarrassed to realize she insulted earlier after he, incognito, stole the cab she was about to get into at the Aldovian airport. Amber quickly becomes attracted to Richard upon learning that, contrary to rumors, he is actually a compassionate and responsible family man, though he is indeed reluctant to take the throne. During this time she also learns from Emily that Richard's cousin Simon is next in line for the throne, which he sorely wants; Amber also encounters Richard's ex-girlfriend Sophia, who Richard suspects was only interested in him for his future title.\n\nAmber is eventually confronted by Emily, who reveals that she knows the truth about her identity. Amber prepares to leave, but Emily agrees to not reveal her secret so long as she writes a story that exposes Richard for the real person he is and ends the negative rumors about him.\n\nAfter Amber follows Richard on horseback through the woods, her horse throws her off and she is nearly attacked by a wolf, only to be saved by Richard. While warming up at his father's old hunting cabin, the prince reveals to her that he told his father he was going to renounce the throne; they had a fight over the decision, and the king died soon after. Richard shows Amber a mysterious poem written by his father, and the two almost kiss but are interrupted by the sound of neighing horses. After Richard leaves to check on the animals, Amber searches the late king's desk and discovers a hidden compartment holding documents which prove that Richard was secretly adopted. Amber is reluctant to reveal the truth, as it would deeply hurt Richard, but decides to tell him during a walk; he kisses her instead, and she realizes she is in love with him. At the same time, a suspicious Sophia and Simon search Amber's room, discovering not only her true identity but Richard's adoption certificate.\n\nAt the Christmas Eve Ball, Richard prepares to be crowned, only for Sophia to reveal his adoption and Amber's true identity. Simon asserts himself as next in line for the throne as Richard storms off and rebuffs a repentant Amber's apologies, and she tearfully leaves the palace. The queen reveals to Richard that she adopted him after being told she could not have children, and that she regretted not telling him sooner, but that she and the king considered him their true son. The two reconcile, and Richard promises to not let Simon win the throne so easily.\n\nSimon marries Sophia, but learns he cannot be crowned until the queen is available to preside over the ceremony. Meanwhile, Amber suspects that she can prove Richard is the rightful king based on clues from his father's poem. She is allowed back into the palace and unearths a secret proclamation in a Christmas ornament made by the king which declares Richard as the rightful heir. Amber carries the document to the official chamber where Simon is being crowned, and she intervenes in time for Richard to be crowned instead, quietly slipping out of Aldovia afterwards.\n\nBack home, Amber's story on Richard is refused for being a puff piece. In anger, she quits the magazine, deciding to blog about the true Richard instead. Her blog becomes popular and eventually gains the attention of Richard himself. Amber spends New Year's Eve at her father's diner, where Richard surprises her and proposes to her, and she happily accepts.\n\nCast [ edit ]\n\nLocation [ edit ]\n\nPrincipal photography took place at the Peleş Castle in Romania.[citation needed]\n\nRelease [ edit ]\n\nThe film was released on Netflix on November 17, 2017.[3]\n\nReception [ edit ]\n\nOn review aggregator website Rotten Tomatoes, the film holds an approval rating of 70% based on 10 reviews, and an average rating of 6/10.[4]\n\nSequels [ edit ]\n\nOn May 18, 2018, a sequel was announced, titled A Christmas Prince: The Royal Wedding. It was released on Netflix on November 30, 2018.[5]\n\nA third film, titled \"A Christmas Prince: The Royal Baby\" was announced by Netflix in March 11, 2019. [6]", "images": ["https://upload.wikimedia.org/wikipedia/en/9/91/A_Christmas_Prince.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1"], "top_img": "https://upload.wikimedia.org/wikipedia/en/9/91/A_Christmas_Prince.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/A_Christmas_Prince", "title": "A Christmas Prince", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.11", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/9/91/A_Christmas_Prince.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}