{"url": "https://www.billboard.com/articles/columns/pop/8061580/the-voice-melanie-martinez-denies-rape-allegations-timothy-heller", "text": "Melanie Martinez, who appeared as a finalist on The Voice in 2012, has adamantly denied an accusation of sexual assault and rape by friend and fellow aspiring musician Timothy Heller. The shocking addition to the flood of stories regarding sexual impropriety in Hollywood, Washington and beyond began on Monday (Dec. 4) when Heller posted a lengthy tweet in which she described her alleged assault at the hands of someone she described as a close friend, later revealing it to be Martinez.\n\nEarly Tuesday morning (Dec. 5) Martinez wrote back, categorically denying Heller's claim. \"I am horrified and saddened by the statements and story told tonight by Timothy Heller, Martinez wrote. \"What she and I shared was a close friendship for a period of time. We came into each other's lives as we were both starting our careers as artists, and we tried to help each other. We both had pain in dealing with our individual demons and the new paths we were forging, but I truly felt we were trying to lift each other up.\"\n\nMartinez ended by adamantly writing that Heller \"Never said no\" to what the pair chose to do together.\n\nIn her original post, Heller wrote about a difficult night in which she said she \"repeatedly said no\" to sexual advances from Martinez, which she claims the singer did not accept. \"I have kept this secret for years, convincing myself that it wasn't a big deal and I wasn't hurt by it. The thought of accepting that my best friend raped me seems insane,\" Heller wrote. \"But I began to get responses I wasn't expecting. Concerned ones. It's hard to say someone you loved raped you. Someone you STILL love.\"\n\nHeller went on to describe Martinez as her best friend, one who took her in when life was hard, but then allegedly asserted her \"power and control\" over Heller during her most difficult times.\n\nWhen I wrote this story about my assault, I initially wasn’t going to make the abuser. But I think it’s important for you all to know this is about Melanie Martinez pic.twitter.com/4PQ5oNI2s9 — Timothy Heller (@timethyheller) December 4, 2017\n\nThe post goes on to claim that Martinez continued to make advances on Heller, ignoring Heller's refusals as Martinez allegedly performed oral sex on her and used a sex toy on her without consent. \"The bottom line that I need to always remind myself is that: I said no,\" she wrote. \"For TWO NIGHTS STRAIGHT. It doesn't matter that I didn't resist during the action. I had been broken down. She knew I didn't want to, I made that clear.\"", "images": ["https://www.billboard.com/files/styles/nav-cover-topcrop/public/media/jobs-cov-bb16-2019-uxnsk-billboard-400.jpg", "https://assets.billboard.com/assets/1562696694/images/Billboard-white.svg?7c321b89f5a705673407", "https://www.billboard.com/files/styles/magazine_cover/public/media/jobs-cov-bb16-2019-uxnsk-billboard-400.jpg", "https://www.billboard.com/files/media/Melanie-Martinez-Austin-City-Limits-Music-Festival-2016-billboard-1548.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1"], "top_img": "https://www.billboard.com/files/media/Melanie-Martinez-Austin-City-Limits-Music-Festival-2016-billboard-1548.jpg", "keywords": [], "authors": ["Gil Kaufman"], "canonical_link": "https://www.billboard.com/articles/columns/pop/8061580/the-voice-melanie-martinez-denies-rape-allegations-timothy-heller", "title": "Melanie Martinez Accused of Rape By Former Friend, Denies Allegations in Statement", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=no", "title": "Melanie Martinez of 'The Voice' Accused of Rape By Former Friend, Denies Allegations in Statement", "description": "Former \"Voice\" star Melanie Martinez is denying the allegations of sexual assault by fellow aspiring musician Timothy Heller.", "og": {"title": "Melanie Martinez Accused of Rape By Former Friend, Denies Allegations in Statement", "description": "Former \"Voice\" star Melanie Martinez is denying the allegations of sexual assault by fellow aspiring musician Timothy Heller.", "image": {"identifier": "https://www.billboard.com/files/media/Melanie-Martinez-Austin-City-Limits-Music-Festival-2016-billboard-1548.jpg", "width": 1548, "height": 1024, "type": "image/jpeg"}, "url": "https://www.billboard.com/articles/columns/pop/8061580/the-voice-melanie-martinez-denies-rape-allegations-timothy-heller", "site_name": "Billboard", "type": "article"}, "twitter": {"card": "summary_large_image", "url": "https://www.billboard.com/articles/columns/pop/8061580/the-voice-melanie-martinez-denies-rape-allegations-timothy-heller", "title": "Melanie Martinez Accused of Rape By Former Friend, Denies Allegations in Statement", "description": "Former \"Voice\" star Melanie Martinez is denying the allegations of sexual assault by fellow aspiring musician Timothy Heller.", "image": "https://www.billboard.com/files/media/Melanie-Martinez-Austin-City-Limits-Music-Festival-2016-billboard-1548.jpg", "site": "@billboard"}}, "movies": [], "publish_date": null, "source": "https://www.billboard.com", "summary": ""}