{"url": "https://www.drliv.com/avoid-acne-while-sleeping/", "text": "Hello everybody! My name is Dr Liv Kraemer, but all my patients are calling me Dr Liv. I’m a dermatologist with focus on skincare and skinfood. Do you suffer from acne? I know it can be distressing! I have so many patients with the same problem. Watch my video on how to avoid acne while sleeping and read my post below.\n\nWhat is acne?\n\nAcne is a skin condition that occurs when your hair follicles become plugged with oil and dead skin cells. Yes, acne always existed, even 100 years ago. I would say because of the dirt and the hygienic problems even more intense in the middle ages than now. Hormonal changes and stress trigger acne. You, of course, know it. Just if you have a date or a party, your bacteria make a big party on your face, too: you get a breakout.\n\nAcne most commonly appears on your face, but also on neck, chest, back and shoulders. I know, acne can be distressing and annoyingly persistent. I have a lot of patients in any age. The patient’s age is ranging from 13, with a peak around their late 20s and even up to their mid-30s and 40s. Acne in the 40s is the so-called “late-onset acne”. But don’t be afraid, don’t give up. There are acne treatment solutions. It doesn’t have to be complicated or expensive. But on the other side don’t over-treat. Don’t try too much, get help by a dermatologist before it is too late.\n\nDepending on its severity, acne can cause emotional distress even depression and lead to scarring of your skin. The lesions heal slowly and -if you are getting older- even slower.\n\nIf one lesion begins to resolve, others seem to crop up, and old once are still visible as red and brown spots. Therefore, it’s so important to treat them in the early stage. So don’t give up, acne can be cured. There are effective treatments available (local cream treatments or with tablets). You might laugh, but so many of my patients harm themselves by using wrong fatty creams, by touching their face or by not washing their face the right way. (Check my video about “how to wash your face right” on Youtube, click here). Let’s start with a series of blog sessions how to give you a glowing skin. Let’s start with small steps. Here are some tips against new breakouts while sleeping:\n\nTips on how to avoid acne while sleeping:\n\nRemove your makeup\n\nWash your face before going to bed! If not, the bacteria will stay on your face!\n\nUse a small towel for your face only! Don’t use it for other parts of your body.\n\nChange your bed sheets once a week. Otherwise, your pillowcase will stay covered in bacteria. Don’t let them grow!\n\nUse bed sheets with 100% cotton. Therefore, you can wash them 60C (it ‘s enough, they don’t have to be washed 90C) but also think green!\n\nBut maybe you don’t have acne – rosacea is often mixed up with acne, an allergic reaction or other skin problems. Rosacea is a very common skin condition that causes redness in your face and often produces small, red, pus-filled bumps. We call it butterfly pattern because the redness is around your cheeks (it indeed look like a butterfly with the wings on your cheeks). Its exact cause is unknown.Triggers are sun exposure, extreme temperature changes, stress, some cosmetics and skincare products so as spicy food and alcohol consumption. Unfortunately, rosacea is also genetically inherited. Does your mom or grandmother has these beautiful apple fresh air cheeks? You will have it as well! If you don’t treat it, the disease will get worse. It affects women so as men of any age, but generally develops late in adulthood. I promise to make another tutorial about it.\n\nIf you wish to make an appointment to get the right treatment, please contact us here:\n\nLearn more about healthy skin and follow me on my social media accounts:\n\nYoutube! ➜ youtube.com/DrLiv\n\nFacebook! ➜ facebook.com/DrLiv\n\nInstagram! ➜ instagram.com/drliv/\n\nPinterest! ➜ pinterest.de/drlivkraemer/\n\nTwitter! ➜ twitter.com/doctorliv/\n\nThanks for your support, either with a comment or with thumbs up – it helps me a lot!\n\nYours,\n\nDr Liv\n\n", "images": ["https://www.drliv.com/wp-content/uploads/2019/02/sleep-acne.jpg", "https://secure.gravatar.com/avatar/67388a980e319168085fe22c865ffadb?s=64&d=mm&r=g", "https://www.drliv.com/wp-content/uploads/2019/04/DrLiv-Logo.png", "https://www.drliv.com/wp-content/plugins/sitepress-multilingual-cms/res/flags/en.png", "https://www.drliv.com/wp-content/plugins/sitepress-multilingual-cms/res/flags/de.png", "https://www.drliv.com/wp-content/uploads/2019/02/Itchy-skin.jpg", "https://www.drliv.com/wp-content/themes/sugarland/assets/images/blank.jpg", "https://www.drliv.com/wp-content/uploads/2019/02/powerfood-pumpkin.jpg"], "top_img": "https://www.drliv.com/wp-content/uploads/2019/02/sleep-acne.jpg", "keywords": [], "authors": ["Liv Kraemer"], "canonical_link": "https://www.drliv.com/avoid-acne-while-sleeping/", "title": "How to avoid acne while sleeping – video by Dr Liv Kraemer", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "Do you suffer from acne? It can be very distressing! In this video and her blog Dr Liv Kraemer will tell you how to avoid acne while sleeping.", "og": {"locale": "en_US", "type": "article", "title": "How to avoid acne while sleeping – by Dr Liv", "description": "Do you suffer from acne? It can be very distressing! In this video and her blog Dr Liv Kraemer will tell you how to avoid acne while sleeping.", "url": "https://www.drliv.com/avoid-acne-while-sleeping/", "site_name": "Dr. Liv Kraemer", "image": "https://www.drliv.com/wp-content/uploads/2019/02/sleep-acne.jpg"}, "article": {"publisher": "https://www.facebook.com/DrLiv", "section": "Good to know", "published_time": "2019-02-22T16:08:17+00:00"}, "twitter": {"card": "summary", "description": "Do you suffer from acne? It can be very distressing! In this video and her blog Dr Liv Kraemer will tell you how to avoid acne while sleeping.", "title": "How to avoid acne while sleeping – by Dr Liv", "site": "@doctorliv", "image": "https://www.drliv.com/wp-content/uploads/2019/02/sleep-acne.jpg", "creator": "@doctorliv", "url": "https://www.drliv.com/avoid-acne-while-sleeping/"}, "generator": "WPML ver:4.2.7.1 stt:1,3;"}, "movies": ["https://www.youtube.com/embed/e9jn0llIev4?feature=oembed"], "publish_date": 1550851697.0, "source": "https://www.drliv.com", "summary": ""}