{"url": "https://en.wikipedia.org/wiki/List_of_Twin_Peaks_episodes", "text": "Twin Peaks: Definitive Gold Box Edition. This : Definitive Gold Box Edition. This box set contains all 30 episodes from the first two seasons including special features on 10 DVDs.\n\nTwin Peaks, an American serial drama television series created by David Lynch and Mark Frost, premiered on April 8, 1990, on the ABC Network in the United States and ended on June 10, 1991. The show spans 30 episodes over two seasons. The original pilot and season 2 premiere are 90 minutes long, while all the other episodes are approximately 45 minutes long. ABC canceled the series due to declining ratings in the second season.[1]\n\nBoth seasons of Twin Peaks were released on DVD in the U.S. in 2001 for the first season by Republic Pictures Entertainment/Artisan Home Entertainment and 2007 for the second and final season by Paramount Pictures Home Entertainment/CBS DVD, respectively.[2][3] A complete series DVD box set, titled \"The Definitive Gold Box Edition\", with additional features was released on October 30, 2007.[4] The complete series (including the film) was released on Blu-ray with even further material on July 29, 2014.[5]\n\nTwin Peaks follows FBI Special Agent Dale Cooper, who is sent to the fictional town of Twin Peaks, Washington to investigate the murder of popular and respected high school student Laura Palmer. A feature-length prequel film, titled Twin Peaks: Fire Walk with Me, was released on August 28, 1992, which depicts the events leading up to Laura's death.[6]\n\nThe regular cast includes Kyle MacLachlan as FBI Special Agent Dale Cooper, Michael Ontkean as Sheriff Harry S. Truman, Mädchen Amick as Shelly Johnson, Dana Ashbrook as Bobby Briggs, Richard Beymer as Benjamin Horne, Lara Flynn Boyle as Donna Hayward, Sherilyn Fenn as Audrey Horne, Warren Frost as Dr. Will Hayward, Peggy Lipton as Norma Jennings, James Marshall as James Hurley, Everett McGill as Big Ed Hurley, Jack Nance as Pete Martell, Kimmy Robertson as Lucy Moran, Ray Wise as Leland Palmer, Joan Chen as Josie Packard, and Piper Laurie as Catherine Martell.\n\nOn October 6, 2014, it was announced that the series would return for a third season to air on Showtime.[7] It premiered on May 21, 2017, and consists of 18 episodes.\n\nSeries overview [ edit ]\n\nSeason Episodes Originally aired First aired Last aired Network 1 8 April 8, 1990 ( ) May 23, 1990 ( 1990-05-23 ) ABC 2 22 September 30, 1990 ( ) June 10, 1991 ( 1991-06-10 ) Fire Walk with Me August 28, 1992 ( ) N/A 3 18 May 21, 2017 ( ) September 3, 2017 ( 2017-09-03 ) Showtime\n\nEpisodes [ edit ]\n\nSeason 1 (1990) [ edit ]\n\nThe first season of Twin Peaks began airing during the 1989–90 United States network television schedule on April 8, 1990. It consists of eight episodes. The pilot opens with the discovery of the plastic-wrapped body of popular high school student Laura Palmer, an event which moves residents of the small town of Twin Peaks, Washington. Sheriff Harry S. Truman investigates Palmer's murder in conjunction with Dale Cooper, an eccentric FBI agent. As Cooper settles into his life in Twin Peaks, he meets the town's residents, who each prove bizarre and quirky in their respective ways. As the series progresses, the seemingly normal appearance of the town begins to fade, revealing various secrets that expose Twin Peaks as the disturbed, unsettling town that it is.\n\nSeason 2 (1990–91) [ edit ]\n\nBefore the season began, a companion book, The Secret Diary of Laura Palmer, was published. Some but not all of the diary entries mentioned during the season were in the book.[17]\n\nThe second season premiered on September 30, 1990, during the 1990–91 United States network television schedule. It consisted of 22 episodes. Lynch directed the first two, as well as the season's seventh episode (\"Lonely Souls\"), where Laura Palmer's killer is revealed. He also directed the season finale. In February 1991, Robert A. Iger, president of ABC Entertainment, announced plans to put Twin Peaks on hiatus;[18] By May, Iger said \"it's unlikely that Twin Peaks will return\".[19]\n\nThe season continues Cooper's investigation of Laura Palmer's murder. He receives some clues from a mysterious \"giant\" that appears to him in a dream. A new murder leads to the discovery of Laura Palmer's killer. Later, Cooper is suspended by the FBI due to his participation in an unauthorized raid on the One Eyed Jacks casino. Cooper's former partner, Windom Earle, escapes from a psychiatric hospital and comes to the town for a confrontation with Cooper. As the town prepares for its \"Miss Twin Peaks\" contest, Cooper tries to uncover the secret of the Black Lodge with help from Sheriff Truman.\n\nTwin Peaks: Fire Walk with Me (1992) [ edit ]\n\nTwin Peaks: Fire Walk with Me is a prequel to the TV series. It tells of the investigation into the murder of Teresa Banks and the last seven days in the life of Laura Palmer. Director David Lynch and most of the television cast returned for the film, with the notable exceptions of Lara Flynn Boyle, who declined to return as Laura's best friend Donna Hayward and was replaced by Moira Kelly, and Sherilyn Fenn due to scheduling conflicts. Also, Kyle MacLachlan returned reluctantly as he wanted to avoid typecasting, so his presence in the film is smaller than originally planned. Lynch originally shot about five hours of footage which was cut down to 134 minutes to allow the film to have a mainstream release. Many of the cut scenes were later released as Twin Peaks: The Missing Pieces in 2014. The film was a box office bomb upon release and was widely panned by critics, however, it has developed a cult following over time and has been critically reevaluated. The release of the third season in 2017, which made many references to the events of the film, led to renewed interest in the film.\n\nSeason 3: The Return (2017) [ edit ]\n\nThe third season[32] is a limited series set 25 years after the events of the season two finale. All episodes were written by David Lynch and Mark Frost.[7] The series was originally planned to have nine episodes, however, after re-negotiations between Lynch and Showtime, the episode order was doubled, with Lynch confirmed to direct all episodes.[33] The season premiered on May 21, 2017 and consists of 18 episodes identified only by number. Each episode (except the first, \"Part 1\" and the last, \"Part 18\") featured a different musical guest playing live at the Roadhouse as the end credits roll.\n\nEpisode titles [ edit ]\n\nFor the original series, creators David Lynch and Mark Frost assigned no episode titles, only episode numbers. When the series aired in Germany, titles were assigned, which were then translated to English. The episodes are untitled on the DVD sets, but the titled episodes appear on the official Twin Peaks CBS website and on Netflix when streaming the episodes.[50] Episode 2, known as \"Zen, or the Skill to Catch a Killer\" is also known as \"Zen and the Art of Killer-Catching\". When episodes 29 and 30 aired in Germany, they were aired as a single broadcast, with only episode 30 being assigned a title. Fans then decided to title episode 29 \"Miss Twin Peaks\", which is how the episode is titled both on the CBS website and on Netflix. However, when episode 29 was re-run in 1996, it was assigned an alternate title which translated to \"The Night of the Decision.\"[51][52]\n\nReferences [ edit ]\n\n^ The pilot was originally shown as a made-for-television film in Europe. a b Double-length episodes (approximately 90 minutes). a b Two episodes aired together as one in original broadcast. a b [35] Parts 3 and 4 were made available immediately after the premiere of parts 1 and 2 through Showtime's digital platform.", "images": ["https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/e/e6/Peaks2.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Cscr-featured.svg/20px-Cscr-featured.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/e/e6/Peaks2.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/List_of_Twin_Peaks_episodes", "title": "List of Twin Peaks episodes", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.11", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/e/e6/Peaks2.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}