{"url": "https://en.wikipedia.org/wiki/Young_Sheldon", "text": "No.\n\noverall No. in\n\nseason Title Directed by Written by Original air date Prod.\n\ncode U.S. viewers\n\n(millions)\n\nSheldon Cooper, a 9-year-old genius, begins his first day of high school in the ninth grade with his older brother, George \"Georgie\" Cooper Jr. Having shown more skills than a typical child his age, he skipped several grades. On his first day, he questions his teachers and informs students of their rule-breaking. He tries to find his place in the new school and Georgie must deal with having a much younger sibling in his class.\n\n2 2 \"Rockets, Communists, and the Dewey Decimal System\" Michael Zinberg Chuck Lorre & Steven Molaro November 2, 2017 ( ) T12.15552 12.66[13]\n\nSheldon learns that his mother is worried about his not having any friends. He therefore gets a copy of How to Win Friends and Influence People from the school library and tries its methods on various students and teachers without success. His sister Missy recommends that he try to make friends with other people who checked out the book, since they too are looking to make friends. That also fails. He eventually meets a Vietnamese American boy named Tam who sees him with the book and they share how difficult it has been for them to make friends. As they start speaking, they realize that they also share an interest in rocketry. Sheldon's mother is so happy that she insists Sheldon invite Tam over for dinner and lifts the ban on Sheldon's model rocketry hobby. The dinner turns awkward when Sheldon's parents exhibit cultural insensitivity as Tam tells them the story of his life. After dinner, the boys' launch attempt goes out of control just as FBI agents arrive to ask Sheldon why he was trying to buy uranium.\n\n3 3 \"Poker, Faith, and Eggs\" Michael Zinberg Story by : Damir Konjicija & Dario Konjicija\n\nTeleplay by : Chuck Lorre & Steven Molaro November 9, 2017 ( ) T12.15553 12.39[14]\n\nSheldon debates the relationship between religion and science with Pastor Jeff, while Billy Sparks brings some eggs for Missy. George suffers a mild heart attack, so Mary takes him to the hospital after calling Meemaw to watch the children. While she is sleeping, Georgie \"borrows\" her car and takes the other children to see their father. In the hospital chapel, Sheldon prays to Blaise Pascal for his father's recovery. When he does recover, Sheldon briefly doubts his atheism, but immediately gets over it after his family eats Billy's eggs and suffers from food poisoning. When Sheldon gets into another debate with Pastor Jeff, George pretends to have heart trouble in order to get his family out of the church service.\n\n4 4 \"A Therapist, a Comic Book, and a Breakfast Sausage\" Jaffar Mahmood Story by : Chuck Lorre & Steven Molaro\n\nTeleplay by : Rob Ulin & Dave Bickel November 16, 2017 ( ) T12.15554 11.83[15]\n\nSheldon chokes on a sausage and becomes fearful of solid foods. His parents take him to a psychiatrist, Dr. Goetsch, who talks to his parents first, telling Sheldon he can read any of the comic books that are in the waiting room. Although Sheldon had previously not been interested in comic books, he starts reading X-Men, which inspires him. He then leaves Dr. Goetsch's office and wanders away to a comic book store to read the next volume of X-Men. He runs into Tam, who is eating licorice at the store. Due to his fear of solid foods, Sheldon initially refuses the licorice that Tam offers him, but eventually gives in and eats one, resolving his eating disorder. Meanwhile, Meemaw babysits Georgie and Missy and comforts them on their feelings of being invisible because of Sheldon's quirks taking most of their parents' attention.\n\n5 5 \"A Solar Calculator, a Game Ball, and a Cheerleader's Bosom\" Chris Koch Story by : Chuck Lorre & Steven Molaro\n\nTeleplay by : Damir Konjicija & Dario Konjicija November 23, 2017 ( ) T12.15555 11.43[16]\n\nSheldon uses sports analytics to help his school's football team, coached by his father, win games, but immediately becomes too popular for his taste as a result. Georgie struggles with his father neglecting him in favor of spending time with Sheldon, while Missy and Tam revel in Sheldon's new popularity. Meanwhile, Meemaw also asks for his advice regarding her sports bets. Sheldon gets a B+ on a math test due to his exhaustion after accompanying Tam to a party and decides that he cannot keep helping the team and continue giving Meemaw advice. He tells on his family to Mary, which prompts her to reprimand them on their actions. George begins ignoring Sheldon again for being a \"snitch\" and reconciles with Georgie.\n\n6 6 \"A Patch, a Modem, and a Zantac®\" Don Scardino Story by : Chuck Lorre & Steven Molaro\n\nTeleplay by : Anthony Gioe & Nick Mandernach November 30, 2017 ( ) T12.15556 12.11[17]\n\nDr. Ronald Hodges, a NASA engineer, appears as a guest speaker in Sheldon's science class and does not take his idea about VTVL technology seriously, making Sheldon go to great lengths to prove him wrong. He tries to do the calculations himself, but he needs a computer to do so. When he realizes the family cannot afford one, he becomes frustrated, which causes him a stress ulcer. Sheldon takes the opportunity to use his doctor's computer and internet access to complete his calculations and send his results to NASA. When no reply comes, Sheldon gets depressed, prompting George to impulsively drive the family to the Johnson Space Center and demand that Hodges listen to Sheldon's idea. Hodges admits that it is theoretically valid, but that NASA lacks the technical capability to implement it at that time. Sheldon concludes that he is ahead of his time. On the way home, he thanks his father for standing up for him. A flashforward shows the successful SpaceX CRS-8 mission, followed by SpaceX founder Elon Musk looking over Sheldon's old notebook then hiding it in a desk drawer.\n\n7 7 \"A Brisket, Voodoo, and Cannonball Run\" Mark Cendrowski Story by : Nick Bakay\n\nTeleplay by : Chuck Lorre & Steven Molaro December 7, 2017 ( ) T12.15557 12.49[18]\n\nMeemaw's disdain for George emerges when she refuses to give him her brisket recipe. George later complains that Mary always takes her mother's side. To get back at George for secretly searching her home for it, Meemaw gives him a fake recipe which requires him to go to great lengths to get the ingredients. After George spends 14 hours cooking in vain, he attempts to ban her from the household. When Georgie and Missy fear their parents might divorce over this, Sheldon suddenly recalls a memory of Meemaw telling him her recipe when he was 23 months old, so he threatens to reveal it unless the two of them make up. While he initially shows his interest in the recipe, George states that he is more bothered by the fact that she never thought he was good enough for her daughter. He acknowledges that he was a disappointment when they first met, but he believes he has grown since then. Meemaw seemingly accepts him as a worthy son-in-law, only for George to get the recipe from Sheldon as soon as she leaves.\n\n8 8 \"Cape Canaveral, Schrödinger's Cat, and Cyndi Lauper's Hair\" Howie Deutch Story by : Chuck Lorre & Steven Molaro\n\nTeleplay by : David Bickel December 14, 2017 ( ) T12.15558 11.64[19]\n\nGeorge takes the boys to Florida to see a Space Shuttle launch as a way to cater to Sheldon's interests for a change, but it gets rained out. To cheer him up, George plays dumb and asks Sheldon how lightning and thunder work, leading the latter to appreciate the former more. Meanwhile, Mary, Missy, and Meemaw go to a beauty salon. Mary and Meemaw get into a heated argument after the latter comments on the former for being \"no fun\" for forbidding Missy to dye her hair, but both later make amends with one another.\n\n9 9 \"Spock, Kirk, and Testicular Hernia\" Peter Lauer Chuck Lorre & Steven Molaro December 21, 2017 ( ) T12.15559 11.32[20]\n\nSheldon tutors Georgie for their math test, only to discover that the latter cheated to pass. Since Star Trek character Captain Kirk also got away with cheating on the Kobayashi Maru test, Sheldon decides to adapt the \"playing fast-and-loose with the rules\" lifestyle he believes both Georgie and Kirk embrace by forging Mary's signature on a note excusing him from P.E. class and not properly checking out school library books. He eventually gets caught after Coach Wilkins shows George the note, prompting Mary to tell off Sheldon and force him to make amends by returning the books and going back to P.E., where Coach Wilkins makes him do the rope climb.\n\n10 10 \"An Eagle Feather, a String Bean, and an Eskimo\" Rebecca Asher Story by : Chuck Lorre & Steven Molaro\n\nTeleplay by : Rob Ulin & David Bickel January 4, 2018 ( ) T12.15560 14.70[21]\n\nSheldon's principal asks Mary and George to consider sending Sheldon to a school for the gifted in Dallas. Sheldon and his teachers are delighted by the idea, but his family (except for Georgie) quickly begins to miss him. Sheldon enjoys the intellectual stimulation, but dislikes the folk rock-singing family that he lives with. When George impulsively drives to Dallas to bring him home, Sheldon is happy to go back home.\n\n11 11 \"Demons, Sunday School, and Prime Numbers\" Howie Deutch Story by : Chuck Lorre & Steven Molaro\n\nTeleplay by : Chuck Lorre & Steven Molaro & Eric Kaplan January 11, 2018 ( ) T12.15561 14.17[22]\n\nMary becomes worried when she finds Sheldon playing Dungeons & Dragons with Tam and Billy. She tries to get Tam's and Billy's parents' help to try to put an end to the game, but they see it as harmless. Mary then seeks advice from Pastor Jeff who, with Mary, convinces Sheldon to study Baptist theology. Sheldon, however, takes it a step further and starts researching all of the major religions, quizzing Tam on what being a Catholic involves and Ira Rosenbloom on being Jewish. He is ultimately unsatisfied with all of the major religions. One night, he has a dream about two living numbers, a 1 and a 0, who almost reveal the secrets of the universe to him before Georgie wakes him up. He then decides to start his own religion which he calls \"Mathology\" and in which the only sin is being stupid.\n\n12 12 \"A Computer, a Plastic Pony, and a Case of Beer\" Richie Keen Story by : Chuck Lorre & Steven Molaro\n\nTeleplay by : Chuck Lorre & Steven Molaro & Tara Hernandez January 18, 2018 ( ) T12.15562 13.33[23]\n\nSheldon asks Mary to buy him a Tandy 1000 SL computer. George insists that they cannot afford it, but Mary reveals that she has been secretly saving money. They get into a heated argument about the secret fund, which prompts Mary to take Sheldon and Missy to live with Meemaw for a while. She buys Sheldon the computer to make a point to George and, while Sheldon is initially overjoyed, he finds that its ELIZA psychotherapy program's advice on how to fix his parents' marriage proves to be useless. Meemaw eavesdrops on Sheldon and forces Mary to feel out George to get her out of her house. Meanwhile, Georgie advises George to apologize to Mary, which the latter eventually does. In the ensuing days, the family finds various uses for the computer.\n\n13 13 \"A Sneeze, Detention, and Sissy Spacek\" Howie Deutch Story by : Chuck Lorre & Steven Molaro\n\nTeleplay by : Eric Kaplan & Jeremy Howe February 1, 2018 ( ) T12.15563 12.92[24]\n\nSheldon's mysophobia surfaces when influenza hits his school. He is successively sentenced to detention and suspension for leaving his class and the school after his teacher got a cold, escaping from other people who had the flu, and escaping from detention after the other teacher had a tickle in his throat. He then uses his suspension time in an attempt to convert the garage into a closed ecological system instead of doing extra chores for the entire week of suspension. While George, Missy, and Meemaw are mostly amused by his behavior, Mary is the only member of the family to be really worried about it. Meanwhile, Georgie takes advantage of Sheldon's situation to gain sympathetic hugs from girls at school. With numerous attempts to get him out of the garage proving to be futile, Meemaw finally coaxes Sheldon out by appealing to his pride as a Texan. Nevertheless, he gets sick, but feels better when his mother sings \"Soft Kitty\" to him.\n\n14 14 \"Potato Salad, a Broomstick, and Dad's Whiskey\" Howie Deutch Chuck Lorre & Steven Molaro & Tara Hernandez March 1, 2018 ( ) T12.15564 12.42[25]\n\nMary gets a job as church secretary, but Pastor Jeff quickly begins asking her for advice, since his beautiful new wife does not speak English and is spending all his money. Since Mary does not get home until 6 pm, and Meemaw refuses to watch them until then, Missy and Sheldon become latchkey kids. When Meemaw peeks in on the twins, they think that she is a burglar and spray her with a fire extinguisher. When Sheldon gets a splinter in his finger, Missy searches all over the house for tweezers with which to extract it. She eventually finds them in an Operation game and successfully removes the splinter.\n\n15 15 \"Dolomite, Apple Slices, and a Mystery Woman\" Mark Cendrowski Story by : Chuck Lorre & Steven Molaro\n\nTeleplay by : Chuck Lorre & Steven Molaro & Tara Hernandez March 8, 2018 ( ) T12.15565 12.52[26]\n\nSheldon and Tam befriend Libby, an 11th-grade girl with an interest in geology. During one of their lunches at the library, Libby offers to drive the three of them to the Houston Museum of Natural Science to see an IMAX film. However, Sheldon is devastated to learn that Libby thinks of him as a child during her talk with Mary. While Sheldon resolves never to make any more friends, Mary assures him that he will be surrounded by a lot of them who are also smart. Tam and Libby end up going to Houston without Sheldon to see the film, where Tam's advances are rejected by Libby. Sheldon and Tam later revert to a two-man social group, where Sheldon reconsiders geology as \"not a science\" to the point where he considers it as more of a hobby.\n\n16 16 \"Killer Asteroids, Oklahoma, and a Frizzy Hair Machine\" Howie Deutch Story by : Chuck Lorre & Steven Molaro\n\nTeleplay by : Steven Molaro March 29, 2018 ( ) T12.15566 11.91[27]\n\nAt the school science fair, Sheldon is devastated when his asteroid impact avoidance project loses to another student's Van de Graaf generator, and vows to quit science. After a therapy session with Dr. Goetsch, Sheldon decides to become an actor. In an acting class, he impresses the drama teacher, Mr. Lundy, and gets the lead role in Annie. His parents worry about him playing a female role, but Sheldon dismisses their concerns until he experiences stage fright on opening night and refuses to perform, leaving Mr. Lundy to take over his role.\n\n17 17 \"Jiu-Jitsu, Bubble Wrap, and Yoo-Hoo\" Jaffar Mahmood Story by : Chuck Lorre & Steven Molaro\n\nTeleplay by : Tara Hernandez & Jeremy Howe April 5, 2018 ( ) T12.15567 11.66[28]\n\nSheldon is being bullied by Bobbi Sparks, the six-year-old neighbor girl. His parents have different ideas about how to handle the situation, neither of which is effective. In the end, George and Bobbi's dad hang out and plan to tell their wives the made-up story of them being involved in a deadly fight. Sheldon even tries paying Missy to warn Bobbi off using his life savings, but that plan eventually fails.\n\n18 18 \"A Mother, A Child, and a Blue Man's Backside\" Jaffar Mahmood Story by : Chuck Lorre & Steven Molaro & Teagan Wall\n\nTeleplay by : David Bickel & Damir Konjicija & Dario Konjicija April 12, 2018 ( ) T12.15568 11.70[29]\n\nAfter Mary confiscates Sheldon's comic books, due to the rather explicit content in an issue of Watchmen, Sheldon demands to be treated like an adult and fails his every attempt to live like one, but a tornado warning reminds Sheldon of family values.\n\n19 19 \"Gluons, Guacamole, and the Color Purple\" Alex Reid Chuck Lorre & Steven Molaro & Tara Hernandez April 19, 2018 ( ) T12.15569 11.67[30]\n\nMeemaw drives Sheldon to a nearby college so that he can audit a weekly class on quantum chromodynamics. The professor, Dr. John Sturgis, asks Meemaw out on a date. She has a nice time, but finds that he is like an older version of Sheldon. The following week, she has to leave the class because her presence is too distracting for Sturgis. Meanwhile, Missy gets Georgie to help her with her homework. Stimulated by Sheldon's example, they actually make some progress.\n\n20 20 \"A Dog, A Squirrel, and a Fish Named Fish\" Jaffar Mahmood Story by : Damir Konjicija & Dario Konjicija & Teagan Wall\n\nTeleplay by : Chuck Lorre & Steven Molaro & David Bickel April 26, 2018 ( ) T12.15570 11.15[31]\n\nSheldon's cynophobia surfaces when the Sparks family begins taking care of a relative's dog, which shows a strange attraction to Sheldon. The families are unable to agree about how to control the dog until Pastor Jeff mediates. Sheldon tries to overcome his fear by dressing in protective clothing and petting the dog, but this backfires when the dog licks him, apparently stimulated by the smell of his Brylcreem. Meemaw tries to get Sheldon accustomed to animals by buying him a fish, but the fish bites both him and George.\n\n21 21 \"Summer Sausage, a Pocket Poncho, and Tony Danza\" Alex Reid Story by : Steven Molaro & Eric Kaplan & Stacey Pulwer\n\nTeleplay by : Chuck Lorre & Tara Hernandez & Connor Kilpatrick May 3, 2018 ( ) T12.15571 11.67[32]\n\nSheldon invites John to dinner without telling anyone. The next evening, John comes to Meemaw's house to cook her some Sichuan cuisine, after which she invites him to stay for the night. Sheldon monitors the event through binoculars. George takes Missy, who is dressed as a princess, to dinner at Red Lobster. That leaves Mary and Georgie to have dinner together, where he quizzes her about the chronology of his conception.\n\n22 22 \"Vanilla Ice Cream, Gentleman Callers, and a Dinette Set\" Jaffar Mahmood Story by : Jeremy Howe & Damir Konjicija & Dario Konjicija\n\nTeleplay by : Chuck Lorre & Steven Molaro & Eric Kaplan May 10, 2018 ( ) T12.15572 12.44[33]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/6/68/Young_Sheldon_title_card.png/250px-Young_Sheldon_title_card.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/6/68/Young_Sheldon_title_card.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1"], "top_img": "https://upload.wikimedia.org/wikipedia/en/6/68/Young_Sheldon_title_card.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Young_Sheldon", "title": "Young Sheldon", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.13", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/6/68/Young_Sheldon_title_card.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}