{"url": "http://toofab.com/2018/07/09/nikki-bella-total-bellas-john-cena-lonely-wedding-planning-boots-bridesmaids/", "text": "Wedding planning was not as much fun as Nikki Bella expected on Sunday's \"Total Bellas.\"\n\nThroughout the episode, the WWE star had to make many big wedding decisions by herself since John Cena's schedule is so packed. That means Nikki decided on invitations, location details and bridesmaids without consulting her partner. All of that responsibility falling on her shoulders made her feeling overwhelmed and alone.\n\n\"I thought like wedding planning was going to be a lot more fun and like I just thought it was going to be different,\" Nikki said at one point. \"I've felt like really alone like in all of this, you know, because John doesn't have time to wedding plan.\"\n\n\"It's so tough making these decisions on my own because like what will John like?\" Nikki said at another point in the episode. \"I don't want him to be disappointed, and I want him to love this wedding just as much as I'm going to, so I kinda get nervous making these decisions because we called the wedding off. And since we want to keep our same date, we lost a lot of time.\"\n\nNikki first traveled to Napa with her sister Brie Bella to work on finalizing their location. However, the last time Nikki was there, was when John had called off the wedding.\n\n\"It's so weird to think, the last time I was in Napa, it was probably the most emotional day of my life,\" Nikki recalled in a confessional. \"But I love that what happened before, didn't ruin our moment now.\"\n\nWith John out of the picture, Brie had to play the part of the \"husband\" holding Nikki together.\n\n\"It's hard to watch Nicole wedding plan because she's doing it all on her own,\" Brie said in a confessional. \"I was really lucky because Bryan was really involved with our wedding planning and that made it a lot of fun, and so it makes me feel bad because John's so busy. He's filming 10,000 movies, he's wrestling, he's doing media, so it just sucks because there's nothing better than being with the man you love and planning your very special day.\"\n\nYes To The Dress\n\nThe sisters traveled to New York City to find Nikki's wedding dress. Although most of the wedding planning proved to be stressful, when it came to finding her perfect gown, Nikki knew exactly what she wanted.\n\n\"I can always be sexy or revealing, but I want to be classic that one day,\" she told her wedding planner and designer. \"I want to have just this gorgeous white dress that you know you know you can never wear to an event again.\"\n\nThe first two dresses were stunning, but not \"the one,\" and then the third try was the charm.\n\n\"Oh my gosh, I just got goosebumps,\" Brie said as she watched her sister step out of the fitting room in the gown. \"It's stunning. I feel like this is exactly what you've been looking for.\"\n\n\"I love this,\" Nikki gushed while admiring herself in the mirror. \"I feel like a Barbie! I think this is it. Yes!\"\n\nWith all the wedding drama, Brie reveled in seeing Nikki with a smile on her face.\n\n\"You always know when a bride finds her dress, because when they walk out and it's like this big smile and they feel like a queen,\" Brie said. \"You're just like, 'That's it, that's the smile I've been looking for lately.' And I just feel like now we've just made a turn, things are going to start feeling really special, like, 'Hey, I'm getting married.'\n\nBye Bye Bridesmaids\n\nNikki originally had 10 friends lined up to be bridesmaids, but the problem -- as Brie explained -- is that those girlfriends are pretty much the only girls coming to the wedding, so Nikki had an awkward decision to make.\n\n\"I wish I could have them all as bridesmaids, but it's just not gonna work out for my wedding,\" Nikki said.\n\nThe reality star met friends Shawna and Katy for dinner to break the news that she decided on two maids of honor instead of 10 bridesmaids. While the girls complimented Nikki for being so \"mature\" through the ups and downs of her engagement to John, they weren't thrilled that she led them on.\n\n\"In the beginning, I kind of only wanted a few,\" Nikki said. \"But then that's when I started to add more because I felt like okay, I only had like you two and Jamie--\"\n\n\"But why didn't you just stop there?\" Shawna cut her off. \"I feel like that's where you need to learn, because you kind of do that a lot.\"\n\n\"You're right, I should of just stopped where I wanted and not of cared what other people felt,\" Nikki responded.\n\nUltimately her friends respected Nikki's decision.\n\n\"Total Bellas\" airs Sunday nights at 9/8c on E!\n\nView Photos Getty", "images": ["http://secure-us.imrworldwide.com/cgi-bin/m?ci=us-404979h&cg=0&cc=1&ts=noscript", "https://assets.toofab.com/toofab.com/main/default/img/skeleton.svg", "http://warnerbros.112.2o7.net/b/ss/wbrostoofab/1/JS-1.5.1--NS/s1563041258?AQB=1&ce=UTF-8&ns=warnerbros&pageName=articles%3Aarticle%3A%3Atotal-bellas-reveals-nikki-bellas-lonely-wedding-planning-without-john-cena&c1=Toofab.us&v1=Toofab.us&c2=article&v2=article&c3=articles&v3=articles&events=event6&AQE=1", "https://toofab.akamaized.net/2018/12/19/newsletter-logo-v2-1.png", "https://ssl-cdn-media.tmz.com/2013/04/26/partner-rss-fox-b-w.png", "https://toofab.akamaized.net/2018/07/09/nikki-bella-total-bellas-main-e-1200x630.jpg", "https://ssl-cdn-media.tmz.com/2013/04/26/partner-rss-thestir-logo-cut-v2-1.png", "https://toofab.akamaized.net/2019/04/06/cdl-260x30-for-tmz3-1.png", "https://ll-media.tmz.com/2013/04/26/partner-rsss-justjared-logo-cut-v2.gif", "https://ssl-cdn-assets.tmz.com/www.tmz.com/main/default/cache/images/feedlogo2.v2014_05_09_134122.gif", "https://toofab.akamaized.net/2017/05/24/tmz-tour-300x250-r01-1.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=3000013&cv=2.0&cj=1", "https://toofab.akamaized.net/2019/04/06/elite-daily-logo-1.png", "https://assets.toofab.com/toofab.com/main/default/img/toofab-logo-white.svg"], "top_img": "https://toofab.akamaized.net/2018/07/09/nikki-bella-total-bellas-main-e-1200x630.jpg", "keywords": [], "authors": ["Toofab Staff"], "canonical_link": "https://toofab.com/2018/07/09/nikki-bella-total-bellas-john-cena-lonely-wedding-planning-boots-bridesmaids/", "title": "Nikki Bella Reveals Lonely Wedding Planning Without John Cena and Boots Bridesmaids on 'Total Bellas'", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "twitter": {"toofab": 116547240, "card": "summary_large_image", "site": "@toofab", "title": "Nikki Bella Reveals Lonely Wedding Planning Without John Cena and Boots Bridesmaids on 'Total Bellas'", "description": "Nikki Bella also decides to boot her bridesmaids on \"Total Bellas\" while John Cena is busy making movies.", "image": "https://toofab.akamaized.net/2018/07/09/nikki-bella-total-bellas-main-e-1200x630.jpg"}, "verify-v1": "Wtpd0N6FufoE2XqopQJoTjWV6Co/Mny9BTaswPJbPPA=", "msvalidate.01": "AFEB17971BCF30779AEA662782EF26F4", "y_key": "14cb04e4656b0c58", "description": "Nikki Bella also decides to boot her bridesmaids on \"Total Bellas\" while John Cena is busy making movies.", "robots": "index,follow", "referrer": "unsafe-url", "og": {"url": "https://toofab.com/2018/07/09/nikki-bella-total-bellas-john-cena-lonely-wedding-planning-boots-bridesmaids/", "site_name": "toofab", "type": "article", "title": "Nikki Bella Reveals Lonely Wedding Planning Without John Cena and Boots Bridesmaids on 'Total Bellas'", "description": "Nikki Bella also decides to boot her bridesmaids on \"Total Bellas\" while John Cena is busy making movies.", "image": "https://toofab.akamaized.net/2018/07/09/nikki-bella-total-bellas-main-e-480x360.jpg"}, "fb": {"app_id": 116046798441464, "pages": 324392354652}, "article": {"publisher": "https://www.facebook.com/TooFab"}}, "movies": [], "publish_date": 1531108800.0, "source": "http://toofab.com", "summary": ""}