{"url": "https://www.sunglasswarehouse.com/blog/how-to-remove-scratches-from-sunglasses/", "text": "It’s happened to all of us. You’re outside enjoying whatever adventure you might be on in your favorite pair of sunglasses when you drop your shades and they land on the ground lens-first. You pick them up and are devastated to see a scratch on the lens right in your line of sight. Don’t panic!\n\nThe good news is that there are tips and tricks you can use to minimize the look of the scratch, fill it in, or polish it over so that you’ll be back to sporting those shades in no time. Here are some handy methods to try to get your sunglasses back to tip-top shape*.\n\nPro Tip: Don’t forget to use a lint-free cleaning cloth with each of these methods to avoid additional scratches.\n\nDon’t have time to shine up your favorite shades? No worries. We’ve made things easy for you:\n\nShop Women’s Shades › Shop Men’s Shades ›\n\nMethod 1: Brass or Silver Polish\n\nDab a bit of brass or silver polish on the lenses with a cotton ball and gently rub it around. If there is any excess polish, remove it with a clean, lint-free cloth Repeat the process until the scratch has disappeared.\n\nMethod 2: Toothpaste\n\nImportant: You’ll want to make sure your toothpaste is non-abrasive, non-minty, non-gel, and non-whitening. Your teeth appreciate all those good things, but your lenses sure won’t! Best to stick with a regular paste instead.\n\nWith a cotton ball, rub the paste into the scratch in a circular motion. Give your lenses a nice massage for about 10 seconds. Rinse the toothpaste off with cool water. If there is any excess, get out a lint-free cloth and wipe it off. Repeat if necessary, until the scratch is no more.\n\nMethod 3: Baking Soda\n\nMix one (1) part water and two (2) parts baking soda in a small bowl until you have a thick paste. Rub the baking soda paste into the scratch for 10 seconds, using a cotton ball and a circular motion. Rinse the paste off with cool water. You’ll probably have some excess, so wipe it off with a lint-free cloth . Repeat if necessary.\n\nMethod 4: Vehicle Wax\n\nApply the way you’d apply wax to your car: with a soft cloth and circular motions. Wipe away any excess with another lint-free cloth. You may need to use multiple cloths, as wax adheres to fabric easily. Repeat as necessary.\n\nMethod 5: Furniture Spray\n\nLike car polish, the wax in furniture spray fills in the scratches. The only problem with this method is that the fix may only last a few days at a time.\n\nSpray your lenses lightly. Don’t get crazy! Break out that lint-free cloth and rub the furniture spray around in a circular motion until the scratch and spray disappear. Repeat as necessary, possibly every few days.\n\nAnother easy way to sport some scratch-free shades? Snag some new sunglasses:\n\nShop Sunglass Warehouse ›\n\n*We recommend trying each method on a small portion of the lens before applying to the whole lens. And if your shades are expensive or near and dear to your heart, we recommend taking them to a professional to attempt to fix them. Sunglass Warehouse is not responsible for any lens damage as a result of these methods.", "images": ["https://www.sunglasswarehouse.com/blog/wp-content/uploads/2011/03/SW-HowToScratches-Feature.jpg", "https://www.sunglasswarehouse.com/blog/wp-content/uploads/2011/03/SW-HowToScratches-InPost.jpg", "https://www.sunglasswarehouse.com/blog/wp-content/uploads/2017/10/SW-Blog-Header-Logo-01.svg", "https://www.sunglasswarehouse.com/blog/wp-content/uploads/2017/10/sw-blog-logo-1.svg"], "top_img": "https://www.sunglasswarehouse.com/blog/wp-content/uploads/2011/03/SW-HowToScratches-Feature.jpg", "keywords": [], "authors": [], "canonical_link": "//www.sunglasswarehouse.com/blog/how-to-remove-scratches-from-sunglasses/", "title": "How to Remove Scratches from Sunglasses", "meta_data": {"viewport": "width=device-width", "version": "1.2", "description": "Scratched sunglasses? No problem! There are a variety of fixes you can find around your house, from baking soda to toothpaste. Try these simple solutions!", "robots": "noodp", "keywords": "remove scratches from sunglasses, glasses scratch remover, glass scratch remover", "og": {"locale": "en_US", "type": "article", "title": "How to Remove Scratches from Sunglasses | Sunglass Warehouse", "description": "Scratched sunglasses? No problem! There are a variety of fixes you can find around your house, from baking soda to toothpaste. Try these simple solutions!", "url": "//www.sunglasswarehouse.com/blog/how-to-remove-scratches-from-sunglasses/", "site_name": "Sunglass Warehouse Blog", "image": {"identifier": "//www.sunglasswarehouse.com/blog/wp-content/uploads/2011/03/SW-HowToScratches-Feature.jpg", "width": 750, "height": 451}}, "article": {"publisher": "//www.facebook.com/SunglassWarehouse"}, "twitter": {"card": "summary", "description": "Scratched sunglasses? No problem! There are a variety of fixes you can find around your house, from baking soda to toothpaste. Try these simple solutions!", "title": "How to Remove Scratches from Sunglasses | Sunglass Warehouse", "site": "@sunglasswarehse", "image": "//www.sunglasswarehouse.com/blog/wp-content/uploads/2011/03/SW-HowToScratches-Feature.jpg", "creator": "@sunglasswarehse"}, "generator": "WordPress 4.8.3", "msapplication-TileImage": "//www.sunglasswarehouse.com/blog/wp-content/uploads/2017/11/cropped-SW-Logo-600x600-02-270x270.jpg"}, "movies": [], "publish_date": null, "source": "https://www.sunglasswarehouse.com", "summary": ""}