{"url": "https://people.com/style/reese-witherspoon-wsj-innovator-awards-speech-2017/", "text": "Image zoom Reese Witherspoon at the 2017 WSJ Magazine Innovator Awards. Andrew Toth/Getty\n\nReese Witherspoon is on a mission to empower women within Hollywood — and outside of it. The actress delivered a emotional call to action during her acceptance speech at WSJ. Magazine’s 2017 Innovator Awards, referencing the ongoing battle of sexism and sexual harassment that exists in the industry, which is now at the forefront of conversation in light of the Harvey Weinstein scandal.\n\n“I don’t know if you guys heard but there has been a lot of stuff going on in Hollywood,” she said while on stage to accept her Entertainment Innovator of the Year Award at the Museum of Modern Art in New York City. “We’ve been dealing with some really ugly truth of sexism and sexual harassment, and it has been rampant for far longer than I have been an actress, and it’s brought back a lot of painful memories for people. It’s been a real time of reckoning for us and there is a definitely a growing realization that we need to take the time to really examine the biases that exist in our industry and make much needed change because this is not an issue about actors and actresses, this is a bigger issue about power.”\n\nShe continued: “I think we have to turn a critical eye about female leadership in Hollywood and whether that’s encouraged or even allowed because you cant have accountability or awareness of different perspectives if women are not at the decision making table.”\n\nWitherspoon, who wore a black embellished Giorgio Armani dress with gathered sleeves and beading on the bodice, was welcomed to the stage by designer and activist Diane von Furstenberg who praised the actress for feeling “the power of strong female characters in her bones.”\n\nImage zoom Reese Witherspoon and Diane von Furstenberg on stage at the 2017 WSJ Magazine Innovator Awards. Andrew Toth/Getty\n\n“Reese was able to craft this incredible round of successes because she understands story telling,” von Furstenberg shared. “As an actress and reader of almost prophetic insight, she’s given us some of the most memorable female characters of the past three decades. And as a mother with her sight set on the future, she is well on her way to leaving Hollywood a much richer place than she found it. For that we respect her, admire her, and love her.”\n\nWitherspoon delivered her inspired speech in front of a room full of innovators, including fellow honorees Mark Bradford (Art), Stephen Alesch and Robin Standefer of Roman and Williams (Design), Raf Simons (Fashion), Ryan Heffington (Performing Arts) and Alex Hofmann, Luyu Yang and Alex Zhu of musical.ly (Technology). Her 18-year-old daughter, Ava Phillippe, watched as her mom spoke to the crowd in a passionate 9-minute address.\n\nImage zoom Reese Witherspoon and Ava Phillippe at the 2017 WSJ Magazine Innovator Awards. Craig Barritt/Getty\n\nThe exclusion of women at the top has led to a lack of female-driven roles, according to Witherspoon, which she said motivated her to start looking at books to adapt into films. She also launched a new production company, Hello Sunshine, which produced the eight-time Emmy winning series Big Little Lies as well as the films Gone Girl and Wild.\n\n“I wanted to be in more projects where I wasn’t just playing the wife or the girlfriend of some famous dude,” she shared. “I know that movies are very powerful. I witnessed that first hand with women who I’m so humbled by, they come up to me on the street and say I went to law school because of Legally Blonde. I mean really, I’m not kidding. Once I was on a panel with Sandra Day O’Connor and they kept coming up to me and thanking me and I said ‘I’m not the lawyer, this is the Supreme Court Justice—it doesn’t make any sense.’ People will tell me they watch Sweet Home Alabama once a year with their family or they say they watch Wild and it made them want to go on adventure that changed their life or healed their heart. Movies can change you.”\n\nRELATED PHOTOS: Reese Witherspoon and Daughter Ava Just Made Us Do a Double-Take — See the Other Times She’s Twinned with Her Kids\n\nImage zoom Reese Witherspoon and Ava Phillippe at the 2017 WSJ Magazine Innovator Awards. Taylor Hill/WireImage\n\nWitherspoon’s said her goal is to portray more relatable female characters and expand the scope of roles available to women.\n\n“I don’t really believe that we’ve been seeing the full spectrum of the female experience and that is simply because women’s stories are not prioritized,” she said. “I also just think we need to think about women differently because women are the largest captured consumer audience in the world.”\n\nThe star adds that her company Hello Sunshine is “not just about making films and television, it’s also about reaching women where they are, multi-platform and digital and mobile and I’m not talking about mommy blogs and 14 ways to cook a turkey. Women want real substance and premium thought-provoking, well-made content and they want it now. Women wan to be entertained where they are, running errands, going to the doctor, on their mobile phones, their laptops. We need to stop expecting them to come to us and we need to go to them because they wanna see themselves on screen and that’s the most important thing.”\n\nImage zoom Reese Witherspoon delivers a speech on stage at the 2017 WSJ Magazine Innovator Awards. Craig Barritt/Getty\n\nShe also calls for a more inclusive and diverse approach to casting.\n\n“Women want to see every age of a woman on screen, they want to see every ethnicity of woman on screen, they want to see every size and every shape, and quite frankly we just cant see the same films from the same group of people over and over again and expect society to change, and that’s why I wake up every day so impassioned to give more women opportunities to get their stories told.”\n\n“I’ve had an incredible career as an actress and it’s my first love, I love being an actor but now it’s become abundantly clear to me that I have a new mission and that’s to do more for others in my industry,” she concluded. “I’m determined to create more opportunity for other women and people of color. To help them tell their stories. To encourage to CEOs to take changes on high-level female executives and champion new female voices on film because the stories we tell have to got change. And sometimes change is about something small, sometimes change starts in a room like this with people like all of you. Thank you so much.”\n\nWhat do you think of Witherspoon’s powerful speech? Share below!", "images": ["https://peopledotcom.files.wordpress.com/2019/07/justin-bieber-bottle-cap-challenge.jpg?crop=0px%2C1076px%2C2700px%2C1418px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2017/10/reese-witherspoon11.jpg?crop=0px%2C0px%2C1600px%2C840px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2019/07/olivia-holt.jpg", "https://peopledotcom.files.wordpress.com/2019/05/channing-tatum-jessie-j-3.jpg?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2017/11/reese-witherspoon1.jpg", "https://peopledotcom.files.wordpress.com/2019/05/reese-4.jpg?crop=0px%2C0px%2C1200px%2C630px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2019/07/emily.jpg?crop=0px%2C0px%2C1280px%2C672px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2019/07/shay-mitchell-8-2000.jpg?crop=0px%2C29px%2C2000px%2C1051px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2017/10/reese-witherspoon11.jpg", "https://peopledotcom.files.wordpress.com/2017/11/reese-witherspoon-2.jpg", "https://peopledotcom.files.wordpress.com/2019/06/split-3.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2018/10/zoe.jpg?crop=0px%2C0px%2C1600px%2C840px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2018/07/john-krasinski-and-emily-blunt.jpg?crop=0px%2C271px%2C1080px%2C567px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2018/02/michael-b-jordan-11.jpg?crop=0px%2C127px%2C2471px%2C1297px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2019/07/mehgan-split.jpg", "https://peopledotcom.files.wordpress.com/2019/07/gettyimages-50720196.jpg?crop=3px%2C174px%2C1800px%2C946px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2017/11/reese-witherspoon-3.jpg", "https://peopledotcom.files.wordpress.com/2019/04/jessica-alba-cash-warren-paris-vacation.jpg?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2019/03/john-delaney.jpg?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2019/07/david-foster-katharine-mcphee-2.jpg?crop=5px%2C329px%2C2623px%2C1376px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2019/07/lil-nas-x.jpg?crop=0px%2C237px%2C1800px%2C946px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2019/02/allbirds-tout-2.jpg?crop=0px%2C0px%2C1024px%2C537.6px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2018/01/gettyimages-902602814.jpg?crop=0px%2C0px%2C2100px%2C1102.5px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2019/04/couple-1.jpg?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2019/05/reese-3.jpg", "https://peopledotcom.files.wordpress.com/2019/07/rachel-lin-hannah.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2019/04/kelly-clarkson-6.jpg?crop=0px%2C164px%2C1660px%2C871px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2019/07/64821275_2776489942378427_1058275460245839514_n.jpg?crop=0px%2C0px%2C1800px%2C945px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2019/05/jada-pinkett-smith-1-2000-e1561486767943.jpg?crop=0px%2C100px%2C1245px%2C654px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2017/11/reese-witherspoon-1.jpg", "https://peopledotcom.files.wordpress.com/2019/04/screen-shot-2019-04-25-at-8.41.31-am.png?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2018/04/mickey-pretzels-1-2000.jpg?&fit=250%2C250"], "top_img": "https://peopledotcom.files.wordpress.com/2017/10/reese-witherspoon11.jpg?crop=0px%2C0px%2C1600px%2C840px&resize=1200%2C630", "keywords": [], "authors": ["Brittany Talarico"], "canonical_link": "https://people.com/style/reese-witherspoon-wsj-innovator-awards-speech-2017/", "title": "Reese Witherspoon Addresses 'Ugly Truth' About Harassment in Hollywood During Powerful Speech", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "reese witherspoon, reese witherspoon style, reese witherspoon WSJ magazine innovator awards, 2017 WSJ magazine Innovator awards, reese witherspoon hello sunshine, reese witherspoon harassment in hollywood, reese witherspoon and daughter ava phillippe, how old is ava phillippe", "news_keywords": "reese witherspoon, reese witherspoon style, reese witherspoon WSJ magazine innovator awards, 2017 WSJ magazine Innovator awards, reese witherspoon hello sunshine, reese witherspoon harassment in hollywood, reese witherspoon and daughter ava phillippe, how old is ava phillippe", "description": "Reese Witherspoon attended the WSJ. Magazine Innovator awards with her daughter Ava Phillippe and delivered an emotional speech about sexism in Hollywood", "og": {"title": "Reese Witherspoon Addresses 'Ugly Truth' About Harassment in Hollywood During Powerful Speech", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/style/reese-witherspoon-wsj-innovator-awards-speech-2017/", "description": "Reese Witherspoon attended the WSJ. Magazine Innovator awards with her daughter Ava Phillippe and delivered an emotional speech about sexism in Hollywood", "image": {"identifier": "https://peopledotcom.files.wordpress.com/2017/10/reese-witherspoon11.jpg?crop=0px%2C0px%2C1600px%2C840px&resize=1200%2C630", "width": 1200, "height": 630}}, "pinterest": {"url": "https://people.com/style/reese-witherspoon-wsj-innovator-awards-speech-2017/", "description": "Reese Witherspoon attended the WSJ. Magazine Innovator awards with her daughter Ava Phillippe and delivered an emotional speech about sexism in Hollywood", "media": "https://peopledotcom.files.wordpress.com/2017/10/reese-witherspoon11.jpg?crop=0px%2C0px%2C1600px%2C840px&resize=1200%2C630"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/style/reese-witherspoon-wsj-innovator-awards-speech-2017/", "title": "Reese Witherspoon Addresses 'Ugly Truth' About Harassment in Hollywood During Powerful Speech", "description": "Reese Witherspoon attended the WSJ. Magazine Innovator awards with her daughter Ava Phillippe and delivered an emotional speech about sexism in Hollywood", "site": "@people", "image": "https://peopledotcom.files.wordpress.com/2017/10/reese-witherspoon11.jpg?crop=0px%2C0px%2C1600px%2C840px&resize=1200%2C630"}, "fb": {"pages": 95926963131}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}