{"url": "https://www.wmagazine.com/story/kardashian-family-feud-recap-kim-kanye-west", "text": "Well before Kanye West and his antics interrupted the nonstop micro-news cycle on new moms Kylie Jenner and Khloé Kardashian, news broke that he and Kim Kardashian would be competing against Khloé, plus Kris and Kendall Jenner in the latest season of Celebrity Family Feud , which premiered on ABC on Sunday night. Clearly taped months ago—Khloé can be seen with her baby bump , and Kylie is nowhere in sight—TV's favorite family played by their own rules and put timeliness aside.\n\nEach pairing was of course accompanied by the show's host, Steve Harvey, as well as some backup. Also on the Jenner team was none other than Kris's mom and Kendall's grandma, Mary Jo Campbell, plus family friends Jonathan Cheban and Cici Bussey. Meanwhile, as if Kimye couldn't stand on their own, they were somehow joined by West's cousins Kim Wallace, Jalil Peraza, and Ricky Anderson. For a recap of what went down once they took to the stage, scroll down.\n\nLoading View on Instagram\n\nLoading View on Instagram\n\nKanye was all smiles.\n\nKim tweeted during a family viewing of the episode on Sunday night that \"Kanye has a permanent smile on his face during this whole Family Feud episode.\" That much was apparent even in the episode's preview, with Kanye immediately responding to Harvey's question about why he's a good kisser with the simple answer, \"lips.\"\n\nThe competition was real.\n\nBefore things kicked off, behind the scenes, Kim caught how her fam's team wouldn't let her in their \"huddle .\" Then, once onstage, things began to get heated between Kim and Khloé, with the latter refusing to shake her sister's hand, and teasing Kim for her obvious lack of prior knowledge about the show. (Though even though their mom kicked things off by saying that appearing on the show was on the \"entire family's bucket list .\") When the Kardashian team also broke rules by convening for a hushed talk, Kim shouted, \"No cheating over there!\" and West yelled, \"That's an automatic disqualification!\"\n\nPinterest Khloé and Kim Kardashian, along with Steve Harvey, on Family Feud. Courtesy of Giphy\n\nKendall snuck in some Donald Trump shade.\n\nWhen Harvey asked Kendall and Kim Wallace whom they'd hate to see at a wild party where everyone was naked, Kendall lost out on responding first, but definitely won with her answer: \"Donald Trump .\" Kris, in full-on mom mode, yelled, \"Good one, Kendall!\" while Khloé cheered and even Kim, whose opinions apparently differ from those of her husband's , openly laughed.\n\nLoading View on Instagram\n\nKris Jenner was in ultimate Mean Girls Mom mode.\n\nKris , in true supportive momager fashion, also stood by her opponent Kim when she somehow got docked points for responding \"my butt\" to the question of what part of her body most often bumps into things, joining in those booing the decision and yelling, \"It's all right!\"\n\nLoading View on Instagram\n\nSomehow, Team Kimye lost.\n\nEven though they were of course convinced that they would win, team Kimye ended up falling short, In the end, though Kendall and Khloé still allowed them to play the \"Fast Money\" portion of the show, since it would also benefit the Children’s Hospital Los Angeles. (And, according to Harvey, \"It's always been Yeezy's dream to play Fast Money.\") In the end, they at least ended up winning that portion of the show, raising $25,000.\n\nLoading View on Instagram\n\nRelated: Kris Jenner Is Already Embarrassing Her Granddaughter North West at School", "images": ["https://www.wmagazine.com/images/w_logo.svg", "https://media.wmagazine.com/photos/5b1e9087ca6b07756add218b/4:3/w_1536/GettyImages-961869596.jpg", "https://vulcan.condenastdigital.com/wmag-services/photos/592f1832802c577242df3ef7/1:1/w_128,c_limit/Bella%20Hadid.jpg", "https://media.wmagazine.com/photos/5b1e79aad57f17098af4db61/master/w_320,c_limit/kim-khloe-family-feud.gif", "https://media.wmagazine.com/photos/5b1e7687dfea9b688514d328/2:1/w_790,c_limit/kim-kardashian-family-feud.png", "https://vulcan.condenastdigital.com/wmag-services/photos/592f1897cc1eac746f6e754f/1:1/w_128,c_limit/Brad%20Pitt.jpg", "https://vulcan.condenastdigital.com/wmag-services/photos/592f0706802c577242df3ef1/1:1/w_128,c_limit/Michelle_Obama_Face.png"], "top_img": "https://media.wmagazine.com/photos/5b1e7687dfea9b688514d328/2:1/w_790,c_limit/kim-kardashian-family-feud.png", "keywords": [], "authors": ["Stephanie Eckardt", "Byron Cohen Getty Images"], "canonical_link": "https://www.wmagazine.com/story/kardashian-family-feud-recap-kim-kanye-west", "title": "Kardashian Family Feud: A Recap of the Ultra Competitive Episode", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=no, width=device-width, initial-scale=1, maximum-scale=1", "msapplication-TileColor": "#ffffff", "msapplication-TileImage": "/images/favicon/ms-icon-144x144.png", "theme-color": "#ffffff", "author": "Stephanie Eckardt", "copyright": "Copyright (c) Condé Nast 2019", "description": "Everything that went down in the premiere of Kim Kardashian and Kanye West's episode of Family Feud, where they're battling Khloé, plus Kris and Kylie Jenner.", "publishDate": "2018-06-11T15:11:50Z", "keywords": "Keeping Up,Kardashians,kanye west,Family Feud,Steve Harvey", "fb": {"app_id": 230068530489385, "admins": 108943, "pages": 40621875003}, "og": {"site_name": "W Magazine", "title": "A Recap of the Kardashians' Drama-Filled Family Feud Episode", "url": "https://www.wmagazine.com/story/kardashian-family-feud-recap-kim-kanye-west", "description": "From Kendall Jenner's Donald Trump shade to Kanye West's nonstop smiling.", "type": "article", "image": "https://media.wmagazine.com/photos/5b1e7687dfea9b688514d328/2:1/w_790,c_limit/kim-kardashian-family-feud.png"}, "twitter": {"card": "summary_large_image", "site": "wmag", "title": "A Recap of the Kardashians' Drama-Filled Family Feud Episode", "description": "From Kendall Jenner's Donald Trump shade to Kanye West's nonstop smiling.", "image": "https://media.wmagazine.com/photos/5b1e7687dfea9b688514d328/2:1/w_790,c_limit/kim-kardashian-family-feud.png?mbid=social_retweet", "domain": "wmagazine.com"}, "version": "2.0.0"}, "movies": [], "publish_date": 1528729910.0, "source": "https://www.wmagazine.com", "summary": ""}