{"url": "https://www.vanityfair.com/news/2018/02/monica-lewinsky-in-the-age-of-metoo", "text": "How do I know him? Where have I seen him? The Man in the Hat looked familiar, I thought, as I peered over at him a second time.\n\nIt was Christmas Eve 2017. My family and I were about to be seated at a quaint restaurant in Manhattan’s West Village. We had just come from Gramercy Park—on the one night each year when the exclusive park (accessible only to nearby residents with special keys) opens its gates to outsiders. There had been carols. People had sung with abandon. In short, it was a magical night. I was happy.\n\nAmid the glow of candles and soft lighting, I strained to look again at the Man in the Hat. He was part of a small group that had just exited the main dining room. They were now gathering their belongings, likely vacating what was to be our table. And then it clicked. He looks just like . . . no, couldn’t be. Could it?\n\nA student of Karma, I found myself seizing the moment. Whereas a decade ago I would have turned and fled the restaurant at the prospect of being in the same place as this man, many years of personal-counseling work (both trauma-specific and spiritual) had led me to a place where I now embrace opportunities to move into spaces that allow me to break out of old patterns of retreat or denial.\n\nAt the same moment I stepped toward the Man in the Hat and began to ask, “You’re not . . . ?,” he stepped toward me with a warm, incongruous smile and said, “Let me introduce myself. I’m Ken Starr.” An introduction was indeed necessary. This was, in fact, the first time I had met him.\n\nI found myself shaking his hand even as I struggled to decipher the warmth he evinced. After all, in 1998, this was the independent prosecutor who had investigated me, a former White House intern; the man whose staff, accompanied by a group of F.B.I. agents (Starr himself was not there), had hustled me into a hotel room near the Pentagon and informed me that unless I cooperated with them I could face 27 years in prison. This was the man who had turned my 24-year-old life into a living hell in his effort to investigate and prosecute President Bill Clinton on charges that would eventually include obstruction of justice and lying under oath—lying about having maintained a long-term extramarital relationship with me.\n\nKen Starr asked me several times if I was “doing O.K.” A stranger might have surmised from his tone that he had actually worried about me over the years. His demeanor, almost pastoral, was somewhere between avuncular and creepy. He kept touching my arm and elbow, which made me uncomfortable.\n\nI turned and introduced him to my family. Bizarre as it may sound, I felt determined, then and there, to remind him that, 20 years before, he and his team of prosecutors hadn’t hounded and terrorized just me but also my family—threatening to prosecute my mom (if she didn’t disclose the private confidences I had shared with her), hinting that they would investigate my dad’s medical practice, and even deposing my aunt, with whom I was eating dinner that night. And all because the Man in the Hat, standing in front of me, had decided that a frightened young woman could be useful in his larger case against the president of the United States.\n\nUnderstandably, I was a bit thrown. (It was also confusing for me to see “Ken Starr” as a human being. He was there, after all, with what appeared to be his family.) I finally gathered my wits about me—after an internal command of Get it together. “Though I wish I had made different choices back then,” I stammered, “I wish that you and your office had made different choices, too.” In hindsight, I later realized, I was paving the way for him to apologize. But he didn’t. He merely said, with the same inscrutable smile, “I know. It was unfortunate.”", "images": ["https://media.vanityfair.com/photos/5d02b85f1af02cd7ed69ff29/1:1/w_350%2Ch_350%2Cc_limit/Duncan-hunter.jpg", "https://media.vanityfair.com/photos/5a64db5f522d2433237667c1/master/w_1600%2Cc_limit/03-womens-march-dc-DSCF3371VF.jpg", "https://www.vanityfair.com/verso/static/hive/assets/logo-header.0dc8f7e2d7caee2661a70d5d16b66b4f23f701b7.svg", "https://media.vanityfair.com/photos/5a64db8c2d4c642bf63b3ba4/master/w_1600%2Cc_limit/02-womens-march-dc-DSCF3316VF.jpg", "https://media.vanityfair.com/photos/5d00d2faef4f5d685d3a408e/1:1/w_350%2Ch_350%2Cc_limit/Tibi%2520RS18%25200909.jpg", "https://media.vanityfair.com/photos/5d03acff76711f312e7fe6b3/1:1/w_350%2Ch_350%2Cc_limit/Jeffrey-Katzenberg%25E2%2580%2599s-Quibi.jpg", "https://media.vanityfair.com/photos/5a8dcf3f9028ff3af11a186e/16:9/w_1280%2Cc_limit/monica-lewinsky-metoo-03-2018-lede.jpg", "https://media.vanityfair.com/photos/5d03a3b276711f0f057fe6b1/1:1/w_350%2Ch_350%2Cc_limit/euphoria-review-hbo.jpg", "https://www.vanityfair.com/verso/static/hive/assets/logo-reverse.6ccb38f17720796c2695284ed57385b6fda63de0.svg", "https://media.vanityfair.com/photos/5a64db687df577764ae9be9b/master/w_1600%2Cc_limit/01-womens-march-dc-DSCF3272VF.jpg", "https://media.vanityfair.com/photos/5d05048028d8add457470b77/1:1/w_350%2Ch_350%2Cc_limit/taylor-swift-stonewall-pride.jpg", "https://media.vanityfair.com/photos/5a8dcfed3c0f45451fecd3a7/master/w_1600%2Cc_limit/monica-lewinsky-metoo-03-2018-embed.jpg", "https://media.vanityfair.com/photos/5a8dcf3d1c6be356b8dcf6a6/16:9/w_1280,c_limit/t-monica-lewinsky-metoo-03-2018.jpg"], "top_img": "https://media.vanityfair.com/photos/5a8dcf3d1c6be356b8dcf6a6/16:9/w_1280,c_limit/t-monica-lewinsky-metoo-03-2018.jpg", "keywords": [], "authors": ["Condé Nast", "Kevin Fitzpatrick", "Tina Nguyen", "Sonia Saraiya", "Monica Lewinsk", "Nicole Sperling"], "canonical_link": "https://www.vanityfair.com/news/2018/02/monica-lewinsky-in-the-age-of-metoo", "title": "Monica Lewinsky: Emerging from “the House of Gaslight” in the Age of #MeToo", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Condé Nast", "copyright": "Copyright (c) Condé Nast 2019", "description": "On the 20th anniversary of the Starr investigation, which introduced her to the world, the author reflects on the changing nature of trauma, the de-evolution of the media, and the extraordinary hope now provided by the #MeToo movement.", "keywords": "metoo,#metoo movement,monica lewinsky", "robots": "index, follow", "og": {"description": "On the 20th anniversary of the Starr investigation, which introduced her to the world, the author reflects on the changing nature of trauma, the de-evolution of the media, and the extraordinary hope now provided by the #MeToo movement.", "image": "https://media.vanityfair.com/photos/5a8dcf3d1c6be356b8dcf6a6/16:9/w_1280,c_limit/t-monica-lewinsky-metoo-03-2018.jpg", "site_name": "Vanity Fair", "title": "Monica Lewinsky: Emerging from “the House of Gaslight” in the Age of #MeToo", "type": "article", "url": "https://www.vanityfair.com/news/2018/02/monica-lewinsky-in-the-age-of-metoo"}, "twitter": {"card": "summary_large_image", "description": "On the 20th anniversary of the Starr investigation, which introduced her to the world, the author reflects on the changing nature of trauma, the de-evolution of the media, and the extraordinary hope now provided by the #MeToo movement.", "domain": "https://www.vanityfair.com", "image": {"src": "https://media.vanityfair.com/photos/5a8dcf3d1c6be356b8dcf6a6/16:9/w_1280,c_limit/t-monica-lewinsky-metoo-03-2018.jpg?mbid=social_retweet"}, "site": "@VanityFair", "title": "Monica Lewinsky: Emerging from “the House of Gaslight” in the Age of #MeToo"}, "fb": {"app_id": 305927716147259, "pages": 8810407571}}, "movies": [], "publish_date": null, "source": "https://www.vanityfair.com", "summary": ""}