{"url": "https://en.wikipedia.org/wiki/Teen_Mom", "text": "This article is about the reality television series. For teenage pregnancy and motherhood, see Teenage pregnancy\n\nTeen Mom (renamed Teen Mom OG from the fifth season) is an American reality television series broadcast by MTV. It is the first spin-off of 16 and Pregnant, and focuses on the lives of several young mothers as they navigate motherhood and strained family and romantic relationships. Its first run consists of four seasons originally aired between December 8, 2009 and October 9, 2012, while another four seasons have aired during its second run that began on March 23, 2015.\n\nThe series originally focused on the lives of Farrah Abraham, Maci Bookout (now McKinney), Catelynn Lowell (now Baltierra), and Amber Portwood, who were featured on the first season of 16 and Pregnant. Are You the One? participant Cheyenne Floyd and television personality Bristol Palin joined in the second half of the seventh season replacing Abraham who departed from the show. However, Palin departed the show following an announcement on Instagram in April 2019. The show's success has allowed for the development of the spin-offs Teen Mom 2, Teen Mom 3, Teen Mom: Young and Pregnant, and Teen Mom: Young Moms Club.\n\nCast members [ edit ]\n\nFarrah Abraham [ edit ]\n\nAn aspiring model,[1] Farrah Abraham (from Council Bluffs, Iowa) is the mother of Sophia Laurent Abraham, whose father, Derek Underwood, was killed in a car accident on December 28, 2008, two months before her birth.\n\nIn January 2010, Farrah's mother, Debra Danielson, was charged with assault in an Iowa court for hitting her.[2] As a result of the fight with her mother, Farrah and Sophia moved out of her mother's house.\n\nShe started seeing a therapist to discuss the rocky relationship with her family,because she couldn't cope with her mothers actions as well as dealing with her emotions regarding Underwood and his death. Farrah eventually proved to Derek's family through a paternity test that Derek was in fact Sophia's father and then was faced with a lawsuit filed by Derek's mother for grandparents' visitation rights, despite no previous contact with Sophia.\n\nShe published her autobiography, My Teenage Dream Ended in August 2012. In May 2013, Vivid Entertainment released a sex tape featuring Abraham having sex with porn star James Deen. Abraham defended her decision to make and sell her porn video, claiming that she wanted to \"celebrate [her] awesome body\".[3]\n\nIn October of 2017, Farrah was fired from the show by producer Morgan J. Freeman. He explained her choice to return to the adult entertainment industry was in conflict with the overall message of Teen Mom. She was later replaced by Bristol Palin and Cheyenne Floyd\n\nMaci McKinney [ edit ]\n\nMaci McKinney (née Bookout) (from Chattanooga, Tennessee), the mother of Bentley Cadence Edwards, is described by MTV as the classic teenage overachiever who is popular, athletic, and successful in school.[4][5] She had aspirations to go away to college with her friends after she graduated from high school, but her dreams are now on hold as she struggles to take care of Bentley, take online courses at the local state college, and maintain her relationship with Ryan, Bentley's father.[6] Maci gets fed up with Ryan when he does not help her juggle parenthood, school, and work to her satisfaction.[1] Bookout said the reason she participated in the show was because she wanted to get a good message across[6] and stated: \"I really just wanted to show girls how hard it was to be a teen parent. I wanted girls who might get pregnant to see there are options out there to move forward with your life and still have goals.\"[5] She has gone back to college after dropping her online classes, and now is majoring in journalism and hopes to write a book about her experience being sixteen and pregnant. She also speaks at local high schools about the challenges of teen pregnancy.[6]\n\nIn December 2014, Maci announced she was expecting her second child, a daughter, with her boyfriend of two years, Taylor McKinney, due in June 2015.[7][8] Bookout gave birth to their daughter, Jayde Carter, on May 29, 2015.[9] In February 2016, Bookout revealed she is expecting her third child, a second son named Maverick Reed, with Taylor McKinney. Maverick made his appearance on May 31, 2016. Maci married Taylor McKinney on October 8, 2016.\n\nCatelynn Baltierra [ edit ]\n\nCatelynn Lowell Baltierra (from Marine City, Michigan) is the birth mother of Carolynn \"Carly\" Elizabeth. Described as a smart and funny high school senior, she struggles to go back to her normal life after her emotional decision to place Carly for adoption. Catelynn is an integral part of the show, letting prospective teen moms know that there are options. She demonstrates that one can go on after becoming a \"birth mom,\" and being completely mature and selfless by choosing parents for her baby via adoption. Carly's adoptive parents are Brandon and Theresa.[4] Catelynn moves back home with her parents, but learns that her mother and stepfather, who is also the father of her boyfriend Tyler, have still not accepted her decision to place her daughter for adoption. During the season, Catelynn comes to terms with being a birth mother, moves in with Tyler and his mother when her mother and her stepfather move into an apartment in another city, and gets engaged to Tyler. She and Tyler both get tattoos in honor of their daughter.\n\nLowell gave birth to their second daughter, Novalee \"Nova\" Reign, on January 1, 2015.[10] The couple were married on August 22, 2015.[11]\n\nAmber Portwood [ edit ]\n\nAmber Portwood (from Anderson, Indiana) is the mother of Leah Leann Shirley. Amber's journey into parenthood has been tough; she struggles to parent Leah, and stay with her fiance Gary. She used to be a self-declared party girl, but now discovers she has little time to do anything besides take care of Leah. Amber dropped out of high school when she discovered she was pregnant, but now is working to obtain her GED. She has many troubles with her baby's father, Gary. The problems have led to physical violence in front of her child, Leah, including an incident where Amber beats him so severely, he is left with permanent scars. Amber eventually gets arrested for domestic violence against Gary.[4] She had a younger sister, Candace, who died of SIDS when Amber was 5.[12] As of June 2012, Amber was serving a five-year jail sentence, the result of a December 2011 arrest for possession of drugs and failing to complete a court-ordered rehab program. On November 4, 2013, she was released from Indiana's Rockville Correctional Facility (four years early).\n\nOver the course of filming, Portwood became engaged to Matt Baier, an author and onetime DJ. Originally, the wedding was scheduled for October 10, 2016; however, the wedding plans were suspended when it was revealed that, unbeknownst to Portwood, Baier had several children by different women and had fallen behind on child support payments and that he had reached out to fellow Teen Mom castmates Farrah Abraham and Jenelle Evans before finally pursuing Portwood.[13][14] The couple reconciled, and a new date has been fixed for October 13, 2017.[15] Portwood has said she would be inviting all of the Teen Mom stars, \"[e]very single one from Teen Mom 2 and Teen Mom OG.\"[13]\n\nPortwood met Baier over Twitter in 2014 and she says \"she put him through a test to see if he really liked her, and not just because she was on TV\". Both Portwood and Baier have a love of music and past addiction problems in common, according to Portwood.[15] On the 2016 check-up with Dr. Drew, Portwood announces that she and her ex fiancé Gary, have agreed to share 50-50 custody of their seven-year-old daughter Leah.\n\nFollowing the sixth-season finale and reunion show, Portwood announced she would not be returning to the series. In a series a tweets, Portwood claimed: \"If I was treated fairly it wouldn't be an issue but it's been nothing but disrespect since the reunion show. Which keeps continuing today. [...] Nothing has been dealt with or has made me feel any safer to even move on with people who have continuously hidden things from the network. The day I'm shown some respect by the people I've worked with for 8 years is the day I'll be back. I've sacrificed a lot for this show.\"[16] Portwood subsequently returned for the seventh season, her upcoming wedding being one of the show's focuses.[13] Portwood and Baier ended their relationship around the summer of 2017 after Portwood learned of Baier's infidelity.[17] She is in a relationship with Andrew Glennon, whom she met whilst filming Marriage Boot Camp, where Glennon was working as a camera man. They welcomed their first child, a boy named James Andrew Glennon on May 8, 2018.[18]\n\nAmber Portwood's spousal abuse legal charges [ edit ]\n\nFootage of Amber Portwood's violent behavior towards her child's father Gary Shirley, including an assault in which Shirley refused to physically defend himself, prompted an investigation from both the police department of Anderson, Indiana, and that city's branch of the state Child Protective Services, along with sparking hundreds of public complaints questioning Portwood's suitability to be a mother. Police searched Portwood's apartment, finding \"evidence that requires further investigation,\" but would not specify what had been found at the time; it was later revealed that Portwood had been caught with a large quantity of marijuana and crack cocaine.\n\nOn October 20, 2010, The Today Show aired a segment revolving around the depicted domestic abuse in both seasons. NBC's Dan Abrams discussed the possible legal consequences Portwood could face under Indiana law, including the felony charge of conducting abuse in the presence of a child under 14 years of age (namely, the couple's two-year-old daughter Leah) and misdemeanor charges including but not limited to domestic assault and battery. On November 3, it was reported that Portwood agreed to allow Indiana CPS to monitor her for up to six months in exchange for CPS's allowing her to maintain custody of Leah.[citation needed]\n\nOn November 18, after an extensive investigation, Portwood was charged with three counts of domestic violence, two of them felonies, in connection with separate incidents of on-camera abuse of Shirley.[19] The same day, MTV released a statement concerning the charges filed on Portwood: \"We are cooperating with all parties and hope for a quick and fair resolution that allows everyone involved to move forward in a positive manner.\"[20]\n\nIn December 2011, Portwood was arrested for the Class D felony of possession of a controlled substance and was later charged with violating her probation on her earlier domestic-violence charges by breaching conditions including behaving well in society, obtaining a GED certificate, completing six months of anger-management training, paying her probation fees, and setting up a $10,000 college fund for Leah. She was held without bond in Madison County Jail until her January 27, 2012, hearing on both charges, at which she entered a guilty plea and the court scheduled a sentencing hearing for February 6 of that year. On February 6, Portwood was given a five-year suspended sentence with the provision that all charges would be dropped if she went to and completed rehab.[citation needed] In March 2012, Portwood failed to take a required drug test, violating the associated condition of her suspended sentence and putting herself in jeopardy of having the five-year suspended sentence reimposed. At the ensuing probation violation hearing, the judge in the case declined to reimpose any portion of the suspended sentence, instead requiring Amber to complete 30 days of daily drug tests.[citation needed] Portwood subsequently dropped out of her rehabilitation program and was charged with a third violation of her probation; in June 2012, the court reimposed Portwood's five-year sentence in its entirety.[21]\n\nOn June 13, 2012, Portwood began serving her five-year sentence, during which she is expected to attend substance abuse classes and earn her GED.[22]\n\nOn December 20, 2013, Portwood made an appearance on the talk show Dr. Phil. She revealed that she has been released from jail early due to good behavior and now has her GED. Portwood also revealed that she was high on prescription and illegal medication for most episodes of Teen Mom and that she is sober with no intent of ever using again. Portwood is working on obtaining a joint custody agreement with her ex-boyfriend Gary Shirley and is trying to focus on being a good mom to her daughter. She also has established an organization to help teens stay off drugs.[23]\n\nTimeline of cast members [ edit ]\n\nName Seasons Teen Mom Teen Mom OG 1 2 3 4 5 6 7A 7B 8 Farrah Abraham Main Maci McKinney Main Catelynn Baltierra Main Amber Portwood Main Cheyenne Floyd Main Bristol Palin Main\n\n\n\n\n\nSeries overview [ edit ]\n\nSeason Episodes Originally aired First aired Last aired 1 9 December 8, 2009 ( ) February 2, 2010 ( 2010-02-02 ) 2 13 July 20, 2010 ( ) October 19, 2010 ( 2010-10-19 ) 3 14 July 5, 2011 ( ) October 4, 2011 ( 2011-10-04 ) 4 14 June 12, 2012 ( ) September 11, 2012 ( 2012-09-11 ) 5 22 March 23, 2015 ( ) March 7, 2016 ( 2016-03-07 ) 6A 17 August 22, 2016 ( ) December 5, 2016 ( 2016-12-05 ) 6B 14 April 17, 2017 ( ) July 10, 2017 ( 2017-07-10 ) 7A 20 November 27, 2017 ( ) April 23, 2018 ( 2018-04-23 ) 7B 14 October 1, 2018 ( ) December 31, 2018 ( 2018-12-31 ) 8 TBA June 10, 2019 ( ) TBA ( TBA )\n\nEpisodes [ edit ]\n\nSeason 1 (2009-2010) [ edit ]\n\nNo. in\n\nseries No. in\n\nseason Title Original air date 1 1 \"Looking for Love\" December 8, 2009 ( ) Single teen mom Farrah starts dating against her family's wishes while Maci begins planning her wedding to fiancé Ryan. Catelynn moves back home with her parents and Amber's anxiety about being a mom gets the best of her. 2 2 \"How Many Chances?\" December 15, 2009 ( ) Teen mom Maci contemplates breaking up with her fiancé, Ryan, Farrah starts dating a new guy even though her family disapproves. Amber struggles to get her GED, and Catelynn feels distant from her daughter since the adoption. 3 3 \"Fallout\" December 22, 2009 ( ) Catelynn's family lashes out over her choice of adoption while Amber and her fiancé Gary come to blows. Farrah learns that dating isn't easy, and Maci struggles to balanced motherhood and school. 4 4 \"Moving On\" December 29, 2009 ( ) Amber and Gary's arguing finally reaches a boiling point, while Catelynn struggles to find a home when her mother moves away. Newly-single mom Maci has a change of heart, and boy-crazy Farrah opts for some protection. 5 5 \"A Little Help\" January 5, 2010 ( ) Catelyn chooses adoption during a weekend retreat with other birth moms, while Maci and Ryan reach out to a counselor. Amber thinks about accepting help from her ex, and Farrah wonders if she should stay home more with her baby. 6 6 \"Standing Up\" January 12, 2010 ( ) Teenage mother Maci struggles with resenting her boyfriend, while Catelynn worries her boyfriend's father might go to jail. Farrah shifts her focus to her daughter, and Amber faces her fears about putting her baby in daycare. 7 7 \"Baby Steps\" January 19, 2010 ( ) Amber wants to put an end to the fighting and move away from Gary. Farrah can't stand living under her parents' roof anymore. Maci struggles to keep up in school when her son starts walking. Catelyn and Tyler plan their future. 8 8 \"Happy Birthday\" January 26, 2010 ( ) Catelynn & Tyler work on letting go of Carly, & Tyler works up the nerve to propose marriage to Catelynn. Maci and Ryan celebrate Bentley's first birthday. Amber copes with the pressures while planning Leah's 1st birthday. 9 9 \"Check Up with Dr. Drew\" February 2, 2010 ( ) Dr. Drew hosts the cast of Teen Mom on-stage in front of a live studio audience. Maci, Farrah, Catelynn and Amber reflect on the struggles of their first year of motherhood, and reveal what's happened since.\n\nSeason 2 (2010) [ edit ]\n\nNo. in\n\nseries No. in\n\nseason Title Original air date 10 1 \"Not Again\" July 20, 2010 ( ) Farrah calls the police on her own mother. Amber faces a pregnancy scare. Maci takes her ex, Ryan, to court for child support. Catelynn is upset that she has to move out of her boyfriend's house and back in with her family. 11 2 \"Should I Stay or Should I Go\" July 27, 2010 ( ) Catelynn gets caught in a lie. Amber's boyfriend might leave her for someone else. Farrah juggles college, a new job and moving houses - all with her daughter Sophia. Maci tries to move into a house with her college friends. 12 3 \"Valentine's Day\" August 3, 2010 ( ) Maci reconnects with an old flame on Valentine's Day. Their crying baby and unrealistic expectations ruin Amber and Gary's romantic dinner. Catelynn's boyfriend struggles about the adoption. Farrah reveals an emotional secret. 13 4 \"Spring Break\" August 10, 2010 ( ) Amber and Gary take a vacation. Maci and Ryan butt heads over Ryan's new girlfriend. Farrah's mom is offered a plea bargain for their physical altercation. Catelynn finds out Tyler is still angry at her about a past lie. 14 5 \"Secrets & Lies\" August 17, 2010 ( ) Catelynn and Tyler find their high school romance back on the rocks, a big fight makes Amber question her engagement to Gary, Maci introduces her new boyfriend to her son Bentley and Farrah gets scammed. 15 6 \"Trial and Error\" August 31, 2010 ( ) Maci questions whether her new boyfriend is ready to date a teen mom while Farrah tries speed dating. Amber works toward her GED and Catelynn's stepdad is court-ordered to rehab, leaving her alone with her guilt-inducing mom. 16 7 \"Senior Prom\" September 7, 2010 ( ) An argument about the adoption ruins Catelynn's prom dress shopping; Maci is upset when Ryan says he's taking her to court over custody of Bentley. Farrah goes to counseling with her mom and Gary ruins Amber's birthday plans. 17 8 \"Hello and Goodbye\" September 14, 2010 ( ) Amber and Gary's wedding plans fall apart, while Farrah considers moving back into her mother's house. Catelynn and Tyler celebrate their daughter Carly's first birthday from afar and Maci tells her parents that she's moving. 18 9 \"Family Bonds\" September 21, 2010 ( ) Farrah reaches out to Sophia's dad's family in an attempt to get Social Security benefits for Sophia. Maci tells Ryan she is moving to Nashville, while Catelynn and Tyler learn Butch has ended up back in jail. 19 10 \"Lashing Out\" September 28, 2010 ( ) Amber lashes out at Gary when he threatens to take Leah away. Catelynn and Tyler find out they will not graduate from High School on time. Maci tries to work out a visitation schedule with Ryan. Farrah has an emotional reunion. 20 11 \"Too Much, Too Soon\" October 5, 2010 ( ) Maci confronts Kyle about her new life in Nashville. Catelynn and Tyler learn they will get to go visit Carly for the first time in a year. Amber breaks it off with Gary. Farrah learns the results of Sophia's DNA test. 21 12 \"See You Later\" October 12, 2010 ( ) A year after the adoption, Catelynn and Tyler have an emotional reunion with their daughter. Amber & Gary try to work out custody of Leah. Farrah's mom sets her up on a date. Maci and Ryan battle over parental rights. 22 12 \"Check Up with Dr. Drew\" October 19, 2010 ( ) Dr. Drew hosts the cast of Teen Mom on-stage in front of a live studio audience, where they reflect on the struggles of their early years of motherhood, the heartbreak, happiness and conflict we saw them face in season 2.\n\nSeason 1 (2009–10) [ edit ]\n\nNo. in\n\nseries No. in\n\nseason Title Original air date 1 1 \"looking for love\" December 8, 2009 ( ) Single teen mom Farrah starts dating against her family's wishes while Maci begins planning her wedding to fiancé Ryan. Catelynn moves back home with her parents and Amber's anxiety about being a mom gets the best of her. 2 2 \"how many chances?\" December 15, 2009 ( ) Teen mom Maci contemplates breaking up with her fiancé, Ryan, Farrah starts dating a new guy even though her family disapproves. Amber struggles to get her GED, and Catelynn feels distant from her daughter since the adoption. 3 3 \"fallout\" December 22, 2009 ( ) Catelynn's family lashes out over her choice of adoption while Amber and her fiancé Gary come to blows. Farrah learns that dating isn't easy, and Maci struggles to balanced motherhood and school. 4 4 \"moving on\" December 29, 2009 ( ) Amber and Gary's arguing finally reaches a boiling point, while Catelynn struggles to find a home when her mother moves away. Newly-single mom Maci has a change of heart, and boy-crazy Farrah opts for some protection. 5 5 \"a little help\" January 5, 2010 ( ) Catelyn chooses adoption during a weekend retreat with other birth moms, while Maci and Ryan reach out to a counselor. Amber thinks about accepting help from her ex, and Farrah wonders if she should stay home more with her baby. 6 6 \"standing up\" January 12, 2010 ( ) Teenage mother Maci struggles with resenting her boyfriend, while Catelynn worries her boyfriend's father might go to jail. Farrah shifts her focus to her daughter, and Amber faces her fears about putting her baby in daycare. 7 7 \"baby steps\" January 19, 2010 ( ) Amber wants to put an end to the fighting and move away from Gary. Farrah can't stand living under her parents' roof anymore. Maci struggles to keep up in school when her son starts walking. Catelyn and Tyler plan their future. 8 8 \"happy birthday\" January 26, 2010 ( ) Catelynn & Tyler work on letting go of Carly, & Tyler works up the nerve to propose marriage to Catelynn. Maci and Ryan celebrate Bentley's first birthday. Amber copes with the pressures while planning Leah's 1st birthday. 9 9 \"finale special: check up with dr. drew\" February 2, 2010 ( ) Dr. Drew hosts the cast of Teen Mom on-stage in front of a live studio audience. Maci, Farrah, Catelynn and Amber reflect on the struggles of their first year of motherhood, and reveal what's happened since. 10 10 \"unseen moments\" February 9, 2010 ( ) Dr. Drew hosts a look at the exclusive moments we never saw with Farrah, Maci, Catelynn and Amber from the first season of Teen Mom.\n\nSeason 2 (2010) [ edit ]\n\nNo. in\n\nseries No. in\n\nseason Title Original air date 11 1 \"not again\" July 20, 2010 ( ) Farrah calls the police on her own mother. Amber faces a pregnancy scare. Maci takes her ex, Ryan, to court for child support. Catelynn is upset that she has to move out of her boyfriend's house and back in with her family. 12 2 \"should i stay or should i go\" July 27, 2010 ( ) Catelynn gets caught in a lie. Amber's boyfriend might leave her for someone else. Farrah juggles college, a new job and moving houses - all with her daughter Sophia. Maci tries to move into a house with her college friends. 13 3 \"valentine's day\" August 3, 2010 ( ) Maci reconnects with an old flame on Valentine's Day. Their crying baby and unrealistic expectations ruin Amber and Gary's romantic dinner. Catelynn's boyfriend struggles about the adoption. Farrah reveals an emotional secret. 14 4 \"spring break\" August 10, 2010 ( ) Amber and Gary take a vacation. Maci and Ryan butt heads over Ryan's new girlfriend. Farrah's mom is offered a plea bargain for their physical altercation. Catelynn finds out Tyler is still angry at her about a past lie. 15 5 \"secrets & lies\" August 17, 2010 ( ) Catelynn and Tyler find their high school romance back on the rocks, a big fight makes Amber question her engagement to Gary, Maci introduces her new boyfriend to her son Bentley and Farrah gets scammed. 16 6 \"trial and error\" August 31, 2010 ( ) Maci questions whether her new boyfriend is ready to date a teen mom while Farrah tries speed dating. Amber works toward her GED and Catelynn's stepdad is court-ordered to rehab, leaving her alone with her guilt-inducing mom. 17 7 \"senior prom\" September 7, 2010 ( ) An argument about the adoption ruins Catelynn's prom dress shopping; Maci is upset when Ryan says he's taking her to court over custody of Bentley. Farrah goes to counseling with her mom and Gary ruins Amber's birthday plans. 18 8 \"hello and goodbye\" September 14, 2010 ( ) Amber and Gary's wedding plans fall apart, while Farrah considers moving back into her mother's house. Catelynn and Tyler celebrate their daughter Carly's first birthday from afar and Maci tells her parents that she's moving. 19 9 \"family bonds\" September 21, 2010 ( ) Farrah reaches out to Sophia's dad's family in an attempt to get Social Security benefits for Sophia. Maci tells Ryan she is moving to Nashville, while Catelynn and Tyler learn Butch has ended up back in jail. 20 10 \"lashing out\" September 28, 2010 ( ) Amber lashes out at Gary when he threatens to take Leah away. Catelynn and Tyler find out they will not graduate from High School on time. Maci tries to work out a visitation schedule with Ryan. Farrah has an emotional reunion. 21 11 \"too much, too soon\" October 5, 2010 ( ) Maci confronts Kyle about her new life in Nashville. Catelynn and Tyler learn they will get to go visit Carly for the first time in a year. Amber breaks it off with Gary. Farrah learns the results of Sophia's DNA test. 22 12 \"see you later\" October 12, 2010 ( ) A year after the adoption, Catelynn and Tyler have an emotional reunion with their daughter. Amber & Gary try to work out custody of Leah. Farrah's mom sets her up on a date. Maci and Ryan battle over parental rights. 23 13 \"unseen moments\" October 11, 2010 ( ) Dr. Drew hosts an exclusive look at never-before seen laughs, fights and other Season 2 drama with Farrah, Maci, Catelynn, and Amber. 24 14 \"check-up with dr. drew\" October 19, 2010 ( ) Dr. Drew hosts the cast of Teen Mom on-stage in front of a live studio audience, where they reflect on the struggles of their early years of motherhood, the heartbreak, happiness and conflict we saw them face in season 2.\n\nSeason 3 (2011) [ edit ]\n\nNo. in\n\nseries No. in\n\nseason Title Original air date 25 1 \"taking it slow\" July 5, 2011 ( ) Teen Mom Maci confronts her ex about child support. Amber chooses between her baby's dad and her new boyfriend. Catelynn and Tyler consider moving in together while still in high school, and Farrah considers making a big 26 2 \"to be with you\" July 12, 2011 ( ) Amber and Gary move in together while Tyler's family questions his decision to move in with Catelynn. Maci considers letting her boyfriend move in and Bentley to make ends meet - and Farrah struggles with being away from Sophia. 27 3 \"the last straw\" July 19, 2011 ( ) Amber finds out that she is being investigated, and fears she will lose custody. Ryan wants to meet Maci's new boyfriend, while Sophia's paternal grandmother is suing for visitation rights. Tyler's dad gets out of jail. 28 4 \"trials and tribulations\" July 26, 2011 ( ) Catelynn struggles to fix her relationship with her mom, while Amber & Gary meet with Child Protective Services. Maci finally decides to move away from Kyle and back home to Chattanooga, and Farrah goes to court. 29 5 \"trick or treat\" August 2, 2011 ( ) Maci and Ryan argue over who has rights to Bentley on his birthday, and Amber breaks down over being separated from Leah. Farrah struggles to spend time with Sophia, and Catelynn and Tyler look for jobs. 30 6 \"terrible twos\" August 9, 2011 ( ) Amber is upset when Gary refuses to celebrate Leah's birthday together, and Catelynn copes with her fears about adoption. Farrah gets a puppy, while Maci's Ex finally discovers that her boyfriend is living with her. 31 7 \"without you\" August 16, 2011 ( ) Farrah takes her daughter Sophia on a trip to visit Sophia's dad's grave, and Amber and her mom get in an argument. Maci struggles to keep up in college, while Catelynn and Tyler want to invite their daughter to graduation. 32 8 \"taking it up a notch\" August 23, 2011 ( ) Amber goes on a date, while Catelynn and Tyler get their parents involved with planning a perfect Christmas. Maci makes a shocking announcement, and Farrah breaks the news to her parents that she wants to move to California. 33 9 \"as long as we're together\" August 30, 2011 ( ) Farrah and her parents argue while on a trip, and Catelynn reunites with her father. Amber reaches out to Gary to re-unite her family on the anniversary of a tragedy, while Maci considers withdrawing from school. 34 10 \"stay with me\" September 6, 2011 ( ) Amber spends the night in jail, and finds out that a no-contact order has been put on her and Gary. Catelynn and Tyler have a falling out, and Farrah explores moving to Florida. Maci is overwhelmed while taking care of Bentley. 35 11 \"time out\" September 13, 2011 ( ) Maci has a blowout with Ryan over custody, while Amber and Gary struggle with a no-contact order. Catelynn finally finishes high school, and Farrah's parents try to talk her into leaving Sophia behind when she moves away. 36 12 \"pros & cons\" September 20, 2011 ( ) Amber and Gary try to get the no-contact order lifted, while Maci tries to cut Ryan out of her life. Farrah makes an unexpected choice about moving away, and Butch moves in with Catelynn and Tyler. 37 13 \"check-up with dr. drew - part one\" September 27, 2011 ( ) Dr. Drew hosts the Teen Moms in front of a live audience. Farrah and Amber reflect on the past year of motherhood - the struggles and family strife that we saw them face in Season 3, and everything that has happened since. 38 14 \"check-up with dr. drew - part two\" October 4, 2011 ( ) Dr. Drew hosts in front of a live audience. Catelynn and Maci discuss new milestones, custody battles, school struggles, and family problems that we saw them face in Season 3. Ryan and Kyle share the stage for the first time. 39 15 \"unseen moments\" October 4, 2011 ( ) Dr. Drew hosts an exclusive look at never-before seen laughs, struggles and other drama from Season 3 with Farrah, Maci, Catelynn, and Amber.\n\nSeason 4 (2012) [ edit ]\n\nNo. in\n\nseries No. in\n\nseason Title Original air date 40 – \"catching up with the girls of teen mom\" May 29, 2012 ( ) A look back at Amber, Catelynn, Farrah, and Amber's stories from the beginning of 16 & Pregnant, through the triumphs and challenges, and most emotional moments of the first three seasons of Teen Mom. 41 1 \"separation anxiety\" June 12, 2012 ( ) Maci decides to enroll Bentley in daycare while Amber prepares to go to rehab. Catelynn and Tyler celebrate Carly's second birthday, and Farrah has a change of heart about leaving daughter Sophia behind when she moves. 42 2 \"letting go\" June 12, 2012 ( ) Catelynn and Tyler have an emotional visit with their daughter. Amber struggles during her first weeks of rehab. Farrah says farewell to her life in Iowa. A disagreement with Ryan disrupts Maci and Kyle's relationship. 43 3 \"the places you'll go\" June 19, 2012 ( ) Catelynn and Tyler attend their high school graduation. Maci considers joining Ryan on his family vacation. Farrah has to deal with her parents' overbearing concerns. In rehab, Amber expects a visit from Gary and Leah. 44 4 \"strike out\" June 26, 2012 ( ) Gary and Leah visit Amber in rehab, and Farrah goes on a date with her neighbor. Maci tags along on Ryan's family vacation and Catelynn and Tyler question letting Butch move back into their home. 45 5 \"homecoming\" July 10, 2012 ( ) Amber and Gary work on their relationship issues. Maci struggles to choose classes. Visiting her parents, Farrah is annoyed with their concerns for Sophia. Catelynn and her grandmother attend a birth parent support group. 46 6 \"temper tantrums\" July 17, 2012 ( ) A visit from Farrah's mom and sister leads to a blowup, and Maci enrolls her son Bentley in preschool. Catelynn and Tyler face issues with Butch, while Amber debates leaving rehab early. 47 7 \"fresh start\" July 24, 2012 ( ) Maci and Ryan clash over Bentley attending preschool. Tyler pressures Catelynn to enroll in college. Farrah begins dating a new guy. After completing two months in rehab, Amber finally heads back home. 48 8 \"the next step\" July 31, 2012 ( ) Maci and Kyle contemplate buying a house. Farrah introduces Sophia to her new boyfriend. Amber struggles to find a way to see her daughter. A fight between Catelynn and Tyler's parents throw their family future into question. 49 9 \"by the rules\" August 7, 2012 ( ) Farrah introduces her boyfriend to Debra. Catelynn supports her own mom as Tyler's dad goes to court. Bentley has a hard time adjusting to Maci's new house. Amber and Gary continue to struggle with sharing custordy of Leah. 50 10 \"change of plans\" August 14, 2012 ( ) In a visit to Texas, Farrah challenges Daniel about their relationship. Maci and Ryan argue about Ryan's new girlfriend. Amber looks for a new home for her and Leah. Catelynn and Tyler struggle to make a decision about college. 51 11 \"for the best\" August 21, 2012 ( ) Bentley's birthday leads to a blowout between Maci and Ryan. Farrah spends time with Sophia before saying goodbye for a month. Amber and Gary come up with a custody plan for Leah. Catelynn and Tyler help their parents cope. 52 12 \"wake up\" August 28, 2012 ( ) Amber has second thoughts about giving Gary full custody. Catelynn helps Tyler cope with emotions about his dad and they both reflect on the adoption. Farrah misses Sophia. Ryan confronts Maci about their custody arrangement. 53 13 \"check-up with dr. drew - part one\" September 4, 2012 ( ) Dr. Drew hosts the Teen Moms in front of a live studio audience. Catelynn, Tyler, and Farrah reflect on their journeys in the last four seasons, and the struggles and triumphs of their final season. 54 14 \"check-up with dr. drew - part two\" September 11, 2012 ( ) Maci drops a bombshell about her relationship with Kyle, and shares the stage for the first time with Ryan's new girlfriend. Gary reflects on his journey with Amber, and Leah, Bentley and Sophia share the stage one last time. 55 15 \"unseen moments\" September 12, 2012 ( ) Dr. Drew hosts a look at the exclusive moments we never saw with Farrah, Maci, Catelynn and Amber from the final season of Teen Mom. 56 16 \"farewell\" October 2, 2012 ( ) In this one hour special, the original Teen Moms - Maci, Catelynn, Farrah, and Amber - say goodbye with a look back on their journeys from being 16 and pregnant through today. Featuring never-before-seen footage from their original casting tapes, behind-the-scenes secrets, and dramatic updates on where they are now. 57 17 \"amber behind bars\" October 9, 2012 ( ) Dr. Drew interviews Amber hitting on her past demons, her experience on Teen Mom, the challenges of being a teen mom, her legal woes, her time in jail and her hopes for the future, for herself, for Leah and for Gary. 58 18 \"ask the moms\" October 9, 2012 ( ) Teen Mom fans finally get a chance to ask Maci, Farrah, Amber, and Catelynn (and the major players in their lives) all the questions they've been dying to know.\n\nSeason 5 (2015–16) [ edit ]\n\nNo. in\n\nseries No. in\n\nseason Title Original air date 59 – \"teen mom og catch up special\" March 16, 2015 ( ) Catch up with original girls who started it all and relive Catelynn, Maci, and Amber's journeys as they navigate being 16 and pregnant to the Teen Mom's they are today. 60 1 \"back and better than ever\" March 23, 2015 ( ) Cate and Tyler find out they are pregnant so Cate wants to get married. Maci struggles co-parenting with Ryan. Amber falls for Gary's flirting, but is crushed when he goes on a family vacation with his new girlfriend and Leah. 61 2 \"back to school\" March 30, 2015 ( ) Cate and Tyler plan a party to reveal the gender of their baby. Maci struggles with the fact that Bentley is starting kindergarten. Gary invites Amber to be a part of Leah's first day of kindergarten. 62 3 \"old wounds\" April 6, 2015 ( ) Tyler posts a video of Carly on their fan page which upsets Brandon and Teresa. Maci continues struggling to communicate with Ryan about co-parenting. Amber is extremely hurt by Gary because he won't let Leah spend the night. 63 4 \"new kids on the block\" April 13, 2015 ( ) Cate finds out Brandon and Teresa want to discuss adoption issues with them. Maci reveals that she and Taylor are expecting a baby. Amber is shocked to find out that Gary is having a baby with Kristina. 64 5 \"surprise surprise\" April 20, 2015 ( ) Cate and Tyler meet with Brandon and Teresa. Maci tells Ryan and his family she's having a baby with Taylor. Amber confronts Gary about his flirting. Farrah is hurt after not bring a part of the season from the beginning. 65 6 \"the f bomb\" April 27, 2015 ( ) Cate finds out she has gestational diabetes. Farrah struggles with her mom's visit. Amber reveals her relationship with her boyfriend and Maci quits the show when she finds out Farrah is back. 66 7 \"first time for everything\" May 4, 2015 ( ) Maci surprises the crew with her return to the series but has some conditions regarding Bentley. Catelynn and Tyler struggle with being first time parents. Farrah introduces Simon to her mom 67 8 \"mom vs. mom\" May 11, 2015 ( ) Amber, Farrah, Maci and Cate come together in New York to do press for the show. The tension between Farrah and the rest of the girls comes to a head when Farrah discovers that Maci had quit the series because of her 68 9 \"boiling point\" May 18, 2015 ( ) Tyler puts pressure on Cate to lose her pregnancy weight. Things boil over between Amber and Matt in Vegas. Maci worries about Bentley's safety while in Ryan's care and Debra attempts to go into business with Farrah. 69 10 \"let's face It\" May 25, 2015 ( ) Amber's family questions Matt's intentions when his past is revealed. Catelynn leaves Nova under April's care. Maci and Taylor find their dream home. Simon meets Sophia and Farrah pressures him for an engagement. 70 11 \"why can't we just get along?\" January 4, 2016 ( ) Farrah realizes her relationship with Simon is over. Amber asks Gary for joint custody while Maci invites Ryan to hang out. Tyler's dad Butch is released from prison and meets Nova for the first time. 71 12 \"playing for keeps\" January 4, 2016 ( ) Farrah asks her mom to watch Sophia for a month, Amber is blindsided when Leah doesn't want to see her and Maci doesn't want Bentley going over to Ryan's parents house every weekend. 72 13 \"party down\" January 11, 2016 ( ) Farrah gets kicked out of a Hampton's White Party. Amber struggles with Gary's new visitation schedule for Leah. Catelynn and Tyler have their bachelor/bachelorette parties while Maci is frustrated that Taylor hasn't proposed. 73 14 \"never say goodbye\" January 18, 2016 ( ) Farrah struggles with taking Sophia to visit Derek's family. Ryan is annoyed that Maci has all the control over Bentley. Catelynn deals with anxiety when Nova meets Carly. 74 15 \"the big day\" January 25, 2016 ( ) Catelynn and Tyler finally say 'I do'! Maci and Taylor buy an online t-shirt business while Amber and Matt decide to flip houses. Farrah and Debra argue when Farrah lets her know she doesn't trust her to take care of Sophia. 75 16 \"skeletons in the closet\" February 1, 2016 ( ) Farrah leaves for a month long business trip and has a last minute change of heart on who can watch Sophia while she is away. Maci and Ryan celebrate Bentleys 7th birthday together while Catelynn has post wedding blues. 76 17 \"forgive & forget\" February 8, 2016 ( ) Farah returns from her business trip and shares a life changing decision with her parents. Maci and Ryan celebrate Halloween as a family while Catelynn and Tyler go to Hawaii for their honeymoon. 77 18 \"honeymoon is over\" February 15, 2016 ( ) Simon comes back into Farrah's life and Catelynn and Tyler are concerned when Butch starts dating. Maci is overwhelmed with life and needs Taylor to step it up and Amber wants to take Leah on a trip but Gary has all the power. 78 19 \"taking chances\" February 22, 2016 ( ) Farrah and Simon decide to take their relationship to the next level. Maci is annoyed she does all the work for Taylor's t-shirt business while Ryan plans a big move. Cate learns she has postpartum depression. 79 20 \"walk away\" February 22, 2016 ( ) Maci is shocked that Ryan is stepping up as a father while Cate and Tyler celebrate Nova's first birthday but Butch and April have to be separated. Amber and Gary work out their custody battle over Leah. 80 21 \"check-up with dr. drew - part one\" June 1, 2015 ( ) Dr. Drew sits down with the cast of Teen Mom OG in front of a studio audience, and chats with Maci about her decision to pull Bentley off the show. Amber and Matt discuss their age difference. 81 22 \"check-up with dr. drew - part two\" June 8, 2015 ( ) In part two, Catelynn has an adorable surprise for Teresa, and Farrah discusses all of the drama that surrounded her return to the show.The four moms finally get serious and unpack the conflict between them.\n\nSeason 6 (2016–17) [ edit ]\n\nNo. in\n\nseries No. in\n\nseason Title Original air date 82 1 \"put a ring on It\" August 22, 2016 ( ) Amber and Gary finally settle their custody dispute over Leah. Farrah plans a move to LA, but questions her relationship with Simon. Catelynn and Tyler debate having another baby. 83 2 \"tweet tweet\" August 22, 2016 ( ) Farrah's mom confronts Simon at Sophia's 7th birthday party after he posts an old mugshot of her on social media. Amber deals with the latest rumor in the media about Matt. 84 3 \"don't panic\" August 28, 2016 ( ) Maci and Taylor find out she's further along in her unexpected pregnancy than they thought, Matt takes Amber to his hometown where she meets one of his family members. 85 4 \"animal instincts\" September 5, 2016 ( ) Maci and Taylor plan their wedding. Leah is hurt after Amber misses a visit with her. Farrah invites Simon to celebrate Easter with her family, and then kicks him out due to his lack of enthusiasm. 86 5 \"hello, goodbye\" September 12, 2016 ( ) Catelynn and Tyler have an emotional goodbye as she heads to a treatment facility for her anxiety and depression. Maci and Taylor buy a bigger house to fit their growing needs. 87 6 \"second guessing\" September 19, 2016 ( ) Maci and Taylor question their decision to have their wedding so soon, while Farrah and Simon get some relationship advice from Dr. Jenn. Catelynn is homesick so Tyler and Nova visit her at her treatment facility. Amber moves to an upscale 88 7 \"the long road home\" September 26, 2016 ( ) Maci's daughter Jayde turns one and she is worried because Ryan isn't around for Bentley. Farrah makes a big move to LA. Amber and Matt get ready for Leah to stay at their new house, and Catelynn returns from her thirty day stay at a treatment facility. 89 8 \"mother's day\" October 3, 2016 ( ) Maci and Taylor welcome their third child but still worry that Ryan isn't showing up enough for Bentley. Gary tries to co-parent with Amber. Farrah decides she's ready to move on from Simon, and Tyler attempts to be more sensitive towards Catelynn. 90 9 \"the tipping point\" October 10, 2016 ( ) Amber worries she's developed a new addiction to food. Farrah decides to open a frozen yogurt shop, while Tyler's concerned that Catelynn is falling back into her old habits. Ryan and his dad get into a huge fight that causes Maci to worry. 91 10 \"lemons into lemonade\" October 17, 2016 ( ) Amber and Gary get ready for Leah's first day of school, while Catelynn continues to struggle. Ryan takes Bentley for the weekend and the grand opening of Farrah's frozen yogurt store is made all the more interesting when Simon shows up to help. 92 11 \"surprise surprise!\" October 24, 2016 ( ) Amber and Matt attempt to put a stop to the tabloid rumors surrounding them, but are sidetracked by a visit from Matt's troubled son while Farrah deals with an employee at FroCo that's not living up to her high standards. Tyler and Catelynn celebrate Butch's first year out of prison, while Taylor and Bentley plan something special for Maci's birthday. 93 12 \"the ties that bind\" November 7, 2016 ( ) In an attempt to keep Matt's son sober, Amber and Matt invite him to move in. Farrah visits Derek's family, but quickly returns home to deal with her next business venture... and her mom. Catelynn and Tyler attempt to celebrate their first year of marriage, but are worried that they may not see Carly this year; and Maci celebrates at her bridal shower while Ryan tries to apologize to his dad. 94 13 \"ginger's last binger\" November 14, 2016 ( ) Farrah and her mother uncover old family wounds and get into a huge fight. Matt is offered the opportunity to write a book about his life, but he and Amber are distracted by the latest tabloid stories. 95 14 \"crazy gardens\" November 21, 2016 ( ) Gary reluctantly asks Amber for help with Leah when Kristina has a family emergency. Maci gets to know Ryan's new girlfriend better, while Catelynn and Tyler discover they're still not ready to move into their new home. 96 15 \"ask the moms (vol.2)\" November 21, 2016 ( ) Hosted by Nessa, a fun-filled show in which Maci, Amber, and Catelynn engage with fans to answer all the questions they've been burning to ask. 97 16 \"i do!\" November 28, 2016 ( ) Amber undergoes plastic surgery in an attempt to relieve her depression and negative self image issues, while Farrah and her mom try to reconcile their differences after an awkward encounter with Debra's boyfriend. 98 17 \"check-up with dr. drew - part one\" November 28, 2016 ( ) In Part 1 of the \"Teen Mom OG\" Finale Special, Dr. Drew talks to Catelynn about her battle with depression and anxiety, and when Amber gets upset over her battles with Farrah and Gary, she threatens to quit the show. 99 18 \"100 things about teen mom og\" December 4, 2016 ( ) The cast of Teen Mom OG lists 100 fun facts about the hit MTV series. 100 19 \"check-up with dr. drew - part two\" December 5, 2016 ( ) In Part 2 of the \"Teen Mom OG\" Finale Special, Dr. Drew discusses Maci's marriage and new baby, Amber storms the stage when Farrah insults Matt, and the moms band together to do something Dr. Drew never expected. 101 20 \"teen mom og: unseen moments\" December 12, 2016 ( ) Maci, Catelynn, and Amber join Nessa to react to a collection of hilarious and touching never-before-seen clips from \"Teen Mom OG.\" 102 – \"teen mom og season 6b catch up special\" April 10, 2017 ( ) Catch up on all you need to know about Maci, Catelynn, Farrah and Amber plus see a sneak peek of the new season. 103 21 \"a fresh start\" April 17, 2017 ( ) Maci and Ryan try to coordinate trick or treating with Bentley. Amber is excited about her new business venture, but is let down when Gary doesn't let Leah stay with her on a school night. 104 22 \"hello again world!\" April 24, 2017 ( ) Tyler's less optimistic than usual when his dad is once again released from prison. Farrah and Simon consider the status of their relationship. Maci throws Bentley a birthday party. 105 23 \"lil' starburst\" May 1, 2017 ( ) Catelynn and Tyler celebrate Nova's birthday and consider having another baby, while Farrah makes a big decision about her and Sophia's future. Amber works with Gary to throw Leah a birthday party. 106 24 \"blue christmas\" May 7, 2017 ( ) Amber continues to be frustrated that she doesn't have Leah as much as she wants, while Ryan's girlfriend encourages him to communicate more with Maci about Bentley's schedule. Cate surprises Tyler with a winter getaway. 107 25 \"let's try to get along\" May 8, 2017 ( ) Maci confides in Ryan's fiance Mackenzie about her co-parenting issues while Amber plans a fashion show to promote her online boutique. Catelynn and Tyler come to terms with their different parenting styles. 108 26 \"the forever knot\" May 15, 2017 ( ) Tyler decides to be more optimistic about Butch's recovery while Farrah questions her mom's relationship with her fiance. Ryan's family finds out that Maci doesn't want Bentley going over to Jen and Larry's house and Amber has doubts about marrying Matt. 109 27 \"viva las vegas\" May 22, 2017 ( ) Maci is worried about Ryan's extracurricular activities while Catelynn and Tyler start an online children's boutique. Farrah works on her relationship with her mom through hypnotherapy while Amber and Matt almost elope in Vegas. 110 28 \"making waves\" May 29, 2017 ( ) Amber, Maci, Catelynn and their significant others travel to Puerto Rico and Maci struggles with wanting to help Ryan overcome his issues. Farrah is invited to speak about her three businesses at SXSW. 111 29 \"love in la la land\" June 5, 2017 ( ) Maci and Taylor work on their marriage in counseling while Farrah goes on a date with Asaf whom she picked on the aftershow. Gary asks Amber to help him surprise Leah with a new house. 112 30 \"friday the thirteenth\" June 12, 2017 ( ) Catelynn and Tyler sign Nova up for daycare while Maci throws a surprise birthday party for Taylor. Simon gets hypnotized to get over Farrah while Amber and Matt lock their wedding venue. The girls travel to New York. 113 31 \"we are family\" June 19, 2017 ( ) Amber celebrates Easter with Gary but then is disappointed when another cheating scandal comes out about Matt. Catelynn and Tyler find their dream home while Farrah makes an effort to get to know her mom's fiance. 114 32 \"teen mom og: unseen moments\" June 19, 2017 ( ) Join Amber, Catelynn, Maci, and Farrah as they watch a collection of never-before-seen clips from this season of \"Teen Mom OG.\" 115 33 \"truth be told\" June 26, 2017 ( ) While on a family vacation in Key West, Farrah and her mom's fiance David argue over their lack of respect for each other. Catelynn and Tyler's offer on their dream home is accepted. Maci tries to confront Ryan. 116 34 \"check-up with dr. drew - part one\" July 3, 2017 ( ) In Part 1 of the \"Teen Mom OG Finale Special,\" Amber lashes out about her troubled relationship with Matt, and Maci faces some harsh truths about Ryan's drug use. 117 35 \"ask the moms\" July 10, 2017 ( ) Catelynn, Maci, and Amber get real - and real emotional - when answering fan questions about the show and their lives off-screen. 118 36 \"check-up with dr. drew - part two\" July 10, 2017 ( ) In Part 2 of the \"Teen Mom OG Finale Special,\" Farrah explains her dislike for her mom's fiance, and Catelynn opens up about how she and Tyler have dealt with Butch's relapse.\n\nSeason 7 (2017–18) [ edit ]\n\nNo. in\n\nseries No. in\n\nseason Title Original air date 119 1 \"Icing on the Cake of Lies\" November 27, 2017 ( ) Amber loses her cool with Ryan's wife. Maci wants Ryan to complete rehab or she'll keep Bentley away. Catelynn worries about Tyler's dad Butch since he's off parole. Farrah celebrates her birthday in New York, while Amber calls off their engagement. 120 2 \"This Is Gonna End Badly\" December 4, 2017 ( ) Amber leans on her family while she figures out what to do about Matt. Ryan completes rehab early and demands to see Bentley. Catelynn worries if she gets pregnant again she'll have postpartum depression. Farrah looks for a home in Los Angeles. 121 3 \"Too Shady\" December 4, 2017 ( ) Farrah goes to Las Vegas for a girls trip and her ex-boyfriend Simon shows up. Catelynn and Tyler hurry to get everything ready for the launch of their children's clothing line. Maci lets Bentley see Ryan on Father's Day, while Amber kicks Matt out. 122 4 \"System Overload\" December 11, 2017 ( ) Maci wants Ryan to pass a drug test before he can see Bentley. Farrah travels abroad for work and leaves Sophia in Michael's care. Catelynn and Tyler launch their kids clothing line but run into issues. Amber and Matt try to save their relationship. 123 5 \"High Hopes\" December 18, 2017 ( ) Farrah plans a family trip to Italy. Bentley starts third grade and Maci is still determined to keep him away from Ryan until he passes a drug test. Amber is depressed after breaking up with Matt. Catelynn and Tyler finally get a date to visit Carly. 124 6 \"What a Ride\" January 1, 2018 ( ) Amber is completely done with Matt and starts dating a new guy. Farrah visits Omaha and Sophia expresses her dislike for Deb's fiancé, David. Taylor surprises Maci and takes her skydiving. Catelynn and Tyler finally get to see Carly. 125 7 \"Runways, Rehab, and Retail\" January 8, 2018 ( ) Amber and Catelynn unite at MTV's Video Music Awards. Tyler struggles with Butch's drug use. Farrah and Sophia model at NY fashion week. Maci and Taylor get an office for their business. Ryan is clean but Mackenzie still worries he may relapse. 126 8 \"Oh Baby!\" January 15, 2018 ( ) Catelynn removes her birth control and doesn't tell Tyler. Farrah goes on a family vacation to Italy. Ryan and Mackenzie have a joint bachelor and bachelorette party. Maci learns Taylor is not invited to the wedding. Amber finds out she is pregnant. 127 9 \"Let's Try Again\" January 22, 2018 ( ) Farrah helps Michael plan his proposal. Catelynn freaks out at a photo shoot and Tyler is overwhelmed with renovations and launching the fall line. Maci and Taylor celebrate their one-year wedding anniversary. Amber is excited about her pregnancy. 128 10 \"Fertile Myrtle\" January 29, 2018 ( ) Amber shocks her whole family when she reveals she's pregnant. Bentley turns 9 and Maci allows him to spend time with Ryan. Deb tries to persuade Sophia to go to her wedding. Catelynn secretly removed her IUD and has a big surprise for Tyler. 129 11 \"Unconfuse Your Brain\" February 12, 2018 ( ) Amber and Andrew have a disagreement. Ryan is furious at Maci when she shows up late to trick-or-treat. Farrah is shocked when she finds out who Deb invited to her wedding. Catelynn surprises her family with her pregnancy. 130 12 \"Something Blue\" February 19, 2018 ( ) Amber has big news for Leah. Farrah gets vaginal rejuvenation and lashes out at her producer. Catelynn spends quality time with Nova while Tyler gets emotional dropping Butch off at rehab. Maci and Taylor attend Ryan and Mackenzie's wedding. 131 13 \"I'm Beautiful, I'm Smart, I'm Strong\" February 26, 2018 ( ) Amber spends quality time with Leah while Gary gets a paternity test to find out if Jody is his father. Maci meets with a doctor to find new ways to manage her Polycystic Ovary Syndrome. Executive Producer Morgan heads to Austin to see Farrah. 132 14 \"Choose Your Path\" March 12, 2018 ( ) Tyler has a hard time running his business and taking care of Nova by himself. Maci trains to participate on another show. Amber starts preparing the nursery while Gary gets the paternity test results. Executive Producer Morgan speaks with Farrah. Last Appearances of: Farrah and Sophia 133 15 \"Keep Chugging Away\" March 19, 2018 ( ) Amber takes Leah on vacation to Florida. Taylor takes Bentley on a boys trip to Jacksonville to visit their new clothing warehouse. Mackenzie enrolls in college and talks about kids with Ryan. Tyler and Nova visit Catelynn at her treatment facility. 134 16 \"Friends In Need\" March 26, 2018 ( ) Amber is angry at Gary and Kristina for saying she is a bad mother. Tyler struggles to keep their clothing business up and running while dealing with his dad and wife being in rehab. Maci visits Catelynn at her treatment facility. 135 17 \"Time Will Tell\" April 2, 2018 ( ) Maci and Taylor meet with an adoption counselor. Tyler and his sister Amber have an emotional reunion with their dad Butch when they visit him in rehab. Amber gives her cousin Krystal advice about co-parenting while Mackenzie and Ryan have big news. 136 18 \"One Life To Live\" April 9, 2018 ( ) Maci finds out from Bentley that Ryan and Mackenzie are expecting a baby. Amber is hurt when Leah chooses to sleepover at a friends house instead of spending time with her. Catelynn returns home but quickly admits herself again. 137 19 \"check-up with dr. drew - part one\" April 16, 2018 ( ) Dr. Drew sits down with Maci, Catelynn, Amber, Farrah and their families for an uncensored discussion about all the biggest moments from this season of Teen Mom OG. 138 20 \"check-up with dr. drew - part two\" April 23, 2018 ( ) Dr. Drew continues his discussion with Maci, Catelynn, Amber, and for the last time Farrah, to break down the biggest season of Teen Mom OG yet. 139 21 \"teen mom og: unseen moments\" April 30, 2018 ( ) Nessa joins the mothers – and for the first time ever, the fathers – of Teen Mom OG to watch never-before-seen moments from Season 7. 140 22 \"Welcome to the Family\" October 1, 2018 ( ) Bristol and Cheyenne join the Teen Mom family, Maci and Taylor deal with Ryan's threats, Tyler cares for Nova while Catelynn's in rehab, and Amber gives birth to a baby boy. 141 23 \"unconditional love\" October 8, 2018 ( ) Maci has an uncomfortable custody handoff with Ryan’s mom, Cheyenne’s father finds out she’s living with Zach, and Dakota feels emotionally alienated from Bristol. 142 24 \"suns out, buns out\" October 15, 2018 ( ) Cheyenne causes a scene, Catelynn and Tyler visit Dr. Oz, Bristol moves forward with her divorce, Maci shares her story in Washington, D.C., and Amber travels to L.A. 143 25 \"making amends\" October 22, 2018 ( ) Bristol lets Tripp go to Alaska with Levi, Tyler visits his dad in rebab, Gary and Kristina take Leah to visit Amber in L.A., and Maci finds out that Ryan got arrested. 144 26 \"mama bear\" October 29, 2018 ( ) Cheyenne worries about Ryder's health condition, Tyler and Catelynn pick up the pieces after his sister checks in to rehab, and Bristol struggles to co-parent with Dakota. 145 27 \"back to square one\" November 5, 2018 ( ) Catelynn and Tyler celebrate Carly's birthday from afar, Bristol fights with Dakota after her family's stalker breaks into his home, and Cheyenne gets back together with Zach. 146 28 \"new g's meet the old g's\" November 12, 2018 ( ) As the moms finally get to know one another and put their nervousness to rest, Gary starts to lose hope in finding his biological dad, and Tyler refuses to forgive his sister. 147 29 \"roll with the punches\" November 19, 2018 ( ) Cheyenne struggles to see eye to eye with Zach, Andrew urges Amber to step into the ring for a charity boxing event, and Bristol makes co-parenting strides with Tripp’s dad. 148 30 \"i choose you\" November 26, 2018 ( ) Catelynn and Tyler find out they're expecting another baby, Cheyenne visits Cory's family in Michigan, and Maci and Taylor move into a new home. 149 31 \"modern families\" December 3, 2018 ( ) Maci tries to improve relations with her ex for their kids’ sake, Bristol grows concerned about Tripp and Dakota’s relationship, and Cheyenne and Cory become godparents. 150 32 \"mixed feelings\" December 10, 2018 ( ) Catelynn worries her separation from Tyler could lead to divorce, Cory gets jealous of Cheyenne’s ex during her birthday party, and Maci’s daughter needs surgery. 151 33 \"eye to eye\" December 17, 2018 ( ) Catelynn visits Amber as her separation from Tyler approaches, Bristol gets advice from a PTSD counselor, Cheyenne and Cory get closer, and Maci meets with Ryan's parents. 152 34 \"reunion, pt. 1\" December 24, 2018 ( ) Maci, Catelynn, Amber, Bristol and Cheyenne sit down with Nessa and Dr. Drew for an uncensored discussion about all the biggest moments from this season of Teen Mom OG. 153 35 \"reunion, pt. 2\" December 31, 2018 ( ) Maci, Catelynn, Amber, Bristol and Cheyenne sit down with Nessa and Dr. Drew for an uncensored discussion about all the biggest moments from this season of Teen Mom OG.\n\nSpecials [ edit ]\n\nTitle Original air date \"teen dads\" September 18, 2011 ( ) Hosted by Dr. Drew, for the first time the dads of Teen Mom and Teen Mom 2 come together to discuss the ups and downs, the challenges, the hilarious moments, and the biggest mistakes they've made since becoming young fathers. \"being maci\" August 18, 2013 ( ) Maci's life after Teen Mom: Maci gets some time to hang out while Ryan watches Bentley. But when Ryan's girlfriend goes out of town, the former couple find themselves hanging out together for the first time since their breakup. \"being farrah\" February 23, 2014 ( ) Since appearing on Teen Mom, Farrah shocked the world with a sex tape and multiple plastic surgeries. Farrah is forced to confront those choices head on when her mom Debra comes to visit her and her daughter, Sophia. \"being catelynn\" February 23, 2014 ( ) It's been two years since Teen Mom wrapped and Catelynn continues to struggle with the reality of having chosen adoption for her daughter Carly and now questions whether her and Tyler will ever get married. \"being amber\" February 23, 2014 ( ) Two years ago, Amber went from being the bad girl of Teen Mom, to a prison inmate. After being locked up for a year and a half, we see Amber reconnect with her daughter, deal with her past, and cope with the outside world \"being dad\" June 8, 2014 ( ) Jo and Vee are dealing with the idea of marriage. Corey balance co-parenting with Leah and his relationship with his wife Miranda. Ryan finally feels ready to move out on his own but his son Bentley is worried. \"getting to know catelynn\" February 21, 2015 ( ) Catelynn and Tyler decided to place their baby up for a adoption and the cameras have been documenting their journey ever since. On this one hour special, they relive those raw, emotional moments and everything that followed. \"getting to know amber\" February 21, 2015 ( ) In this one hour special, Amber and Gary take a look back at the six years MTV has documented their lives. They discuss her drug addiction, why she made the choice to go to jail, and if she will ever get custody of Leah again. \"getting to know maci\" February 21, 2015 ( ) In a special one-hour episode, Maci and her friends revisit the past six years of Maci's life and watch highlights from 16 and Pregnant and Teen Mom while discussing the difficulty of growing up in front of an audience. \"getting to know farrah\" February 21, 2015 ( ) Farrah's family, friends, and producers come together to divulge their real feelings about Farrah's involvement in the adult entertainment industry and discuss the hardships following Sophia's dad's death. \"behind the cameras\" December 28, 2015 ( ) For the first time ever, Maci, Farrah, Cate and Amber show us what it's like to shoot Teen Mom. They share personal home videos and we see just how close they are with their crew. Nothing is left on the cutting room floor. \"check-up with dr. drew - part one\" February 29, 2016 ( ) The girls and families reunite with Dr. Drew. In this part one, Maci and Farrah dig deeper into their journey, exploring Maci's relationship with Ryan and Farrah's romance with Simon and fiery final moment. \"check-up with dr. drew - part two\" March 7, 2016 ( ) In part two, Catelynn breaks down over her depression and Tyler and Butch open up about their individual childhoods. Amber and Matt confront Gary over exposing Matt's numerous child support cases. \"teen mom og: unseen moments\" March 14, 2016 ( ) Nessa and the girls take a look at never-before-seen footage and share stories that never made it to air. \"being butch\" July 18, 2016 ( ) After Butch is released from prison, memories and forgiveness bring Tyler and Butch to a new closeness that changes their lives. Butch finds himself in a happy relationship and makes steps towards getting engaged. \"being the edwards\" February 8, 2017 ( ) Larry and Jen have helped Ryan care for his son Bentley for 8 years, but a fight between Ryan and Larry nearly broke their family apart.The Edwards family is determined to build a strong foundation of support and understanding. \"being debra\" February 15, 2017 ( ) Newly engaged Debra is head over heels in love with fiancé David, but her relationship with daughter Farrah is still rocky. Debra starts her own record label and comes up with a plan to unite her family through song. \"being matt\" April 10, 2017 ( ) Before marrying fiance Amber, Matt comes face-to-face with the consequences of his addiction when he invites his two youngest kids to visit and meet their older half-brother for the first time. \"being simon\" October 11, 2017 ( ) Farrah's ex-boyfriend, Simon, is busy juggling his real estate career, friends, and nightlife. But now he wants to partner up with Farrah and flip houses. After a trip to the bay area, Farrah gets to know Simon's Indian culture and spark fly..again. \"that's a wrap 2017\" December 25, 2017 ( ) You're invited to the party of the year with the casts of Teen Mom OG and Teen Mom 2! Join them in a swanky LA loft for a night of games, gossip, and fun as they celebrate 2017 and look ahead to 2018. \"being gary\" February 18, 2018 ( ) To celebrate Leah's 9th birthday, Gary plans a trip to Florida with his family and hopes to fix his difficult relationship with his mom, Carol. Meanwhile, his parents recently started dating each other again and a proposal is in the works. \"Law and Disorder\" September 17, 2018 ( ) The true story behind every arrest and fight in “Teen Mom” history.\n\nReception [ edit ]\n\nIn 2016, a New York Times study of the 50 TV shows with the most Facebook Likes found that Teen Mom was \"most popular in rural Kentucky and least popular in New York City. As with 16 and Pregnant, it's much more popular among women — 94 percent of 'likes' come from women, second only to Pretty Little Liars\".[24]\n\nRatings [ edit ]\n\nThe pilot episode was the network's highest-rated premiere in over a year, with 2.1 million total viewers;[25] the record was surpassed by the controversial series Skins, which had 3.26 million viewers. The first-season finale brought in 3.6 million viewers.[26] The second-season finale pulled in over 5.6 million viewers.[26]", "images": ["https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Teen_Mom", "title": "Wikipedia", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.13", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}