{"url": "https://www.inquisitr.com/4411111/dwts-peta-murgatroyd-maksim-chmerkovskiy-son-shai-pulled-hair-out/", "text": "Peta Murgatroyd is revealing the naughty thing her and husband Maksim Chmerkovskiy’s 7-month-old son did that left her in tears.\n\nThe Dancing with the Stars pro opened up about their son Shai in a recent interview and revealed that he’s already getting pretty “feisty” and “cheeky” when it comes to his behavior, not too unlike his dad.\n\n“He ripped out a clump of my hair right here,” Peta told E! News, admitting that the incident caused “a little tear” to roll her cheek.\n\nHowever, Murgatroyd kept cool and composed and explained to the site that she calmly told her firstborn, who she and her husband welcomed into the world on January 4, that “mama’s hurt.”\n\nBut grabbing chunks of his mom’s hair isn’t the only way little Shai has been expressing himself. Peta revealed that the youngster is also asserting himself when it comes to his food habits.\n\n“He’ll grab the food bowl [and] throw it wherever he can,” she said. “He’s very cheeky right now.”\n\nMurgatroyd’s latest confessions about her and Chmerkovskiy’s bundle of joy comes shortly after she revealed that he’s already getting very strong and pulling himself up, while the youngster is also starting to get two teeth coming through.\n\n[Image by John Sciulli/Getty Images for Caruso Affiliated]\n\n“We have some nights of screaming at the moment with the pain,” the Dancing with the Stars professional told Extra of how she’s having sleepless nights with her baby as he starts teething. “You just get up as soon as you hear anything… mommy mode just kicks in and you just get straight up.”\n\nBut while it sounds like Shai certainly isn’t afraid to express himself, Maksim revealed last week that he could soon be taking all that feistiness and channeling it into dancing just like his parents.\n\nChmerkovskiy shared a video of his son getting his very first dance lesson from his brother Val Chmerkovskiy, who also appears on Dancing with the Stars alongside Maksim and Peta, to Instagram.\n\n[Image by Michael Buckner/Getty Images for Entertainment Weekly]\n\nThe adorable video, which has since gone viral, shows the brothers spending some quality time with little Shai as Maks holds him in his arms while Val wiggled his hands to make him dance.\n\nThe youngster could be seen grooving and giggling while enjoying a dance break with his dad and his uncle while Maksim joked in the caption that his son has most definitely inherited his parents dancing genes.\n\n“DNA. Something about some fruit and some trees,” he captioned the sweet clip.\n\nAs for what’s next for Peta and Maksim, Murgatroyd admitted earlier this week that there’s a chance she and her husband may not head back into the ballroom for Dancing with the Stars Season 25 this coming September.\n\nShe revealed that the two haven’t yet signed on the dotted line for the new round of shows next month and may instead take the season off to spend more time with their son.\n\nWhat do you think of Peta Murgatroyd revelations about her and Maksim Chmerkovskiy’s 7-month-old son?\n\n[Featured Image by Monica Schipper/Getty Images]", "images": ["https://www.inquisitr.com/wp-content/uploads/2019/07/Rita-Ora-3-300x170.jpg", "https://cdn.inquisitr.com/assets/ee54ce/dist/images/logos/favicon.png", "https://cdn.inquisitr.com/wp-content/uploads/2017/08/Peta-Murgatroyd-Says-Her-Maksim-Chmerkovskiys-Son-Pulled-Her-Hair-Out.jpg", "https://secure.gravatar.com/avatar/04740ca59ff3a7ed6178872d42206b16?s=250&d=mm&r=g", "https://www.facebook.com/tr?id=1472001486461948&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=478801082325642&ev=PageView&noscript=1", "https://cdn.inquisitr.com/wp-content/uploads/2017/08/Peta-Murgatroyd-says-her-and-DWTS-star-Maksim-Chmerkovskiys-son-is-naughty.jpg", "https://cdn.inquisitr.com/assets/ee54ce/dist/images/logos/logo_header_no_tagline.png", "https://cdn.inquisitr.com/wp-content/uploads/2017/08/Peta-Murgatroyd-opens-up-about-her-Maksim-Chmerkovskiys-son-Shai.jpg"], "top_img": "https://cdn.inquisitr.com/assets/ee54ce/dist/images/logos/favicon.png", "keywords": [], "authors": ["Emily Hutchinson"], "canonical_link": "https://www.inquisitr.com/4411111/dwts-peta-murgatroyd-maksim-chmerkovskiy-son-shai-pulled-hair-out/", "title": "‘DWTS’ Star Peta Murgatroyd Says Her & Maksim Chmerkovskiy’s Son Pulled Her Hair Out", "meta_data": {"msapplication-TileImage": "//cdn.inquisitr.com/assets/ee54ce/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "https://www.inquisitr.com", "summary": ""}