{"url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/12/21/can-the-the-voice-winner-chloe-kohanski-be-the-shows-first-real-superstar/", "text": "\n\nChloe Kohanski with her coach, Blake Shelton, after “The Voice” Season 13 finale. (Tyler Golden/NBC)\n\nAll celebrity coaches on NBC’s “The Voice” brag about the potential of their contestants, and Blake Shelton was no different after his team member, 23-year-old Nashville rocker Chloe Kohanski, was crowned the winner of Season 13 this week.\n\nBut backstage with reporters after the show on Tuesday night, Shelton made a big claim: “I truly think Chloe can go on from here and become really the first superstar,” he said.\n\n[‘The Voice’ finale: How Chloe Kohanski won despite a big mistake by Miley Cyrus]\n\nThen Shelton quickly walked back his pronouncement a bit, saying that Kohanski could be “the first star that we’ve had come out of this show that can have some hit songs.”\n\n“I do think you can be a superstar,” he added, according to a transcript from Hollywood Life. “But I’m trying not to hex this thing.”\n\nShelton’s hesitation makes sense. “The Voice” winners have notably had some issues becoming real-life music stars once the show ends and their recording contracts kick in. Some winners, such as Cassadee Pope, Jordan Smith and Danielle Bradbery, launched successful singles and albums. Others, such as Alisan Porter and Craig Wayne Boyd, parted ways with the label without releasing a record.\n\nIn the past, Adam Levine has blamed the record labels. After a contestant wins, they’re assigned to a label within Universal Music Group, and executives take it from there. Levine complained in an expletive-filled interview with Howard Stern that “no one knows what they’re doing” on the label side, which is frustrating when the show and coaches boost them so much on national television.\n\nIn a recent HuffPost piece about the trajectory of “Voice” winners, executive producer Audrey Morrissey echoed the same idea, in a much gentler way.\n\n“There is choice amongst the label what they do with them, but we, as a television show, once they won, we’re not necessarily personally involved in their careers,” Morrissey said. “We do everything in our power to prop them up, as we can, but that’s when it flips over to, really, the music business.”\n\nKohanski is leaving “The Voice” with as much momentum as one could hope for, with a string of Top 10 iTunes singles from the show and a loyal fan base that connected to her unique, psychedelic rock-inspired sound. She also has Nashville superstar Shelton as a mentor and a fan: “It would change music if she could get on the radio,” he said Tuesday. Although Shelton’s country colleagues might not necessarily help with her psych rock dreams, he’s still very well connected in the city where Kohanski lives — and, until her appearance on “The Voice,” worked in a coffee shop as a struggling musician.\n\nNow we wait and see if Kohanski breaks “The Voice” no-superstar curse. Either way, the show’s ratings are stellar, as it still averages about 10 million viewers per episode. But with “American Idol” coming back to ABC in March and threatening to steal some of the reality singing competition spotlight, it wouldn’t hurt the show to earn some credibility and break a huge artist.\n\n“The record company just needs to give her the platform. If they can really do that it’s going to be easy,” Shelton said after the finale, according to USA Today. “If we can’t follow through with this thing, then WTF?”\n\nRead more:\n\nAdam Levine slams record labels for mismanaging ‘The Voice’ winners\n\nA former contestant from ‘The Voice’ spills how the singing show really operates\n\n‘The Voice’ launched Danielle Bradbery’s music career. But then she had to find her own path.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=3005617&cv=2.0&cj=1", "https://www.washingtonpost.com/resizer/yAFxThroW-CI5t-yu8Q6FsF7kHI=/1x1/www.washingtonpost.com/pb/resources/img/spacer.gif", "https://www.washingtonpost.com/resizer/nEJDONy2yFxi24u1eS3X-tWeI84=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/2Z33ZXYQBQ56LPH5K3GPD7IKCA.jpg", "https://me.effectivemeasure.net/em_image", "https://www.washingtonpost.com/resizer/e-KSJ0LA3-UIzm0g0N6ZfhDQqHQ=/1024x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/DKGQHS7CZA75DLCHFLWCZZ5XCQ.jpg"], "top_img": "https://www.washingtonpost.com/resizer/nEJDONy2yFxi24u1eS3X-tWeI84=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/2Z33ZXYQBQ56LPH5K3GPD7IKCA.jpg", "keywords": [], "authors": ["Emily Yahr", "Style Reporter Covering Pop Culture", "December", "Emily Yahr Is An Entertainment Reporter For The Washington Post. She Joined The Post In", "Has Previously Written For The Boston Globe", "Usa Today", "The Lexington", "Ky.", "Herald-Leader", "The American Journalism Review."], "canonical_link": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/12/21/can-the-the-voice-winner-chloe-kohanski-be-the-shows-first-real-superstar/", "title": "Can the ‘The Voice’ winner Chloe Kohanski be the show’s first real ‘superstar’?", "meta_data": {"object-hash": 1519604563, "viewport": "width=device-width, initial-scale=1.0, user-scalable=yes, minimum-scale=0.5, maximum-scale=2.0", "referrer": "unsafe-url", "keywords": "the voice winner, chloe kohanski voice, the voice finale, who won the voice, blake shelton chloe kohanski, who is chloe kohanski, the voice season 13 winner, chloe kohanski songs", "news_keywords": "the voice winner, chloe kohanski voice, the voice finale, who won the voice, blake shelton chloe kohanski, who is chloe kohanski, the voice season 13 winner, chloe kohanski songs", "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "creator": "@emilyyahr"}, "og": {"type": "article", "site_name": "Washington Post", "url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/12/21/can-the-the-voice-winner-chloe-kohanski-be-the-shows-first-real-superstar/", "image": "https://www.washingtonpost.com/resizer/nEJDONy2yFxi24u1eS3X-tWeI84=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/2Z33ZXYQBQ56LPH5K3GPD7IKCA.jpg", "title": "Can the ‘The Voice’ winner Chloe Kohanski be the show’s first real ‘superstar’?", "description": "Coach Blake Shelton believes it's possible — but the show has yet to break a major mainstream artist."}, "article": {"publisher": "https://www.facebook.com/washingtonpost", "content_tier": "metered", "author": "https://www.facebook.com/emily.yahr"}, "fb": {"app_id": 41245586762, "admins": 500835072}, "zeusAds": "true", "description": "Coach Blake Shelton believes it's possible — but the show has yet to break a major mainstream artist.", "robots": "index,follow", "theme": "normal", "author": "https://www.facebook.com/emily.yahr"}, "movies": [], "publish_date": 1513832400.0, "source": "https://www.washingtonpost.com", "summary": ""}