{"url": "https://www.hollywoodreporter.com/news/how-e-is-remaking-peoples-choice-awards-2018-1156622", "text": "Brass at the cable giant hope a cross-portfolio push will bring an optimistic finish to an inarguably rough year for televised kudos.\n\nAwards shows may still be among TV’s surest bets to lure a live audience, but fraught licensing negotiations and flagging ratings are dulling the sheen. A unique solution to those problems, however, is to skip the middleman altogether and buy one at a fire sale.\n\nThat’s what E! did in April of 2017, when Proctor & Gamble unloaded the People’s Choice Awards with the last of its TV properties. The 43-year-old populist celebration debuts at its new network with a new owner (NBCUniversal) on Nov. 11. Brass at the cable giant hope the unconventional move (and a cross-portfolio push) will bring an optimistic finish to an inarguably rough year for televised kudos.\n\n“There wasn’t a year that went by that someone didn’t come in with a pitch for an original awards show,” says E! president Adam Stotsky, who long sought a tentpole event for his brand synonymous with red carpet coverage. “And when the rights for some of the smaller shows came up, it never made sense.”\n\nNBCUniversal’s purchase, which is said to have set the company back a modest $8 million to $10 million, gives E! freedom to change the show to suit the celebrity-centric outlet without losing any of the built-in brand recognition. This year's event will be produced by Wilshire Studios and Den of Thieves with exec producers Jesse Ignjatovic and Evan Prager. (For its final five years on CBS, the show averaged 8.2 million viewers and a 1.9 rating among adults 18-49 — numbers any cable network would salivate over.)\n\n“This show fits in perfectly with what [NBCUniversal CEO] Steve Burke says about owning not renting,” says network EP of live events Jen Neal. Also E!'s executive vp marketing, Neal points to the social footprint of nominees as a major assist in getting the word out. Deadpool star Ryan Reynolds, The Avengers’ Chris Hemsworth and resident E! shills the Kardashians have been among the more vocal promoters thus far.\n\nTo be sure, 2018 has not been pretty for glitzy Hollywood telecasts. The main shows (the Emmys, Oscars, Globes and Grammys) lost a combined 15 million viewers from their year-ago telecasts. Concerns over that downward trajectory stalled deal renewals for both the Globes at NBC and the Emmys with the Big Four. NBCUniversal anticipates a calendar shift for People’s Choice, which traditionally aired in the middle of awards season, might help buck that trend — as could the decision to air it simultaneously on sister networks Syfy, USA, Bravo and NBC Universo, in addition to E!'s 160 international territories.\n\nAt least four marquee advertisers have been secured since the parent company's decision to make the show a point of emphasis during its Rockefeller Center pitch to media buyers in May. And, even if it's a flop, the fact that NBCUniversal now owns People's Choice in perpetuity offers a rare cushion in the awards space.\n\n“We’ve built a huge business out of filming people walking through a parking lot, but we’ve never gone in the building,” adds Stotsky. “This is already a win for us.”\n\nThis story appears in the Oct. 30 issue of The Hollywood Reporter magazine. To receive the magazine, click here to subscribe.", "images": ["http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/2018/10/e_peoples_choice_awards_-_h_-_2018.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/landscape_928x523/2018/10/e_peoples_choice_awards_-_h_-_2018.jpg", "https://assets.hollywoodreporter.com/assets/1562102990/images/brand/thr-logo-white.svg?a0259e7bd063a50286c0", "https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/08/mikey_headshot_small.jpg"], "top_img": "https://cdn1.thr.com/sites/default/files/2018/10/e_peoples_choice_awards_-_h_-_2018.jpg", "keywords": [], "authors": ["Michael O'Connell", "Michael.Oconnell Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/news/how-e-is-remaking-peoples-choice-awards-2018-1156622", "title": "How E! Is Remaking the People's Choice Awards for 2018", "meta_data": {"viewport": "width=device-width", "description": "NBCUniversal’s purchase, which is said to have set the company back a modest $8 to $10 million, gives E! freedom to change the show to suit the celebrity-centric outlet without losing any of the built-in brand recognition.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/news/how-e-is-remaking-peoples-choice-awards-2018-1156622", "domain": "https://www.hollywoodreporter.com/", "title": "How E! Is Remaking the People's Choice Awards for 2018", "description": "Brass at the cable giant hope a cross-portfolio push will bring an optimistic finish to an inarguably rough year for televised kudos.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2018/10/e_peoples_choice_awards_-_h_-_2018.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "How E! Is Remaking the People's Choice Awards for 2018", "description": "Brass at the cable giant hope a cross-portfolio push will bring an optimistic finish to an inarguably rough year for televised kudos.", "url": "https://www.hollywoodreporter.com/news/how-e-is-remaking-peoples-choice-awards-2018-1156622", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2018/10/e_peoples_choice_awards_-_h_-_2018.jpg", "width": 1296, "height": 729, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "How E! Is Remaking the People's Choice Awards for 2018", "sailthru.description": "Brass at the cable giant hope a cross-portfolio push will bring an optimistic finish to an inarguably rough year for televised kudos.", "sailthru.author": "Michael O'Connell", "sailthru.vertical": "Television", "sailthru.date": "2018-10-31 07:00:00", "sailthru.tags": "Television"}, "movies": [], "publish_date": 1540983600.0, "source": "https://www.hollywoodreporter.com", "summary": ""}