{"url": "www.washingtonpost.com/news/arts-and-entertainment/wp/2018/02/02/kylie-jenners-mystery-pregnancy-might-be-the-most-confusing-kardashian-situation-ever/", "text": "\n\nKylie Jenner attends the 2015 Billboard Music Awards at the MGM Grand Garden Arena in Las Vegas. (Robyn Beck/AFP/Getty Images)\n\nHere are a selection of headlines People.com has posted over the past few days:\n\nPregnant Kylie Jenner Wants an ‘Easy Birth’, Says Source: She’s ‘Open to Pain Medicine’\n\nPregnant Kylie Jenner ‘Hasn’t Hired a Nanny’: She’s ‘Worried About New People Around the Baby’\n\nPregnant Kylie Jenner Has a Baby Name Picked Out for Her Daughter\n\nPregnant Kylie Jenner. Pregnant Kylie Jenner. Pregnant Kylie Jenner. Yet — Kylie Jenner, 20, has not actually confirmed she is pregnant.\n\nFor some celebrities, this would not be a big deal — some stars get pregnant and do not say a word, even as “sources” and “insiders” dish to the tabloids, as illustrated above. For someone in the Kardashian-Jenner family, this is especially confusing.\n\nAfter all, these family members have become international superstars because they share nearly every detail of their lives, even the painful or uncomfortable moments. As a result, people have become inexplicably fascinated by all of them (Kris Jenner, Caitlyn Jenner, Kim Kardashian West, Kourtney Kardashian, Khloe Kardashian and Rob Kardashian), which has fueled their multimillion-dollar franchise of reality shows and sponsorships.\n\nSo the decision to keep Kylie’s apparent pregnancy under wraps is very off-brand for the family. This month, speculation will probably hit even more of a fever pitch, as February is the oft-reported due date for her baby, reportedly a girl.\n\nThe non-confirmation of the news — reported by the tabloids in September and described as a “happy” surprise for Kylie and her boyfriend, rapper Travis Scott — has sent some fans into a spiral. On Christmas Day, fans melted down when Kylie did not appear on the family’s annual Christmas card. Starting Dec. 1, Kim released a new part of the photo every day, and many expected Kylie’s announcement to be included in the final photo shoot. No dice.\n\n[Kylie Jenner still hasn’t confirmed her pregnancy. On Christmas, fans melted down on social media.]\n\nMeanwhile, people keep searching for information. TMZ posted blurry footage of Kylie’s first public appearance since the fall, although she’s wearing baggy clothes. Kylie recently posed for a magazine shoot, but is strategically holding a baby lamb in front of her. Meanwhile, some think the announcement will be part of an episode of “Keeping Up With the Kardashians,” which wraps its current season in a few weeks: The website HelloGiggles reported Wikipedia briefly listed the season finale title as “We’re Expecting!” (The title is no longer listed on the Wikipedia page.)\n\nToday in Creative Ways Kylie Jenner Has Hidden Her Pregnancy for Fashion Jobs: a baby lamb in @THELOVEMAGAZINE! pic.twitter.com/vyu7vmgIdu — Alyssa Vingan Klein (@alyssavingan) January 29, 2018\n\nShould Kylie’s baby arrive this month, it will join new cousin Chicago West, Kim and Kanye West’s daughter who was born via surrogate last month. Khloe and her boyfriend, NBA player Tristan Thompson, are also expecting a baby in March. Although according to the tabloids, you might not see Kylie’s baby’s debut for quite some time.\n\n“She very much enjoys being out of the spotlight and can’t wait to spend quiet time with the baby,” a “source” told People, adding Kylie does not plan to sell any photos of her child. “She doesn’t seem in any rush to get back to a more public life.”\n\nRead more:\n\nAs Kim and Kanye welcome baby No. 3, the Kardashian deluge of 2018 has officially started\n\nKim and Kanye named their new baby girl Chicago West, and the city is loving the attention\n\nPerspective | Here’s why Chicago is actually a great name for Kimye’s baby", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=3005617&cv=2.0&cj=1", "https://www.washingtonpost.com/resizer/yAFxThroW-CI5t-yu8Q6FsF7kHI=/1x1/www.washingtonpost.com/pb/resources/img/spacer.gif", "https://www.washingtonpost.com/resizer/ky7bA0ZXzBFzG8UPfN3R3qvgPAQ=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ACEJRXHXDA2EHF2TVIKLLJJXGQ.jpg", "https://www.washingtonpost.com/resizer/oEDFA_ML3fQeFNBJjQQoBAnVWdE=/1024x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/WJPDVFVQ5E7RDJ6YELCL3KPOY4.jpg", "http://me.effectivemeasure.net/em_image"], "top_img": "https://www.washingtonpost.com/resizer/ky7bA0ZXzBFzG8UPfN3R3qvgPAQ=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ACEJRXHXDA2EHF2TVIKLLJJXGQ.jpg", "keywords": [], "authors": ["Emily Yahr", "Style Reporter Covering Pop Culture", "February", "Emily Yahr Is An Entertainment Reporter For The Washington Post. She Joined The Post In", "Has Previously Written For The Boston Globe", "Usa Today", "The Lexington", "Ky.", "Herald-Leader", "The American Journalism Review."], "canonical_link": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/02/02/kylie-jenners-mystery-pregnancy-might-be-the-most-confusing-kardashian-situation-ever/", "title": "Kylie Jenner’s mystery pregnancy might be the most confusing Kardashian situation ever", "meta_data": {"object-hash": 1519604146, "viewport": "width=device-width, initial-scale=1.0, user-scalable=yes, minimum-scale=0.5, maximum-scale=2.0", "referrer": "unsafe-url", "keywords": "kylie jenner pregnant, kylie jenner travis scott, kylie baby, is kylie jenner pregnant, kylie jenner kardashian baby, chicago west, who is the father of kylie's baby", "news_keywords": "kylie jenner pregnant, kylie jenner travis scott, kylie baby, is kylie jenner pregnant, kylie jenner kardashian baby, chicago west, who is the father of kylie's baby", "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "creator": "@emilyyahr"}, "og": {"type": "article", "site_name": "Washington Post", "url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/02/02/kylie-jenners-mystery-pregnancy-might-be-the-most-confusing-kardashian-situation-ever/", "image": "https://www.washingtonpost.com/resizer/ky7bA0ZXzBFzG8UPfN3R3qvgPAQ=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ACEJRXHXDA2EHF2TVIKLLJJXGQ.jpg", "title": "Kylie Jenner’s mystery pregnancy might be the most confusing Kardashian situation ever", "description": "The decision to keep any personal news under wraps is very off-brand for the family."}, "article": {"publisher": "https://www.facebook.com/washingtonpost", "content_tier": "metered", "author": "https://www.facebook.com/emily.yahr"}, "fb": {"app_id": 41245586762, "admins": 500835072}, "zeusAds": "true", "description": "The decision to keep any personal news under wraps is very off-brand for the family.", "robots": "index,follow", "theme": "normal", "author": "https://www.facebook.com/emily.yahr"}, "movies": [], "publish_date": 1517547600.0, "source": "http://www.washingtonpost.com", "summary": ""}