{"url": "https://www.businessinsider.com/real-housewives-of-orange-county-lydia-mclaughlin-season-12-2017-7", "text": "Lydia McLaughlin returns to \"The Real Housewives of Orange County\" after leaving the show in 2013. Tommy Garcia/Bravo Lydia McLaughlin says that the time was right for her to return to Bravo's \"The Real Housewives of Orange County.\"\n\n\"It was actually really hard to decide to leave,\" McLaughlin told INSIDER of quitting the show after just one season in 2013. \"I think a lot of people thought I was crazy. One of the producers actually said, 'It's lightning in a bottle and it doesn't happen twice,' because I told them maybe I'll just take a break. I just felt like my kids were really young and I wanted to have another kid close in age to them. And so it was the right decision for my family, but it was hard.\"\n\nFour years later, McLaughlin and her husband, Doug, have added on to her family with a third son and they've created a new high-end men's magazine called \"Nobleman.\" With that, McLaughlin decided to end her break and continue her story on the 12th season of Bravo's longest-running \"Real Housewives\" show.\n\n\"I think that's a really interesting kind of story to follow, the two of us really going out, and taking a risk, and starting a magazine, working together, just the two of us to fulfill our dreams,\" the 36-year-old said.\n\n\"And then obviously having the new baby being two years old, I felt like he was old enough where he literally isn't attached to me nursing anymore, so I can be more involved and kind of have something on my own,\" she continued. \"Those six months of taping 'Real Housewives' were great, it was much better even than last time.\" \"Real Housewives of O.C.\" stars, from left, Lydia McLaughlin, Tamra Judge, Shannon Beador, Meghan King Edmonds, Vicki Gunvalson, Peggy Sulahian, and Kelly Dodd. Tommy Garcia/Bravo\n\nAfter the first time around, McLaughlin said she learned some important lessons about trust that she brought with her to this season.\n\n\"Last time, I was really nervous about editing or sharing something, for example, my faith is really important to me and sacred in my life, and I was nervous a lot times when I was filming and talking about that,\" she said. \"I was scared about the way it would be portrayed or how it might be edited. And this time around, I was just more free with it. I think if you do a reality show, you really have to trust the production and trust that your story will get told.\"\n\nAlthough she was more prepared for the rigors of production, McLaughlin was somewhat blindsided by the level of feuding between her cast mates. She hasn't caught up on the show after she left - referring to seeing what was happening on the show and with her cast mates without her as \"bittersweet,\" so she didn't have an accurate idea of where the women's relationships stood.\n\n\"I hadn't watched it, so I was assuming that they don't like each other right now, but they just need to talk and it'll be fine,\" the self-titled \"Friendship Whisperer\" told us.\n\n\"And then I quickly realized it's not something that talking is necessarily going to help, it might make it worse. These ladies have really hurt each other and there's a lot of pain there, so maybe they're not ready to move on. You know, a cup of coffee and a lunch date isn't going to help. So I kind of had to reevaluate my plan and try to figure out what the best thing is for everybody.\"\n\n\"The Real Housewives of Orange County\" returns Monday at 9 p.m. on Bravo.", "images": ["https://amp.businessinsider.com/images/59640bb87ba1362d7b71a203-1136-568.jpg", "https://amp.businessinsider.com/images/59640bb87ba1362d7b71a202-750-563.jpg"], "top_img": "https://amp.businessinsider.com/images/59640bb87ba1362d7b71a203-1136-568.jpg", "keywords": [], "authors": ["Jethro Nededog"], "canonical_link": "https://www.insider.com/real-housewives-of-orange-county-lydia-mclaughlin-season-12-2017-7", "title": "A Real Housewife who's back on the show after leaving 4 years ago says she was shocked by how nasty the cast feuds had gotten", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "ii-ab-test": {"hpi4": "variant"}, "msapplication-config": "//media.businessinsider.com/public/assets/BI/US/favicons/browserconfig.xml", "theme-color": "#1d607c", "date": "2017-07-17", "sailthru.date": "2017-07-17", "news_keywords": "TV, Culture, The Real Housewives of Orange County, Real Housewives, Bravo, Reality TV, Prime, Jethro Nededog", "sailthru.tags": "TV, Culture, The Real Housewives of Orange County, Real Housewives, Bravo, Reality TV, Prime, Jethro Nededog", "description": "The married mother of three and lifestyle magazine maven told INSIDER why it was the right time for her to return to the Bravo reality show.", "sailthru.description": "The married mother of three and lifestyle magazine maven told INSIDER why it was the right time for her to return to the Bravo reality show.", "title": "A Real Housewife who's back on the show after leaving 4 years ago says she was shocked by how nasty the cast feuds had gotten", "sailthru.verticals": "insider", "sailthru.title": "A Real Housewife who's back on the show after leaving 4 years ago says she was shocked by how nasty the cast feuds had gotten", "linkedin": {"owner": "mid:1d5f7b"}, "tbi-image": "https://amp.businessinsider.com/images/59640bb87ba1362d7b71a203-1136-568.jpg", "sailthru.image.full": "https://amp.businessinsider.com/images/59640bb87ba1362d7b71a202-1136-852.jpg", "sailthru.image.thumb": "https://amp.businessinsider.com/images/59640bb87ba1362d7b71a202-160-120.jpg", "tbi-vertical": "Insider", "sailthru.author": "Jethro Nededog", "og": {"title": "A Real Housewife who's back on the show after leaving 4 years ago says she was shocked by how nasty the cast feuds had gotten", "description": "The married mother of three and lifestyle magazine maven told INSIDER why it was the right time for her to return to the Bravo reality show.", "type": "article", "url": "https://www.businessinsider.com/real-housewives-of-orange-county-lydia-mclaughlin-season-12-2017-7", "image": "https://amp.businessinsider.com/images/59640bb87ba1362d7b71a203-1136-568.jpg", "site_name": "Business Insider"}, "article": {"publisher": "businessinsider"}, "author": "Jethro Nededog, INSIDER", "twitter": {"url": "https://www.businessinsider.com/real-housewives-of-orange-county-lydia-mclaughlin-season-12-2017-7", "title": "A Real Housewife who's back on the show after leaving 4 years ago says she was shocked by how nasty the cast feuds had gotten", "description": "The married mother of three and lifestyle magazine maven told INSIDER why it was the right time for her to return to the Bravo reality show.", "card": "summary_large_image", "image": "https://amp.businessinsider.com/images/59640bb87ba1362d7b71a203-1136-568.jpg", "creator": "@TheRealJethro", "site": "@"}, "Business Insider": "Snapchat", "A Real Housewife who's back on the show after leaving 4 years ago says she was shocked by how nasty the cast feuds had gotten": "The Fastest Way to Share a Moment!", "fb": {"pages": 20446254070}, "apple-itunes-app": "app-id=554260576"}, "movies": [], "publish_date": 1500264000.0, "source": "https://www.businessinsider.com", "summary": ""}