{"url": "https://en.wikipedia.org/wiki/The_Handmaid%27s_Tale_(TV_series)", "text": "American television series\n\nThe Handmaid's Tale is an American dystopian drama web television series created by Bruce Miller, based on the 1985 novel of the same name by Margaret Atwood. It was ordered by the streaming service Hulu as a straight-to-series order of 10 episodes, for which production began in late 2016. The plot features a dystopian future following a Second American Civil War wherein a totalitarian society subjects fertile women, called \"Handmaids\", into child-bearing servitude.[3]\n\nThe first three episodes of the series premiered on April 26, 2017; the subsequent seven episodes were released every Wednesday. In May 2017, the series was renewed for a second season which premiered on April 25, 2018.[4] In May 2018, Hulu renewed the series for a third season,[5] which premiered on June 5, 2019.[6]\n\nThe Handmaid's Tale has received critical acclaim and its first season won eight Primetime Emmy Awards from thirteen nominations, including Outstanding Drama Series. It is the first show produced by Hulu to win a major award as well as the first series on a streaming service to win an Emmy for Outstanding Series.[7] It also became the first streaming series to win the Golden Globe Award for Best Television Series – Drama. Elisabeth Moss was also awarded the Golden Globe for Best Actress.\n\nPlot [ edit ]\n\nIn the near future, fertility rates collapse as a result of sexually transmitted diseases and environmental pollution.[8] With this chaos, the totalitarian, theonomic government of Gilead establishes rule in the former United States in the aftermath of a civil war.[9][10][11] Society is organized by power-hungry leaders along with a new, militarized, hierarchical regime of fanaticism and newly-created social classes, in which women are brutally subjugated, and by law are allowed to work only in very limited roles – and not allowed to own property, handle money, or read.[11]\n\nWorldwide infertility has led to the conscription of the few remaining fertile women in Gilead, citing an extremist interpretation of the Biblical account of Bilhah. These women, called Handmaids,[11] are assigned to the homes of the ruling elite, where they must submit to ritualized rape by their male masters in order to become pregnant and bear children for those men and their wives. They assume a name created by the addition of the prefix Of- to the first name of the man who owns them. When they are transferred, their names are changed.\n\nAlong with the Handmaids, much of society is now grouped into classes that dictate their freedoms and duties. Women are divided into a small range of social categories, each one signified by a plain dress in a specific color: Handmaids wear long red dresses, heavy boots and white coifs, with a larger white coif to be worn outside, concealing them from public view and restricting their own vision. Marthas (who are housekeepers and cooks, named after the biblical figure) wear long, loose-fitting dull green garments and cover their hair with headwraps. Upperclass Wives (who are expected to run their households beautifully) wear elegant, tailored dresses in blue and turquoise, cut in styles evoking the 1950s. They wear high heels, their hair is carefully coiffed, and they wear gloves and hats when out of doors.[12]\n\nEconowives, the lower-class women who still have minimal agency, are a sort of mixture of all these categories, and they wear shades of gray (a departure from the book in which Econowives wear clothing striped with the aforementioned colors). Women prisoners are called Unwomen and, wearing rags, are worked to death clearing toxic waste in the Colonies.\n\nAnother class of women, Aunts (who train, oversee and discipline the Handmaids), wear brown. Jezebels are sex workers in secret brothels catering to the elite ruling class. They wear otherwise forbidden evening clothes, costumes and lingerie from “before”.\n\nAmong the men of Gilead, the Eyes are a secret police watching over the general populace for signs of rebellion, Hunters track down people attempting to flee the country.\n\nJune Osborne, renamed Offred (Elisabeth Moss), is the Handmaid assigned to the home of the Gileadan Commander Fred Waterford (Joseph Fiennes) and his wife Serena Joy (Yvonne Strahovski). Offred is subject to strict rules and constant scrutiny; an improper word or deed on her part can lead to brutal punishment, including death.\n\nOffred, who is named after her male master, Fred (\"Of Fred\"), like all Handmaids, was married and had a daughter, a job, a bank account, and her own name and identity in the \"time before,\" but all she can safely do now is follow the rules of Gilead in hopes that she can someday live free again and be reunited with her husband and daughter. The Waterfords, key players in the rise of Gilead, have their own conflicts with the realities of the society they have helped create.\n\nCast and characters [ edit ]\n\nMain [ edit ]\n\nElisabeth Moss as June Osborne / Offred / Ofjoseph #2, a woman who was captured while attempting to escape to Canada with her husband, Luke, and daughter, Hannah. Due to her fertility, she is made a Handmaid to Commander Fred Waterford and his wife, Serena Joy as \"Offred\". Now she is with Commander Joseph Lawrence as \"Ofjoseph\".\n\nJoseph Fiennes as Commander Fred Waterford, a high-ranking government official and June's master. Both he and his wife were instrumental in Gilead's founding. He wishes to have more contact with June outside of what is lawful between a Handmaid and her master, and starts inviting her to play nightly games of Scrabble .\n\n. Yvonne Strahovski as Serena Joy Waterford, Fred's wife and a former conservative cultural activist. She appears to have accepted her new role in a society that she helped create. She is poised and deeply religious, but capable of great cruelty and is often callous to June. She is desperate to become a mother.\n\nAlexis Bledel as Dr. Emily Malek / Ofglen #1 / Ofsteven / Ofroy / Ofjoseph #1, June's shopping partner. Although June is initially wary of her, it is revealed she is not as pious as she seems, and the two become friends. Emily has a wife and son living in Canada, and was a university lecturer in cellular biology. Being homosexual is punishable by death in Gilead, and while most intellectuals and \"gender traitors\" are worked to their deaths in the Colonies, Emily, as \"Ofglen\", was spared and later converted into a Handmaid, due to her having \"two viable ovaries\". She was later captured and cruelly punished for her lesbian relationship with a Martha, and is sent to another household where she becomes \"Ofsteven\". She is involved with a resistance movement called \"Mayday\". She was in the process of being worked to death in the toxic fields of the Colonies until the attack on the Red Center had her, Janine, and several others returned to handmaiden duty. After attacking Aunt Lydia at the Lawrence household, she as \"Ofjoseph\" fears execution, until Commander Lawrence sends her away in a truck with the baby Nichole, whom June hands to her before ditching them to free her other daughter Hannah. Both Emily and Nichole manage to flee to Canada, where she is soon reunited with her wife and son.\n\nMadeline Brewer as Janine / Ofwarren / Ofdaniel / Ofhoward, a Handmaid who entered the Red Center for training at the same time as June, and considers June a friend due to her kind treatment. Initially non-compliant, Janine has her right eye removed as a punishment. She becomes mentally unstable due to her treatment, and often behaves in temperamental or childlike ways. She gives birth to a child for Warren and Naomi Putnam, whom they name \"Angela\", but Janine insists the baby's name is \"Charlotte\". Janine is later reassigned and becomes \"Ofdaniel\". She was temporarily assigned to the Colonies until a bombing at the new Rachel and Leah Center.\n\nAnn Dowd as Aunt Lydia / Lydia Clements, a woman in charge of overseeing the Handmaids in their sexual reeducation and duties. She is brutal and subjects insubordinate Handmaids to harsh physical punishment, but she also cares for her charges and believes deeply in the Gileadean mission and doctrine. She appears to have a soft spot for Janine, and even goes so far as to address her by her given name on occasion.\n\nO. T. Fagbenle as Lucas \"Luke\" Bankole, June's husband from before Gilead. Because he is divorced (he and June began their relationship before his divorce from his first wife), their union is considered invalid in the new society. June is considered an adulteress and their daughter, Hannah, is considered illegitimate. Initially, June believes he has been killed, but it is later revealed Luke managed to escape to Canada.\n\nMax Minghella as Commander Nick Blaine, Commander Waterford's driver and a former drifter from Michigan who has feelings for June. June and Nick develop an intimate relationship and she eventually discovers that he is an Eye, a spy for Gilead. In season 3, he is promoted to Commander.\n\nSamira Wiley as Moira, June's best friend since college. She is already at the Red Center when June enters Handmaid training but escapes before being assigned to a home. She is recaptured and becomes \"Ruby\", a Jezebel. She seems to have given up hope of ever being free, but on meeting June again regains the conviction to escape. She is now living her life in Canada as a refugee.\n\nAmanda Brugel as Rita (recurring season 1, main season 2–present), a Martha at the Waterford house. She had a son named Matthew, who died fighting in the civil war when he was 19 years old. [13]\n\nBradley Whitford as Commander Joseph Lawrence (recurring season 2, main season 3), the founder of the Colonies and architect of Gilead's economy.[14][15]\n\nRecurring [ edit ]\n\nStephen Kunken as Commander Warren Putnam. He's the first known Commander of Janine. He had his left hand amputated by the Council after being found guilty of adultery.\n\nEver Carradine as Naomi Putnam, Commander Warren Putnam's wife.\n\nTattiawna Jones as Lillie Fuller / Ofglen #2 (season 1–2), who replaces Emily in the position after Emily is captured by the Eyes. She initially follows the rules and does not wish to upset the status quo, but this is because she believes her life as a Handmaid is better than the difficult, impoverished life she led prior to Gilead, rather than out of religious piety. After refusing to stone Janine, she was clubbed with a rifle by a guardian, and her tongue was cut out according to Alma. After that, she sacrifices herself to bomb a new Red Center on the day of its christening. 26 Commanders and 31 Handmaids were killed as a result.\n\nNina Kiri as Alma / Ofrobert, another Handmaid who trained at the Red Center with June, Moira, and Janine. She is frank and chatty, and often trades gossip and news with June. She is also involved with Mayday and becomes June's first contact with the resistance group.\n\nJenessa Grant as Dolores / Ofsamuel, a local Handmaid with a friendly and talkative nature.\n\nBahia Watson as Brianna / Oferic, another local Handmaid who is friends with June.\n\nJordana Blake as Hannah Bankole / Agnes McKenzie, June and Luke's daughter. She is later renamed Agnes.\n\nEdie Inksetter as Aunt Elizabeth, a fellow Aunt who works closely with Aunt Lydia at the Red Center.\n\nKristen Gutoskie as Beth (season 1, 3), formerly a Martha at Jezebel's. She had an arrangement with Nick whereby she traded illegal alcohol and other contraband for drugs, which the Jezebels use. She has a casual sexual relationship with him and is aware that he is an Eye. She later becomes a Martha in Joseph Lawrence's household.\n\nErin Way as Erin, a young, apparently mute, woman who was being trained to become a Handmaid but managed to escape to Canada. [16]\n\nClea DuVall as Sylvia (season 2–present), Emily's wife. [17]\n\nCherry Jones as Holly Maddox (season 2–present), June's mother, an outspoken feminist. [18]\n\nSydney Sweeney as Eden Spencer (season 2), a pious and obedient girl who was married off to Nick during a ceremony in episode 5 of season 2. She and Guardian Isaac were drowned to death in a swimming pool for \"infidelity\". [19]\n\nSam Jaeger as Mark Tuello (season 2–present), a mysterious stranger who Serena encounters in Canada.\n\nGreg Bryk as Commander Ray Cushing (season 2)\n\nRohan Mead as Isaac (season 2), a Guardian assigned to the Waterford home.\n\nJulie Dretzin as Eleanor Lawrence (season 2–present), Joseph's wife.\n\nOrdena Stephens-Thompson as Frances (season 2–3), the Martha who was assigned to the McKenzie household. She was executed plus a few others for \"endangering a sacred child\".\n\nAshleigh LaThrop as Natalie / Ofmatthew (season 3), a devoted Handmaid whose loyalty to Gilead causes divisive tensions amongst her peers. [20]\n\nSugenja Sri as Sienna (season 3), a new Martha in the Lawrence household.\n\nJonathan Watton as Commander Matthew Calhoun (season 3), the assigned Commander of Ofmatthew.\n\nChristopher Meloni as High Commander George Winslow (season 3), a High Commander stationed in Washington, D.C. [21]\n\nElizabeth Reaser as Olivia Winslow (season 3), [21] the wife of High Commander Winslow.\n\nthe wife of High Commander Winslow. Sarah McVie as Lena (season 3), a Swiss Diplomat negotiating the hostile conflict between Gilead and Canada over Nichole.\n\nGuest [ edit ]\n\nZabryna Guevara as Mrs. Castillo (season 1), an Ambassador from Mexico who visits Gilead to see the effectiveness of the regime.\n\nChristian Barillas as Mr. Flores (season 1), Mrs. Castillo's assistant.\n\nRosa Gilmore as Zoe (season 1), the daughter of a US army soldier and the leader of the group of survivors who Luke encounters after being separated from June and Hannah.\n\nTim Ransom as Mr. Whitford (season 1), a friend of June's mother who helps her, Luke and Hannah attempt to cross the border.\n\nMarisa Tomei as Mrs. O'Conner (season 2), a Commander's wife who is exiled to the Colonies as punishment for committing a sin to the flesh. [22]\n\nYahya Abdul-Mateen II as Omar (season 2), a man who helps June attempt to escape.\n\nJohn Carroll Lynch as Dan (season 2), Emily's boss at the university where she worked.\n\nKelly Jenrette as Annie (season 2), Luke's ex-wife who was after June for cutting her out of her marriage to Luke prior to Gilead's rise.\n\nRebecca Rittenhouse as Odette (season 2), a Doctor and Moira's deceased fiancée.\n\nOprah Winfrey (uncredited) as Newsreader (season 2) on a car radio. [23]\n\nAmy Landecker as Mrs. McKenzie (season 3), Hannah's placement mother during the existence of Gilead.\n\nLaila Robins as Pamela Joy (season 3), the mother of Serena Joy.\n\nEmily Althaus as Noelle (season 3), a young single mother whose son Aunt Lydia taught before the rise of Gilead.\n\nEpisodes [ edit ]\n\nSeason Episodes Originally released First released Last released 1 10 April 26, 2017 ( ) June 14, 2017 ( 2017-06-14 ) 2 13 April 25, 2018 ( ) July 11, 2018 ( 2018-07-11 ) 3 13[24] June 5, 2019 ( ) August 14, 2019 ( 2019-08-14 ) [24]\n\nSeason 1 (2017) [ edit ]\n\nNo.\n\noverall No. in\n\nseason Title Directed by Teleplay by Original release date 1 1 \"Offred\" Reed Morano Bruce Miller April 26, 2017 ( ) A family is pursued by a group of armed men. The woman is caught, and separated from her young daughter and husband as shots are fired in the distance. She is now known as Offred, the handmaid to Commander Fred Waterford. While walking, she and another handmaid, Ofglen, pass by a wall on which men have been hanged for crimes such as being gay, working in an abortion clinic, and being a Catholic priest.[25] In a flashback, women are indoctrinated into their new role by Aunt Lydia, and Offred sees her best friend Moira among them. Another woman, Janine is rude to Aunt Lydia and is shocked with a cattle prod; later, her right eye is removed as punishment. In the present, Commander Waterford tries to impregnate Offred during \"the Ceremony\". The next day, the handmaids are encouraged to beat a man to death for allegedly raping a pregnant handmaid and killing her baby. On the way home, Ofglen warns her there is an Eye in the Waterford house. Offred affirms to herself that her name is June and she intends to survive to find her daughter. 2 2 \"Birth Day\" Reed Morano Bruce Miller April 26, 2017 ( ) June and Ofglen go shopping, and they reveal more personal information about themselves to each other. While they are walking, they see St. Paul Catholic Church, their local church, being destroyed by the new régime.[26][25] Ofglen tells Offred that the régime also bulldozed St. Patrick's Cathedral in Manhattan to try to \"erase\" the fact that it ever existed. When June asks how Ofglen knows this information, Ofglen reveals that she is part of a resistance movement against the government, but June declines to join.[27] Commander Waterford's driver, Nick, tells June that the Commander wants to see her alone later that night, which is forbidden, and warns her that Ofglen is dangerous. June and the other handmaids witness the birth of Janine/Ofwarren’s child, named Angela by the Putnams but Charlotte by Janine. In flashbacks, June remembers the birth of her daughter, Hannah. At that time healthy births were already rare, and a woman tried to kidnap baby Hannah and was arrested. In the present, June warily goes to the Commander's office, but he just wants to play Scrabble, to her relief. The next day, a different woman introduces herself as Ofglen. 3 3 \"Late\" Reed Morano Bruce Miller April 26, 2017 ( ) In flashbacks, the rise of Gilead is detailed through June's eyes: June and her female colleagues were fired and the government froze women's bank accounts and ruled they could no longer own property. In the present, Serena takes June to see Janine and the baby, and June fears Janine is delusional. Back home, June is interrogated by an Eye and Aunt Lydia about her knowledge of Ofglen. Aunt Lydia shocks June with a cattle prod for being disrespectful and quoting from the Bible but before Aunt Lydia can hit June again, Serena intervenes, believing June is pregnant. When June later tells Serena that she's not, Serena angrily locks her in her room. In a flashback, June and Moira attend a protest against the new laws amidst automatic gunfire and explosives. In the present, Ofglen and the Martha she's in a relationship with are charged with \"gender treachery\". The fertile Ofglen is reassigned but the Martha is hanged. Later, Ofglen (referred to by her \"old\" name, Emily) awakes to find, to her grief and anger, that she has undergone female genital mutilation surgery, as explained by Aunt Lydia. 4 4 \"Nolite Te Bastardes Carborundorum\" Mike Barker Leila Gerstein May 3, 2017 ( ) Banished to her room, June retreats to her closet where she finds a Latin phrase, Nolite Te Bastardes Carborundorum, scratched discreetly into the wall. When Rita, the Martha assigned as the Commander's housekeeper, finds June lying on the floor, June tells her that she fainted so Serena sends her to the hospital for a check-up. During the examination the physician remarks that the Commander is most likely sterile and offers to impregnate June, but she declines. In flashbacks, Aunt Lydia teaches the handmaids about The Ceremony in which a commander endeavors to fertilize a handmaid. Later, June and Moira assault Aunt Elizabeth, and Moira takes her outfit. June and Moira plan to go to Boston, which has safe houses. Moira catches the train but June is detained by a soldier and returned to the Red Centre. In the present, Commander Waterford has an unsuccessful Ceremony night, but later that night, they play Scrabble again. She asks him about the Latin phrase, and he tells her it means, Don't let the bastards grind you down. She learns that the previous Offred killed herself because life was unbearable and releases June from her confinement. 5 5 \"Faithful\" Mike Barker Dorothy Fortenberry May 10, 2017 ( ) Serena suggests to June that she have sex with Nick in case Commander Waterford is sterile. Later that day, Serena leads June up to Nick's room and waits by the door while June and Nick have detached sex. Flashbacks detail June and Luke's first meeting and courtship. During a Ceremony night, the Commander touches June's thigh, which she later tells him never to do again, and confronts him about Emily. He admits that while they thought they were building a better world, they knew that \"better never means better for everyone.\" June also confronts Nick, who reveals that he is indeed an Eye. At an open-air market, June questions Emily about the resistance group (which is called Mayday). Emily jumps behind the steering wheel of a security car and drives erratically around the plaza. She hits a guard, and is caught and put into a black van. June returns to Nick's coach house alone, and they have passionate sex. 6 6 \"A Woman's Place\" Floria Sigismondi Wendy Straker Hauser May 17, 2017 ( ) When Mexican trade delegates visit the Waterfords' home to evaluate the effects of the Gilead cultural movement, June is asked about her experience in which she lies, saying that she is happy. The handmaids are taken to a function to demonstrate Gilead's success, illustrated by a parade of Commanders' children to whom the handmaids had given birth. The next day, June tells Mexico's ambassador the truth about Gilead and asks for her help, but the ambassador is unable to. However, June is told that Luke is alive and a message can be sent to him. A flashback details Serena and Fred's life at the beginnings of the Gilead movement, when Serena was a conservative cultural activist with passion and intelligence equal to her husband's. It is revealed that she wrote a book about her beliefs, titled A Woman's Place. The Waterfords are shown to have been involved with the movement since the beginning, and Fred later finds out that the movement will attack the U.S. government. After the takeover, Serena is completely shut out and accepts her new role in the society she helped create. A copy of her book is seen being thrown out with the trash. 7 7 \"The Other Side\" Floria Sigismondi Lynn Renee Maxcy May 24, 2017 ( ) A flashback chronicles Luke's story after he was separated from June and Hannah. Luke is shot and injured but escapes when the ambulance crashes. He passes out from his wounds and is rescued by a resistance group traveling to Canada with many survivors, including Erin, a mute escaped handmaid and Zoe, the daughter of a US Army soldier.[28] Initially reluctant, Luke joins them after Zoe shows him that Gileadan authorities hanged people from the rafters of their church for resisting.[29][30] As they board a boat, Gileadan guards kill several members of the group, but Luke and Erin manage to survive. A further flashback shows Luke, June, and Hannah before they were separated. June and Luke are helped by Mr. Whitford, a man who knew June's mother. He leaves them at a secluded cabin in the woods while he arranges documentation for them to escape to Canada. However, he is caught and hung, and a local hunter attempts to help them instead. Three years later, in the present, Luke and Erin live safely in \"Little America\", based in Toronto. While in the main administrative office, Luke receives the letter from June which reads, \"I love you so much. Save Hannah.\" 8 8 \"Jezebels\" Kate Dennis Kira Snyder May 31, 2017 ( ) Commander Waterford gifts June with makeup and a dress and takes her out for the night. Nick drives them to Boston to an underground brothel, where sex workers (known as \"Jezebels\") work. June spots Moira and they briefly reunite. Nick trades drugs and pregnancy tests for alcohol with Beth, one of the brothel's Marthas. June goes to see Moira again, and she explains to June how Quakers tried to help her escape but were caught.[31][32] Moira had the choice of being sent either to the Colonies or one of the brothels.[32] Moira tells June to forget about escaping but June tells Moira that Luke got out. Flashbacks detail how Nick, struggling with unemployment and a troubled family, got involved with the Sons of Jacob and subsequently the Gilead movement, and how he became an Eye after reporting a Commander for breaking protocol with his handmaids. The suicide of the previous Offred is shown. In the present, after Nick drives Waterford and June home, he ends his relationship with June, which upsets and angers her. The episode closes with June etching the words \"You are not alone\" into the closet wall. 9 9 \"The Bridge\" Kate Dennis Eric Tuchman June 7, 2017 ( ) Janine's daughter is handed over to Commander Putnam and his wife she is then transferred to another couple and renamed Ofdaniel. During the first Ceremony night with her new Commander, Janine forcefully stops the proceedings. At the market, Alma tells June that she is involved with Mayday, and requests that June retrieve a package from the bar at Jezebel's. June convinces Waterford to take her to Jezebel's again that night. Waterford presents June with Moira and June privately asks Moira to retrieve the package, but she refuses. The next day June is taken to a bridge where Janine is standing on the edge with baby Charlotte, while many, including the Putnams, stand fearfully by. Janine shouts that Commander Putnam promised to leave his wife for her. June convinces Janine to give her Charlotte, but Janine then jumps into the icy water. Later, while Janine lies comatose in the hospital, Commander Putnam is led away by guards. Mrs. Putnam causes Serena to doubt her husband's loyalty. At the market, June is given a package by the butcher, sent by Moira from Jezebel's. At the brothel, Moira kills a client and takes his clothes, then drives off in his car. 10 10 \"Night\" Kari Skogland Bruce Miller June 14, 2017 ( ) A flashback shows June's capture and indoctrination by Aunt Lydia at the Red Center. In the present, after discovering Fred's trips to Jezebels, June is forced to take a pregnancy test, which ends up being positive. Serena angrily accuses Fred, telling him the child is not his. after learning the news, Nick and June have a tender moment. Serena takes June to see Hannah, but leaves her in the car. Serena warns June that Hannah will be safe as long as June's unborn child is. Following his trial, Commander Putnam's left arm is amputated below the elbow. The package from Jezebel's contains letters from women who lost family members and have been enslaved in the Gilead takeover. Later, an emotional Aunt Lydia gathers the handmaids and instructs them to stone Janine. The handmaids hesitate eventually June and the others refuse, dropping their stones. Following this, a black van comes for June, something the Waterfords were unaware of. Nick urges her to trust him and go with them. As June leaves, she whispers to Rita where to find the hidden letters. Meanwhile, Moira reaches Canada, is granted asylum and is reunited with Luke.\n\nSeason 2 (2018) [ edit ]\n\nNo.\n\noverall No. in\n\nseason Title Directed by Teleplay by Original release date 11 1 \"June\" Mike Barker Bruce Miller April 25, 2018 ( ) The handmaids are taken to Fenway Park, where they are made to believe they will be hanged. When June rejects a meal Lydia gives her, she is shown Ofwyatt chained in a prison room due to her attempted suicide. June agrees to eat and the handmaids are punished through burning with a gas flame. June is taken to a doctor for a pregnancy check-up, where she is visited by the Waterfords. Afterward, she finds a key in one of her boots, which she uses to escape to a van parked underneath the hospital. The van drops her off at a safe house in Back Bay, where she meets Nick, while Fred authorizes a search party. Nick tells June to change out of her clothes and to cut her hair. In flashbacks throughout the episode, Hannah is admitted to the hospital for having a fever while in school, and June is questioned by one of the hospital workers about giving Hannah medication to bypass the school's fever policy. When June and Luke arrive home, they watch the Capitol Building and White House being attacked on television. 12 2 \"Unwomen\" Mike Barker Bruce Miller April 25, 2018 ( ) June has been transported to the abandoned headquarters of The Boston Globe.[33] Emily has been taken to the Colonies, where \"unwomen\" dig on toxic land.[34] Emily befriends a former commander's wife and finds that she committed a \"sin of the flesh\" that landed her in the Colonies. Emily murders her with poisoned tablets as she blames her for what she perceives to be \"holding a woman down while her husband rapes her\".[33] Janine arrives at the Colonies and Nick visits June. In a flashback, Emily is told by her boss, Dan, that she will not be teaching the following semester at the university, giving her a lower profile to avoid attracting criticism for her sexual orientation. Dan is later seen hanged with the word \"faggot\" painted underneath him. When Emily, along with her wife Sylvia and son Oliver, attempt to emigrate to Canada, she is unable to leave the country because same-sex marriage is no longer recognized, and it becomes known that she is Oliver's biological mother. In the present, June makes a news-clipping memorial for The Boston Globe employees who were executed at the newspaper's former headquarters, and prays to God to send an angel to watch over it.[33] 13 3 \"Baggage\" Kari Skogland Dorothy Fortenberry May 2, 2018 ( ) June learned about the emergence of the Sons of Jacob in newspaper archives and is moved to a place where she meets Omar, who tells her he is bringing her to a safe house. When he learns the safe house has been compromised, he tries to leave without her. June makes him bring her with him to his apartment, where she meets his wife Heather and their son Adam. When the family goes to church, June finds a hidden Qur'an. June dons Heather's Econowife outfit and leaves. After a train ride, June advances to the airstrip that Omar had told her about; the airplane is intercepted, the pilot is executed, and June and another fugitive are apprehended by the Guardians. Moira, now living with Luke and Erin, gives a tour to a new co-worker, but he has a breakdown, traumatized his acts as a Guardian. In a flashback, June is taken to a Take Back the Night rally by her mother, Holly. Holly was later disappointed at June's career and plan to marry, having hoped June would become an activist. Moira and June learned at the Red Center that Holly was sent to the Colonies. 14 4 \"Other Women\" Kari Skogland Yahlin Chang May 9, 2018 ( ) June is recaptured and Lydia explains that June must choose between imprisonment, followed by execution after childbirth, or return as a handmaid. The Waterfords treat June's disappearance as a kidnapping, but privately Serena is furious. Rita returns the letters she found and tells June that she will no longer be involved. A baby shower is held for Serena, incorporating prayer and a binding of June to Serena. June learns from Alma that Ofglen No. 2's tongue was removed for speaking up for Janine, and that Mayday is silent. Lydia takes June out to show her Omar hanging, telling June that Omar's wife Heather is now a handmaid, their son Adam was given away, and this was June's fault. Lydia encourages her to distinguish between Offred's identity and June's, saying June is to blame, not Offred. In a flashback, June is harassed by Luke's first wife Annie, who tells her that she and Luke made wedding vows before God, and June should back off, but Luke rejects Annie's plea. Years later, Annie sees Luke and June in a restaurant with Hannah. June has collapsed emotionally under the knowledge of Omar's family's fate and prays that Hannah will forget her. 15 5 \"Seeds\" Mike Barker Kira Snyder May 16, 2018 ( ) June burns some letters she had been keeping for Mayday. She notices vaginal bleeding but does not inform anyone. Nick notices June's apparent depression and informs Serena. Serena, alarmed at Nick's interest in June, and apprises Fred, who arranges for him to be married at a Prayvaganza where loyal Guardians receive a wife. Nick's new bride, Eden, moves into his room. Nick later finds June bloody and unconscious and she is hospitalized. June awakens in the hospital and promises her baby that they both will escape Gilead. In the Colonies, Janine assures Emily that God is protecting them through their struggles in Gilead, and helps to arrange a small wedding for a dying worker, officiated by another unwoman who is a rabbi. Emily, who has begun to lose her teeth, argues with Janine for attempting to bring brightness to a place that otherwise seems so bleak. When the newlywed unwoman dies, the rabbi officiates at the burial as the deceased is lowered into her grave in a cemetery adorned with crosses. 16 6 \"First Blood\" Mike Barker Eric Tuchman May 23, 2018 ( ) Advised by a doctor that a harmonious household would benefit the child, Serena shows care for June, giving her the sitting room as a bedroom and inviting her friends for brunch. When Serena shows June the nursery for the baby, June asks to see Hannah. In retaliation, Serena moves June back to her previous room. Eden reveals to June that she fears Nick may be a \"gender traitor\" due to his reluctance for intimacy, so June warns him. Nick elopes with Eden, but only after he tells June that he loves her. Fred visits June and gives her a photograph of Hannah. At the opening of the Rachel and Leah Center, Nick asks Commander Pryce to reassign him and ensure June's protection. Ofglen No. 2 detonates a bomb. Flashbacks show the beginning of the Gilead movement with Serena being attacked while promoting her book A Woman's Place. After being booed, Fred forces Serena to finish her speech, which is met by jeers and clapping, escalating when a protester shoots Serena. Fred oversees executions of those students involved in his wife's shooting. 17 7 \"After\" Kari Skogland Lynn Renee Maxcy May 30, 2018 ( ) 31 handmaids, 26 commanders (including Commander Pryce), and many civilians were killed in the attack and Fred was injured. Commander Cushing takes Commander Pryce's role, increases checkpoints, and orders numerous people executed. He questions June, asking who aided her in fleeing the country. June responds that she was kidnapped. Serena is alarmed at her household's being targeted and Pryce's response, so she forges orders to have Commander Cushing arrested. Because many handmaids were killed, some women from the Colonies are made to serve as handmaids again, including Janine and Emily. Both reunite with June in the grocery store, where Janine happily tells June that it was God's plan that she be rescued. June tells Emily Ofglen No. 2's name and several of the handmaids whisper their names to one another. Serena enlists June's help in performing Fred's work for him while he is hospitalized. At the refugee center, Moira looks through records to try to find out what happened to her fiancée, Odette; Moira is revealed to have been a surrogate birth mother for a couple, meeting Odette, an obstetrician. In the present, Moira eventually finds photographs showing Odette was killed. 18 8 \"Women's Work\" Kari Skogland Nina Fiore & John Herrera June 6, 2018 ( ) Serena gives June a music box and flower for June's help in completing Fred's work while he is in the hospital. Serena tells June that the Putnams' child is ill. June advocates for Janine to be able to see the baby, and Serena agrees to ask about it. Naomi Putnam dislikes the idea, but she is overruled by her husband. Serena petitions Fred to allow the child to be seen by a Martha who, prior to the Sons of Jacob coup, was a top neonatologist. Fred denies the request so Serena forges Fred's signature on an order that temporarily transfers the Martha to the hospital. Lydia tells June that she will hold her responsible if anything goes wrong with Janine's visit to the hospital. The neonatologist can find no physical explanation for the child's deterioration and recommends no further treatment other than supportive care. When Fred discovers that Serena forged his signature on an order to temporarily transfer the Martha, he belts Serena. After Eden rearranges his garret and uncovers the bundle of handmaids' letters, he demands that Eden never touch his belongings. Janine holds Angela/Charlotte, singing \"I Only Want to Be with You\" and the baby's health improves. 19 9 \"Smart Power\" Jeremy Podeswa Dorothy Fortenberry June 13, 2018 ( ) The Waterfords and Nick travel to Canada on a diplomatic mission. Serena is approached by Mark Tuello, who works for the remnant of the U.S. government in Hawaii and offers to help her defect from Gilead if she will publicly denounce the regime, but Serena declines. At the Waterford residence, June tells Rita that when Hannah was baptized, she and Luke chose godparents for her, and that she wants Rita to be the godmother of her expected child as soon as it is born.[35] Rita states that she will try her best, although the government of Gilead has prohibited baptisms and severely restricts Marthas. June makes a similar request to Aunt Lydia, prompting Lydia to reveal she was previously the godmother her sister's baby, who died in infancy.[35] Nick finds Luke, tells him June is pregnant by Fred and gives him the bundle of letters. Luke, Moira, and Erin make the letters public, which prompts the Canadians to cancel the summit. Nick gives June news of Luke and Moira, adding that the letters were instrumental in curtailing the talks. June reveals that Moira is Hannah's godmother.[36] 20 10 \"The Last Ceremony\" Jeremy Podeswa Yahlin Chang June 20, 2018 ( ) The commander to whom Emily is newly assigned as handmaid collapses and dies during the Ceremony. June suffers contractions while shopping, forcing her to go home and to endure a \"birthing ceremony\" as everyone awaits the birth of the child. However, it turns out to be a false alarm. June pleads to Fred to be positioned closer to her daughter Hannah after the eventual birth. After Fred denies this request, June implies that the child she is carrying is not his and that he will never have a child of his own. Fred rapes June with Serena holding her down, under the guise of inducing the labor. Eden finds herself attracted to Isaac and meets with him at night. They kiss, but she stops once she sees Nick. She begs Nick's forgiveness, which he gives with a detachment that infuriates her. She accuses Nick of liking June. Fred arranges for Nick to take June to a remote house for a visit with Hannah, now renamed Agnes. Hannah is initially detached, but then embraces June, and the two have a brief reunion. After they are separated, Guardians take Nick captive, and June is left behind, having hidden in the house. 21 11 \"Holly\" Daina Reid Bruce Miller & Kira Snyder June 27, 2018 ( ) After Nick is taken away from the house, June finds a 1975 Chevrolet Camaro in the garage and car keys, and is able to start the car. She returns to the house and gets a man's coat. Flashbacks throughout the episode show her first pregnancy, and Hannah's birth and childhood. Fred and Serena arrive at the house in a panic, looking for June, and end up arguing, with Serena telling Fred she gave up everything for him and the cause, and only ever wanted a child in return. June finds a gun and prepares to shoot them, but desists. The Waterfords are unable to find June and decide to leave, feeling both angry and concerned. After she's certain they're gone, June, having contractions, gets back into the car but cannot get it out of the garage, which is frozen shut. June is exhausted and in pain, lies down in front of the fire, and finally goes into labor and passes out. When she awakens she's covered in blood, but the baby still hasn't come. She crawls outside and discharges the gun to attract attention, then ends up delivering the baby by herself. She whispers that the baby's name is Holly, after June's mother. Light comes in through the windows, indicating that a car has arrived at the house. 22 12 \"Postpartum\" Daina Reid Eric Tuchman July 4, 2018 ( ) June is unable to pump enough milk and is brought to her baby in order to induce lactation. As June's lactation increases during the meeting, Lydia convinces Fred to allow June back in the house for the baby's health. Nick, who is back in the Waterford household and presented as having been key to the rescue of June and the baby, suggests that he, June, and the baby should flee, and Fred attempts to renew elements of his relationship with June. Emily is reassigned to the Lawrence household as a handmaid after being rejected by four couples. His unstable wife, Eleanor, reveals to Emily that Lawrence was the creator of the Colonies. Lawrence reveals that he knows much about her past. Eden and Isaac elope but are caught. Eden and Nick admit their faults and ask each other's forgiveness. Eden and Isaac are brought to a diving board above a swimming pool for infidelity; each of them is attached to chains and weights. Both refuse to repent, and Eden instead begins to recite a biblical paean to love. They are both pushed off and drown to death.[37] Made distraught by the events, Serena allows June to nurse the baby herself. 23 13 \"The Word\" Mike Barker Bruce Miller July 11, 2018 ( ) It is revealed that Eden's father turned Eden and Isaac in. While searching through Eden's belongings, June discovers a Bible that Eden read from and annotated, despite it being illegal for women to read in Gilead.[38] June argues about Nichole's future in Gilead, stating that Nichole won't be able to know God unless she is able to read his word.[38] Serena proposes that girls be taught to read the Bible, and Serena reads from the Bible to make her point. She is punished by having a finger removed.[38] Emily is dismissed by Lawrence, who does not undergo the ceremony. Emily is visited by Lydia and as Lydia leaves, Emily stabs her. Fred suggests to June that he could arrange for her to remain his handmaid, offering meetings with Hannah; June rejects the proposal. As a fire consumes a neighboring house, Rita tells June that she and Holly have this chance to get out. Nick prevents Fred from arranging their caputre. Serena catches June, but allows June to take Nichole, assisted by Marthas. June is reunited with Emily, who is dropped off at the escape truck by Lawrence; June delivers the baby to Emily, telling her to call her Nichole.\n\nSeason 3 (2019) [ edit ]\n\nNo.\n\noverall No. in\n\nseason Title [39][40] Directed by Written by Original release date [41] 24 1 \"Night\" Mike Barker Bruce Miller June 5, 2019 ( ) June prays for the safety of Emily and Nichole, using words from Psalm 23. Meanwhile, Emily escapes with June's baby Nichole into Canada after heavy currents in a river crossing, where they are granted asylum. Nichole is taken into the care of Luke and Moira. Back in Gilead, June visits her older daughter Hannah before being recaptured by the Guardians and returned to the Waterfords, but not before Hannah's placement mother, Mrs. McKenzie warns June that future visits could result in her execution in front of Hannah. In order to hide June's involvement in Nichole's \"kidnapping\", Fred pins the blame on Emily, but Serena defiantly pins it all on herself by telling him and an agent of the Eyes that she was the one who gave away Nichole to a \"murderer\", meaning Emily. She then tries to commit suicide by burning down the house, but she is rescued by June and Rita. After being punished at the Red Center, June is reassigned to Commander Lawrence, who had facilitated Emily and Nichole's escape to Canada. 25 2 \"Mary and Martha\" Mike Barker Kira Snyder June 5, 2019 ( ) June, who is now Ofjoseph, meets her new shopping partner, Ofmatthew, who is deeply devoted to Gilead. At the Lawrence household, June joins an underground resistance cell consisting of the Marthas Beth, Cora, and Alison. The latter is a former chemistry teacher who joins the resistance in order to make bombs to destroy Gilead. It is also revealed that she made the bomb that blew up the new Rachel and Leah center. June and the Marthas help a Martha from another district escape. However, this woman is later shot by the Guardians and Alison returns with her to the Lawrence household. Commander Lawrence reluctantly harbors the fugitive from the Guardians. Commander Lawrence's wife, Eleanor, who previously seemed unstable, helps June and the Marthas hide the wounded woman. The Martha succumbs to her injury and June uses digs her a grave in the backyard and then prays for her soul to rest in peace. Commander Lawrence dismisses Cora for lying while June is burying the Martha. Eleanor plants flowers over the grave. In Canada, Emily is staying with Luke, Moira, and Erin, who successfully convince Emily to re-establish contact with her wife Sylvia. 26 3 \"Useful\" Amma Asante Yahlin Chang June 5, 2019 ( ) June resolves to search for \"allies with power\", in order to survive Gilead. The Commanders meet at Commander Lawrence's house to discuss the fighting in Chicago including an incoming shipment of female captives. June encounters Nick, who has been promoted to Commander, and the two share a tender moment. Commander Lawrence conscripts June to select five Chicago women to serve as \"Marthas\"; the remainders will be shipped to the Colonies, which is ultimately a death sentence. While unwilling to be complicit in Lawrence's crimes, June eventually chooses five Marthas who would make good recruits for her resistance cell: an engineer, an IT technician, a journalist, a lawyer, and a thief. Meanwhile, a despondent Serena goes to stay with her mother Pamela, who chastises her for losing her child and for not realizing without Fred, Serena has no place in Gileadean society. At the end, she tries to kill herself via drowning in the ocean, but changes her mind and walks by Fred. 27 4 \"God Bless the Child\" Amma Asante Eric Tuchman June 12, 2019 ( ) June and some other handmaids attend a reception at the Putnam household. There, June convinces Fred to give his wife Serena a \"voice behind the scenes\" in Gilead. Flashbacks throughout the episode show June and Luke's baptism of Hannah by Christian priest before the hostile takeover by the Sons of Jacob, who now dedicate children, rather than baptize infants. June learns that Ofmatthew has given birth to three babies. Janine pleads with the Putnams to invite her back into the house so that she can produce a sibling for baby Angela. Aunt Lydia furiously rejects her plea, and then beats her until June throws herself between Janine and Lydia. Aunt Lydia then apologizes for what happened. She later privately breaks down in tears. Serena tells June that Hannah is at a school in Brookline, MA. June and the Waterfords later receive video footage of Nichole with Luke in Canada, during a demonstration condemning Gilead's hostile assault on Chicago. June is forced to confirm her husband's identity, which she does. In Canada, Emily reunites with her partner Sylvia and their son Oliver. Luke and Moira request a Christian priest to baptize Nichole, which they do in a church. 28 5 \"Unknown Caller\" Colin Watkinson Marissa Jo Cerar June 19, 2019 ( ) At Serena's request, June phones her husband Luke in order to arrange a meeting between the Waterfords and Nichole. Luke agrees to the meeting on the condition that only Serena attend the meeting and not Fred. During their tense meeting at Toronto Pearson International Airport, Serena reassures Luke that June is safe and that both she and June gave up Nichole to give Nichole a better life in Canada. Serena passes Luke a locket for Nichole, as well as a cassette tape containing a recorded message from June, revealing the name she gave to Nichole (Holly) and biological father (Nick). Later, June is picked up by Guardians and forced to participate in a televised broadcast in which the Waterfords state that they are a family mourning the kidnapping of Nichole and urge the Canadian government to return their daughter to Gilead. 29 6 \"Household\" Dearbhla Walsh Dorothy Fortenberry June 26, 2019 ( ) The Waterfords, June, and Aunt Lydia travel to Washington, D.C. to stay with the family of High Commander George Winslow. There, they meet with a delegation of Swiss diplomats who are seeking to negotiate between Gilead and Canada and to take part in internationally broadcast mass prayers being held at the former Washington Monument that has now been turned into a giant cross, asking for the return of baby Nichole from Canada. Once there, June and Lydia are shocked and appalled at how in Washington, the leadership caste there have taken the rules of Gilead to shocking extremes: forcing all handmaids to be muzzled at all times to cover up small ring piercings used to permanently keep their mouths closed. The two bond, as Lydia tells June she believes that Handmaids should not be denied the right of speech. Commander Winslow offers Fred position for him and Serena in DC. June reunites with Nick, who as a Commander is now prepping military forces for the Chicago frontline with the rebels. June makes a deal with the Swiss to convince Nick to provide information on Gilead's power structure, however they reject talking to Nick upon obtaining information about unstated war crimes committed by him in the early days of the Gilead takeover. June and Serena have an argument inside what used to be the Lincoln Memorial over Serena's change of heart regarding baby Nichole. Afterwards, the Waterfords force June to lead tens of thousands of Handmaids massed along what use to be the Lincoln Memorial Reflecting Pool in a televised prayer for Nichole's return. 30 7 \"Under His Eye\" Mike Barker Nina Fiore & John Herrera July 3, 2019 ( ) While visiting a supermarket, June arranges with Frances to visit Hannah at the school in Brookline that Serena told her about. Emily and Sylvia meet with a Swiss diplomat, who questions Emily about crimes she has been accused of committing in Gilead. Emily acknowledges them but does not regret the actions she took to survive in Gilead. Emily later befriends Moira and the two join a group of protestors who confront the Canadian Immigration Minister over his negotiations with Gilead and are arrested. Olivia Winslow admonishes Serena to settle in Washington D.C., showing her that she could move into the former house of a Baptist family that was removed following the Sons of Jacob takeover. Fred and Serena renew their love for each other while negotiations take place to secure Nichole's return and an extradition treaty with Canada. June convinces Eleanor to accompany her on a visit to Brookline. The two women are not permitted entry into the school. June takes part in a particicution where Frances and others are hanged for \"endangering a child.\" June realizes that Ofmatthew was spying on her and reported Frances to Lydia. June angrily attacks Ofmatthew, but is restrained by the other Handmaids. 31 8 \"Unfit\" Mike Barker Kira Snyder July 10, 2019 ( ) In a ritual in which handmaids are admonished to \"testify\" for their sins, June is singled out for being responsible for the death of Frances, which would negatively affect Hannah. June outs Ofmatthew's doubts about wanting to carry another child to term. In the night, Ofandy gives birth to a stillborn. Ofmatthew snaps when she next encounters June at a grocery store and she grabs a gun from a Guardian and nearly kills June and Aunt Lydia, before another Guardian is forced to kill the pregnant handmaid to save the two. When asked by June about their whereabouts, Commander Lawrence informs her that he does not know where Hannah and her new family has been relocated. Flashbacks meanwhile show Aunt Lydia's past: she was a caring Christian teacher who was rejected by the principal she was secretly in love with when, at the urging of a neglectful single mother who she had befriended, she made a pass at him during their first date. Seeing that the mother was dating several men, did not attend church, and that her child wore dirty clothes, Lydia called child protective services onto the mother resulting in her son being placed in a foster home.\n\nProduction [ edit ]\n\nHulu's straight-to-series order of The Handmaid's Tale was announced in April 2016, with Elisabeth Moss set to star.[42] Based on the 1985 novel of the same name by Margaret Atwood, the series was created by Bruce Miller, who is also an executive producer with Daniel Wilson, Fran Sears, and Warren Littlefield.[42] Atwood serves as consulting producer, giving feedback on some of the areas where the series expands upon or modernizes the book.[42][43] She also played a small cameo role in the first episode.[44] Moss is also a producer.[45] In June 2016, Reed Morano was announced as director of the series.[46] Samira Wiley, Max Minghella, and Ann Dowd joined the cast in July 2016.[47][48][49] Joseph Fiennes, Madeline Brewer, and Yvonne Strahovski were cast in August 2016,[50][51][52] followed by O. T. Fagbenle and Amanda Brugel in September 2016.[53][54] In October 2016, Ever Carradine joined the cast,[55] and Alexis Bledel was added in January 2017.[56]\n\nFilming on the series took place in Toronto, Mississauga, Hamilton, Burlington, Oakville, and Cambridge, Ontario, from September 2016 to February 2017.[57][58] Hulu released the first full trailer of the TV series on YouTube, on March 23, 2017.[59] The series premiered on April 26, 2017.[60]\n\nOn May 3, 2017, The Handmaid's Tale was renewed for a second season to premiere in 2018.[61] Moss told the news media that the subsequent episodes would cover further developments in the story, filling in some of the unanswered questions and continuing the narrative already \"finished\" in the book.[62] The second season consists of 13 episodes and began filming in fall 2017. Alexis Bledel returned as a series regular.[63] Showrunner Bruce Miller stated that he envisioned 10 seasons of the show, stating, \"Well, you know, honestly, when I started, I tried to game out in my head what would ten seasons be like? If you hit a home run, you want energy to go around the bases, you want enough story to keep going, if you can hook the audience to care about these people enough that they're actually crying at the finale.\"[64]\n\nSeason 2 was filmed in Ontario, primarily in Toronto, but some scenes were shot in Hamilton and Cambridge.[65]\n\nSeason 3 started production in Toronto in October 2018.[66][67] Scenes for season 3 were also filmed in Cambridge and Hamilton, Ontario as well as in Washington, D.C.[68][69][70]\n\nBroadcast and release [ edit ]\n\nThe first three episodes of the series premiered on April 26, 2017; the subsequent seven episodes were released on a weekly basis.[60][71] In Canada, the series is broadcast weekly by Bravo and the streaming service CraveTV; the first two episodes premiered on April 30, 2017.[72] In Scandinavia, the series is available on HBO Nordic.[73] In the United Kingdom, the series premiered on May 28, 2017, on Channel 4.[74] In Ireland, the series premiered on February 5, 2018 on RTÉ2, with a showing of the first two episodes.[75] RTÉ also became the first broadcaster in Europe to debut Season 2 and Season 3 following its broadcast in the US and Canada.[76] In Brazil, the series premiered on March 7, 2018, on Paramount Channel.[77]\n\nIn New Zealand, the series was released on the subscription video on demand service Lightbox on June 8, 2017.[78] In Australia, the series premiered on the TV channel SBS's video streaming service SBS on Demand, on July 6, 2017.[79]\n\nThe first season was released on Blu-ray and DVD on March 13, 2018.[80] The second season was released on Blu-ray and DVD on December 4, 2018.[81]\n\nReception [ edit ]\n\nCritical response [ edit ]\n\nSeason Critical response Rotten Tomatoes Metacritic 1 94% (121 reviews) 92 (41 reviews) 2 89% (98 reviews) 86 (28 reviews) 3 84% (44 reviews) 67 (13 reviews)\n\nSeason 1 [ edit ]\n\nOn Rotten Tomatoes, the first season has an approval rating of 94% based on 121 reviews, with an average rating of 8.72/10. The site's critical consensus reads, \"Haunting and vivid, The Handmaid's Tale is an endlessly engrossing adaptation of Margaret Atwood's dystopian novel that's anchored by a terrific central performance from Elisabeth Moss.\"[82] On Metacritic, it has a weighted average score of 92 out of 100 based on 41 critics, indicating \"universal acclaim\".[83]\n\nDaniel Fienberg of The Hollywood Reporter called it \"probably the spring's best new show\".[84] Jen Chaney of Vulture gave it a highly positive review, and wrote that it is \"A faithful adaptation of the book that also brings new layers to Atwood's totalitarian, sexist world of forced surrogate motherhood\" and that \"this series is meticulously paced, brutal, visually stunning, and so suspenseful from moment to moment that only at the end of each hour will you feel fully at liberty to exhale\".[85]\n\nThere was much debate on whether parallels could be drawn between the series (and by extension, the book it is based on) and American society during the Presidency of Donald Trump.[86][87] A comparison has also been made to the Salafi/Wahabbi extremism of ISIL, under which enslaved women of religious minorities are passed around and utilized as sex objects and vessels to bear new jihadis.[88][89][90]\n\nSeason 2 [ edit ]\n\nOn Rotten Tomatoes, the second season has an approval rating of 89% based on 98 reviews, with an average rating of 8.33/10. The site's critical consensus reads, \"Beautifully shot but dishearteningly relevant, The Handmaid's Tale centers its sophomore season tightly around its compelling cast of characters, making room for broader social commentary through more intimate lenses.\"[91] On Metacritic, it has a weighted average score of 86 out of 100 based on 28 critics, indicating \"universal acclaim\".[92]\n\nHowever, other critics perceived the second season's depictions of violence as excessive. Sophie Gilbert wrote: \"There came a point during the first episode where, for me, it became too much.\"[93] Lisa Miller of The Cut wrote: \"I have pressed mute and fast forward so often this season, I am forced to wonder: 'Why am I watching this'? It all feels so gratuitous, like a beating that never ends.\"[94] And The Daily Telegraph's Rebecca Reid admitted she had an anxiety attack watching an episode of the show.[95]\n\nSeason 3 [ edit ]\n\nOn Rotten Tomatoes, the third season has an approval rating of 84% based on 44 reviews, with an average rating of 6.82/10. The site's critical consensus reads, \"The Handmaid's Tale's third season reins in its horrors and inspires hope that revolution really is possible – if only the story would stop spinning its wheels and get to it already.\"[96] On Metacritic, it has a weighted average score of 67 out of 100 based on 13 critics, indicating \"generally favorable reviews\".[97]\n\nKelly Lawler of USA Today gave it a positive review, scoring it three out of four stars. She claimed it is an improvement over the second season, \"that rights many – though definitely not all – of Season 2's wrongs.\" Overall, she wrote, \"The new season is more propulsive and watchable, although it doesn't quite reach the heights of that first moving season. But Handmaid's regains its footing by setting off on a new path.\"[98]\n\nDaniel Fienberg of The Hollywood Reporter wrote a generally positive review, praising Elisabeth Moss' performance and the cinematography, but criticized the plot \"that has become frustratingly repetitive.\" Overall, he wrote, \"Still occasionally powerful, but rarely as provocative.\"[99]\n\nAwards [ edit ]\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/The_Handmaid%27s_Tale_intertitle.png/250px-The_Handmaid%27s_Tale_intertitle.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Blue_pencil.svg/10px-Blue_pencil.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/The_Handmaid%27s_Tale_intertitle.png/1200px-The_Handmaid%27s_Tale_intertitle.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/The_Handmaid%27s_Tale_intertitle.png/1200px-The_Handmaid%27s_Tale_intertitle.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/The_Handmaid%27s_Tale_(TV_series)", "title": "The Handmaid's Tale (TV series)", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.13", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/The_Handmaid%27s_Tale_intertitle.png/1200px-The_Handmaid%27s_Tale_intertitle.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}