{"url": "https://variety.com/2018/tv/news/13-reasons-why-season-2-netflix-katherine-langford-1202812754/", "text": "The Season 2 premiere of Netflix’s buzzy teen drama “13 Reasons Why” is fast approaching, and the recently released trailer, featuring the returns of main cast members Katherine Langford, Dylan Minnette, Alisha Boe, and more as the Liberty High students grapple with Hannah’s death, has piqued anticipation for the series’ sophomore run.\n\nThe new season begins in the throes of a court case that forces its teen protagonists — and antagonists — to delve deeper into their inner struggles and actions that led up to Hannah’s suicide in the Season 1 finale. Here’s everything we know about “13 Reasons Why” Season 2, streaming Friday.\n\nSeven New Actors Joined the Cast\n\nThe show’s ensemble cast expands in the second season to include seven new recurring characters played by Anne Winters, Bryce Cass, Chelsea Alden, Allison Miller, Samantha Logan, Kelli O’Hara, and Ben Lawson. Winters plays Liberty High’s newest head cheerleader and beautiful “it girl” Chloe; Cass plays the edgy and mischievous Cyrus; Alden plays Cyrus’ artsy, witty, and outspoken sister Mackenzie; Logan plays respected track star Nina; O’Hara plays a passionate advocate for bullying victims named Jackie; Miller plays a smart and ambitious young litigator named Sonya; and Lawson rounds out the newcomers as Liberty High’s beloved baseball coach, Rick.\n\nKatherine Langford Returns as Hannah Baker\n\nWhile Langford’s character died by suicide in the Season 1 finale, Hannah will reappear in flashbacks and as a haunting figment of characters’ imaginations in the second season. Earlier this month at Netflix’s annual FYSee Kick-Off event in Los Angeles, newcomer Lawson commented on Hannah’s role in Season 2. “We also see a lot more of what Hannah’s story involved,” Lawson revealed. “That’s not over. You’ll see a lot more of what happened in the lead up to her suicide.” Langford received a 2018 Golden Globe nomination for her portrayal of Hannah in Season 1.\n\nThe Writers Heard Viewer Criticisms\n\nThe most-tweeted-about show of 2017, “13 Reasons Why” viewers did not hesitate to share their thoughts on Season 1’s handling of difficult topics such as suicide, sexual violence, and bullying. One common critique of the show argued that none of its bully characters faced sufficient consequences for their actions. At the FYSee event, Derek Luke, who plays school guidance counselor Kevin Porter, told Variety that the feedback informed the Season 2 script. “Our Season 2 was affected obviously by the writers’ room, but it was also affected by the outcry of fans who wanted some type of redemption,” Luke said. “We all went in there feeling a burden to deal with the hurt. Some of that hurt is in the shape of an antagonist that I think people will love to see get dealt with.”\n\nTrigger Warnings Will Precede New Episodes\n\nAfter Netflix conducted multiple studies which found the show had a significant cultural impact, igniting tough conversations and causing viewers to take action in regard to its address of serious issues, the streaming giant announced a formatting change for Season 2 which will feature a warning video to air prior to each episode. In the video, stars Langford, Minnette, Boe, and Justin Prentice warn viewers of potentially triggering topics to come and encourage fans to seek help via crisis resources and a viewing guide to 13ReasonsWhy.Info. Additionally, Season 2 episodes will be followed by new after-show content titled “Beyond the Reasons,” in which actors, experts, and educators will break down each installment’s darker plot threads.\n\nLiberty High Students Face Justice\n\nThe new trailer for Season 2 picks up where the first season left off as Clay, Jessica, Bryce, and the rest of the Liberty High crew testify in a court case Hannah’s parents have filed against the school. In the process of recounting details from the events leading up to Hannah’s suicide, the students also have to face their own personal experiences and truths, expanding on each character’s Season 1 demons.\n\nAdult Characters Evolve, Too\n\nIt’s not only the teenagers who have to come to terms with their respective knowledge and mistakes. The show’s adults, including parents and school faculty members, cannot avoid the harsh realities of a local teen’s suicide as Hannah’s death becomes increasingly publicized. Luke also commented on adult characters’ new Season 2 outlook at the FYSee event. “The word ‘accountability’ now for the adults is different because in our story the story has gone public,” Luke said. “So, anytime you’re in the media’s eye the emotions and the weight get even heavier. I think this season everyone’s looking [for] who to blame, especially the adults.”\n\nSheri Grapples With Guilt\n\nSeason 1 left Sheri in a fragile emotional state as Hannah’s tapes forced her to confront the reality that she took out a stop sign resulting in the death of a classmate, adding to Hannah’s stress as a passenger. At the FYSee event, actress Ajiona Alexus said Season 2 will continue to explore her character’s damaged psyche as she grapples with the guilt and trauma of her secret. Alexus acknowledged that the solution for bullying comes from consequences and “at the end of Season 1, I think you kind of feel like people got away with it.”\n\nPOPULAR ON VARIETY:", "images": ["https://pmcvariety.files.wordpress.com/2019/07/rexfeatures_10330533ap.jpg?w=700&h=393&crop=1", "https://pmcvariety.files.wordpress.com/2019/06/game-of-thrones-siggraph.jpg?w=250&h=140&crop=1", "https://pmcvariety.files.wordpress.com/2019/06/hbo-chernobyl.jpg?w=700&h=393&crop=1", "https://pmcvariety.files.wordpress.com/2019/07/rexfeatures_10331334cg-1.jpg?w=700&h=393&crop=1", "https://pmcvariety.files.wordpress.com/2017/05/chloe-dan-2nd-photo.jpg?w=450&h=253&crop=1", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2018%2Ftv%2Fnews%2F13-reasons-why-season-2-netflix-katherine-langford-1202812754%2F&ct=article&lob=pmc-core&loc=us&env=desktop&post_id=1202812754&comment_count=1", "https://pmcvariety.files.wordpress.com/2019/07/9245539a-cropped-e1562834428290.jpg?w=250&h=140&crop=1", "https://pmcvariety.files.wordpress.com/2019/06/schitts-creek-1.jpg?w=700&h=393&crop=1", "https://pmcvariety.files.wordpress.com/2018/05/13rw_203_02742r1.jpg?w=1024&h=683", "https://pmcvariety.files.wordpress.com/2019/07/nicholsfabian.jpg?w=450&h=253&crop=1", "https://pmcvariety.files.wordpress.com/2019/07/oscar-jaenada-shooting-hernan.jpg?crop=0px%2C283px%2C5472px%2C3084px&resize=450%2C253", "https://pmcvariety.files.wordpress.com/2018/05/rexfeatures_8827691bm.jpg?w=1050&h=700", "https://pmcvariety.files.wordpress.com/2019/07/stranger-things.jpg?w=700&h=393&crop=1", "https://boygeniusreport.files.wordpress.com/2019/07/french-fries.jpg?quality=98&strip=all&resize=230%2C135", "https://pmchollywoodlife.files.wordpress.com/2019/07/kourtney-kardashian-in-nothing-but-a-towel-selfie-ftr.jpg?resize=230%2C135", "http://b.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pmcvariety.files.wordpress.com/2019/07/st3.jpeg?w=700&h=393&crop=1", "https://pmcvariety.files.wordpress.com/2019/07/marc-guggenheim.jpg?w=450&h=253&crop=1", "https://pmcvariety.files.wordpress.com/2018/05/13rw_201_01770r1.jpg?w=1024&h=683", "https://pmcspy.files.wordpress.com/2019/07/91jwqitgssl._ux679_.jpg?resize=230%2C135", "https://pmcvariety.files.wordpress.com/2019/06/jakeg.jpg?w=700&h=393&crop=1", "https://pmcvariety.files.wordpress.com/2019/07/big-little-lies-season-2-episode-6.jpg?w=450&h=253&crop=1", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://pmcvariety.files.wordpress.com/2019/06/2037-_toy-story-4_-cast-explains-why-forky-isne28099t-named-sporky-youtube-f09f948a.jpg?w=700&h=393&crop=1", "https://pmcvariety.files.wordpress.com/2019/07/big-little-lies-season-2-episode-6.jpg?w=250&h=140&crop=1", "https://pmcvariety.files.wordpress.com/2018/05/13-reasons-why.jpg?w=700&h=393&crop=1", "https://pmcvariety.files.wordpress.com/2019/06/jacob-and-zach.jpg?w=700&h=393&crop=1", "https://pmcvariety.files.wordpress.com/2019/06/rexfeatures_10314204hj-e1561059816154.jpg?w=700&h=393&crop=1", "https://pmcvariety.files.wordpress.com/2019/06/game-of-thrones-siggraph.jpg?w=450&h=253&crop=1", "https://pmcvariety.files.wordpress.com/2019/06/lion-king.jpg?w=700&h=393&crop=1", "https://pmcwwd.files.wordpress.com/2019/07/premiazioni_10.jpg?resize=230%2C135", "https://pmcvariety.files.wordpress.com/2019/04/big-little-lies-season-2-2.jpg?w=700&h=393&crop=1", "https://pixel.quantserve.com/pixel/p-31f3D02tYU8zY.gif", "https://pmcvariety.files.wordpress.com/2018/05/13-21.jpg?w=1000&h=667", "https://pmcvariety.files.wordpress.com/2017/01/bethany-hamilton-unstoppable-lieber-films.jpg?w=250&h=140&crop=1", "https://pixel.wp.com/b.gif?v=noscript", "https://i1.wp.com/www.indiewire.com/wp-content/uploads/2019/07/Screen-Shot-2019-07-13-at-8.41.51-AM.png?resize=230%2C135&ssl=1", "https://pmcvariety.files.wordpress.com/2019/06/theylive1.jpg?w=700&h=393&crop=1"], "top_img": "https://pmcvariety.files.wordpress.com/2018/05/13-reasons-why.jpg?w=700&h=393&crop=1", "keywords": [], "authors": ["Christi Carras", "Christi'S Most Recent Stories", "View All"], "canonical_link": "https://variety.com/2018/tv/news/13-reasons-why-season-2-netflix-katherine-langford-1202812754/", "title": "’13 Reasons Why’ Season 2: Everything We Know So far – Variety", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0", "description": "The Season 2 premiere of Netflix's buzzy teen drama \"13 Reasons Why\" is fast approaching. Here's everything we know about its sophomore run.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199, "pages": 12616252196}, "news_keywords": "13 Reasons Why, Katherine Langford, Netflix", "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "Everything We Know About ’13 Reasons Why’ Season 2", "url": "https://variety.com/2018/tv/news/13-reasons-why-season-2-netflix-katherine-langford-1202812754/", "description": "The Season 2 premiere of Netflix’s buzzy teen drama “13 Reasons Why” is fast approaching, and the recently released trailer, featuring the returns of main cast members Katherine L…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/05/13-reasons-why.jpg?w=700&h=393&crop=1", "width": 1000, "height": 562, "alt": "13 Reasons Why"}, "locale": "en_US"}, "article": {"published_time": "2018-05-17T15:00:03+00:00", "modified_time": "2018-05-18T15:05:52+00:00"}, "twitter": {"creator": "@Variety", "site": "@variety", "text": {"title": "Everything We Know About ’13 Reasons Why’ Season 2"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/05/13-reasons-why.jpg", "alt": "13 Reasons Why"}, "card": "summary_large_image", "title": "Everything We Know About ’13 Reasons Why’ Season 2", "description": "The Season 2 premiere of Netflix's buzzy teen drama \"13 Reasons Why\" is fast approaching. Here's everything we know about its sophomore run."}, "author": "Christi Carras", "content_type": "Article", "title": "Everything We Know About '13 Reasons Why' Season 2", "published_at": "2018-05-17 08:00:03", "image": "https://pmcvariety.files.wordpress.com/2018/05/13-reasons-why.jpg?w=1000", "comment_count": 1, "tags": "Netflix", "topics": "News", "appeared_in_print": "No", "body": "The Season 2 premiere of Netflix's buzzy teen drama \"13 Reasons Why\" is fast approaching, and the recently released trailer, featuring the returns of main cast members Katherine Langford, Dylan Minnette, Alisha Boe, and more as the Liberty High students grapple with Hannah's death, has piqued anticipation for the series' sophomore run.\r\n\r\nThe new season begins in the throes of a court case that forces its teen protagonists — and antagonists — to delve deeper into their inner struggles and actions that led up to Hannah's suicide in the Season 1 finale. Here's everything we know about \"13 Reasons Why\" Season 2, streaming Friday.\r\n\r\nSeven New Actors Joined the Cast\r\n\r\nThe show's ensemble cast expands in the second season to include seven new recurring characters played by Anne Winters, Bryce Cass, Chelsea Alden, Allison Miller, Samantha Logan, Kelli O'Hara, and Ben Lawson. Winters plays Liberty High's newest head cheerleader and beautiful \"it girl\" Chloe; Cass plays the edgy and mischievous Cyrus; Alden plays Cyrus' artsy, witty, and outspoken sister Mackenzie; Logan plays respected track star Nina; O'Hara plays a passionate advocate for bullying victims named Jackie; Miller plays a smart and ambitious young litigator named Sonya; and Lawson rounds out the newcomers as Liberty High's beloved baseball coach, Rick.\r\n\r\nKatherine Langford Returns as Hannah Baker\r\n\r\nhttps://www.youtube.com/watch?v=0XuOkYlUWIs\r\n\r\nWhile Langford's character died by suicide in the Season 1 finale, Hannah will reappear in flashbacks and as a haunting figment of characters' imaginations in the second season. Earlier this month at Netflix's annual FYSee Kick-Off event in Los Angeles, newcomer Lawson commented on Hannah's role in Season 2. “We also see a lot more of what Hannah’s story involved,” Lawson revealed. “That’s not over. You’ll see a lot more of what happened in the lead up to her suicide.” Langford received a 2018 Golden Globe nomination for her portrayal of Hannah in Season 1.\r\n\r\nThe Writers Heard Viewer Criticisms\r\n\r\n\r\n\r\nThe most-tweeted-about show of 2017, \"13 Reasons Why\" viewers did not hesitate to share their thoughts on Season 1's handling of difficult topics such as suicide, sexual violence, and bullying. One common critique of the show argued that none of its bully characters faced sufficient consequences for their actions. At the FYSee event, Derek Luke, who plays school guidance counselor Kevin Porter, told Variety that the feedback informed the Season 2 script. “Our Season 2 was affected obviously by the writers’ room, but it was also affected by the outcry of fans who wanted some type of redemption,” Luke said. “We all went in there feeling a burden to deal with the hurt. Some of that hurt is in the shape of an antagonist that I think people will love to see get dealt with.”\r\n\r\nTrigger Warnings Will Precede New Episodes\r\n\r\nhttps://www.youtube.com/watch?v=WU-iQ9mA31Y\r\n\r\nAfter Netflix conducted multiple studies which found the show had a significant cultural impact, igniting tough conversations and causing viewers to take action in regard to its address of serious issues, the streaming giant announced a formatting change for Season 2 which will feature a warning video to air prior to each episode. In the video, stars Langford, Minnette, Boe, and Justin Prentice warn viewers of potentially triggering topics to come and encourage fans to seek help via crisis resources and a viewing guide to 13ReasonsWhy.Info. Additionally, Season 2 episodes will be followed by new after-show content titled \"Beyond the Reasons,\" in which actors, experts, and educators will break down each installment's darker plot threads.\r\n\r\nLiberty High Students Face Justice\r\n\r\n\r\n\r\nThe new trailer for Season 2 picks up where the first season left off as Clay, Jessica, Bryce, and the rest of the Liberty High crew testify in a court case Hannah's parents have filed against the school. In the process of recounting details from the events leading up to Hannah's suicide, the students also have to face their own personal experiences and truths, expanding on each character's Season 1 demons.\r\n\r\nAdult Characters Evolve, Too\r\n\r\n\r\n\r\nIt's not only the teenagers who have to come to terms with their respective knowledge and mistakes. The show's adults, including parents and school faculty members, cannot avoid the harsh realities of a local teen's suicide as Hannah's death becomes increasingly publicized. Luke also commented on adult characters' new Season 2 outlook at the FYSee event. “The word ‘accountability’ now for the adults is different because in our story the story has gone public,” Luke said. “So, anytime you’re in the media’s eye the emotions and the weight get even heavier. I think this season everyone’s looking [for] who to blame, especially the adults.”\r\n\r\nSheri Grapples With Guilt\r\n\r\n\r\n\r\nSeason 1 left Sheri in a fragile emotional state as Hannah's tapes forced her to confront the reality that she took out a stop sign resulting in the death of a classmate, adding to Hannah's stress as a passenger. At the FYSee event, actress Ajiona Alexus said Season 2 will continue to explore her character's damaged psyche as she grapples with the guilt and trauma of her secret. Alexus acknowledged that the solution for bullying comes from consequences and “at the end of Season 1, I think you kind of feel like people got away with it.” \r\n\r\nPOPULAR ON VARIETY:", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "fragment": "!", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128"}, "movies": ["https://www.youtube.com/embed/0XuOkYlUWIs?version=3&enablejsapi=1&origin=https://pmcvariety.wordpress.com&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/WU-iQ9mA31Y?version=3&enablejsapi=1&origin=https://pmcvariety.wordpress.com&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent"], "publish_date": 1526569203.0, "source": "https://variety.com", "summary": ""}