{"url": "https://qz.com/1304407/guess-cofounder-paul-marciano-has-resigned-after-sexual-misconduct-claims/", "text": "After a months-long investigation into claims that he acted inappropriately toward models, including allegations by Kate Upton that he forcibly groped and kissed her, Guess cofounder Paul Marciano is resigning as executive chairman.\n\nMarciano won’t be cutting all ties with the company, which is known for its sex-centric marketing and has helped launch many young models’ careers. He will remain chief creative officer through January 2019, when his contract expires, and then will stay on as a board member, Bloomberg reports.\n\nIn a regulatory filing, Guess announced that Marciano had entered into settlements with five people arising out of claims of inappropriate conduct, for a total of $500,000. The settlements, according to the filing, were to avoid litigation costs, and did not represent an admission of “liability or fault.”\n\nThe investigators, who according to the filing interviewed 40 people and reviewed some 1.5 million pages of documents, ultimately couldn’t corroborate many of the allegations. ”In some cases, no conclusion could be reached because the individuals either declined to be interviewed or provided insufficient information to the investigators,” the filing states. “And, in other cases, the investigation found that credible accounts were given by both sides.”\n\nWhat the investigators did conclude was that Marciano “exercised poor judgment in his communications with models and photographers,” and that he had put himself in situations that could—and did—result in “plausible allegations of improper conduct.”\n\nUpton first went public with her allegations in January, joining the #MeToo movement on social media and later giving a detailed account to Time magazine. “After the first day of shooting the Guess Lingerie campaign [on July 25, 2010], Paul Marciano said he wanted to meet with me,” she said. “As soon as I walked in with photographer Yu Tsai, Paul came straight up to me, forcibly grabbed my breasts and started feeling them—playing with them actually. After I pushed him away, he said, ‘I’m making sure they’re real.'”\n\nShe said that after she repeatedly rebuffed him, he became hostile toward her, calling her “disgusting” and a “pig” on set and spreading rumors that she was drunk during shoots. Marciano denied Upton’s claims, telling Time that he had never touched her inappropriately, and that he would never “refer to a Guess model in such a derogatory manner.” He added that he supports the #MeToo movement, and wouldn’t allow others to defame him. Tsai, the photographer, corroborated Upton’s claims to Time.\n\nWhen Guess opened its probe into Marciano, he ceased his day-to-day responsibilities at the company, and his pay was suspended. Now that the investigation is over, he will receive his salary again until January 30, according to the filing.\n\nMeanwhile, Guess says that Marciano has begun transitioning his duties to Victor Herrero, who previously took over Marciano’s role as Guess CEO in 2015, while brother Maurice Marciano has been appointed by the board to serve as the company’s new executive chairman.", "images": ["https://cms.qz.com/wp-content/uploads/2018/06/RTR4YFK-e1528899928986.jpg?quality=75&strip=all&w=410&h=230.625", "https://cms.qz.com/wp-content/uploads/2018/06/RTR4YFK-e1528899928986.jpg?quality=75&strip=all&w=1400"], "top_img": "https://cms.qz.com/wp-content/uploads/2018/06/RTR4YFK-e1528899928986.jpg?quality=75&strip=all&w=1400", "keywords": [], "authors": [], "canonical_link": "https://qz.com/1304407/guess-cofounder-paul-marciano-has-resigned-after-sexual-misconduct-claims/", "title": "Guess cofounder Paul Marciano is stepping down after sexual misconduct claims", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=5", "og": {"locale": "en_US", "description": "Guess started an investigation after model Kate Upton shared her #MeToo story about Marciano in February.", "image": "https://cms.qz.com/wp-content/uploads/2018/06/RTR4YFK-e1528899928986.jpg?quality=75&strip=all&w=1400", "title": "Guess cofounder Paul Marciano is stepping down after sexual misconduct claims", "type": "article", "url": "https://qz.com/1304407/guess-cofounder-paul-marciano-has-resigned-after-sexual-misconduct-claims/", "site_name": "Quartz"}, "application-name": "Quartz", "theme-color": "#000000", "apple-mobile-web-app-title": "Quartz", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black", "msapplication-window": "width=1024;height=768", "msapplication-tooltip": "News, videos, ideas, and obsessions from the new global economy", "msapplication-TileColor": "#ffffff", "msapplication-TileImage": "https://cms.qz.com/wp-content/uploads/2018/07/quartz-icon.jpg?w=144&h=144&crop=1&strip=all&quality=75", "msapplication-square70x70logo": "https://cms.qz.com/wp-content/uploads/2018/07/quartz-icon.jpg?w=70&h=70&crop=1&strip=all&quality=75", "msapplication-square150x150logo": "https://cms.qz.com/wp-content/uploads/2018/07/quartz-icon.jpg?w=150&h=150&crop=1&strip=all&quality=75", "msapplication-wide310x150logo": "https://cms.qz.com/wp-content/uploads/2018/07/quartz-icon.jpg?w=310&h=150&crop=1&strip=all&quality=75", "msapplication-square310x310logo": "https://cms.qz.com/wp-content/uploads/2018/07/quartz-icon.jpg?w=310&h=310&crop=1&strip=all&quality=75", "google-site-verification": "s3UlsLX3rTzf6Zh3P-bFlB0KcMuM1gKAPYrMm5icDK8", "news_keywords": "paul marciano,resigns,conduct,Guess?,inappropriate behavior,settlements,allegations,chairman,Models,Time,ceo,#MeToo,leadership,marketing,advertising,style,fashion,Lifestyle,management,Business", "article": {"publisher": "https://www.facebook.com/quartznews"}, "author": "Marc Bain", "twitter": {"card": "summary_large_image", "creator": "@marcbain_", "image": "https://cms.qz.com/wp-content/uploads/2018/06/RTR4YFK-e1528899928986.jpg?quality=75&strip=all&w=1400", "site": "@qz", "url": "https://qz.com/1304407/guess-cofounder-paul-marciano-has-resigned-after-sexual-misconduct-claims/"}, "description": "Guess started an investigation after model Kate Upton shared her #MeToo story about Marciano in February."}, "movies": [], "publish_date": null, "source": "https://qz.com", "summary": ""}