{"url": "https://nypost.com/2018/12/19/timeless-creator-credits-fans-with-resurrecting-it-twice/", "text": "It’s rare to get a show un-cancelled.\n\nTo have it happen twice is a TV miracle.\n\nBut that’s what transpired for NBC’s “Timeless,” which finally wraps its run with a two-hour finale airing Thursday night.\n\nThe series was co-created by Shawn Ryan, responsible for critical darlings (“The Shield”) and cult favorites (“Terriers”). He says it was a wild ride.\n\n“I’ve had shows cancelled before, and they don’t get un-cancelled … that just doesn’t happen,” says Ryan, 52. “To have that happen twice, [‘Timeless’] does begin to feel like the show that doesn’t die.”\n\n“Timeless” premiered on NBC in October 2016 and was axed after its freshman season with its audience hovering between 2 and 4 million viewers each week.\n\nThen, just three days later, NBC un-cancelled “Timeless” and ordered a second season. “We all know it’s a competitive tough environment to get on the air and stay on the air,” says Ryan. “And the overall numbers were never big enough to make us feel safe. It was a little bit of shock when I first heard [it was un-cancelled] — like, ‘Is this really happening? Is it a prank?’ What a mean prank this would be!”\n\nNot only was it not a prank, it happened again, when during its second season, NBC axed “Timeless” again. There was no third season, but the network did order the two-hour series finale airing Thursday night — which Ryan says is designed for both fans and newcomers alike.\n\n“We really did treat this like a two-hour event that you can enjoy whether you’re a big fan of the show, a casual fan, or you’ve never experienced it,” he says. “We want people to not feel intimidated like, ‘Oh there are 26 prior episodes I don’t have time to watch in the next few days, this isn’t for me.’ ”\n\n‘It was the fans that really wouldn’t let this show die, who protested and hired helicopters to fly banners.’\n\n“Timeless” stars Abigal Spencer (“Suits”) and Matt Lanter (“90210”) as members of a group who use a time machine to travel to different eras to protect American history from a thief planning to rewrite that history.\n\n“It was the fans that really wouldn’t let this show die, who protested and hired helicopters to fly banners,” says Ryan. “I think their voices are part of what made NBC decide to do the two-hour movie.”\n\nRyan was thrilled the show was un-cancelled, he says, but it was also a big job to wrangle the cast and crew again — since many of them had moved on after the cancellation.\n\n“It was difficult in a lot of ways, but we were all so determined and feeling fortunate that we were given a second chance,” he says. “Here’s the dirty little secret of Hollywood types. When your shows get cancelled, you’re 95 percent devastated and 5 percent like, ‘Thank God I don’t have to do that work anymore!’ This is easily the most difficult show I’ve ever worked on.”\n\nOf course, since it’s already come back to life multiple times, is this two-hour finale really the end?\n\n“It’s certainly the ending of the NBC version of the show, and we want to make sure we honor that and give a really satisfying conclusion,” says Ryan. “Having said that, it’s a world that could be explored in different ways down the line. Whether its ‘Brooklyn Nine-Nine’ ending at Fox but going to NBC, or ‘Last Man Standing’ ending at ABC and going to Fox, you’re seeing that just because a show don’t make sense at a particular outlet, that doesn’t mean there’s not a place for it.\n\n“It used to be extraordinarily rare for that to happen,” he says. “It’s not normally something I’d spend time thinking about, but when your show has been declared dead twice and then revived, well …”", "images": ["https://googleads.g.doubleclick.net/pagead/viewthroughconversion/988380111/?value=0&guid=ON&script=0", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://s2.wp.com/wp-content/mu-plugins/post-flair/sharing/images/loading.gif", "https://thenypost.files.wordpress.com/2018/12/TV-Timeless-1a.jpg?quality=90&strip=all&w=618&h=410&crop=1", "https://thenypost.files.wordpress.com/2018/12/TV-Timeless-1a.jpg?quality=90&strip=all&w=1200", "https://pixel.wp.com/b.gif?v=noscript", "https://q.quora.com/_/ad/d29ea10c24a74df597d0ccaa32076ecd/pixel?tag=ViewContent&noscript=1", "https://s0.wp.com/wp-content/themes/vip/plugins/vip-do-not-include-on-wpcom/vip-powered-wpcom/images/vip-powered-dark-small.png"], "top_img": "https://thenypost.files.wordpress.com/2018/12/TV-Timeless-1a.jpg?quality=90&strip=all&w=1200", "keywords": [], "authors": ["December"], "canonical_link": "https://nypost.com/2018/12/19/timeless-creator-credits-fans-with-resurrecting-it-twice/", "title": "‘Timeless’ creator credits fans with resurrecting it — twice", "meta_data": {"copyright": "Copyright 2019 NYP Holdings. All rights reserved.", "p": {"domain_verify": "44b526edc36ffbcc163412ee9fe42833"}, "description": "The series was co-created by Shawn Ryan, responsible for critical darlings (“The Shield”) and cult favorites (“Terriers”). He says it was a wild ride.", "generator": "WordPress.com", "og": {"type": "article", "title": "‘Timeless’ creator credits fans with resurrecting it — twice", "url": "https://nypost.com/2018/12/19/timeless-creator-credits-fans-with-resurrecting-it-twice/", "description": "It’s rare to get a show un-cancelled. To have it happen twice is a TV miracle. But that’s what transpired for NBC’s “Timeless,” which finally wraps its run with a two-hour finale airing Thursday ni…", "site_name": "New York Post", "image": {"identifier": "https://thenypost.files.wordpress.com/2018/12/TV-Timeless-1a.jpg?quality=90&strip=all&w=1200", "secure_url": "https://thenypost.files.wordpress.com/2018/12/TV-Timeless-1a.jpg?quality=90&strip=all&w=1200"}, "locale": "en_US"}, "article": {"published_time": "2018-12-20T01:07:49+00:00", "modified_time": "2018-12-20T01:07:49+00:00", "publisher": "https://www.facebook.com/nypost"}, "twitter": {"creator": "@nypost", "site": "@nypost", "text": {"title": "‘Timeless’ creator credits fans with resurrecting it — twice"}, "image": {"identifier": "https://thenypost.files.wordpress.com/2018/12/TV-Timeless-1a.jpg?quality=90&strip=all&w=664&h=441&crop=1", "alt": "Abigail Spencer (from left), Malcolm Barrett and Claudia Doumit in the “Timeless” finale.", "src": "https://thenypost.files.wordpress.com/2018/12/TV-Timeless-1a.jpg?quality=90&strip=all&w=664&h=441&crop=1"}, "card": "summary_large_image", "title": "'Timeless' creator credits fans with resurrecting it — twice", "description": "It’s rare to get a show un-cancelled. \nTo have it happen twice is a TV miracle.\nBut that’s what transpired for NBC’s “Timeless,” which finally wraps its run with a two-hour finale airing"}, "fb": {"pages": 225343690812937}, "nypost-section": "Entertainment", "parsely-metadata": "{\"post_id\":\"nypost-13306257\"}", "keywords": "TV,nbc,series finales,shawn ryan,what to watch", "google-site-verification": "eyT36MjcFGn_qzUdS9VyWVb89Lq2f8-ItpI8WRksiyw", "msvalidate.01": "8188997BC82071CE07AB711B5675CE54", "application-name": "New York Post", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Your source for breaking news, news about New York, sports, business, entertainment, opinion, real estate, culture, fashion, and more.", "msapplication-task": "name=Subscribe;action-uri=https://nypost.com/feed/;icon-uri=https://secure.gravatar.com/blavatar/0b14d9dbf0c711522a906102b60f3da0?s=16"}, "movies": ["https://www.youtube.com/embed/MdGOmB_Jj98?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent"], "publish_date": 1545195600.0, "source": "https://nypost.com", "summary": ""}