{"url": "https://www.wmagazine.com/story/zendaya-tom-holland-dating-rumors-wont-die", "text": "Despite the fact that Zendaya and Tom Holland have both repeatedly denied that they are dating, the rumor mill keeps churning this one out. The 21-year-old Spider-Man: Homecoming stars who met on set in 2016 are reportedly dating in secret, and have been for just about a year.\n\nAfter competing with one another on Spike's Lip Sync Battle —Zendaya won over the crowd with a spot-on rendition of Bruno Mars' \"24K Magic,\" while Holland performed Rihanna's \"Umbrella\" in a leather get-up—the Internet began to flood with suspicions that the co-stars are more than just friends. The two also frequently appeared on each other's Instagram and Snapchat stories and often playfully interacted on the red carpet. Then, in August, shortly after Spider-Man: Homecoming was released, Zendaya told Variety that Holland is \"literally one of my best friends,\" but adamantly denied any rumors that the two were romantically linked. The Marvel superstars each jumped on Twitter to poke fun at the reports that their relationship was more than platonic, citing the endless Spider-Man press tours as a reason the public might suspect that they were officially together as an item.\n\nBut now, according to Us Weekly , Zendaya and Holland apparently are dating—they're just keeping everything extremely low key, and have been this entire time. The evidence of a romantic relationship between the two is inconclusive, but they did go holiday shopping together and posted pictures and videos of the whole ordeal on Snapchat . Zendaya's parents have also met Holland over dinner on December 9, while celebrating the release of her new movie musical, The Greatest Showman , and according to the reports; reportedly, Zendaya's parents are big fans of her \"best friend\" Tom Holland.\n\nIn Spider-Man: Homecoming , Holland played Peter Parker and Zendaya played his friend turned love interest, MJ. The former Disney star generally keeps very quiet about her personal life, but earlier this year she told Entertainment Tonight that rumors linking the two Spider-Man stars romantically was to be expected. “I mean, it comes with the territory. It comes with the job, so it's all good,” Zendaya said. The next time Zendaya and Holland take the red carpet together, you know, for work , will be for the release of the Spider-Man: Homecoming sequel in 2019, but until then, body language experts will have to keep a keen eye out for any future public appearances worth analyzing because this rumor just won't die.\n\nRelated: Zendaya Just Stepped Out with a Platinum Blonde Pixie, And, Of Course, She Looks Stunning", "images": ["https://www.wmagazine.com/images/w_logo.svg", "https://vulcan.condenastdigital.com/wmag-services/photos/592f1832802c577242df3ef7/1:1/w_128,c_limit/Bella%20Hadid.jpg", "https://media.wmagazine.com/photos/5a319524f46871653c88d6e3/2:1/w_790,c_limit/GettyImages-696193274.jpg", "https://vulcan.condenastdigital.com/wmag-services/photos/592f195a802c577242df3f00/1:1/w_128,c_limit/Cara%20Delevingne.jpg", "https://media.wmagazine.com/photos/5a319524f46871653c88d6e3/4:3/w_1536/GettyImages-696193274.jpg", "https://vulcan.condenastdigital.com/wmag-services/photos/592f1855cc1eac746f6e7549/1:1/w_128,c_limit/Kristen%20Stewert.jpg"], "top_img": "https://media.wmagazine.com/photos/5a319524f46871653c88d6e3/2:1/w_790,c_limit/GettyImages-696193274.jpg", "keywords": [], "authors": ["Brooke Marine", "David M. Benett Getty Images"], "canonical_link": "https://www.wmagazine.com/story/zendaya-tom-holland-dating-rumors-wont-die", "title": "The Zendaya and Tom Holland Dating Rumors Just Won't Die", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=no, width=device-width, initial-scale=1, maximum-scale=1", "msapplication-TileColor": "#ffffff", "msapplication-TileImage": "/images/favicon/ms-icon-144x144.png", "theme-color": "#ffffff", "author": "Brooke Marine", "copyright": "Copyright (c) Condé Nast 2019", "description": "Zendaya and Tom Holland have both denied reports they're dating, but the rumor mill keeps churning this one out.", "publishDate": "2017-12-13T21:32:11Z", "keywords": "zendaya,Spider-Man: Homecoming,tom holland", "fb": {"app_id": 230068530489385, "admins": 108943, "pages": 40621875003}, "og": {"site_name": "W Magazine", "title": "The Zendaya and Tom Holland Dating Rumors Just Won't Die", "url": "https://www.wmagazine.com/story/zendaya-tom-holland-dating-rumors-wont-die", "description": "They've both denied it, but the rumor mill keeps churning this one out.", "type": "article", "image": "https://media.wmagazine.com/photos/5a319524f46871653c88d6e3/2:1/w_790,c_limit/GettyImages-696193274.jpg"}, "twitter": {"card": "summary_large_image", "site": "wmag", "title": "The Zendaya and Tom Holland Dating Rumors Just Won't Die", "description": "They've both denied it, but the rumor mill keeps churning this one out.", "image": "https://media.wmagazine.com/photos/5a319524f46871653c88d6e3/2:1/w_790,c_limit/GettyImages-696193274.jpg?mbid=social_retweet", "domain": "wmagazine.com"}, "version": "2.0.0"}, "movies": [], "publish_date": 1513200731.0, "source": "https://www.wmagazine.com", "summary": ""}