{"url": "https://www.regisjesuit.com/page.aspx?pid=1611&storyid6067=21732&ncs6067=3", "text": "Franklin '13 Announces Retirement from Competitive Swimming in Heartfelt Letter Missy announced that she would be retiring from competition in a letter to ESPN.\n\nFranklin '13 Named a 2019 Colorado Sports Hall of Fame Inductee Missy will be inducted in April 2019 to the Colorado Sports Hall of Fame. Read the article.\n\nFranklin Discusses Overcoming Body Issues Missy Franklin '13 discusses body issues she experienced especially during her teenage years and how she worked to overcome them in this podcast.\n\nMissy Announces Engagement Missy Franklin '13 announced her engagement to Hayes Johnson via Instagram on 09.23.18. Congratulations to our Golden Girl.\n\nMissy Defines Success Beyond the Typical Missy Franklin '13 again shows how success should be defined beyond winning medals and setting records. Read the story.\n\nFranklin Reflects on Her Performance at Nationals Missy Franklin '13 continues to inspire as she speaks candidly about both her physical and mental struggles after failing to quality for the U.S. National team: READ THE STORY\n\nFranklin '13 Falls Short of Qualifying for the PanPacs and Worlds Returning to Nationals for the first time since surgery, Missy missed qualifying for both the Pan Pacific and World Championship meets next summer. Read the story.\n\nFranklin '13 Heads to Nationals Missy returns to her first major meet since Rio with a new appreciation for the virtue of patience. Read the story.\n\nMissy to Compete in Freestyle at U.S. Nationals Franklin '13 will swim in the 100 and 200 free at U.S. Nationals, just her fourth meet since having double-shoulder surgery. READ THE STORY\n\nFranklin '13 Returns to Colorado in August for Charity Event Missy Franklin will appear with other Olympians at a charity swimming event supporting cancer research at Children's Hospital Colorado. Learn more.\n\nMissy's Return to Competition is a Victory Unto Itself Read how Franklin's '13 return to competitive swimming at the Mare Nostrum is a win.\n\nThree Lessons to Learn from Missy Franklin '13 According to Swimming World magazine, Missy Franklin's struggles can teach us three important lessons. READ THE STORY\n\nFranklin's Successful Return to Competition Returning to competition for the first time since her surgery, Missy Franklin '13 swims well. Read the story.\n\nMIssy Franklin '13 Returns to Competition For the first time since undergoing surgery on both shoulders, Missy is entered to compete in the three-meet Mare Nostrum series in Europe. Read the story.\n\nFranklin '13 Makes a Splash with a Giant Kickboard As an ambassador for the USA Swimming Foundation's Make a Splash tour, Missy got in the water with a giant kickboard to help promote the work. Read the story.\n\nMissy Talks about Making a Splash as a USA Swimming Ambassador Franklin '13 discusses the importance of learning to swim and the lifelong benefit of learning how to swim. Watch the interview.\n\nFranklin Working toward a Comeback Missy Franklin '13 transferred to the University of Georgia in January 2018 to complete her degree. She has also been training hard in the pool. READ THE FULL STORY.\n\nFranklin Opens Up About Depression Missy Franklin '13 speaks openly to CNN about depression and the importance of mental health for athletes. See the full story here.\n\nFranklin Counted among the Most Accomplished Athletes at Cal Though she has since transferred to the University of Georgia, Cal-Berkeley still counts Missy Franklin '18 among their most accomplished athletes. Read the story.\n\nFranklin Roots on the 2018 Winter Athletes with Fellow Olympic Champions As opening ceremonies for the Winter Olympics broadcast tonight, #GreatRaider Missy Franklin '13 is cheering on the athletes from Utah with fellow Olympic champions. WATCH THE STORY\n\nHow Missy Franklin '13 and Mikaela Shiffrin Became Friends As the 2018 Winter Games are primed to begin, Colorado Olympians Franklin and Shiffrin recall how they met and became friends: READ THE STORY FROM NBC NEWS\n\nMISSY FRANKLIN ’13 RETURNS TO CAMPUS FOR TALK AND SWIMMING CLINIC Five-time gold-medalist and #GreatRaider Missy Franklin ’13 returns to her alma mater on Saturday, February 17 for a presentation and clinic in support of the Ripples to Waves Foundation, which provides free swim lessons to children. 2:00-2:45 pm | The Z Theatre – Missy speaks on perseverance and her experience as a female athlete; open to all with a suggested $20 donation to Ripples to Waves\n\n– Missy speaks on perseverance and her experience as a female athlete; open to all with a suggested $20 donation to Ripples to Waves 3:00-5:00 pm | RJ Pool – Starts and turns clinic with Missy and SwimLabs coaches; limited to 40 participants, age 10+ with a $150 donation (includes talk and clinic) See the flyer for complete details. Contact Meg Perron at mperron@swimlabs.com with questions and to register. Don’t miss this opportunity to see Missy and hear her inspirational story!\n\nMissy Franklin '13 Relocates to Georgia Missy announced that she has transferred to the University of Georgia to complete her degree and reboot her swimming career. Read and see coverage of her move: ESPN\n\nFox Sports\n\nMercury News\n\nNBC 11 Alive in Georgia - coverage by Cheryl Preheim Good luck at your new school, Missy. You will bloom there we are as sure as we know that you will always be a Raider.\n\nMissy Selfie Featured in SwimSwam's Best Photos of 2017 See the full list: https://swimswam.com/best-swimming-photos-2017-surface/\n\nWhat's It Like Living & Hanging With The Bear Bros? Earlier this year the Cal Bear Bros gained a new Bro-ette with ​Missy Franklin.​ Franklin started training with ​Dave Durden​ and the Cal men's program this past fall after the 2016 Rio Olympics. As if that was not enough fun, she even moved into a house with ​Jacob Pebley, Josh Prenot, ​and ​Ryan Murphy​.​ That has to be one of the fastest swimming houses of all time. At the very least, it's the house with the most bling -- 10 Olympic medals, to be exact. READ THE FULL STORY\n\n'Relentless Spirit' Features Missy Franklin's '13 Years at Regis Jesuit ‘Relentless Spirit’ Book Gives Intimate Look at Missy Franklin\n\nBy Dan D’Addona, Swimming World Magazine From the minute Missy Franklin stepped on to the international stage, there was something different about her — something special.\n\nThe young teen from Colorado showed the swimming world an upbeat, engaging personality unlike it has ever seen.\n\nThe sport and the country fell in love with Franklin because of that openness, that genuineness and that infectious smile.\n\nFranklin took that openness and genuineness to a new level in her recent book “Relentless Spirit: The Unconventional Raising of a Champion” co-written with her parents, D.A. and Dick Franklin.\n\n“We have all been so thrilled with the response we have gotten,” Missy Franklin said. “Immediately, we were all anxious to see what our close family, friends and loved ones thought about it. The highest compliment we got was that is sounded exactly like us and it was so honest and authentic, and that is really what we wanted to do with it. Once we heard that feedback from the people that knew us best, I think we all felt really comfortable that was how it was going to be portrayed.” READ THE FULL ARTICLE\n\nQ&A with Arthur Ashe Kids' Day co-host Missy Franklin Missy Franklin is one of the world’s best swimmers, having won four gold medals at the 2012 London Olympics and recently winning six gold medals at the 2013 World Championships in Spain. Missy, 18, is also bringing her talents back to Arthur Ashe Kids’ Day as a co-host with TV personality Quddus, after serving as a celebrity guest at Kids’ Day in 2012. The world record holder in the 200m backstroke, Missy is about to start her collegiate swimming career at Cal Berkeley, and took some time from rehearsing to speak to USOpen.org about her upcoming plans and how excited she is to be back at Kids’ Day.\n\n\n\nUSOpen.org: How excited were you to get the invite to come back to Arthur Ashe Kids’ Day?\n\nFranklin: I was so excited. At first it was a hard decision; we were writing the e-mail saying I couldn’t do it because I was so worried about moving into college the day after the event and how stressful that would be. But my mom was writing the e-mail and I ran downstairs and said \"Stop! I have to do this. I have to!\" I had a blast here last year. ... The kids get so involved with everything and it is such a fun event so I can’t think of a better event to have my first co-hosting position.\n\n\n\nUSOpen.org: How different do you think it will be from last year, when you were part of the \"Call Me Maybe\" flash mob?\n\nFranklin: I will still be dancing this year, I promise. Another great thing about this event is all the surprises that happen. Everyone loved it last year. It was so fun because that song had such a connection to my summer. The song the U.S. Olympic swim team was known for that summer was \"Call Me Maybe,\" so to do that with Carly Rae Jepsen was awesome. I think it will be very different. I was on court for like five minutes last year and I am on stage for almost the whole show now. It is definitely more script reading but I am so excited for the experience for sure.\n\n\n\nUSOpen.org: How much are you looking forward to swimming at Cal? When do you move in?\n\nFranklin: I will literally leave right after Kids’ Day on Saturday and I get into Berkeley really late on Saturday and I move in Sunday. My mom is out there right now, she has all my stuff and my dad and I are going to meet up with her there. I think a couple weeks after I get there, we start swimming together. I can’t wait. I am so looking forward to that. I worked with [Cal women’s swim coach] Teri [McKeever] this summer again and a couple girls from Cal women’s swim team were at world championships in Spain. It was nice to spend the summer with them again and it was my last meet with my coach from Denver so that was great too. But I can’t wait to swim for Cal.\n\n\n\nUSOpen.org: How pleased were you with your performance at World Championships, setting a record with six gold medals? Did you think it was better than London?\n\nFranklin: There was definitely a lot of improvements from London that were awesome to see, and also things that weren’t as good as London. The best part about swimming is every time you swim, you learn something about yourself and about your strokes.\n\n\n\nUSOpen.org: What are your goals for this year? Are you eyeing the 100m world record?\n\nFranklin: Absolutely, of course! But it is definitely not what I think about when I train. Right now my goal is NCAA Championships in 2014. Now that I am a college swimmer that is the big goal, and after that I’ll start focusing on the big meets for the summer and for the USA Team. Read the full article at the US Open.\n\nMissy Franklin presented with quilt CENTENNIAL - It has been a rare time out of the water for Missy Franklin. She's had a break from training after coming home from the World Championships with 6 gold medals, something no woman had ever done before.\n\n\n\nThat time off, Missy says, is just what she's needed before she moves to California for college. However, before the big move she got a touching surprise that brought the last 18 years back.\n\n\n\nThere is a rhythm to life. Time brings stops and starts as trials and joys weave who we become.\n\n\n\nHelen Lenda compiled markers of time in a way few others do. She turned a garbage bag of T-shirts into a quilt for Missy, a canvas that shares a life journey.\n\n\n\n\"This is going to be an absolutely fantastic quilt for Missy. It's going to be a surprise,\" Missy Franklin's Mom, D.A., said.\n\n\n\nD.A. looked at the pieces pinned together on the wall. She thought back on the tempo of the last 18 years, with the kind of detail only a parent can conjure. She spotted a piece of blue fabric.\n\n\n\n\"Oh, it is Missy's baby blanket,\" she said, touching it gently. \"I really wanted this to be part of it.\"\n\n\n\nDown the line of perfectly symmetrical quilt squares are memory after memory.\n\n\n\n\"Here is her Gators shirt. She started the neighborhood swim team when she was 5 years old,\" D.A. said.\n\n\n\nThen there was the Olympic trials T-shirt from when Missy was 13 years old. D.A. saved every T-shirt and the stored each story that went along with it.\n\n\n\n\"This one is from Dick,\" she said, pointing to a Harley Davidson shirt. \"Missy and her dad would go for rides. To this day, I don't let them leave the neighborhood.\"\n\n\n\nOver the years, Missy's cadence in the pool continued to bring unmatched success. She earned four Olympic Gold medals and a bronze at the Summer Olympics in London. She won six gold medals at the World Championships in Barcelona this summer. It was something no other woman had accomplished before her.\n\n\n\nAs her fame grew, so did the times she spent at places like Children's Hospital Colorado. It has been important to the young woman. She is always looking to give back.\n\n\n\n\"Coming here is one of my favorite things to do. These children are beautiful. They are so inspiring,\" Missy said.\n\n\n\nMissy headed to a stage set up in the hospital lobby to answer questions from patients, staff and parents. They say her time there has always been a gift. She had no idea that this time, the kids had planned a gift for Missy.\n\n\n\nThey presented big bag to the surprised Olympian. \"Oh wow! Oh my gosh!\" Missy gasped. It was the quilt.\n\n\n\n\"I saw her eyes light up when she started to recognize it and realized it was her T-shirts from over the years,\" D.A. said.\n\n\n\nMissy ran over and gave her mom a hug.\n\n\n\n\"This is incredible, lots of memories there,\" Missy said. D.A. Franklin blinked back tears.\n\n\n\nThe Children's Hospital Colorado says the quilt is its way of thanking Missy for everything she's done for the kids over the years.\n\n\n\nThe back of the quilt shows gold drawings of gold medals that patients designed themselves. She noticed every detail.\n\n\n\n\"We listened to Mama\" is embroidered on that square.\n\n\n\nThe newest shirt on the quilt is the only one showing the swimming sensation's future, a college T-shirt from the University of California-Berkeley. She will compete with the Bears this season.\n\n\n\nBut you won't find the sentimental quilt in Missy's dorm room. Her mom said she is not taking it to college.\n\n\n\n\"When she is done with college and she has a place and a proper place to put it, where people aren't going to sit on it and not have dirty shoes on it, then she can have it,\" D. A. said.\n\n\n\nMissy stretched out the quilt to get a closer look.\n\n\n\n\"I can't even express how much this means to me. It is my life in a blanket,\" she said.\n\n\n\nLife has a rhythm, bringing with it measures of time you could never predict. Yet it carries a certainty too: it continues on. It is ever changing.\n\n\n\nThat is apparent this weekend as Missy moves into her dorm room and begins another chapter of life. Watch the video and read the article at 9News.\n\nOlympic Swimmer Missy Franklin Heads to College Missy Franklin is college-bound.\n\n\n\nThe 18-year-old became the first US female swimmer to win six gold medals at the World Championships in Barcelona on Aug. 4, but she's already focused on starting her life as a student at the University of California, Berkeley.\n\n\n\n\"Honestly just being home is enough of a celebration for me,\" the four-time Olympic gold medalist, who will go straight from hosting the US Open Arthur Ashe Kids' Day to move into her dorm room, told PEOPLE on Tuesday.\n\n\n\nWhile such a busy schedule could be overwhelming for some, Franklin takes it all in stride, with the help of her trademark upbeat attitude.\n\n\n\n\"I’ve heard so many incredible things about college and I’ve given up so much for this experience,\" she said. \"I'm so looking forward to it.\"\n\n\n\nStill, moving away from home for the first time can be hard on everyone – especially parents. Franklin says her mom is \"a total mess,\" adding that \"we both bawl our eyes out every time we talk about it.\"\n\n\n\nRegardless, the freshman is \"excited to live in the dorms and have a roommate,\" she said. But as for partying, Franklin admits she's \"never been to a party before\" an unusual admission for someone of her age, until you remember that she won her first gold medal at 17.\n\n\n\nAs for those coveted gold medals, Missy will not be taking them to Berkeley. Instead, she prefers to keep them at home with her parents in a safety deposit box and \"take them out for special occasions.\"\n\n\n\nWhen asked if she thinks her fellow classmates will recognize her at her new school, the swim star laughed bashfully.\n\n\n\n\"I’m just going to go there as Missy the freshman, you know? Like every other freshman going there ... to have the time of my life.\" Read the full article in People Magazine.\n\nMissy Franklin Named Finalist for 2013 Sportswoman of the Year National Team member Missy Franklin is a finalist for the Women’s Sports Foundation’s Sportswoman of the Year award. The winner will be announced at the 34th Annual Salute to Women in Sports on Oct. 16 at Cipriani Wall Street in New York City.\n\n\n\nFranklin is one of eight finalists who were selected based on their athletic achievements between Aug. 13, 2012 and July 31, 2013. The other finalists include: Mao Asada, figure skating; Kelly Clark, snowboarding; Tina Maze, alpine skiing; Tatyana McFadden, Paralympic track and field; Inbee Park, golf; Jenn Suhr, track and field; and Serena Williams, Tennis.\n\n\n\nVoting for Sportswoman of the Year is now open and runs through Sept. 9. To vote, click here.\n\n\n\nAt the 2013 FINA World Championships, Franklin won gold in the 200-meter freestyle, 100m backstroke and the 4x100m free relay during the nomination period. She went on to capture three more gold medals becoming the first women in history to win six gold medals at a single world championships. The 18-year-old also won four golds in the 100- and 200m back and free at the 2013 Phillips 66 National Championships in June.\n\n\n\nOver the past year, Franklin won several awards, including International Swimming Federation 2012 Female Swimmer of the Year, 2012 James E. Sullivan Award as top U.S. amateur athlete and 2013 ESPY Award for Best Female United States Olympic Athlete.\n\n\n\nPast Sportswoman of the Year recipients include: (Individual) Gabrielle “Gabby” Douglas, Gymnastics; Yani Tseng, Golf; Yuna Kim, Figure skating; Erin Popovich, Paralympic Swimming; Martina Navratilova, Tennis, and Jackie Joyner-Kersee, Track & Field; (Team) Alex Morgan, Soccer; Abby Wambach, Soccer; Jessica Mendoza, Softball; Misty May & Kerri Walsh, Beach Volleyball; Lisa Leslie, Basketball, and Serena & Venus Williams, Tennis. Read the full article in USA Swimming.\n\nMissy Franklin Nominated for 2013 Sportswoman of the Year Award Missy Franklin has been nominated for the Women’s Sports Foundation’s 2013 Sportswoman of the Year Award in the Individual Sport category. Each year, the Women’s Sports Foundation allows sports fans to cast their votes for whom they think is the most outstanding female athlete over the past year. As described by their website, the Women’s Sports Foundation has selected it’s nominees based on their achievements between August 13th, 2012 and July 31st, 2013. The winner of the award is selected by a 50-50 vote, where 50% of the vote comes from the public, and 50% comes from an Awards Committee.\n\n\n\nFor Missy Franklin, this qualification period encompasses all of her achievements after the London Olympics. Therefore, this includes her 4 wins at the World Championship Trials, and all of her golds from the 2013 FINA World Championships in Barcelona, Spain, amongst other honors as well. Missy’s competition within the Individual Sport category includes Mao Asada (Japan, Figure Skating), Kelly Clark (United States, Snowboarding), Tina Maze (Slovenia, Alpine Skiing), Tatyana McFadden (United States, Paralympic Track & Field), Inbee Park (South Korea, Golf), Jenn Suhr (United States, Track & Field), and Serena Williams (United States, Tennis).\n\n\n\nThe Women’s Sport Foundation was founded in 1974 by tennis legend, Billie Jean King, and has dedicated itself to “advancing the lives of girls and women through sports and physical activity”. Swimmers have been well represented in the Individual Sport category since its inception in 1993, with Amy Van Dyken (1996), Jenny Thompson (2000), and Natalie Coughlin (2003) all winning the award in past years. Before 1993, when the award had two different categories (Professional and Amateur), Tracy Caulkins (1981) and Janet Evans (1989) both won the award in the Amateur category as well.\n\n\n\nFranklin’s nomination comes less than one week after it was announced that she would co-host the Arthur Ashe Kids’ Day on August 24. Franklin’s rise to high-profile athlete and national icon status has been nothing short of remarkable as she continues to be one of the most visible female swimmers in and out of the pool in recent memory. Fans can vote for Franklin at the competition’s landing page, which can be found here. Read the full article in SwimSwam.\n\nMissy Franklin To Co-host Arthur Ashe Kids’ Day Fresh off of winning six gold medals at the 2013 FINA World Championships, Missy Franklin will co-host Arthur Ashe Kid’s Day August 24th. The 4-time Olympic gold medalist has remained very visible in and out of the water since her stunning performance at the 2012 London Olympic Games by lending her support to numerous charities. Arthur Ashe Kid’s Day is a spectacular single-day event the Saturday before the US Open Tennis Championships. A-list celebrities and sports stars attend every year, stumping for the values that made the sports icon and humanitarian Arthur Ashe so respected and loved.\n\n\n\nNext on Franklin’s schedule, UC Berkeley, where she will be busy with her studies and the Cal Golden Bears’ dual meet season starting soon.\n\n\n\nAbout Arthur Ashe Kids’ Day\n\nArthur Ashe Kids’ Day presented by Hess is the largest single-day, grassroots tennis and entertainment event in the world, with chart-topping performers, celebrities and some of the best tennis players in the game coming together to celebrate the life and values of tennis legend and humanitarian Arthur Ashe. The event takes place the Saturday before the US Open.\n\n\n\nArthur Ashe Kids’ Day features a ticketed Stadium Show and concert inside Arthur Ashe Stadium preceded by a free Grounds Festival on the grounds of the USTA Billie Jean King National Tennis Center in Flushing Meadows, N.Y.\n\n\n\nAmong those who have performed at the Ashe Kids’ Day on their way to stardom are Justin Bieber, Rihanna, Britney Spears, Jessica Simpson, Sean Kingston, Demi Lovato, Ne-Yo, Gavin DeGraw, Carly Rae Jepsen and the Jonas Brothers. A “Who’s Who?” of the tennis world has given back to the game during this fun-filled afternoon, including Andre Agassi, Kim Clijsters, Lindsay Davenport, Novak Djokovic, Roger Federer, John McEnroe, Rafael Nadal, Andy Roddick, Maria Sharapova, Serena Williams and Venus Williams. They’ve been joined by celebrities including Alec Baldwin, Nick Cannon, John Cena, Ellen DeGeneres, Will Ferrell Tony Hawk, Randy Jackson, Matthew Morrison, and Kenan Thompson.\n\n\n\nThe free Grounds Festival offers interactive games, music and tennis activities for all ages so that kids and their families can enjoy the health and fitness benefits of tennis. Families can test their skills, watch top tennis pros and have a chance to win prizes. The Grounds Festival also features a free concert with exciting up-and-coming talent on the Hess Express Stage.\n\n\n\nThe proceeds from Arthur Ashe Kids’ Day help support USTA Serves, the USTA’s national charitable foundation, and the National Junior Tennis and Learning (NJTL) network. NJTL was founded by Ashe, Charlie Pasarell and Sheridan Snyder and is a nationwide group of more than 600 nonprofit youth-development organizations that provide free or low-cost tennis, education and life-skills programming to more than 325,000 children each year.\n\n\n\nFor more information on Arthur Ashe and his legacy, please visit the Arthur Ashe Learning Center at www.arthurashe.org. Read the full article in SwimSwam.\n\nMissy Franklin stands alone Missy Franklin entered elite company Sunday as she won her sixth gold medal at the swimming world championships.\n\n\n\nThe 18-year-old Franklin became the most successful female swimmer ever at the worlds and improved on her performance at the London Olympics, where she was one of the biggest stars with four golds and a bronze. She eclipsed the women's record that had had been shared by Tracy Caulkins, who won five times at the 1978 worlds, and Libby Trickett, who did it in 2007.\n\n\n\nFranklin also joins Michael Phelps, Mark Spitz, Australia's Ian Thorpe and East Germany's Kristin Otto as the only swimmers to capture as many as six golds at either worlds or an Olympics. \"I still can't really believe that it happened,\" Franklin said. The Aussies took the silver in 3:55.22. Russia held on for the bronze (3:56.47).\n\n\n\nFranklin completed a grueling week in which she competed in eight events. She dropped out of the 50 backstroke after swimming in the preliminaries of the non-OIympic event, wanting to focus on more important races, and took fourth in the 100 freestyle. Otherwise, it was all gold.\n\n\n\n\"I knew I had to get out there for my team,\" Franklin said. \"We had really tough competition in that race, so we were sitting there in the ready room and we said, 'No matter what happens, we're just going to do our best and have fun and we can't let each other down if we do that.' So I just went out there and it hurt really, really bad, but now we're done and we're all super excited.\"\n\n\n\nThe victory in the final race of the meet came after a stunning result for the Americans in the next-to-last event.\n\n\n\nThe men appeared to have an easy victory in their 400 medley relay, but 19-year-old breaststroker Kevin Cordes, the least experienced member of the foursome, left too soon on the exchange between the first and second legs. The US team, which touched nearly one and a half seconds ahead of France, was disqualified. The French moved up to take the gold, while the silver went to Australia and Japan snatched the bronze.\n\n\n\n\"A relay disqualification is not a particular individual's fault,\" said Nathan Adrian, who swam the freestyle anchor in vain. \"It's Team USA's fault and it falls on all of our shoulders.\" Read the full article in ESPN.\n\nFranklin era in swimming 'just getting started' Pity to be an elite female swimmer in this age of Missy Franklin. After Franklin became the first woman to win six gold medals at a single world championships, the swimming world was again reminded: It's only the beginning.\n\n\n\nFranklin, 18, owns the most world titles by a female swimmer with nine, a feat accomplished in her second long course world meet. \"To look at the names she is now with is amazing and she is just getting started,\" said Todd Schmitz, her longtime coach.\n\n\n\nFranklin became only the fifth swimmer to capture as many as six golds at either worlds or an Olympics, joining a club which includes Michael Phelps, Mark Spitz, Ian Thorpe and Kristin Otto.\n\n\n\nShe's also setting herself apart from the other great American female swimmers of the last half-century, which include Donna de Varona, Tracy Caulkins, Janet Evans, Natalie Coughlin, and Jenny Thompson.\n\n\n\nDEAL: U.S. Speedskating, athletes reach settlement\n\n\n\n\"It takes decades for a swimmer like Missy to come along just like it took decades for Michael Phelps,\" said de Varona, who competed at the 1960 Olympics at just 13 and went on to win two gold medals in 1964.\n\n\n\n\"Her ability to handle the pressure and to continue to be a leader is exactly what our program needs, particularly with the vacuum that Michael left.\"\n\n\n\nUSAIN BOLT: Physicists unravel mystery of sprinter's speed\n\n\n\nJust for fun, consider how Franklin stacks up to the greatest of all time at this point in his career. Based on their first two performances at worlds, Swimming World magazine concluded: \"Franklin is on the same trajectory as Michael Phelps.\"\n\n\n\nPutting aside his single world title in the 200 butterfly in 2001, Phelps also won nine world titles in his first two full-scheduled meets (four golds at worlds in 2003 and five golds at the 2005 worlds). Of course Phelps went on to reach absurd heights with seven world titles in 2007 before his historic eight at the 2008 Olympics.\n\n\n\nAnother frightening fact for the rest of the world: Franklin probably hasn't reached her peak. With victories in the 100 and 200 backstroke, the 200 freestyle and all three relays at worlds, she has concentrated on improving her speed this year. Next, she's off to California-Berkeley to swim for Teri McKeever, also the London Olympic coach.\n\n\n\nThen there's this bummer for anyone not wearing a USA suit: teammate Katie Ledecky, 16, was named the top swimmer of the meet after winning four golds and setting the world record in both the 800m and 1500m free. \"Great one-two punch,\" said de Varona about America's top teens.\n\n\n\nAfter Franklin won her final gold swimming the leadoff leg in the 400-meter medley relay on Sunday, Australia's Cate Campbell was asked if she's scared about the future.\n\n\n\n\"Absolutely I'm terrified,\" Campbell said with a laugh. \"She's definitely given me the motivation to go and train a little bit harder.\"\n\n\n\nThree years from the next Summer Games in Rio de Janeiro, the rest of the world likely feels the same. Read the full article in USA Today.\n\n5 reasons to be inspired by Missy Franklin Team USA Olympic gold-medalist swimmer Missy Franklin (that’s an accomplished mouthful if we’ve ever heard one), is becoming a Golden Bear this fall! That’s old news, of course, but we thought with the school semester fast approaching (what, we have to do homework again?!) you could use an extra boost of inspiration from her arrival.\n\n\n\n1) She was 17 when she won. The 2012 London Olympics were held while the new Team USA member was still in high school. She was planning her senior year while simultaneously nabbing four gold medals with world-class athletes left, right and center (although while in the pool, just left and right). She wasn’t even of legal age yet! How many people can say they’ve achieved that much so early in life? Instead of making you feel hopelessly unaccomplished, this should give you hope and push you to strive for more. You don’t have to be a Cal alum to accomplish great things! You can start right now and make a name for yourself before you’ve even donned a cap and gown. The fact that you got accepted here and made the extremely wise decision of attending means you’re already on the right track.\n\n\n\n2) She’s friends with cool people. That’s putting it mildly. She wasn’t alone when she was taking the world by storm last year with her performance. Her name is alongside Dana Vollmer’s and Natalie Coughlin’s — fellow Olympic medalists — on the national team roster. She cheered on Michael Phelps as he broke his own record … and he cheered her on right back as she launched her career. She’s probably already grabbed frozen yogurt with Nathan Adrian at Yogurt Park while she was visiting Berkeley for a campus tour. You could just be jealous of all this and sit around whining. Or you could take it as proof that if you work hard you can live it up with big shots while BEING a big shot yourself. Maybe one day your name will be tossed around with the likes of Donald Trump or even Obama! Aim high. You go to UC Berkeley — it isn’t much of a stretch.\n\n\n\n3) She’s humble. While we don’t know Missy personally and are unfortunately not actually on first name terms with her (though we wouldn’t mind if she changed that!), from what we have seen, she’s a sweetheart. We at the Clog were able to meet the athlete when she was still a maybe-freshman-Cal-bear and visiting the school last year. She sat in on an ordinary English discussion, and when everyone went around the room introducing herself she just said her name and that she was checking out the school on a recruiting tour. She didn’t drop the word “medal” or “Olympics” once. Someone even had to ask her which sport she was recruiting for! Not only is she ridiculously tall (we felt like dwarves when she stood up), she remembers she’s a person just like us. Keep that in mind for when you make it big one day. You may be cool and all, but that doesn’t mean everyone should know it every time you open your mouth. Being humble will actually make you cooler.\n\n\n\n4) She’s into school. Watch this interview, and you’ll see she doesn’t say Cal is lucky to have her or that she’s there only for the swim program. She talks about getting a degree, something we almost forget about when talking about her swim career and whether she’s going collegiate or pro. She says that academics are important to her and that regardless of her status as an athlete, she’ll be graduating from Cal, which is an accomplishment in and of itself! Even amid all the Olympic chatter, she’s been able to keep her perspective on education, and we think that’s extremely important. We’re lucky to be going here! While swimming is one of the things that opened the door to Cal for Missy, Cal is going to be opening a lot of doors for us in the future. Making it through all the challenges it throws at us is something we’ll have in common with champions like her.\n\n\n\n5) She’s still not done. We’ve mentioned her Olympic medals three times already, but those aren’t the only ones she’s won. She’s taking home six gold medals from the world championships in Barcelona, adding to her already incredible record. But is she calling it quits and going back to her mansion to lord over all that metal? (Note: We exaggerate and don’t know what type of house she lives in, but a mansion would be cool). No, she says there’s still things she can work to improve. She’s planning out the rest of her career. She’s won countless races and had a career in the last few years most people can only dream of … and she’s just getting started! We can all do that. Don’t settle for something if you know you can do better. Test your abilities and push yourself to your absolute limits. Don’t go off the deep end (swimming pun!), but don’t sit on your butt all day waiting for things to happen to you. Take it from our incoming Golden Bear, reach for the stars and keep reaching!\n\n\n\nWe hope this has helped show you that Missy’s entrance to Cal means more than just a chance to see someone famous. That being said, we can’t promise the Spieker Aquatics Center will be free of people who “just happened to be in the area.” Adrian stalkers, you now have friends to conspire with! Read the full article in The Daily Californian.\n\nMissy Franklin wins record 6th gold at swim worlds BARCELONA, Spain (AP) — Missy Franklin stands alone.\n\n\n\nFranklin claimed her record sixth gold medal of the world championships Sunday night, swimming the leadoff leg for the Americans in the 400-meter medley relay. She gave the U.S. a slight lead, and her teammates — Jessica Hardy, Dana Vollmer and Megan Romano — made it look easy from there. The winning time was 3 minutes, 53.23 seconds.\n\n\n\nLOCHTE: Enjoys success at worlds\n\n\n\nThe 18-year-old Franklin became the most successful female swimmer ever at the worlds and improved on her performance at the London Olympics, where she was one of the biggest stars with four golds and a bronze.\n\n\n\nShe eclipsed the women's record that had had been shared by Tracy Caulkins, who won five times at the 1978 worlds, and Libby Trickett, who did it in 2007.\n\n\n\nFranklin also joins Michael Phelps, Mark Spitz and East German Kristin Otto as the only swimmers to capture as many as six golds at either worlds or an Olympics.\n\n\n\nAustralia took the silver in 3:55.22. Russia held on for the bronze (3:56.47).\n\n\n\nUSAIN BOLT: Physicists unravel mystery of his speed\n\n\n\n\"I'm not really sure where that came from but I'm really happy with that,\" Franklin said. \"I knew I had to get out there for my team. We had really tough competition in that race, so we were sitting there in the ready room and we said, 'No matter what happens, we're just going to do our best and have fun and we can't let each other down if we do that.' So I just went out there and it hurt really, really bad, but now we're done and we're all super excited.\"\n\n\n\nThe victory in the final race of the meet came after a stunning result for the Americans in the next-to-last event.\n\n\n\nThe men appeared to have an easy victory in their 4x100 medley relay, but 19-year-old breaststroker Kevin Cordes, the least experienced member of the team, left too soon on the exchange between the first and second legs.\n\n\n\nThe U.S. team, which touched nearly one and a half seconds ahead of France, was disqualified. The French moved up to take the gold, while the silver went to Australia and Japan snatched the bronze.\n\n\n\n\"A relay disqualification is not a particular individual's fault,\" said Nathan Adrian, who swam the freestyle anchor in vain. \"It's Team USA's fault and it falls on all of our shoulders.\"\n\n\n\nCordes came into the meet touted as the next great American breaststroker, but he endured a tough week in Barcelona. The teenager failed to win an individual medal, then cost him and his team a gold in the finale.\n\n\n\n\"If us four ever step up again, we're never going to have a disqualification, that's for sure,\" Adrian vowed. \"It will really motivate him. I don't doubt if in the next couple years we're going to have the fastest breaststroker in the world swimming for Team USA. This could be a catalyst for that.\"\n\n\n\nCordes stood on the deck in disbelief, hands on his head, but the replay showed he clearly left the block before backstroker Matt Grevers touched the pad. Ryan Lochte could only shake his head, having contributed a strong butterfly leg that didn't matter. He was denied his fourth gold medal of the meet, leaving him tied with Chinese star Sun Yang as the most successful male swimmers.\n\n\n\nFranklin stood above them all — even though, amazingly enough, she was not even named the top female swimmer of the meet.\n\n\n\nThat award went to fellow American Katie Ledecky, who won four golds and set two world records. She edged out Franklin based on a formula that doesn't count the relays and gives bonus points for world marks.\n\n\n\nSun was named the top male swimmer after sweeping the freestyle distance events. He closed with a victory in the 1,500 free, adding to his triumphs in the 400 and 800. Read the full article in USA Today.\n\nMissy Franklin wins 4th gold BARCELONA, Spain -- Missy Franklin won her fourth gold medal of the world swimming championships with a strong anchor leg for the United States in the 4x200-meter freestyle relay Thursday.\n\n\n\nKatie Ledecky earned her third gold of the meet, swimming leadoff for the Americans.\n\n\n\nLedecky led France's Camille Muffat at the first exchange, but the U.S. slipped back to second -- first behind the French, then Australia -- as Shannon Vreeland and Karlee Bispo took over for the middle legs.\n\n\n\nBut the U.S. was close enough when Franklin dove in for the final 200. She zipped by Australia's Alicia Coutts and won going away in 7 minutes, 45.14 seconds. Australia settled for silver in 7:47.08, while France took the bronze in 7:48.43.\n\n\n\nJames Magnussen rallied to win the 100-meter freestyle with a furious finishing kick at the world swimming championships Thursday.\n\n\n\nThe Missile edged Americans Jimmy Feigen and Nathan Adrian, who settled for silver and bronze.\n\n\n\nThe winning time was 47.71 seconds.\n\n\n\nRussia's Vladimir Morozov went out strong, leading Adrian at the turn with Magnussen in fifth. But the Australian was stronger on the return lap, touching ahead of Feigen (47.82) and Adrian (47.84).\n\n\n\nMorozov faded to fifth. Magnussen hopped on a rope and flexed for the crowd, taking a step toward making up a disappointing performance in the London Olympics. He was favored in the 100 free but lost to Adrian by hundredth of a second, and didn't even make the final of the 50 free.\n\n\n\nEarlier, Ryan Lochte returned to the top at the championships, cruising to victory in the 200-meter individual medley.\n\n\n\nLochte trailed Brazil's Thiago Pereira after the butterfly and backstroke legs, but the American took control on the breaststroke and won going away with a powerful freestyle finish.\n\n\n\nThe winning time was 1 minute, 54.98 seconds. Japan's Kosuke Hagino took the silver in 1:56.29, while the bronze went to Pereira in 1:56.30.\n\n\n\nLochte got off to a disappointing start in the championships, finishing fourth in the 200 freestyle. But, in the third of an expected seven events at Barcelona, he has another world title. Read the full article in ESPN.\n\n3 for 3: Missy Franklin claims 3rd gold medal of swimming worlds after giving up bid for 8 BARCELONA, Spain — Missy Franklin has claimed her third gold medal of the world swimming championships with a victory in the 200-meter freestyle.\n\n\n\nFranklin gave up her bid to win eight golds in Barcelona, scratching the 50 back so she could focus on the 200 free. That decision paid off Wednesday night when she touched first in 1 minute, 54.81 seconds.\n\n\n\nItaly’s Federica Pelligrini took the silver, 0.33 behind the winner, and France’s Camille Muffat claimed bronze.\n\n\n\nMuffat went out hard, leading after the first lap and 0.75 under the world-record pace. But Franklin edged ahead at the midway point and held off a hard-charging Pelligrini at the end.\n\n\n\nIt was the most significant freestyle win of Franklin’s career. She was fourth in the 200 free at the London Olympics. Read the full article in The Washington Post.\n\nMissy Franklin Looking Good For Second Gold So Far; Hosszu Scratches After Hungarian Record BARCELONA, Spain, July 29. OLYMPIC darling Missy Franklin, who has a daunting schedule of eight events this week, is looking to set up her second gold of the FINA World Championships thus far with a strong outing in the women's 100-meter backstroke.\n\n\n\nFranklin also hopes to make some history as she could become the only woman ever to back up an Olympic victory in this event with a triumph in the 100 back the following year at Worlds. She took care of what she needed to do to advance to semis as she blasted a 59.13 in prelims, going out in 29.06 and coming home in 30.07. She's likely to clear 59 seconds in semis, as she already has a world-leading 58.67 from U.S. Nationals earlier this summer.\n\n\n\n\n\nMeanwhile, Katinka Hosszu Hosszu's time of 59.40 made her the first Hungarian to break 1:00 as she downed her national record of 1:00.24 set at the Irish Championships in April of this year. That performance lowered the legendary Krisztina Egerszegi's record, and put Hosszu in line for another final. Her swim today vaulted her to fifth in the world rankings.\n\n\n\nHosszu may not pull off a potential eight gold run like Franklin, but she's still one of the most versatile female swimmers this planet has ever seen when it comes to the amount of events in which she could potentially medal. The scary thing about Hosszu is that if given enough time, she probably could medal in every single event on the schedule.\n\n\n\nHosszu, however, had seen enough in terms of the 100 back, and told Swimming World after her swim that she was scratching the 100 back the rest of the way to focus on the rest of her daunting schedule.\n\n\n\nFranklin's future California Golden Bear teammate Elizabeth Pelton also served up a sub-1:00 in prelims with a 59.94 for the third seed. She's already been a fourth-ranked 59.27 this year at nationals and Team USA will be gunning for a 1-2 finish in the event.\n\n\n\nChina's Fu Yuanhui, currently ranked sixth in the world with a 59.56, qualified fourth in 1:00.01, while Australia's Emily Seebohm, raced to fifth in 1:00.02 after scratching the 200 IM finals to focus on this event.\n\n\n\nCzech's Simona Baumrtova (1:00.05), Japan's Aya Terakawa (1:00.09) and Canada's Sinead Russell (1:00.17) comprised the rest of the top eight out of prelims.\n\n\n\nMeanwhile Australia's Belinda Hocking (1:00.39), Ukraine's Daryna Zevina (1:00.43), France's Cloe Credeville (1:00.70), Spain's Duane Da Rocha Marce (1:00.80), China's Zhou Yanxin (1:00.99), Spain's Mercedes Peris Minguet (1:01.19), Great Britain's Lauren Quigley (1:01.23) and South Africa's Karin Prinsloo (1:01.25) also made the semifinals with Kimberly Buys moving into the top 16 with a 1:01.35 after Hosszu's intended scratch. Read the full article in Swimming World Magazine.\n\nMissy \"The Missile\" Franklin targets busy week with world champs in Spain on tap BARCELONA, Spain — Missy Franklin giggled a bit when a reporter asked for her \"body measures.\"\n\n\n\nThen she dived right in.\n\n\n\nShe's 6-foot-1. She estimated her wingspan at around 6-4ish. She wears size-13 shoes.\n\n\n\nSay this about Missy the Missile: She's comfortable in her own skin.\n\n\n\nThat wasn't always the case, though.\n\n\n\nThe endearing star of the London Olympics, where success in the water was only enhanced by her bubbly personality on dry land, conceded Friday there were some uncomfortable moments along the way.\n\n\n\n\"I'm definitely a little bit different than your average 18-year-old girl,\" Franklin said during a news conference at the world swimming championships. \"It was actually a little difficult growing up and kind of being a little bit different than everyone, always being a head above all the boys. It kind of took me a while to realize how much it helps me.\"\n\n\n\nWith Michael Phelps in retirement, at least for now, Franklin is the leading attraction for this biennial championship.\n\n\n\nA couple of months removed from her graduation from Regis Jesuit High School, Franklin will take on a Phelpsian workload by swimming eight events — five individual races, plus all three relays. The swimming competition begins Sunday.\n\n\n\n\"It's definitely a lot,\" she said. \"But I'm very, very excited. They are some of my favorite races. I'm really looking forward to those. The expectations are just to have fun.\"\n\n\n\nThat has never been much of a problem for Franklin. Read the full article in The Denver Post.\n\n2013 Swimming World Championships TV schedule, list of events Two United States swimming stars from the 2012 London Summer Olympics will be putting their skills on display for the 2013 world championships beginning Sunday, July 28. Ryan Lochte and Missy Franklin both have full schedules, that exceed the amount of events they competed in during the Olympics, as they look to prove they are still among the greatest in the world.\n\n\n\nIf you want to catch the swimming championships, below is the entire schedule and day-by-day list of events.\n\n\n\nHere is the complete televised schedule for the world championships followed by the breakdown of each day’s events:\n\nDate Time (p.m. ET) Network\n\nSunday, July 28 2:30-4:30 NBC\n\nSunday, July 28 9-11 (re-air) Universal Sports\n\nMonday, July 29 12-2 (LIVE) Universal Sports\n\nTuesday, July 30 12-2:30 (LIVE) Universal Sports\n\nWednesday, July 31 12-2 (LIVE) Universal Sports\n\nThursday, Aug. 1 12-2:30 (LIVE) Universal Sports\n\nFriday, Aug. 2 12-2:30 (LIVE) Universal Sports\n\nSaturday, Aug. 3 1-3 NBC\n\nSaturday, Aug. 3 9-11 (re-air) Universal Sports\n\nSunday, Aug. 4 4-6 NBC\n\nSunday, Aug. 4 9-11 (re-air) Universal Sports\n\nDay 1\n\nSun. 28 July Day 2\n\nMon. 29 July Day 3\n\nTue. 30 July\n\nDay 4\n\nWed. 31 July\n\n\n\nH 10.00-13.45 H 10.00-12.45 H 10.00-12.45 H 10.00-12.10\n\n100m Butterfly W 100m Back W 50m Breast M 50m Back W\n\n400m Free M 100m Back M 200m Free W 100m Free M\n\n200m IM W 100m Breast W 200m Butterfly M 200m Butterfly W\n\n50m Butterfly M 200m Free M 800m Free M 200m IM M\n\n400m Free W 1500m Free W\n\n100m Breast M\n\n4x100m Free W\n\n4x100m Free M\n\n\n\nF 18.00-20.05 F 18.00-19.50 F 18.00-20.10 F 18.00-20.00\n\n100m Butterfly W SF 100m Breast M 200m Free M 100m Free M SF\n\n400m Free M 100m Butterfly W 100m Back W 50m Back W SF\n\n200m IM W SF 100m Back M SF 50m Breast M SF 200m Butterfly M\n\n50m Butterfly M SF 100m Breast W SF 1500m Free W 200m Free W\n\n400m Free W 50m Butterfly M 100m Back M 50m Breast M\n\n100m Breast M SF 100m Back W SF 200m Free W SF 200m Butterfly W SF\n\n4x100m Free W 200m Free M SF 200m Butterfly M SF 200m IM M SF\n\n4x100m Free M 200m IM W 100m Breast W 800m Free M\n\n\n\nDay 5\n\nThu. 1 August Day 6\n\nFri. 2 August Day 7\n\nSat. 3 August Day 8\n\nSun. 4 August\n\n\n\nH 10.00-12.45 H 10.00-12.45 H 10.00-13.00 H 10.00-12.30\n\n100m Free W 50m Free M 50m Free W 400m IM M\n\n200m Back M 50m Butterfly W 50m Back M 400m IM W\n\n200m Breast W 100m Butterfly M 50m Breast W 4x100m Medley M\n\n200m Breast M 200m Back W 1500m Free M 4x100m Medley W\n\n4x200m Free W 4x200m Free M\n\n800m Free W\n\n\n\nF 18.00-20.10 F 18.00-20.30 F 18.00-20.10 F 18.00-20.25\n\n100m Free W SF 100m Free W 50m Butterfly W 50m Back M\n\n200m IM M 200m Back M 50m Free M 50m Breast W\n\n200m Breast W SF 200m Back W SF 200m Back W 400m IM M\n\n100m Free M 50m Free M SF 50m Breast W SF 50m Free W\n\n200m Butterfly W 200m Breast W 100m Butterfly M 1500m Free M\n\n200m Breast M SF 100m Butterfly M SF 50m Free W SF 400m IM W\n\n50m Back W 50m Butterfly W SF 50m Back M SF 4x100m Medley M\n\n200m Back M SF 200m Breast M 800m Free W 4x100m Medley W\n\n4x200m Free W 4x200m Free M Read the full article at FanSided.\n\nMissy Franklin wins first of eight possible swim golds BARCELONA, Spain (AP) - With Michael Phelps cheering from the stands and a big assist from a teammate, Missy Franklin got off to a thrilling start in her own quest to win eight gold medals at the world championships. Too bad the U.S. men didn't have Phelps for their relay.\n\n\n\nMegan Romano turned in a brilliant anchor leg to ensure Franklin of a gold in the women's 400-meter freestyle relay Sunday evening, chasing down the Australians in the last, furious strokes.\n\n\n\nComing off a starring role at the London Olympics, Franklin is now one-for-one in Barcelona.\n\n\n\nSeven more to go.\n\n\n\n\"Oh, my gosh, it was amazing!\" said Franklin, who clutched hands with teammate Natalie Coughlin at the edge of the pool as they cheered on Romano. \"We knew Megan could do it.\"\n\n\n\nOverall, it was good start for the American team on the first night of pool swimming at the arena atop Montjuic. Katie Ledecky, still only 16 and preparing to start her junior year of high school, nearly broke the world record while winning the women's 400 free. Connor Jaeger pulled out a bronze in the men's 400 free, which was won in dominating fashion by China's Sun Yang.\n\n\n\nIt looked as though the final race of the night would produce another red, white and blue celebration.\n\n\n\nTurns out it did - but it was Le Tricolore that waved throughout the Palau Sant Jordi when the French rallied to snatch the gold away from the Americans in the men's 400 free relay.\n\n\n\nIn a repeat of their stirring comeback at last summer's Olympics, Jeremy Stravius chased down Jimmy Feigen to set off a wild celebration among the huge French contingent in the stands.\n\n\n\n\"I actually didn't even see them until the last five meters,\" Feigen said. \"Maybe I should have paid more attention to them.\"\n\n\n\nMaybe the result would have been different if Phelps had not retired after London. He is in Barcelona to make some promotional appearances and attend the evening finals, but only as a fan. The swimming world is abuzz with speculation that he's planning a comeback, but not yet.\n\n\n\n\"He was texting me,\" said Bob Bowman, coach of the U.S. men's team and Phelps' longtime mentor. \"He was disappointed we got beat. He was just giving me his critique. It was right on.\"\n\n\n\nOf course, Phelps was on the relay team that lost in London. He helped give the Americans what looked to be a commanding lead, but Ryan Lochte couldn't hold off Yannick Agnel's furious charge for gold on the anchor leg.\n\n\n\nThis time, Agnel went out first for the French, and he was next-to-last when he handed off to Florent Manaudou. France was still only fourth after a blistering 100 by Fabien Gilot (the fastest of the night, 46.90). The U.S. was slightly ahead of the Australians when Anthony Ervin passed it off to Feigen.\n\n\n\nHe couldn't hold off Stravius, who touched the wall in 3 minutes, 11.18 seconds. The Americans took silver in 3:11.42, while Russia claimed the bronze in 3:11.44. The Aussies faded to fourth.\n\n\n\nPhelps was in no shape to swim, even if he wanted to. He arrived at the arena wearing a boot cast on his right foot, having sustained some sort of minor stress fracture that apparently worsened from playing golf.\n\n\n\n\"I tried to get him on the relay but he didn't want to do it,\" U.S. assistant coach Mike Bottom said jokingly. \"Bob actually was giving him a tough time. He was like, 'Hey, you ready to go? Let's go.' But he was limping around.\"\n\n\n\nEven so, Agnel was asked whether he was glad to see Phelps in the stands rather than in the pool.\n\n\n\n\"I don't understand the question,\" the Frenchman quipped.\n\n\n\nNo swimmer has ever won eight golds at the world championships. Phelps came oh-so-close in 2007 when he won his first seven events but never got a chance in the eighth. The Americans were disqualified in the preliminaries of the 400 medley relay while Phelps was resting up to swim in the final.\n\n\n\nThe following year, of course, he won a record eight golds on a much bigger stage, the Beijing Olympics.\n\n\n\nFranklin, now 18 and getting ready to go off to college at Cal-Berkeley, won four golds and a bronze in London. She just missed out on medals in the 100 and 200 free - events she will again swim at the worlds along the 50 back, a non-Olympic event.\n\n\n\n\"I'm right where I was last summer, which gives me a lot of confidence going into the rest of the meet,\" Franklin said. \"I think I am a little stronger in my backstrokes than my freestyles, but I've done a lot of work on my freestyle the past year so I really hope that it's going to be up there.\"\n\n\n\nShe was far behind on the opening leg after a blistering start by Australia's Cate Campbell. Coughlin and Shannon Vreeland chipped away at the Aussie lead before Romano finished the job. She edged Coutts by 0.12 seconds with a winning time of 3:32.43. The Netherlands finished another 3 seconds behind for the bronze.\n\n\n\n\"I just love to race. And relays are awesome,\" Romano said. \"It's great competing for these girls next to me. I was doing it for them. It's fun and I love it. I can't not go fast.\"\n\n\n\nDitto for Ledecky, who's also planning a grueling program at these worlds that includes the 800 and 1,500 free. It looks likes she can handle the load, her star still on the rise after a stunning gold medal in the 800 at the London Olympics when she was a complete unknown internationally.\n\n\n\n\"It is easier,\" she said. \"I am a lot more relaxed on the international stage after having the Olympics as a first international competition. It's just great to get back to a top international competition and to do well.\"\n\n\n\nThe only drama in her race was whether the world record would fall. She was on pace much of the race before winning with a time of 3:59.82 - a mere 0.67 seconds off the mark set by Italy's Federica Pelligrini back in 2009 in one of those rubberized suits that are no longer allowed.\n\n\n\nMelanie Costa of Spain took silver in 4:02.47, while the bronze went to New Zealand's Lauren Boyle in 4:03.89.\n\n\n\n\"I'm still in shock over the time,\" Ledecky said. \"The U.S. has such a great tradition of distance swimmers, so I'm just trying to do my best to live up to that.\"\n\n\n\nSun looked as though he barely exerted himself winning the first final of the night.\n\n\n\nThe towering swimmer hopped out of the pool and flexed his fists for the crowd after winning the men's 400 free in 3:41.59, far ahead of silver medalist Kosuke Hagino of Japan (3:44.82). Jaeger was next in 3:44.85.\n\n\n\n\"I had a pretty good time for me because I don't have a major challenger here,\" said Sun, who won two golds, a silver and a bronze at the London Games. \"If I had had one, I would have gone a lot faster.\" Read the full article in USA Today.\n\nBears Prep for Worlds in Barcelona BERKELEY – California will take the spotlight on the world stage once again when a large contingent of Golden Bears swims in the 15th FINA World Championships from July 28-Aug. 4 at the Palau Saint Jordi in Barcelona. Incoming freshman Missy Franklin, returning sophomore Elizabeth Pelton and alumnae Natalie Coughlin and Lauren Boyle are among the Bears competing in the long-course championships, while Cal head coach Teri McKeever is an assistant coach for the United States in Spain.\n\n\n\nMcKeever, the head coach of the U.S. squad at the 2012 London Olympics, will join several of her protégés on the U.S. team. Along with Coughlin, Franklin and Pelton, other Bears swimming for the United States include Rachel Bootsma, Elizabeth Pelton and Dana Vollmer.\n\n\n\nCal boasts swimmers competing for other countries at worlds as well. Boyle and incoming freshman Sophia Batchelor will swim for their native New Zealand. Fresh off the World University Games in Kazan, Russia, current Bears Stephanie Au and Yvette Kong will swim for Hong Kong in Barcelona. Farida Osman, another incoming freshman, swims for Egypt at worlds.\n\n\n\nNBC and Universal Sports will broadcast action – both live and taped – from the World Championships; that TV schedule is available on USASwimming.org. Results for the World Championships will be available on OmegaTiming.com.\n\n\n\nOther information from the meet is available on the official website. Fans can also follow the official World Championships’ Twitter feed @bcn2013swimming.\n\n\n\nComcast SportsNet Central recently featured three Cal alums – Coughlin, Nathan Adrian and Anthony Ervin – as they prepared in Berkeley for the World Championships. That video is available by clicking here.\n\n\n\nFranklin, who won five medals at the 2012 London Olympics, will be even busier in Barcelona, as she is scheduled to swim in eight events – the 50-, 100- and 200-meter backstrokes, the 100- and 200-meter freestyles as well as three relays: 4x100-meter freestyle relay, 4x200-freestyle relay and 4x100-medley relay. Franklin, who swam in seven events in London, holds the long-course world record in the 200-meter backstroke (2:04.06).\n\n\n\nThe Swimmer of the Meet at the NCAA Championships last March, Pelton will be swimming in her third World Championships. The American record-holder (1:47.84) and 2013 NCAA champ in the 200-yard back, she will swim in the 100- and 200-meter backs and 4x100-free relay in Spain.\n\n\n\nBootsma, the 2012 Olympic gold medalist who like Pelton will be a sophomore at Cal this fall, will compete in the 50 back in Spain. One of the Bears’ many talented backstrokers, Bootsma won the 100-yard back at NCAAs.\n\n\n\nThe 2012 Olympic bronze medalist in the 200-meter individual medley, Leverenz completed her Cal career last fall by repeating as the NCAA champ in the 200-yard IM. She will swim in the 200 IM at worlds.\n\n\n\nCoughlin – the Cal legend and 12-time Olympic medalist, who won a bronze medal in London – is slated to swim in the 50 freestyle and the 4x100-free relay. Over her storied career, Coughlin has won a total of 18 medals at long-course worlds.\n\n\n\nThe world record-holder in the 100 butterfly – which she set when she won the gold medal last summer in London – Vollmer will swim the 100 fly, 50 fly and 4x100-medley relay at worlds. She also won gold in the 4x200-free relay and 4x100-medley relay in 2012.\n\n\n\nA two-time Olympian for New Zealand, Boyle is a strong contender in the 800 free, which she won at the FINA Short-Course World Championships last December. She will swim the 400, 800 and 1500 frees in Barcelona. Batchelor – who barely missed out on a spot at the London Olympics in the 100 butterfly– is the latest in a long-line of talented international swimmers to commit to Cal. The new Bear is slated to swim the 50 fly, 100 fly and 200 back at worlds.\n\n\n\nAu, another two-time Olympian, who will be a Cal senior in 2013-14, is scheduled to swim in the 50 and 100 backs as well as in Hong Kong’s 4x100-medley relay. Kong, a returning junior, has a docket that includes the 50 and 100 breaststrokes and the 4x100-medley relay.\n\n\n\nOsman, who will also begin her Cal career in the coming season, qualified to swim in the 50 and 100 frees as well as the 50 and 100 flies at worlds.\n\n\n\nBears in Barcelona\n\n\n\nUSA\n\n\n\nRachel Bootsma, sophomore – 50-meter backstroke\n\n\n\nNatalie Coughlin, alumna – 50-meter freestyle, 4x100-meter freestyle relay\n\n\n\nMissy Franklin, incoming freshman – 100-meter freestyle, 200-meter freestyle, 50-meter backstroke, 100-meter backstroke, 200-meter backstroke, 4x100-meter freestyle relay, 4x200-meter freestyle relay, 4x100-meter medley relay\n\n\n\nCaitlin Leverenz, alumna – 200-meter individual medley\n\n\n\nElizabeth Pelton, sophomore – 100-meter backstroke, 200-meter backstroke, 4x100-meter freestyle relay\n\n\n\nDana Vollmer, alumna – 50-meter butterfly, 100-meter butterfly, 4x100-meter medley relay\n\n\n\nTeri McKeever – assistant coach\n\n\n\nEgypt\n\n\n\nFarida Osman, incoming freshman – 50-meter butterfly, 100-meter butterfly, 50-meter freestyle, 100-meter freestyle\n\n\n\nHong Kong\n\n\n\nStephanie Au, senior – 50 meter backstroke, 100 meter backstroke, 4x100-meter medley relay\n\n\n\nYvette Kong, junior – 50-meter breaststroke, 100-meter breaststroke, 4x100-meter medley relay\n\n\n\nNew Zealand\n\n\n\nSophia Batchelor, incoming freshman – 50-meter butterfly, 100-meter butterfly, 200-meter backstroke\n\n\n\nLauren Boyle, alumna – 400-meter freestyle, 800-meter freestyle, 1500-meter freestyle Read the full article in Cal Bears Athletics.\n\n2013 Worlds Previews: Franklin, Pelton Favorites to 1-2 in 200 Back While Missy Franklin has proven to be the best backstroker in the world since 20, she isn’t necessarily untouchable heading into Barcelona (though she will certainly be the favorite). Teammate Elizabeth Pelton pushed Franklin at World Championship Trials, and a pair of experienced Aussies who have made noise on the international stage will do everything in their power to give Franklin a run for her money.\n\n\n\nTHE FIELD:\n\n\n\nThe heavy favorite is defending World and Olympic champion Missy Franklin of the United States. The Colorado teenager has been absolutely dominant in this event, easily posting the top time in the world over each of the last three years. Her world record swim in London last summer (2:04.06) is 1.8 seconds quicker than the next best textile time (from Anastasia Zueva of Russia, who isn’t swimming the 200 back in Barcelona). Though it would be easy for Franklin to become complacent with her results from last summer and fall back a step as we’ve seen with a majority of the top Team USA swimmers after the Olympic year, Franklin has stayed the course (it’s probably easier to maintain a routine when you’re still in high school). She may not beat her world record performance from a year ago, but in general, she seems to only be getting better as a swimmer. A scary thought for the rest of the world as she heads to Berkeley this fall to join arguably the best backstroke training group in the world.\n\n\n\nFellow Cal Bear and Team USA swimmer Elizabeth Pelton could be the closest challenger. Franklin’s future teammate has bounced back from a heartbreaking Olympic Trials (she finished third in the 200 back and 200 IM) in a big way, smashing the American record in the short course yards 200 back at NCAA’s, and becoming the fourth fastest textile performer of all time last month. Her 2:06.29 from World Championship Trials was also a best time by 1.2 seconds, just 0.61 behind Franklin, good for second in the world this year. By challenging Franklin at Trials, Pelton proved she has reemerged as the medal contender we thought she would be after her third-ranked swim back at 2010 Pan Pacs.\n\n\n\nThe two Americans will face stiff challenges from a pair of Aussies, Belinda Hocking and Meagan Nay. Hocking had a disappointing performance in the 200 back last summer in London, failing to make the championship final after posting the fourth fastest time in 2012 at Australian Trials. Hocking is once again near the top of the ranks, however, and will look to repeat her 2011 Worlds performance, where earned a silver medal and became the second fastest textile swimmer in history (behind Franklin). Nay has been juuuuust out of medal contention on the world stage each of the last two years, touching sixth in 2011 and fifth in 2012. With Elizabeth Beisel, Anastasia Zueva, and Elizabeth Simmonds out of the field (more on them in a moment), Nay is actually the second-highest returner from the Olympic field, and the third fastest swimmer overall.\n\n\n\nThere are a number of past medalists and historically top-ranked swimmers not competing in this event in Barcelona, including last summer’s silver and bronze medalists. Elizabeth Beisel, who won bronze in London, was beaten by Pelton at U.S. Trials, locking her out of this event. Anastasia Zueva of Russia posted the second best textile performance ever to win silver last summer, but after taking time off and then breaking her foot earlier this season, she has elected to focus solely on the 100 back. Elizabeth Simmonds, who has been in the top five of the world rankings each of the last three years, was left off the British team entirely after a subpar 2013 switching training programs (she won this at British Trials, but failed to break 2:10). Japan’s Aya Terakawa has dropped the 200 backstroke from her program in 2013, despite being ranked in the world’s top 5 leading into the Olympic Games.\n\n\n\nIf you skipped over the text, went straight to the picks, and were left scratching your head at the inclusion of Federica Pellegrini… no, that’s not a misprint. The Italian superstar has elected to give up the 200 and 400 freestyle events for this season (despite holding the world record in both of them) to focus on the backstrokes, and has quickly emerged as a medal contender. She clocked a lifetime best 2:08.05 at Italian Nationals in mid-April, one of the top five times in the world at that point (she currently sits sixth). With her background as a 400 freestyler, expect Pellegrini to have some pretty quick closing speed.\n\n\n\nNote: Pellegrini will return her focus to the mid-distance frees this coming fall.\n\n\n\nSpeaking of closing speed, we have to mention Ye Shiwen of China. The current 400 IM world record holder and two-time Olympic gold medalist known for her wicked freestyle legs will certainly bring plenty to the table in Barcelona. Ye swam a lifetime best by 2+ seconds to win Chinese Nationals in 2:09.12, good for fourth in the world (she now sits ninth). She has been known to rise to the occasion, and if Ye is anywhere near the field, she could storm home and sneak away with a medal.\n\n\n\nWe should also see Sinead Russell, a returning Olympic finalist and Canadian record holder, make her way through semifinals. Russell was the third fastest 200 backstroker in the country as a freshman at the University of Florida this past short course season, and while she hasn’t put up anything particularly special in the long course pool, expect her to swim considerably faster on 100% rest in Barcelona.\n\n\n\nTHE PICKS:\n\n\n\n1. Missy Franklin, United States – 2:04.06\n\n2. Elizabeth Pelton, United States – 2:06.29\n\n3. Belinda Hocking, Australia – 2:06.06\n\n4. Meagan Nay, Australia – 2:07.16\n\n5. Federica Pellegrini, Italy – 2:08.05\n\n6. Ye Shiwen, China – 2:09.12\n\n7. Sinead Russell, Canada – 2:08.04\n\n8. Daria Ustinova, Russia – 2:08.39 Read the full article in SwimSwam.\n\nMissy Franklin and Katie Ledecky lead US women’s high expectations at swim worlds in Barcelona BARCELONA, Spain — Rebecca Soni is taking the year off. Allison Schmitt didn’t qualify.\n\n\n\nStill, with teenagers Missy Franklin and Katie Ledecky leading the way, the U.S. women’s swim team has lofty goals at the world championships, where the traditional pool events start Sunday.\n\n\n\n“Yes, we don’t have Rebecca or Allison, but Missy and Ledecky are here, and Breeja Larson is starting to come into her own. And then we’ve got veterans like Dana Vollmer and Natalie Coughlin. So it’s a pretty good mix of young swimmers and veterans,” U.S. women’s coach Dave Salo said Tuesday.\n\n\n\n“I think we’re still real solid and we’re going to do some damage on the podium,” Salo added.\n\n\n\nExpect Franklin to do a big chunk of that damage. She’s planning to swim a Michael Phelps-like load of eight events inside the Palau Sant Jordi, the arena where Phelps first swam an extensive program a decade ago at the last worlds in Barcelona.\n\n\n\nThat’s one more event than Franklin swam at last year’s London Games, when she won four golds and a bronze. Her schedule this time includes the 100- and 200-meter freestyle, all three backstroke events — 50, 100 and 200 — and all three relays.\n\n\n\n“It is a big load, but she had a big preparation for that in London, and I think she’s able to handle it,” Salo said. “And we have people to help on the relay prelims, so that will give her a chance to rest a bit.”\n\n\n\nNo swimmer — male or female — has ever won eight golds at a world championships. Phelps, of course, won a record eight at the 2008 Beijing Olympics.\n\n\n\nFranklin finished fourth in the 200 free and fifth in the 100 in London, and she has focused on improving those events.\n\n\n\n“Missy is swimming much more maturely in the 100 and 200 free,” Salo said.\n\n\n\nWhile Franklin’s potential was well known before London, Ledecky burst onto the scene a year ago as a 15-year-old when she won the 800 free with the second fastest time in history.\n\n\n\nThen at the U.S. trials last month, Ledecky became the first American woman to qualify for worlds in the 200, 400, 800 and 1,500 free. And even though she’s wavered over the 200, Salo said she’s planning to swim all four events.\n\n\n\n“The 200 might be a bit of a stretch, but she’s training really well and I think she has a lot in her,” he said.\n\n\n\nWithout Soni in the breaststroke events, veteran Jessica Hardy and the 21-year-old Larson, at her first worlds, will get their chances.\n\n\n\nThe 30-year-old Coughlin is the oldest member of the team. She’s also the only American woman here who also competed at the previous worlds in Barcelona a decade ago.\n\n\n\nVollmer, at 25, is the other established veteran and a favorite in the 100 and 200 fly.\n\n\n\nThen there’s 20-year-old Maya Dirado, who showed off her versatility by qualifying for the 200 fly, 400 IM and 4x200 relay after a strong NCAA season at Stanford. Read the full article in The Washington Post.\n\nIncoming Cal freshman Missy Franklin ready to dive into worlds The world's top female swimmer is coming to Cal, but first she's planning to reassert her dominance on the global stage.\n\n\n\nOne of the most famous incoming freshmen in the history of Cal athletics, Missy Franklin, made a splash at the U.S. championships in Indianapolis last month, winning four national titles and setting a U.S. record in the 100-meter backstroke. Now, the 18-year-old is looking to carry the momentum into international competition with another eye-dropping performance at the FINA World Championships in Barcelona, Spain, which open on Friday, though the swimming portion won't begin until July 28.\n\n\n\n\"I've been training hard and want to swim fast,\" Franklin said via email. \"It's really such an honor to be representing my country on the world stage.\"\n\n\n\nAfter winning four gold medals at the 2012 London Olympics, more than any other female athlete at the games, Franklin returned to Aurora, Colo., last fall and graduated from Regis Jesuit High School in May.\n\n\n\nRather than turning pro and potentially earning millions of dollars in endorsements, Franklin decided to enroll at Cal, where she'll swim for 2012 U.S. Olympic coach Teri McKeever. Franklin is expected to compete at Cal for two years before turning pro in advance of the 2016 Rio de Janeiro Games.\n\n\n\nFranklin said Cal felt like home from the minute she walked onto campus for her official visit.\n\n\n\n\"The swim team was obviously a big draw, along with coach Teri McKeever, but Cal is a nationally renowned school for its academics and my education is extremely important to me,\" she said, adding: \"I couldn't imagine going to any other school.\"\n\n\n\nAfter the World Championships, Franklin will return to Colorado, pack and head off to Berkeley, where classes begin on Aug. 29.\n\n\n\n\"I'm sure I'll drag my parents to do some dorm-room shopping when we get into town,\" Franklin said. \"I'm going to do my best to spend as much time as possible with my parents and close friends. ... I can't believe moving day is coming so soon!\"\n\n\n\nAt this point, Franklin is leaning toward a degree is social welfare, but she isn't committing to anything just yet.\n\n\n\n\"I am very interested in education and non-profits, so this major would certainly prepare me for these careers,\" she said. \"I am keeping my options open, however, and I'm even taking an exciting class in marine biology as that subject has always been fascinating.\"\n\n\n\nBut before she hits the books, Franklin will attempt to follow up her dazzling performance at nationals in the worlds in Barcelona, where she'll be competing in seven events: 200-meter freestyle, 100 freestyle, 200 backstroke, 100 backstroke, 50 backstroke, 400 medley relay and 800 free relay.\n\n\n\n\"My goal in Barcelona for world championships is to represent Team USA as best I can,\" Franklin said.\n\n\n\nFINA World Championships\n\n\n\nWHEN: Friday to Aug. 4\n\n\n\nWHERE: Barcelona, Spain\n\n\n\nSWIMMING: Swimming competition begins July 28; diving, water polo and synchronized swimming all start sooner\n\n\n\nFRANKLIN'S EVENTS: 200 freestyle, 100 freestyle, 200 backstroke, 100 backstroke, 50 backstroke, 400 medley relay and 800 free relay Read the full article at the SF Examiner.\n\nFour-time Olympic champion Missy Franklin a vastly improved swimmer It's 6:30 a.m. and Missy Franklin is in the middle of swimming 4,700 meters in 90 minutes at Lowry LC Pool, a six-lane, Olympic-length pool with the rudimentary trappings associated with a military base. In six hours, she will be back again.\n\n\n\nThis has been Franklin's life, adding a few other pools around town, since she was 7 years old. The number of swimmers she beat on her way to becoming the 2012 FINA swimmer of the year is a mere drop in the sea of nationally ranked girls who hung up the goggles before their first junior high dance.\n\n\n\nFor Franklin, 18, burnout is a foreign word; peaking is as distant a worry as social security. A year after winning four Olympic gold medals and a bronze medal at the London Games, Franklin heads into Sunday's world championships in Barcelona, Spain, a vastly improved swimmer.\n\n\n\n\"I have such big goals and such big dreams and I've definitely touched on those, but I'm nowhere near where I want to be,\" Franklin said. \"Having that big of dreams helps you. With last year in London, I really realize what it takes to get there.\"\n\n\n\nIt doesn't always work that way. Her coach with the Colorado Stars, Todd Schmitz, has a dog-eared article headlined \"The 10-and-Under Wonder.\" It's a study showing that less than 10 percent of age-group swimmers ranked in the top 10 at age 10 were ever ranked at age 18.\n\n\n\nFast fades don't just happen at 10, either. Allison Schmitt won Olympic gold in the 200-meter freestyle, silver in the 400 freestyle and teamed with Franklin to win gold in the 400 freestyle relay and the 800 medley relay.\n\n\n\nAt the U.S. nationals in Indianapolis last month, Schmitt didn't even make the world team.\n\n\n\n\"She worked so hard to get to that level and said, 'OK, I did it,' \" Schmitz said. \"It's an important lesson for Missy to learn at 18 years old. It doesn't matter how old you are or how good you are. If you don't continue to put in the work in this sport, somebody's going to knock you off the pedestal.\n\n\n\n\"There's always the next Missy Franklin out there somewhere training hard.\"\n\n\n\nAnd, yes, Franklin can improve. People forget she didn't medal in London in the 100 and 200 freestyle events. She missed a bronze medal in the 200 by 0.01 and finished fifth in the 100.\n\n\n\nBut in Indianapolis, her freestyle went from promising to medal favorite. She won the 100 (53.43) and 200 (1:55.56) in times that bettered what she did in London (53.64 and 1:55.82).\n\n\n\n\"Her mind-set was different this year,\" Schmitz said. \"Last year going into the Olympics, she kind of told herself she'd been training more backstroke. Not necessarily. I looked at it. We did almost half and half, the same as this year. But I realized last year she didn't have the confidence in freestyle, so this year I made sure I kept talking about freestyle.\"\n\n\n\nThat stroke has now almost caught up with her backstroke, where she's the world-record holder in the 200 and American-record holder in the 100.\n\n\n\nAsked about her new confidence level in freestyle, she said: \"Huge. Through all the Grand Prix and where my times were at Indy, I'm very, very confident in my freestyles. I was happy with my freestyles in London, but I definitely want to make them better.\n\n\n\n\"I really feel like we're on that road right now to Barcelona.\"\n\n\n\nExpect another major medal haul. Franklin is entered in eight events, including five individual. How many will produce gold is the only question. She's ranked first in the world in both backstrokes and second in the 100 free behind Cate Campbell, a member of Australia's Olympic gold medal-winning 4x100 freestyle relay team in London.\n\n\n\nFranklin is ranked second in the 200 freestyle behind France's Camille Muffat, the silver medalist in London and gold medalist in the 400 freestyle. Swimming World magazine picked Australia to beat the U.S. in the two freestyle relays.\n\n\n\nFranklin also is entered in the 50 backstroke, where she made the team in her only race of the year.\n\n\n\nThe Barcelona schedule, which begins Sunday with the 400 freestyle relay, sets up perfectly. The only night she swims three races is Aug. 1 — when she does the 100 freestyle semifinals, 50 backstroke final and the 4x200 freestyle relay final. Joining Franklin in the relay is Cherry Creek High School graduate Jordan Mattern, who swam for the Colorado Stars and just finished her sophomore year at Georgia.\n\n\n\n\"The best thing about it is Missy did the double in the Olympics 12 minutes apart,\" Schmitz said. \"In between the 50 back final and the 800 relay start is 25 minutes. In a perfect world, she anchors the relay. Then she'll have almost 30 minutes, and it's a 50 back.\"\n\n\n\n\"It's like a little baby warm-up,\" Franklin said.\n\n\n\nThe difference this year? Unlike the London Games, where she burst onto sports' mainstream, she is the face of international women's swimming. She will have \"USA\" on her cap, but a target on her back.\n\n\n\n\"It was definitely different than trials meets I've been to before,\" Franklin said of the U.S. nationals. \"I wouldn't necessarily say it's a target, but it was different for me being on that higher end of that. It was fun because it's like Allison Schmitt. You never really know where people are at, especially after the Olympics.\"\n\n\n\n50 backstroke\n\n\n\n1. Yuanhui Fu, China, 27.22\n\n\n\n2. Aya Terakawa, Japan, 27.51\n\n\n\n3. Rachel Bootsma, U.S., 27.68\n\n\n\n4. Xiang Liu, China, 27.76\n\n\n\n5. Etiene Medeiros, Brazil, 27.88\n\n\n\n9. Missy Franklin, U.S., 27.98\n\n\n\n\n\n\n\n100 backstroke\n\n\n\n1. Missy Franklin, U.S., 58.67\n\n\n\n2. Aya Tarakawa, Japan, 58.84\n\n\n\n3. Emily Seebohm, Australia, 59.17\n\n\n\n4. Elizabeth Pelton, U.S., 59.27\n\n\n\n5. Yuanhui Fu, China, 59.58\n\n\n\n200 backstroke\n\n\n\n1. Missy Franklin, U.S., 2:05.68\n\n\n\n2. Elizabeth Pelton, U.S., 2:06.29\n\n\n\n3. Belinda Hocking, Australia, 2:07.17\n\n\n\n4. Elizabeth Beisel, U.S., 2:07.64\n\n\n\n5. Meagen Nay, Australia, 2:07.96\n\n\n\n100 freestyle\n\n\n\n1. Cate Campbell, Australia, 52.83\n\n\n\n2. Missy Franklin, U.S., 53.43\n\n\n\n3. Camille Muffat, France, 53.51\n\n\n\n4. Sarah Sjostrom, Sweden, 53.66\n\n\n\n5. Bronte Campbell, Australia, 53.72\n\n\n\n200 freestyle\n\n\n\n1. Camille Muffat, France, 1:55.48\n\n\n\n2. Missy Franklin, U.S., 1:55.56\n\n\n\n3. Bronte Barratt, Australia, 1:56.05\n\n\n\n4. Federica Pellegrini, Italy, 1:56.51\n\n\n\n5. Sarah Sjostrom, Sweden, 1:56.55\n\n\n\nWhere missy ranks\n\n\n\n50-meter backstroke\n\n\n\n1. Yuanhui Fu, China, 27.22\n\n\n\n2. Aya Terakawa, Japan, 27.51\n\n\n\n3. Rachel Bootsma, U.S., 27.68\n\n\n\n4. Xiang Liu, China, 27.76\n\n\n\n5. Etiene Medeiros, Brazil, 27.88\n\n\n\n9. Missy Franklin, U.S., 27.98\n\n\n\n100 backstroke\n\n\n\n1. Missy Franklin, U.S., 58.67\n\n\n\n2. Aya Tarakawa, Japan, 58.84\n\n\n\n3. Emily Seebohm, Australia, 59.17\n\n\n\n4. Elizabeth Pelton, U.S., 59.27\n\n\n\n5. Yuanhui Fu, China, 59.58\n\n\n\n200 backstroke\n\n\n\n1. Missy Franklin, U.S., 2:05.68\n\n\n\n2. Elizabeth Pelton, U.S., 2:06.29\n\n\n\n3. Belinda Hocking, Australia, 2:07.17\n\n\n\n4. Elizabeth Beisel, U.S., 2:07.64\n\n\n\n5. Meagen Nay, Australia, 2:07.96\n\n\n\n100 freestyle\n\n\n\n1. Cate Campbell, Australia, 52.83\n\n\n\n2. Missy Franklin, U.S., 53.43\n\n\n\n3. Camille Muffat, France, 53.51\n\n\n\n4. Sarah Sjostrom, Sweden, 53.66\n\n\n\n5. Bronte Campbell, Australia, 53.72\n\n\n\n200 freestyle\n\n\n\n1. Camille Muffat, France, 1:55.48\n\n\n\n2. Missy Franklin, U.S., 1:55.56\n\n\n\n3. Bronte Barratt, Australia, 1:56.05\n\n\n\n4. Federica Pellegrini, Italy, 1:56.51\n\n\n\n5. Sarah Sjostrom, Sweden, 1:56.55\n\n\n\nRead the full article in The Denver Post.\n\nMichael Phelps, Missy Franklin and Jessica Long win 2013 ESPY Awards Michael Phelps wins an ESPY Award in the Best Male Olympian category. Also in the running for the award was swimmer, Ryan Lochte and decathlete, Ashton Eaton.\n\n\n\nPhelps’ second ESPY Award of the night is for the Best Record Breaking Performance. Phelps tallied up 22 Olympic Medals throughout his Olympic Career in his fourth and most recent Olympic Games. 18 of his 22 Olympic medals were Gold.\n\n\n\nMissy Franklin was nominated for Best Female Athlete as well as Best Female Olympian. Franklin won ESPY for Best Female Olympian. She was nominated for the award with Aly Raisman and Gabby Douglas, two members of the “Fierce Five.” Tennis player, Serena Williams, won the ESPY for Best Female Athlete.\n\n\n\nAlong with the Best Male Olympian, Phelps was also nominated for Best Record Braking-Performance, Best Male Athlete, and Best Play, although his best play nomination was for a 153 foot putt, rather than for his swimming abilities. LeBron James won the ESPY for the Best Male Athlete.\n\n\n\nJessica Long was nominated for an ESPY in the category of Best Female Olympian. She wins the ESPY for the third time. Also nominated for the award was swimmer, Victoria Arlen, Muffy Davis, Tatyana McFadden, and Shirley Reilly.\n\n\n\nLt. Bradley Snider was nominated for Best Male Athlete with a Disability. Jeremy Campbell, a pentathlon athlete, won the award.\n\n\n\nThe ESPY for the Best Women’s College Athletic Program went to North Carolina. North Carolina Women’s Swimming finished 15th in the 2013 CSCAA Coaches Poll. UCLA won the ESPY for the Best Men’s College Athletic Program. UCLA has not had a men’s swimming program since the team was cut in 1994.\n\n\n\n\n\n\n\n2013 ESPY Awards:\n\n\n\nBest Coach/Manager: Rick Pitino\n\n\n\nBest MLB Player: Miguel Cabrera\n\n\n\nBest Male Olympian: Michael Phelps\n\n\n\nBest Male Collegiate Athlete: Johnny Manziel\n\n\n\nBest Driver: Ryan Hunter-Reay\n\n\n\nBest MLS Player: Thierry Henry\n\n\n\nBest WNBA Player: Candace Parker\n\n\n\nBest Championship Performance: LeBron James\n\n\n\nBest NBA Player: LeBron James\n\n\n\nBest NFL Player: Adrian Peterson\n\n\n\nBest Breakthrough Athlete: Colin Kaepernick\n\n\n\nBest Comeback: Adrian Peterson\n\n\n\nBest Game: Miami Heat Vs. San Antonio Spurs (Game 6)\n\n\n\nBest NHL Player: Sidney Crosby\n\n\n\nBest Female Tennis Player: Serena Williams\n\n\n\nBest Female Athete: Serena Williams\n\n\n\nBest Upset: Florida Gulf Coast University over Georgetown (NCAA Tournament)\n\n\n\nBest Record Breaking Performance: Michael Phelps\n\n\n\nBest Moment: Jack Hoffman – TD run in Nebraska Spring Game\n\n\n\nBest Male Athlete: LeBron James\n\n\n\nBest Female Olympian: Missy Franklin\n\n\n\nBest Male Fighter: Floyd Mayweather Jr.\n\n\n\nBest Female Collegiate Athlete: Brittany Griner\n\n\n\nBest Male Tennis Player: Novak Djokovic\n\n\n\nBest International Athlete: Usain Bolt\n\n\n\nBest Male Golfer: Tiger Woods\n\n\n\nBest Female Golfer: Stacy Lewis\n\n\n\nBest Team: Miami Heat\n\n\n\nBest Female Athlete with a Disability: Jessica Long\n\n\n\nBest Female Athlete with a Disability: Jeremy Campbell\n\n\n\nBest Play: Jadeveon Clowney’s Hit\n\n\n\nBest Male Action Sport Athlete: Nyjah Huston\n\n\n\nBest Female Action Sport Athlete: Stephanie Gilmore\n\n\n\nBest Bowler: Pete Weber\n\n\n\nBest Jockey: Joel Rosario\n\n\n\nBest Men’s College Athletic Programs: UCLA\n\n\n\nBest Women’s College Athletic Programs: North Carolina\n\n\n\nArthur Ashe Award For Courage: Robin Roberts\n\n\n\nJimmy V ESPY for Perseverance: Dick and Rick Hoyt Read the full article at SwimSwam.\n\nChat with Missy Franklin Welcome to SportsNation! On Friday, U.S. Olympic gold medalist Missy Franklin stops by to chat about her two ESPYS nominations. The ESPYS airs live July 17 on ESPN at 9 p.m. ET.\n\n\n\nFranklin, @FranklinMissy, starred on the 2012 U.S. Olympic swim team at the London Games, winning five medals, including four gold. She broke the world record in the 200m backstroke, while setting the American record in the 100m backstroke.\n\n\n\nFor her impact on the U.S. Olympic team, Franklin is nominated for two ESPYS - Best Female Athlete and Best Female U.S. Olympian. Voting ends July 17.\n\n\n\nSend your questions now and join Franklin Friday at 2 p.m. ET! Read the full article at ESPN.\n\nMissy Franklin soon to say goodbye to longtime swim coach Todd Schmitz Missy Franklin leaves for Barcelona on Tuesday, but on Aug. 23 she leaves Colorado for good. She departs for college at California, leaving behind the state she helped make famous for swimming and the man who helped make her great.\n\n\n\nOn Aug. 4, after her leg in the 400 medley relay at the World Championships, Franklin and her coach, Todd Schmitz, will have the longest embrace of any visitors to Spain this summer. Schmitz, her coach with the Colorado Stars, will hand her off to Cal coach Teri McKeever, who merely gets the world's top swimmer of 2012 and the fastest female 200-meter backstroker who ever lived.\n\n\n\nAnd what of the man who helped turn her into a four-time Olympic gold medalist and world-record holder? How will he react when she steps out of the pool under his tutelage for the last time?\n\n\n\n\"He's a crier,\" Franklin said.\n\n\n\nSchmitz started coaching Franklin, 18, when she was 7 years old. Granted, there will be tears but they'll dry in a hurry.\n\n\n\n\"At no point will I think we'll never not talk,\" Schmitz said. \"The best part about it is even if I'm not there on a daily basis or a workout basis or I'm her coach, that doesn't mean she's not going to text me or come back at Thanksgiving or Christmas. That's the best thing about it. I don't expect her to suddenly delete my number and not talk to me.\"\n\n\n\nFranklin blossomed under the Metro State grad, who was scoffed at by more established coaches who couldn't understand how an average Division II swimmer from North Dakota could build an Olympic champion in the swimming backwaters of Colorado.\n\n\n\nBut Franklin broke her first national age-group record at 12, won her first international medal at 15, broke her first world record at age 16 and was the star of the London Olympics at age 17.\n\n\n\nThe biggest gift Schmitz, 34, gave to Franklin is an unabashed love of swimming. In a Swimming World article entitled \"The 10-and-Under Wonder,\" a study showed that of the girls ranked in the top 10 nationally at 10 and under, only 11 percent were ranked when they reached the 17-18 age group.\n\n\n\nFranklin didn't get burned out. She burned hotter.\n\n\n\n\"I wouldn't have a career without him,\" Franklin said. \"Every coach has something about him that makes him special. Todd and I have a relationship that's special in itself. We've always been more than athlete and coach. He could always tell when I'm upset or had a bad day and I can always tell when he's had a bad day.\n\n\n\n\"That's why we're able to work so well together. It's so much more than swimming.\"\n\n\n\nSince Franklin's international emergence and Schmitz's inclusion on the Olympic coaching staff, he has received offers to leave the Stars. However, the Stars have won more state titles than any club in Colorado history, as well as two national club titles. Membership totals 165. He turns away more than 200 kids every fall.\n\n\n\nGetting their own pool is still a distant dream. Franklin must check her schedule every morning to make sure she doesn't crash someone's aqua aerobics class. But there's something to be said for training at a mile high.\n\n\n\n\"I don't want to move just to move and get in the college ranks,\" Schmitz said. \"I've got a lot going on now that's pretty good. I'll listen to people but the people I've listened to don't say the right things.\n\n\n\n\"At the end of the day I want control. I want to hire my own staff.\"\n\n\n\nBut first, he has another World Championships to coach.\n\n\n\n\"On Aug. 4 in our last day in our last race we want to, quote-unquote, leave it all in the pool,\" Schmitz said. \"Get out and be proud of what we've done.\" Read the full article in The Denver Post.\n\nMaxPreps 2012-13 Female Athlete of the Year: Missy Franklin A prodigy runner and a prodigy swimmer.\n\n\n\nPicking between Bronxville (N.Y.) junior middle distance sensation Mary Cain and Regis Jesuit (Aurora, Colo.) senior swimmer Missy Franklin is like choosing between Porsche models.\n\n\n\nIn the last eight months, Cain has shattered American high school records in the 800 meters, 1,500 and 5,000.\n\n\n\nBut last August, Franklin went upon the world stage and brought home five Olympic medals, four of them gold. She then, showing her heart and good nature, swam for her school team and chipped in a couple more state records.\n\n\n\nThe major accomplishments for both athletes came while competing against non-high school athletes. They are, after all, prodigies.\n\n\n\nIn a season filled with prep phenoms — boxer Claressa Shields and gymnast Gabby Douglas also brought home Olympic gold medals from London — Franklin earned the nod.\n\n\n\nFour golds against the world is about impossible to match.\n\n\n\nAt 17, Franklin swept the women's backstroke events, taking the 100-meter and 200-meter events. She currently holds the world record in the 200 backstroke (long and short course) and the American record in both the 100 and 200 backstroke (long course).\n\n\n\nWhat we liked most is that she finished out her prep career at Regis in the winter, winning two more individual titles and anchoring two relays to victory. She led the Raiders to a second-straight 5A state title.\n\n\n\nShe won the 200-yard individual medley in a national record of 1:56.86, the 500 freestyle in a state record 4:41.72 and anchored the championship 200 and 400 freestyle relays.\n\n\n\nNice sendoff.\n\n\n\nAfter the state finals at the Edora Pool Ice Center, she told the Denver Post: \"Now, I realize why I did this. It's being with my girls for the last time. It's the very last swim with all of them and for me to have a Regis cap on my head.\"\n\n\n\nAbout the time Franklin was wrapping up her prep swim career, Cain, aided by her first-year coach and former American marathon record holder Alberto Salazar, went on a six-month record roller coaster ride.\n\n\n\nShe set an American high school 5,000-meter record in the Portland Track Festival at Lewis & Clark College by finishing in 15 minutes, 45.46 seconds. That came a week after Cain broke the national high school and natonal junior record in the 800, going 1:59.51 at the Prefontaine Classic. And that came only 15 days after she broke her own 1,500 national mark by going 4:04.62 in the USATF Oxy High Performance Meet at Occidental College in Los Angeles.\n\n\n\nAll that came after a superlative indoor track season. On Jan. 26 in New York City, she ran the indoor mile in 4:32.78, breaking a 41-year national mark by almost 6 seconds. It was also faster than the 1982 outdoor mark of 4:35.24 set by Polly Plumer.\n\n\n\nOn Feb. 2 at the Boston Indoor Games, she set an indoor 2-mile record by going 9:38.68. On Feb. 16, she lowered her own mile mark by going 4:28.25 — a time that was the fastest by an American woman of any age during the 2013 indoor season.\n\n\n\nShe topped it all on June 22 in Des Moines Iowa, becoming the youngest American athlete to make the team at the USA Outdoor Track and Field Championships. She did that by placing in the top three of the 1,500 – she placed second.\n\n\n\nShe'll join the USA team in Russia for the World Champions in August.\n\n\n\n\"You never know where you're going to be years from now,\" Cain told reporters after her race in Des Moines. \"I have the greatest support team — coaches, parents, teammates — so I can still be around years from now. But it's nice to get on that team when you're running good.\"\n\n\n\nOn the 40th anniversary of Title IX — equal rights for girls' and women's sports — it was fitting there was so much success among high school girls athletes.\n\n\n\nDouglas was actually the AP Female Athlete of the Year over Franklin for capturing the all-around gymnastics gold medal and leading the American women win the team gold medal for only the second time.\n\n\n\nDouglas, from Virginia Beach, Va., is home-schooled and doesn't compete for a high school team. Thus she wasn't eligible for this award.\n\n\n\nLikewise, Shields wasn't eligible because there is no boxing team at her Northwestern (Detroit) High School. She became the first American woman to win a boxing gold medal by taking the middleweight crown over Russian Nadezda Torlopova with a 19-12 decision. She was featured in a MaxPreps Beyond the X profile before the Olympics.\n\n\n\nOther girls in the discussion for Athlete of the Year who participated in high school athletics:\n\n\n\n* Morgan Andrews won her second-straight girls soccer national Player of the Year award from Gatorade after the Milford (N.H.) standout scored 31 goals and added 18 assists for the state-champion Spartans (16-3-1). Andrews is the captain of the U.S. Soccer Under-17 Women's National Team and a member of the Under-20 and Under-23 national team player pools.\n\n\n\nMorgan Andrews won two straight Gatorade Soccer Player of the Year awards.\n\nFile photo by Mark Camp\n\nMorgan Andrews won two straight Gatorade\n\nSoccer Player of the Year awards.\n\n* MaxPreps Girls Basketball Player of the Year Diamond DeShields, a 6-foot-2 wing, averaged 26 points, 7 rebounds, 4.5 steals and 3.8 assists per game, leading Norcross (Ga.) to a state AAAAAA title, a 28-5 record and No. 15 Xcellent 25 national ranking. The daughter of former Major League Baseball infielder Delino DeShields will play at North Carolina in the fall.\n\n\n\n* Daniel (Central, S.C.) right-handed pitcher Carley Hoover posted a 16-4 record with a gaudy 338 strikeouts in 138 innings. She also hit .500 with four homers and 45 runs. She'll play next year at Stanford.\n\n\n\n* Papillion-LaVista South (Papillion, Neb.) 6-3 senior twins Amber and Kadie Rolfzen were MaxPreps co-Players of the Year in volleyball while leading their team (42-1) to a third-straight Nebraska A Division state title and a No. 4 national ranking. Amber recorded 390 kills, 283 digs, 34 aces and 38 blocks while Kadie totaled 369 kills, 49 aces, 38 blocks and 340 digs. The twins will play next season at Nebraska.\n\n\n\n* Mercedes Russell, a 6-5 basketball center, led Springfield (Ore.) to a 24-4 record and the state 5A championship game by averaging 25.1 points, 12.3 rebounds, 5.5 blocks and 3.9 assists per game. She was the Gatorade and Naismith Girls High School Player of the Year. Russell, who was surprised with the Gatorade award by Maya Moore, will play at Tennessee next season. Read the full article in MaxPreps.\n\nMissy Franklin to Take 2nd American Spot in 50 Backstroke at Worlds USA Swimming has confirmed a few more spots for the 2013 USA Swimming World Championships that will take place in Barcelona at the end of July.\n\n\n\nThey affirmed the selection of Karlee Bispo to swim as a part of the 800 free relay and Katie Ledecky’s scratch from the same event. They also confirmed that Shannon Vreeland from Georgia, who was 3rd in the 200 free behind Ledecky, would take that individual spot.\n\n\n\nOther new announcements include adding Matt Grevers and Kevin Cordes officially to the second spots in the 50 backstroke and 50 breaststroke, respectively. Both swimmers finished 2nd in those events, but it was on the basis of their 100 meter finishes (Grevers was 2nd in the 100 back, Cordes won the 100 breast) that they earned these swims. Neither was a great surprise.\n\n\n\nNor were the additions of Michael McBroom to the men’s 800 or Chloe Sutton to the women’s 1500. They were runners-up in those races, and were the logical choice to swim them.\n\n\n\nA bit more uncertain was who would swim the second spot in the men’s 50 fly, and that will go to Grevers as well after finishing 2nd in the 50 fly, giving him 5 events in total. Ryan Lochte, who was runner-up in the 100 fly, would’ve had the first shot at the 50 fly, but it would seem he declined it.\n\n\n\nMissy Franklin, despite media reports to the contrary, is entered in the 50 backstroke. That gives her 5 individual events, and a triple on the meet’s 5th day (Thursday) with the 100 free semifinal, the 50 back final and the 800 free relay final.\n\n\n\nBreeja Larson was confirmed as the second 50 breaststroker, Dana Vollmer will be the 2nd 50 butterflier on the basis of her win in the 100 fly (which makes her scratch in the 50 at Trials look genius).\n\n\n\nThe full roster can be seen here. No additional athletes can be entered in the meet, though events could theoretically change before the final FINA deadline.\n\n\n\nSo, the new additions in summary:\n\n\n\nKatie Ledecky scratches individual 200 free\n\nKarlee Bispo added to roster in 800 free relay\n\nShannon Vreeland takes Ledecky’s spot in individual 200\n\nMatt Grevers adds 50 back and 50 fly\n\nKevin Cordes adds 50 breast\n\nMissy Franklin adds 50 back\n\nDana Vollmer adds 50 fly\n\nBreeja Larson adds 50 breast\n\nChloe Sutton adds 1500 free\n\nMichael McBroom adds 800 free Read the full article in SwimSwam.\n\nFive things we learned from USA Swimming nationals The first U.S. swimming nationals in the post-Michael Phelps era are in the books. The IUPUI Natatorium housed champion performances from USA Swimming’s two headliners (Ryan Lochte, Missy Franklin) and potential breakouts (Kevin Cordes, Maya DiRado among them). As the world championships approach, starting July 28 at Barcelona’s Palau Sant Jordi, let’s look at the lasting storylines from Indianapolis.\n\n\n\n1. Ryan Lochte sets up for his busiest international meet ever. The 11-time Olympic medalist entered 11 events before Tuesday’s start, but he was never going to swim that kind of marathon schedule over five days. He scratched down to a handful (notably cutting the 400-meter individual medley).\n\n\n\nLochte didn’t set any records but fared well after busy post-Olympic dryland activities. He won the 200 freestyle, 200 backstroke and 200 individual medley and placed second in the 100 butterfly, an event he’s now expected to swim for the first time at a major international meet. He took fourth in the 100 free to qualify for all three relays at worlds.\n\n\n\nLochte will swim seven events in Barcelona if he enters everything he’s qualified for. He has never swum more than six events at an Olympics or world championships. The problem lies on August 2, when he’s slated for a triple in the evening session — the 200 back final, 100 butterfly semis and 4×200 free relay final.\n\n\n\n2. Missy Franklin goes five for five. Franklin, 18, was the swimmer of the meet. She won four of her five events and placed second in the outlier, qualifying for worlds in every one. She set a nationals record in the 100 free and U.S. Open and nationals records in the 100 back and 200 back. The future Cal collegian also won the 200 free and was runner-up in the 50 back, which sets up a potential but unlikely eight-medal attempt at worlds.\n\n\n\nIt’s probably not going to happen because Franklin would have to swim three events on August 1 — the 50 back final, 100 free semis and the 4×200 free relay final. She’ll likely opt out of the 50 back and go with the same seven-event schedule she had at the 2012 Olympics, where she medaled in five of seven races.\n\n\n\n3. Natalie Coughlin’s sprint switch a success. The most decorated a", "images": ["https://www.regisjesuit.com/image/responsive/headerBanner.png", "http://www.greatplainsexaminer.com/wp-content/uploads/2012/09/Todd-Schmitz-Web-300x247.jpg", "https://www.regisjesuit.com/image/homepage/Twitter-Logo-2016-28x28.png", "https://www.regisjesuit.com/image/responsive/RJHS-OFF-BR.png", "http://www.glamour.com/fashion/blogs/slaves-to-fashion/2012/11/13/1113-missy-franklin-glamour-women-of-the-year-rent-the-runway_fa.jpg", "https://www.regisjesuit.com/image/YouTube-Logo-2016-28x28.png", "https://www.regisjesuit.com/view.image?Id=4613", "http://images.intellitxt.com/ast/adTypes/icon1.png", "https://www.regisjesuit.com/image/athletics---gd/MF-Halloween-Costume.jpg", "http://www.glamour.com/fashion/blogs/slaves-to-fashion/2012/11/12/1113gabby-douglas-women-of-the-year_fa.jpg", "https://www.regisjesuit.com/view.image?id=5129", "https://www.regisjesuit.com/image/missy-franklin/MFHalloween-3.jpg", "http://static.thehollywoodgossip.com/images/videos/justin-bieber-to-missy-franklin-congratulations_320x240.jpg", "https://www.regisjesuit.com/view.image?Id=434", "https://www.regisjesuit.com/image/missy-franklin/MFHalloween-2.jpg", "https://www.regisjesuit.com/images/blank.gif", "https://www.regisjesuit.com/view.image?Id=2255", "https://www.securitymetrics.com/images/sm_tested_pci2.gif", "http://l2.yimg.com/bt/api/res/1.2/zCkQwCnhg65YqcLcoO3Yrg--/YXBwaWQ9eW5ld3M7cT04NTt3PTYzMA--/http://media.zenfs.com/en/blogs/sptuspreprally/High-school-junior-and-U.S.-Olympic-hopeful-Missy-Franklin-Getty-Images.jpg", "http://www.glamour.com/fashion/blogs/slaves-to-fashion/2012/11/13/1113-kayla-harrison-glamour-women-of-the-year-rent-the-runway_fa.jpg", "https://www.regisjesuit.com/view.image?Id=433", "http://static.tvfanatic.com/images/gallery/missy-franklin-on-pll_535x331.jpg", "http://c.gigcount.com/wildfire/IMP/CXNID=2000002.11NXC/bT*xJmx*PTEzNDY3NzAyODAzOTUmcHQ9MTM*Njc3MDI4MjEyNiZwPSZkPSZnPTImbz*2NDIzZjYwYzQ*OTU*ODIyYmIzZTU2NGZl/MzU2ZDY5MSZvZj*w.gif", "https://www.regisjesuit.com/image/athletics---gd/MF-Halloween-Costume-2.jpg", "http://www.glamour.com/fashion/blogs/slaves-to-fashion/2012/11/13/1113-carli-lloyd-glamour-women-of-the-year-rent-the-runway_fa.jpg", "https://www.regisjesuit.com/image/missy-franklin/MFHalloween-1.jpg"], "top_img": "https://www.regisjesuit.com/view.image?id=5129", "keywords": [], "authors": [], "canonical_link": "", "title": "Missy Franklin in the News at Regis Jesuit High School", "meta_data": {"vs_targetSchema": "http://schemas.microsoft.com/intellisense/ie5", "viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "description": "Regis Jesuit High School is a Catholic, Jesuit, college preparatory high school serving young men and young women in grades 9-12 in the Jesuit tradition with an innovative educational model combining single gender instruction with coed socialization.", "keywords": "regis,jesuit,high,school,Denver,CO,colorado,Aurora,private,catholic,co-institutional,education,independent,admissions,boys,girls,division,best,regisjesuit.com,jesiut,logo,athletics,reis,www.regisjesuithighschool.com,alumni,hs,grads,service,rtegis", "last-modified": "9/12/2017 5:35:57 PM"}, "movies": ["http://www.youtube.com/embed/opCMfcAl7yw?rel=0", "http://www.youtube.com/embed/uzp_LwCTW8U?rel=0", "http://www.youtube.com/embed/wiP3NmIY9rE?rel=0", "http://www.youtube.com/embed/B8Y3UIYKqDM?rel=0", "http://www.youtube.com/embed/03gIxOSyGS8", "http://player.vimeo.com/video/62915576?title=0&byline=0&portrait=0", "http://www.youtube.com/embed/sthYUtq_8dQ", "http://player.vimeo.com/video/62136031", "http://player.vimeo.com/video/61866615", "http://www.youtube.com/embed/75WdQ-XMEHM?rel=0", "http://www.youtube.com/embed/UibM5u6Zp48?rel=0", "http://www.youtube.com/embed/aw7Zuvp977M", "http://www.youtube.com/embed/DyPGCBchdWs", "http://www.youtube.com/embed/sthYUtq_8dQ?rel=0", "http://www.youtube.com/embed/0BlpNwgKBlo?rel=0", "http://www.youtube.com/embed/2TqFzX81ok0?rel=0", "http://www.youtube.com/embed/V2YrqppL5qg?rel=0", "http://www.youtube.com/embed/v7W1f4LIsHg?rel=0", "http://www.youtube.com/embed/mMoSqCdf00w?rel=0", "http://www.youtube.com/embed/wvuNqUYBcCI?rel=0", "http://www.youtube.com/embed/PA6PFqpW5Gc?rel=0", "http://www.youtube.com/embed/tFzqdU8L5PQ?rel=0", "http://www.youtube.com/embed/VrOx6BGDoRg?rel=0", "http://www.youtube.com/embed/MLv1MKYDKiI?rel=0", "http://www.youtube.com/embed/l3YU9GWbj5A?rel=0", "http://www.youtube.com/embed/YPIA7mpm1wU?rel=0", "http://www.youtube.com/embed/e-03goDzbpM?rel=0", "http://www.youtube.com/embed/MOr_RHQ-jdw", "http://www.youtube.com/embed/YPIA7mpm1wU?rel=0", "http://www.youtube.com/embed/DVibRxuIx-Q?rel=0", "http://www.youtube.com/embed/tAgG1pBz6C4?rel=0", "http://www.youtube.com/embed/VJOxF79ATQU?rel=0"], "publish_date": null, "source": "https://www.regisjesuit.com", "summary": ""}