{"url": "https://thespotlyte.com/news/how-to-diy-a-cat-eye-like-beyonces", "text": "For even the most seasoned beauty pro, cat eyes still present major challenges — ranging from imbalanced wings to sloppy sketching. Add some crinkling to the corners of your eyes and it seems like you have a recipe for a makeup mess. According to Sir John, Beyoncé’s main beauty guru, that’s not the case. He’s currently on the run with Beyoncé and Jay-Z for their OTR II world tour, but he took time out to share his secrets for flawlessly recreating his signature feline flick at home. “This whole tour, I’m doing a serious cat eye on her — it’s almost like an optical illusion,” he says of the eye-opening effects of the iconic look. Here, his top tips for winging it like a pro.\n\nStep 1: Create a smooth surface\n\nMaybe you’re just thinking about making an appointment with your derm to discuss those undesirable laugh lines at the outer corners of your eyes created by repetitive muscle movement (i.e., smiling or squinting), or perhaps you’ve already dabbled in medical aesthetics to help iron them out. But, according to Sir John, injectable wrinkle reducers (which temporarily smooth the appearance of wrinkles in areas like the crow’s feet for adults) can create a more level playing field. “It’s going to make your eyeliner application crisper and allow you to execute the trend a lot better,” he explains.\n\n[Editor’s Note: Injectable wrinkle reducers are prescription treatments, so be sure to talk to a provider about the risks and benefits to see if they are right for you.]\n\nHe also suggests avoiding greasy eye creams before applying your cat eye, and for extra insurance, using a lid primer — he likes NARS Smudge Proof Eyeshadow Base ($26). After all, once you’ve achieved even wings (otherwise known as beauty nirvana), you want to make sure your hard work doesn’t budge.\n\nStep 2: Find your light\n\n“Nine times out of ten, your bathroom is not going to have the best lighting,” says Sir John, who recommends applying eyeliner in natural light (like near a sunny window). Once you’re in a well-lit space, place a mirror on a hard surface and lean your head back slightly so that you’re able to look up your nose. “[This angle] gives you the best view of your eyelid so that you can create a beautiful, lateral line,” he adds.\n\nStep 3: Take it slow and steady\n\nEven this master of makeup admitted that felt-tip eyeliner pens can be tricky, but said a skinny brush dipped in a gel formula — such as MAC Cosmetics Pro Longwear Fluidline in Blacktrack ($18) — offers more control. “You’re never going to get a perfect wing in one go,” stresses Sir John. “Pace yourself — I like to do three or four strokes that overlap to create one continuous line.”\n\nStart from the inner corner and work your way to the outer corner. Once you get there — and while the liner is still wet — gently drag the pigment out and up toward the tail end of your brow to make eyes appear more lifted. Then, trace over the shape you just created with liner again to intensify the line. (Don’t worry about refining the flick just yet! You’ll sharpen the edges in step seven.)\n\nIn terms of where the line should stop, there really are no rules, according to the pro. “I like a more extended eye à la Sophia Loren,” he says. “You can be dramatic with winged liner and bring the shape out a bit farther to makes eyes look bigger and brighter.”\n\nStep 4: Define your lower lashes\n\nTo ’Yonce-ify your cat eye, rim your lower lash line with a brown pencil for added definition — a trick Sir John often uses on the Queen herself. “No one knows they’re looking at brown and not black, but it’s so much less aggressive,” he explains. The must-have pencils he keeps in his kit are from Marc Jacobs Beauty Highliner Gel Eye Crayon Eyeliner in (Earth)Quake 41 ($25) and MAC Cosmetics Technakohl liner in Brownborder ($18) because they’re “very creamy but don’t move once they dry.” Just be sure to gently blend the band of color with a brush, cotton swab, or sponge before it sets, as “a blunt line along the bottom lashes can age the eye,” he warns.\n\nStep 5: Tighten the top\n\nA two-second trick that makes a “huge difference” is tightlining your top lashes, says Sir John, who always rims the inner waterline with a black pencil to make eyes look more dynamic. He likes MAC Cosmetics Technakohl Liner in Graphblack ($18). “The entire area between the liner and your lashes should be dense and saturated with color — you shouldn’t see any skin,” the pro notes.\n\nPolish off lashes with mascara, wiggling the wand back and forth at the roots and pulling up toward the tips. “It’s almost as if you were brushing your teeth,” he explains. “This creates separation and massive amounts of volume.”\n\nStep 6: Perfect your shape\n\nThe final step is calling in the clean-up crew. “Water-based makeup remover and Muji Thin Cotton Swabs ($3) are my best friends for getting the perfect shape,” Sir John says. To do this, simply add a few drops of remover to the swab (don’t oversaturate it, because this could cause you to remove more liner than you intended!), then use it just as you would an eraser to make the edges look super crisp. After sharpening his wings, Sir John uses a fluffy brush like the MAC Cosmetics 224 ($32) to apply concealer and get undereyes in formation. With flicks this fierce, you’re ready to run the world.\n\nAllergan may receive commission for purchases made through links in this article.\n\nSir John is a paid Allergan consultant.", "images": ["https://www.datocms-assets.com/8490/1560536140-stocksytxp9a66909em9n200large22977451x1.png?w=50&h=50&fm=jpg", "https://www.datocms-assets.com/8490/1560829349-thumbandfeaturestocksytxp2c1f8c6ablj200originaldelivery490489tszfrw.jpg?auto=format&fit=crop&fm=jpg&ixlib=react-8.5.1", "https://www.datocms-assets.com/8490/1560830657-thumbandfeaturecatmattavnzz7f.jpg?auto=format&fit=crop&fm=jpg&ixlib=react-8.5.1", "https://www.datocms-assets.com/8490/1560836822-istock-499778695jybslk.jpg", "https://www.datocms-assets.com/8490/1560535067-beauty-pros.png?w=50&h=50&fm=jpg", "https://www.datocms-assets.com/8490/1560531308-stocksytxpc229acccspm200large23177711x1.png?w=50&h=50&fm=jpg", "https://www.datocms-assets.com/8490/1560831028-thumbimg4865st0pt0.jpg?auto=format&fit=crop&fm=jpg&ixlib=react-8.5.1", "https://www.datocms-assets.com/8490/1560832215-thumbandfeatureistock-466976408m6h7k2.jpg?auto=format&fit=crop&fm=jpg&ixlib=react-8.5.1", "https://www.datocms-assets.com/8490/1560839650-istock-500924969.jpg?auto=format&w=500?trimcolor=fff&trim=color&fit=fillmax&fill=solid&fill-color=fff&w=530&h=400&fm=jpg", "https://www.datocms-assets.com/8490/1560531308-stocksytxpc229acccspm200large23177711x1.png?w=60&h=60&fm=jpg", "https://www.datocms-assets.com/8490/1560535067-beauty-pros.png?w=60&h=60&fm=jpg", "https://www.datocms-assets.com/8490/1560831086-thumbandfeature101918spotlyte24loft04601tsmrlu.jpg?auto=format&fit=crop&fm=jpg&ixlib=react-8.5.1", "https://www.datocms-assets.com/8490/1560836864-istock-499778695jybslk.jpg?auto=format&fit=crop&fm=jpg&ixlib=react-8.5.1", "https://www.datocms-assets.com/8490/1560536140-stocksytxp9a66909em9n200large22977451x1.png?w=60&h=60&fm=jpg", "https://www.datocms-assets.com/8490/1560839651-istock-530797977.jpg?auto=format&w=500?trimcolor=fff&trim=color&fit=fillmax&fill=solid&fill-color=fff&w=530&h=400&fm=jpg", "https://www.datocms-assets.com/8490/1560839650-istock-941128310.jpg?auto=format&w=500?trimcolor=fff&trim=color&fit=fillmax&fill=solid&fill-color=fff&w=530&h=400&fm=jpg", "https://www.datocms-assets.com/8490/1560831569-thumbandfeaturestocksytxpfe1dfcc588e200large1316814s8owdl.jpg?auto=format&fit=crop&fm=jpg&ixlib=react-8.5.1"], "top_img": "https://www.datocms-assets.com/8490/1560836822-istock-499778695jybslk.jpg", "keywords": [], "authors": ["Nicole Moleti", "May", "Cat Matta", "March", "Kristin Granero", "February", "January"], "canonical_link": "https://thespotlyte.com/1124774/how-to-diy-a-cat-eye-like-beyonces", "title": "Beyoncé’s Go-To Makeup Artist Explains How to Get Your Cat Eye In Formation", "meta_data": {"title": "Beyoncé’s Go-To Makeup Artist Explains How to Get Your Cat Eye In Formation", "description": "For even the most seasoned beauty pro, cat eyes still present major challenges — ranging from imbalanced wings to sloppy sketching. According to Beyoncé’s main beauty guru, Sir John, that doesn't have to be the case.", "og": {"title": "Beyoncé’s Go-To Makeup Artist Explains How to Get Your Cat Eye In Formation", "description": "For even the most seasoned beauty pro, cat eyes still present major challenges — ranging from imbalanced wings to sloppy sketching. According to Beyoncé’s main beauty guru, Sir John, that doesn't have to be the case.", "image": {"identifier": "https://www.datocms-assets.com/8490/1560836822-istock-499778695jybslk.jpg", "secure_url": "https://www.datocms-assets.com/8490/1560836822-istock-499778695jybslk.jpg", "width": 3000, "height": 2002}, "site_name": "Spotlyte", "type": "article", "url": "https://thespotlyte.com/1124774/how-to-diy-a-cat-eye-like-beyonces", "locale": "en_US", "updated_time": "2018-09-11T22:29:46-04:00"}, "twitter": {"card": "https://www.datocms-assets.com/8490/1560836833-istock-499778695jybslk.jpg", "title": "Beyoncé’s Go-To Makeup Artist Explains How to Get Your Cat Eye In Formation", "description": "For even the most seasoned beauty pro, cat eyes still present major challenges — ranging from imbalanced wings to sloppy sketching. According to Beyoncé’s main beauty guru, Sir John, that doesn't have to be the case.", "image": {"identifier": "https://www.datocms-assets.com/8490/1560836833-istock-499778695jybslk.jpg", "alt": "Beyoncé’s Go-To Makeup Artist Explains How to Get Your Cat Eye In Formation-twitter"}, "site": "@thespotlyte", "domain": "https://thespotlyte.com", "creator": "@thespotlyte"}, "article": {"published_time": "2018-09-11T22:29:46-04:00", "publisher": "https://www.facebook.com/thespotlyte/"}, "fb": {"app_id": 166520954016074}, "viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "msapplication-TileColor": "#da532c", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1536719386.0, "source": "https://thespotlyte.com", "summary": ""}