{"url": "https://www.babygaga.com/20-celebs-who-are-superheroes-on-screen-and-parents-in-real-life/", "text": "How great it would be to be able to go out on a date with a favorite superheroe. Probably for some of us our partners are our personal superheroes, but we know that deep down we dream of the God of thunder, beautiful spies stealing classified information, night watchmen, or women with pyrotechnic skills. At some point, everyone has wished to have a date with one of those characters or at least with one of the actors that played them.\n\nBut for some people, this dream has come true. Deep in their hearts everyone else envies them because they know it must be fun to be able to say that their husband, wife or even one of their parents has been defeating different villains under the spotlights of the Hollywood cameras. So, let's stop and think about it for a moment... if being a parent is already a challenge then try to picture being parents and superheroes at the same time. Anyone else would lose their minds! But Commissioner James Gordon once said \"[One has] to make a difference. A lot of time it won't be huge. It won't be visible even. But it will matter just the same\".\n\nThat's why today we will talk about those actors who have brought the world's favorite superheroes to life and have had to learn to balance their lives as parents and superheroes in the film industry.\n\nContinue scrolling to keep reading Click the button below to start this article in quick view Share Tweet Email Copy Link Copied\n\n20 Gal Gadot Is The Perfect Wonder Woman\n\nGal Gadot is an Israeli actress and model, who is best known for her role in films such as Fast and Furious, and for playing the role of Wonder Woman in the film adaptation of DC comics, participating in films such as Batman v Superman: Dawn of Justice (2016), Wonder Woman (2017) and Justice League (2017).\n\nAnd according to Forbes, Wonder Woman has become the most successful movie of the D.C franchise, making $ 821.74 million at the box office. Gal, in her life outside of the cameras, is the wife of Yaron Versano, an Israeli businessman. The couple is married since 2008 and they have 2 children, Alma Versano who was born in 2011 and Maya Versano who was born in 2017.\n\n19 People Don't Like Ben Affleck's Batman\n\nVia Pinterest\n\nBen Affleck is an American actor who comes from a long career in the industry, acting in films like Good Will Hunting (1997), Armageddon (1998), and Argo (2012). But recently, Affleck was selected to give life to one of the most important superheroes of DC, Batman, after Christian Bale played the same character from 2005 to 2012. Unfortunately, Affleck did not have the same receptivity in the audience as Bale had. Some dislike him, others love him. In fact, Variety places Affleck among the worst actors who have played the bat on the big screen.\n\nHowever, beyond being considered one of the worst Batman in history, Ben was married to actress Jennifer Garner from 2005 to 2017, with whom he has 3 children, Violet Affleck who was born in 2005, Seraphina Rose Elizabeth Affleck, who was born in 2009, and Samuel Garner Affleck who was born in 2012.\n\n18 Scarlett Johansson's Daughter Says Her Mom's Job Is \"Superhero\"\n\nVia gotceleb.com\n\nScarlett Johansson is an actress who began her acting career from an early age with small minor roles until she began to become notorious in her adulthood with roles in films like Lost in Translation (2003) with Billy Murray, which allowed her to establish herself as an actress in Hollywood. Scarlett, according to her biography in IMDb, was the best-paid actress between 2014 and 2016.\n\nThis American actress has an exotic and different beauty, which is why we are not surprised that she was chosen to play the role of the black widow in the Marvel franchise \"The Avengers\". Moreover, Scarlett revealed a funny fact during an interview on Ellen DeGeneres’ talk show, that her 4 years old daughter believes she is a real superhero. \"If you ask her what I do for a living she says, 'Mommy's a superhero'.\"\n\n17 James McAvoy: Professor X\n\nhttps://weheartit.com/entry/119923616\n\nRaise your hand to who would like to be saved by James McAvoy? Have you seen those eyes? Impossible not to get lost in that blue. McAvoy is an actor of Scottish origin who is best known for his roles in films such as the Narnia franchise, Penelope (2007), and Atonement (2007), among others. Since 2011, McAvoy has joined the cast of the new generation of X-Men, a franchise based on Marvel comics. In this new generation, McAvoy plays a much younger version of the iconic Professor Charles Xavier.\n\nMeanwhile, in his life outside the cameras, McAvoy enjoys his role as a father. Between 2006 and 2016 the actor was married to Anne-Marie Duff, an English actress 9 years older than him. The couple received their first child Brendan McAvoy in 2010, and have always maintained a conservative life, and keep their son away from the cameras, so there are not many photos of them.\n\n16 Chris Pratt's Son Prefers Captain America\n\nVia Daily Mail\n\nChris Pratt is an American actor who until a few years ago had only minor roles, and was mostly known for his role as Andy Dwyer in the NBC sitcom Parks and Recreation (2009-2015). But in 2014 he had the opportunity to join the Marvel franchise and play the role of Peter Quill / Star-Lord in the movie Guardians of the Galaxy. This role served to boost his acting career and obtain leading roles in films such as Jurassic World (2015) and Passengers (2016).\n\nMoreover, Chris has a son with the well-known actress Anna Faris, with whom he was married from 2009 to 2017. The couple had a son in 2012, Jack Pratt, and currently, both have a good relationship and are co-parenting. Ironically, Jack is not a fan of his father's characters in action movies or superheroes. Jack has proven to be a great admirer of Captain America, and luckily, his dad knows Chris Evans.\n\n15 Cobie Smulders A.K.A. Robin Scherbatsky\n\nVia Pinteres\n\nCobie Smulders is a Canadian actress who achieved fame thanks to her role as Robin Scherbatsky on the comedy series How I Met Your Mother (2005-2014), which helped her later to obtain the role of Maria Hill, former director of S.H.I.E.L.D, in the films of the Avengers franchise, inspired by Marvel comics.\n\nCobie is married to the actor Taran Killam, best known for his work on television, participating in shows like The Amanda Show, and Saturday Night Live. The couple has been married since 2002 and they have two kids, 8-year-old Shaelyn Cado, and a 4-year-old child. But how cool it must be to be able to tell your classmates that your mom is fighting the villains in the world and is a friend of The Avengers.\n\n14 Chris Hemsworth: God Of Thunder\n\nVia Daily Mail\n\nOkay, ladies! Let's be honest, we all envy Elsa Pataky, the actress and Spanish model, who also is the proud wife of Chris Hemsworth (AKA Thor) since 2010. The couple has 3 beautiful children, India Rose Hemsworth who was born in 2012, and the twins Tristan Hemsworth and Sasha Hemsworth that were born in 2014. He is also the big brother of Miley Cyrus's boyfriend, Liam Hemsworth.\n\nChris is an actor of Australian origin who had some minor roles in Hollywood, despite having been well known in Australia for participating in television series such as Guinevere Jones and Fergus McPhail. But his jump to fame came when he was selected in 2011 to play the Thunder God Thor.\n\n13 Zoe Saldana: Avatar And Guardians Of The Galaxy\n\nVia Daily Mail\n\nZoe Saldana is an American actress and dancer who has been acting in Hollywood for a long time and is best known for her roles in films such as Avatar (2010), the Star Trek franchise, and recently, she joined the group of actors who belong to Marvel's superheroes inspired by the comics. Saldana, since 2014 has been playing the role of Gamora as part of the team of Guardians of the Galaxy and The Avengers.\n\nZoe, besides saving the world from terrible villains, is the mother of 3 children with her husband Marco Perego, an Italian artist. The couple has been married since 2013. And according to Page Six, they met in New York, but it is unknown exactly how and where they met because the couple is often too reserved with their personal lives and avoid exposing themselves too much under the spotlight.\n\n12 Gwyneth Paltrow Is Iron Man's Girlfriend\n\nVia People\n\nThe American actress and singer, Gwyneth Kate Paltrow, known for her roles in films such as Shakespeare in Love (1998), or for being the girlfriend of Iron Man in the films inspired by the Marvel comics. But during Iron Man 3, Pepper (Gwyneth) did what many women have long hoped for the superhero girlfriends, she defended her boyfriend Tony Stark against the villain.\n\nIn her real life, Gwyneth was married to Chris Martin, the lead singer of the British band Coldplay, from 2003 till 2016. The couple had two children, Apple who was born in 2004, and Moses who was born in 2006. Gwyneth is now engaged to Brad Falchuk, an American screenwriter, and producer, while Chris is dating, actress Dakota Johnson.\n\n11 Bradley Cooper Voices Rocket Raccoon\n\nVia Page Six\n\nBradley Cooper is an American actor and producer, who is known for films such as Silver Linings Playbook (2012), American Hustle (2013), and American Sniper (2014). But currently he's been working as one of the superheroes that belong to the Galaxy Guardians team, and if you had not noticed, the handsome Cooper is the one who gives voice to Rocket Raccoon.\n\nBut regarding his personal life, Bradley has been dating Irina Shayk a Russian model and one of the Victoria Secret's Angels. In 2017, the couple welcomed their first daughter whom they named Lea De Seine Shayk Cooper, and since the birth of their daughter the couple seems to be more united than ever, but so far it is unknown if they plan to take the big step and get married.\n\n10 Benedict Cumberbatch Is The Perfect Dr. Strange\n\nhttps://www.bustle.com/articles/47648-17-times-benedict-cumberbatch-expressed-wanting-a-family-more-than-anything\n\nBenedict Cumberbatch is an actor of English origin known for his roles in films such as Atonement, 12 Years to Slave, and the Star Trek franchise. In 2015 the actor got the role of one of Marvel's superheroes, Doctor Strange, who had his own film and soon after joined the plot of The Avengers, due to his ability to time travel.\n\nAccording to The Sun UK, Benedict met his future wife, Sophie Hunter, in the thriller Burlesque Fairytales in 2009, but it was not until 2013 that Cumberbatch reconnected with Sophie and they started dating. Sophie is a theater director, playwright and former performer. The couple married in 2015 and currently have two children, Christopher Carlton, who was born in June 2015, and Hal Auden, who was born in March 2017.\n\n9 Hugh Jackman Was Wolverine For 17 Years\n\nhttp://www.dailymail.co.uk/tvshowbiz/article-2042029/Hugh-Jackman-opens-painful-road-parenthood.html\n\nHugh Jackman is an Australian actor and is considered one of the established actors in the film industry. We all remember the actor thanks to films like Van Helsing (2004), Les Misérables (2012), The Greatest Showman (2017). But probably his most memorable character has been Wolverine (Logan) from the universe of Marvel, X-Men, being one of the favorite characters of the audience.\n\nSince 1996, Hugh has been married to Deborra-Lee Furness, another actress of Australian origin. The couple, unfortunately, could never conceive their own children, but that did not stop them at the time of wanting to become parents, which is why they decided to adopt. Both have two children, Oscar Maximilian who was born in 2000 and Ava Eliot who was born in 2005.\n\n8 Evangeline Lilly Is No Longer Lost\n\nVia dailymail.co.uk\n\nEvangeline Lilly is a Canadian actress who stole our hearts when she played the role of Kate in the television series Lost (2004-2010). She also starred in other films such as The Hurt Locker (2008), Real Steel (2011) and The Hobbit film series (2013-14). But recently, Evangeline was selected to play the role of Hope van Dyne, the romantic interest of the superhero Ant-Man, but Hope is not only the girlfriend of the superhero who is just there to be rescued, but she also has a role quite prominent in the movies of Marvel, so she also has superpowers.\n\nHowever, in real life, Evangeline has a relationship with Norman Kali, whom the actress met during the filming of Lost. Currently, the couple has 2 children, Kahekili Kali who was born in 2011 and in 2015 the couple received their second child.\n\n7 Jason Momoa: Aquaman Has Never Looked So Good\n\nJason Momoa is an American actor and producer who is best known for his role in the television series Game of Thrones, where he played Khal Drogo, leader of the Dothraki tribe and husband of the mother of dragons, Daenerys Targaryen. And it was thanks to that role that Jason subsequently got the role of Aquaman in the movie Justice League (2017).\n\nJason in real life is married to the actress Lisa Bonet, whom the actor has confessed has been in love since he was a child. “I was 8-years-old and I saw her on the TV and I was like, ‘Mommy, I want that one,’” he told during the talk show of James Corden. “I was like, ‘I’m going to stalk you for the rest of my life, and I’m going to get you.’ I’m a full-fledged stalker.” The couple married in 2017 and have two children.\n\n6 Paul Rudd Is The \"Smallest\" Superhero\n\nVia Pinterest\n\nDo you guys remember Josh from the movie \"Clueless\" from 1995? Well, that role was played by Paul Rudd, and since that kiss on the stairs with Cher, I must admit that he stole my heart. Since then Paul has made other films but almost always playing secondary roles, but his great opportunity came when he was offered the role of Ant-Man for the 2015 Marvel movie, and since then we have seen him in other films of the Marvel universe as Captain America: Civil War (2016) and the Avengers (2018).\n\nPaul has been married since 2003 to Julie Yaeger, a publicist. According to Bustle, the couple met in New York after Paul was recommended to get a publicist. They currently have two children, Jack Sullivan Rudd who was born in 2006 and Darby Rudd who was born in 2010.\n\n5 Ryan Reynolds Has Been Two Different Superheroes\n\nVia Pinterest\n\nRyan Reynolds is a Canadian actor that we remember from films like, Blade: Trinity (2004), Just Friends (2005), X-Men Origins: Wolverine (2009) and The Proposal (2009). Reynolds already had time playing superheroes as Deadpool in the version of X-Men and Green Lantern, but actually earned the respect of the audience and the critics after playing again the role of Deadpool, under the direction of Tim Miller, becoming the most successful adult rated movie ever.\n\nRyan who was previously married to Scarlett Johansson found love again when he met the actress Blake Lively with whom he has been married since 2012. The couple has two daughters, James Reynolds who was born in 2014 and Inez Reynolds who was born in 2016.\n\n4 Halle Berry: Bond Girl And X-Man\n\nVia Pinterest\n\nHalle Berry is an American actress who has stolen the attention of the audience since her first films. Berry has starred in films such as The Rich Man's Wife (1996), Monster's Ball (2001), 007 (2002), and Kingsman: The Golden Circle (2017), among others. But we all remember Halle for her role as Storm of the X-Men franchise in early 2000.\n\nIn 2005, Halle met the Canadian model Gabriel Aubry during a photo shoot, both started dating and in 2008 they had their first daughter Nahla, and two years later they announced their separation. Subsequently, Halle got married for the third time to the French actor, Olivier Martinez, whom she met during the filming of the movie Dark Tide. The couple was married from 2013 to 2016, during their marriage they welcomed a son called Maceo Robert Martinez who was born in 2013.\n\n3 Selma Blair Hasn't Been A Superhero In A Long Time\n\nVia dailymail.co.uk\n\nSelma Blair is an American actress known for her roles in films such as Cruel Intentions (1999), Legally Blonde (2001) and The Sweetest Thing (2002). Although, comics fans probably remember her more for her role as Liz Sherman, a pupil of B.P.R.D., in the Hellboy film franchise from 2004 to 2008.\n\nBut in real life, Selma has a calmer life, beyond fighting villains in the comic book movie world. The actress was married to Ahmet Zappa from 2004 to 2006, but it was when she met Jason Bleick, a fashion designer, that Selma got pregnant with her son Arthur Saint Bleick who was born in 2011. Fourteen months after the birth of her son, the couple split.\n\n2 Ming-Na Wen Was Mulan Before Joining S.H.E.I.L.D.\n\nVia Zimbio\n\nMing-Na Wen is an American Chinese actress, best known for her role as Melinda May in the ABC action drama series Agents of S.H.I.E.L.D. This actress has also lent her voice to films such as Mulan and Mulan II (as Fa Mulan), Sofia the First in the Disney animated series, and she reprised her role as Mulan in the new film Ralph Breaks the Internet: Wreck-It Ralph 2\n\nThis actress has tried to keep her personal life out of the spotlights of the cameras. After a failed first marriage, Ming-Na Wen seemed to find love again and married the actor Eric Michael Zee in 1993. In the year 2000 the couple received their daughter Michaela Zee and in 2005 they welcomed their second child, Cooper Dominic Zee.\n\n1 Dan Stevens Is A Long Way From Downton Abbey\n\nVia Pinterest\n\nDan Stevens is an English actor best known for his role as Matthew Crawley, from the Downton Abbey series. Later, Dan obtained roles in films such as The Fifth Estate (2013), Night at the Museum: Secret of the Tomb (2014), and Beauty and the Beast (2017). But lately, the actor has become more notorious thanks to his role in the television series Legion, based on the character of Marvel Comics David Haller, and the tv show is connected to the series of films X-Men.\n\nDan according to his biography in IMDb is married to Susie Stevens since 2009. The couple currently has 3 children, Willow Stevens who was born in 2009, Aubrey Stevens who was born in 2012 and Eden Stevens who was born in 2016.\n\nReferences: huffingtonpost.com, contactmusic.com, bustle.com, pagesix.com, forbes.com, variety.com, dailymail.co.uk, etonline.com, wired.co.uk, imdb.com", "images": ["https://www.babygaga.com/public/build/images/cb-logo-full-white.afca2e29.svg", "https://www.babygaga.com/public/build/images/tt-logo-full-white.04a6f0d4.svg", "https://www.babygaga.com/public/build/images/ts-logo-full-white.54beb4cf.svg", "https://www.babygaga.com/public/build/images/bg-logo-full-white.8242bbb9.svg", "https://www.babygaga.com/public/build/images/th-logo-full-white.7684e614.svg", "https://static3.babygagaimages.com/wordpress/wp-content/uploads/2018/06/fd0133a5-b1be-46f2-ad10-6b8478e48b96.jpg", "https://www.babygaga.com/public/build/images/tq-logo-full-white.7436bde3.svg", "https://q.quora.com/_/ad/91f52889f6a04390a65ad2591c59986e/pixel?tag=ViewContent&noscript=1", "https://www.babygaga.com/public/build/images/sr-logo-full-white.b0cc2b44.svg", "http://b.scorecardresearch.com/p?c1=2&c2=21868715&cv=2.0&cj=1", "https://www.facebook.com/tr?id=378931439163281&ev=PageView&noscript=1", "https://www.babygaga.com/public/build/images/mm-logo-full-white.fe72c74c.svg", "https://www.babygaga.com/public/build/images/tg-logo-full-white.fc9e742a.svg", "https://www.babygaga.com/public/build/images/tv-logo-full-white.642d3d01.svg", "https://www.babygaga.com/public/build/images/tr-logo-full-white.090c581a.svg", "https://www.babygaga.com/public/build/images/hc-logo-full-white.5f66cfe4.svg"], "top_img": "https://static3.babygagaimages.com/wordpress/wp-content/uploads/2018/06/fd0133a5-b1be-46f2-ad10-6b8478e48b96.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.babygaga.com/20-celebs-who-are-superheroes-on-screen-and-parents-in-real-life/", "title": "20 Celebs Who Are Superheroes On-Screen And Parents In Real Life", "meta_data": {"viewport": "user-scalable=yes, initial-scale=1.0, width=device-width", "description": "Practically all of the Avengers have kids off-screen.", "og": {"title": "20 Celebs Who Are Superheroes On-Screen And Parents In Real Life", "type": "article", "image": {"identifier": "https://static3.babygagaimages.com/wordpress/wp-content/uploads/2018/06/fd0133a5-b1be-46f2-ad10-6b8478e48b96.jpg", "width": 970, "height": 582}, "url": "https://www.babygaga.com/20-celebs-who-are-superheroes-on-screen-and-parents-in-real-life/", "locale": "en_US", "description": "Practically all of the Avengers have kids off-screen.", "site_name": "BabyGaga"}, "article": {"published_time": "2018-06-15T18:06:49Z", "section": "Incredible"}, "fb": {"app_id": 270407583294564, "pages": 135226476595920}}, "movies": [], "publish_date": 1529086009.0, "source": "https://www.babygaga.com", "summary": ""}