{"url": "https://en.wikipedia.org/wiki/Ron_Goldman", "text": "Ronald Lyle Goldman (July 2, 1968 – June 12, 1994) was an American restaurant waiter and a friend of Nicole Brown Simpson, the ex-wife of O. J. Simpson. He was murdered along with Brown at her home in Los Angeles, California, on June 12, 1994 by Simpson. Simpson was acquitted of their murders in 1995, but found liable for both deaths in a 1997 civil suit.\n\nEarly life [ edit ]\n\nGoldman was born on July 2, 1968. He grew up in the community of Buffalo Grove, Illinois, near Chicago. His parents divorced in 1974 when he was six and, after spending a brief time in the custody of his mother, Sharon (Fohrman) Rufo, he was raised by his father, Fred Goldman, and lived with him and his younger sister, Kim Goldman.[2][3]\n\nGoldman grew up Jewish.[4][5] He attended high school at Adlai E. Stevenson High School in Lincolnshire, Illinois. He was a student at Illinois State University for one semester (where he planned to major in psychology) and a pledge to Sigma Nu fraternity before he followed his family to southern California at age 18.[6]\n\nWhen younger, Goldman had worked as a camp counselor and had volunteered to help disabled children.[7][8]\n\nIn California [ edit ]\n\nWhile living in Los Angeles, Goldman took some classes at Pierce College.[7] He learned to surf and enjoyed playing beach volleyball, rollerblading and nightclubbing.[9]\n\nUpon arriving in California, he lived independently from his family and supported himself by working as an employment headhunter and tennis instructor. He then worked a string of waiter jobs.[7] He also occasionally did work as a model for Barry Zeldes, owner of Z90049 (the store next to the California Pizza Kitchen in Brentwood Gardens, where he had worked before Mezzaluna).[6] Not long before his death, he had earned an Emergency Medical Technician's license but decided not to pursue that career.[7]\n\nInstead, Goldman told friends that he wanted to open a bar or restaurant in the Brentwood area.[7] He had shared with friends his vision of opening a future restaurant or bar characterized not by a name, but by the ankh, an Egyptian religious symbol of life that matched the tattoo on his shoulder.[6] According to his friend, Jeff Keller, he wanted to learn all facets of the restaurant-bar business, and occasionally worked as a promoter[6] at a Century City dance club called Tripps.[7] For Memorial Day, he participated with a group of event promoters in organizing a party at Renaissance, a club and restaurant on the Third Street Promenade in Santa Monica.[6]\n\nGoldman had also expressed aspirations to act and to be on a show, and he appeared as a contestant on the short-lived game show Studs in 1992. He had dated Jacqui Bell for nearly two years before she broke off their relationship three months before his death.[10][11]\n\nFriendship with Nicole Brown [ edit ]\n\nAccording to a June 15, 1994 Los Angeles Times article published three days after his death, Goldman probably met Brown six weeks before they were killed, when he borrowed her Ferrari. They grew increasingly close, accompanying each other to dance clubs, and meeting for coffee and dinner during the month-and-a-half before they died. According to police and friends, their relationship was platonic. According to the article, he had borrowed her car when he met his friend, Craig Clark, for lunch. According to Clark, he told him it was her car, but that he did not say she was his girlfriend. \"He said they were friends.\"[12]\n\nDeath [ edit ]\n\nOn the evening of Sunday, June 12, 1994, Goldman was a waiter at Mezzaluna Trattoria, a restaurant located at 11750 San Vicente Boulevard in Brentwood. Brown had called there to report that her mother, Juditha Brown, had accidentally left her sunglasses on the table.[12] After a quick search, they were discovered in the gutter outside the restaurant. Although he had not served her table, he agreed to take them to her home after work.\n\nBefore returning the sunglasses, Goldman stopped at his apartment, located at 11663 Gorham Avenue in Brentwood. He had after-work plans with his friend, Stewart Tanner, Mezzaluna's bartender, who said: \"He was going to go home and change and then we were going to go out.\" The Los Angeles Times reports, \"Goldman punched out at 9:33 pm and stayed another 15 minutes to have a bottled water at the bar. Then he left, still in his uniform, black pants and white shirt, his tie shed. He carried the glasses that Brown wanted to be returned to her. 'I'll see you later,' he called to Tanner as he walked out.\"[6]\n\nWhen Goldman arrived at Brown's residence, at 875 South Bundy Drive, he was stabbed to death along with her by Brown's ex-husband, retired professional football player and actor O. J. Simpson, on the walkway leading to the condominium. His body, along with Brown's, was found shortly after midnight, when police arrived at the crime scene. He was just a few weeks shy of his 26th birthday.[6] During a reconstruction of the events, the police came to believe he had arrived during or shortly after Nicole's death.[citation needed] Goldman's family believe that Goldman died trying to save Brown from her attacker and that he was the man whom eyewitnesses heard shouting that night.[13]\n\nGoldman is buried at Pierce Brothers Valley Oaks Memorial Park in Westlake Village, California.[14]\n\nAftermath [ edit ]\n\nSimpson was tried for the murders of both Brown and Goldman. In October 1995, after a public trial that lasted nearly nine months, he was acquitted. In a 1997 civil trial, a jury found him liable for the wrongful death of Goldman and awarded $19.5 million in damages to his family. Simpson was subsequently jailed for an unrelated armed robbery at a Las Vegas hotel in 2008.[15][16]\n\nThe rights to Simpson's book, If I Did It, a first-person account of how he would have committed the murders had he committed them, were awarded to the Goldman family in August 2007. They were granted the proceeds from the book in 2007 as part of the $33.5 million civil jury award against him they had been trying to collect for over a decade. They own the copyright, media rights, and movie rights.[17]\n\nThey also acquired Simpson's name, likeness, life story, and right of publicity in connection with the book, according to court documents, ensuring he would not be able to profit from the book. After renaming the book If I Did It: Confessions of the Killer, the Goldman family published it in September 2007 through Beaufort Books.[18]\n\nFoundation [ edit ]\n\nThe Goldman family contributed a portion of proceeds from the If I Did It book sales to the newly founded Ron Goldman Foundation for Justice.[19] It provides grants for multiple organizations and programs that provide resources to victims and survivors of violent crimes.[20] One of the largest donors to the foundation is Las Vegas executive Mark Goldman, Fred's first cousin.\n\nPortrayals [ edit ]\n\nGoldman was portrayed by Paul Witten in the TV movie The O. J. Simpson Story. He was portrayed by Russ Russo in Reenactment of the Century. He will be portrayed by Oliver Walker in Joshua Newton’s upcoming film Nicole & O.J..\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/0/0d/Ronald_goldman.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/0/0d/Ronald_goldman.jpg/220px-Ronald_goldman.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/0/0d/Ronald_goldman.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Ron_Goldman", "title": "Ron Goldman", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.13", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/0/0d/Ronald_goldman.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}