{"url": "http://www.stepandrepeat.com/blog/2016/04/media-wall-vs-step-and-repeat-vs-logo-walls/", "text": "You’ve come for the nitty gritty distinctions between the step and repeat, the media wall, and the logo wall. Each one of these is a variation on the backdrops erected at the end of the red carpet for celebrities during major events, like the Oscar’s or Grammy’s, and is often a way to advertise a specific brand or product. There’s nothing like solid product marketing couched behind an award-winning smile.\n\nWhen it comes down to it there are more similarities than differences between these industry-standard backdrops. But we’ll break each down below with specific use-cases and materials to make sure you know the exact kind of backdrop you need.\n\nThe Step and Repeat\n\nThe Step and Repeat is the classic in the entertainment industry. Historically, it’s the original name and model when it comes to event backdrops.\n\nThe phrasing comes from two separate ideas:\n\n“Step and Repeat,” the phrase. This phrase was used by photographers when they needed an actor or actress to pose in front of specific location during a red carpet walk. An endless queue of famous folk wait in line (while getting incrementally closer to their award ceremony or game), and are then asked to “step” up and pose in front of the backdrop. The photographer then asks the next celeb to “repeat” the process. Thus, the “Step and Repeat.” On and on it goes, cementing that small section of the red carpet walk in history. “Step and Repeat,” for graphic designers. Maybe the photography phrase caught on and informed the Photoshop world (it’s not entirely clear), but the second phrasing comes directly from a process in which graphic designers create an image, copy it, and repeat it in a “step” or diagonal pattern. This logo placement is essential to the business of Step and Repeat. The repeating logo is then printed on banners, and is thus called the “step and repeat” by those designers, which ties all of this together nicely.\n\nNow that we’re clear on the origins of the advertising runway backdrop, let’s get into the specifics of the Step and Repeat, as opposed to media walls and logo walls.\n\nAs we’ve said, the Step and Repeat is the original backdrop, and as such it is usually what people refer to when talking about buying or creating something like this. But the Step and Repeat in the industry means something specific. It has these common elements, most of the time:\n\nThere are brand logos. It may seem obvious, but not all event backdrops actually have logos. The Step and Repeat almost always does, and those logos are almost always placed in the close, connected pattern seen on television and in countless pre- and post-party photos.\n\nIt may seem obvious, but not all event backdrops actually have logos. The Step and Repeat almost always does, and those logos are almost always placed in the close, connected pattern seen on television and in countless pre- and post-party photos. It’s made of vinyl. This isn’t always true, but in the event world today when you order a Step and Repeat (as opposed to a media or logo wall), you’re looking at vinyl material. The quality of this material can change, which we’ll cover below, but this is the industry standard because it is cheaper than the design of a media wall.\n\nThis isn’t always true, but in the event world today when you order a Step and Repeat (as opposed to a media or logo wall), you’re looking at vinyl material. The quality of this material can change, which we’ll cover below, but this is the industry standard because it is cheaper than the design of a media wall. It hangs on a banner stand. The method of construction, in this case a banner stand, is the main difference between the Step and Repeat and other event backdrops. The Step and Repeat is often printed as repeating squares of vinyl, which are hung onto a banner stand. This means that while they are easy to move, set up, and take down, they are not very rigid. Depending on the quality of banner stand, you’re Step and Repeat will be more (or less) secure.\n\nThose are the biggest elements that define the Step and Repeat, as opposed to a media wall or logo wall.\n\nThe biggest variable in the construction of the Step and Repeat is the quality of vinyl. There are two big factors to consider when looking at quality over cost for your vinyl: glossy levels, and image quality. Each of these will affect the photographers and media greatly, and therefore your brand (or your event).\n\nIf you’re ordering a Step and Repeat you’ll want to make sure the backdrop is suitable for photographers. As we know, professional photographers use a variety of lights, including bright and sudden flash, to snap photos of these celebrities. If the vinyl is too glossy it will appear extremely shiny in the photograph, which looks bad for the celebrity, the photographer, and will likely make it hard to see the logos clearly. This can be a real issue, and as such it’s best to go with a quality manufacturer of vinyl Step and Repeats. Look for matte vinyl when choosing, and make sure to get samples of finished work for the material you’re about to purchase.\n\nImage quality relates to the quality of vinyl used, but it goes beyond it as well. Let’s say the vinyl is matte, and has very little sheen to it. But if your logo (or your sponsor’s logo) is printed poorly, it won’t look sharp. Most sponsors are paying to make sure they get noticed. This won’t work out well for either party, so consider quality of printing before purchasing a Step and Repeat.\n\nBoth the image and vinyl quality also matter in terms of longevity. Some Step and Repeats may be a one-off purchase for a single event, but many can be reused over and over, especially for strong partnerships between brands and event planners. The image and vinyl quality needs to last for multiple events in this case, and a weak spot on either will increase wear and tear, which means you’ll need to purchase a new Step and Repeat more often, decreasing the repeated value.\n\nWhen it comes to quality, similar mentalities are true for media walls and logo walls. You’re going to get what you pay for, and it really depends on your needs.\n\nLet’s dive into the media wall, and see how it stacks up against Step and Repeats and logo walls.\n\nMedia Walls\n\nMedia walls don’t have nearly the historic background of the Step and Repeat. As such, they lack the charm of a tradition based name. But that’s alright, because the media wall could be considered more substantial than the Step and Repeat in today’s event planning world.\n\nThe media wall has a lot in common with the Step and Repeat, namely that it’s still a backdrop for celebrities to pose in front of and often used for marketing purposes. But the differences are just as important:\n\n“Wall” really means a wall. Unlike the hanging banner platform of a Step and Repeat, a media wall is typically a hard-paneled backdrop that stands on its own. It can be made of a few different materials, but wooden frames are common for high-end events. The rigid board surface is standard, and the media logos are often put on over it.\n\nUnlike the hanging banner platform of a Step and Repeat, a media wall is typically a hard-paneled backdrop that stands on its own. It can be made of a few different materials, but wooden frames are common for high-end events. The rigid board surface is standard, and the media logos are often put on over it. Media walls are higher-end. Those huge events we’ve mentioned, like the Oscar’s and Grammy’s, always use media walls. For such a prestigious event where so many different people come and go, it’ necessary to have a solid, hassle-free board that can stand up to wind and other elements.\n\nThose huge events we’ve mentioned, like the Oscar’s and Grammy’s, always use media walls. For such a prestigious event where so many different people come and go, it’ necessary to have a solid, hassle-free board that can stand up to wind and other elements. Media walls are more expensive. Due to the durable design, media walls tend to cost more. But if you have the space to store them, they will last a lot longer than a banner-style Step and Repeat.\n\nDue to the durable design, media walls tend to cost more. But if you have the space to store them, they will last a lot longer than a banner-style Step and Repeat. Media walls don’t always have advertisements. This might seem incongruous with the whole point of the event backdrop, but media walls don’t always advertise something. They usually do, but sometimes a company decides to print only its own logo on the board, or the name of the event. This can add a sense of class to an event. Some backdrops plaster as many advertisements as possible on a wall or step and repeat, which is effective, but can be gaudy. This is also true of Step and Repeats, but not Logo Walls, as we’ll see below.\n\nThis might seem incongruous with the whole point of the event backdrop, but media walls don’t always advertise something. They usually do, but sometimes a company decides to print only its own logo on the board, or the name of the event. This can add a sense of class to an event. Some backdrops plaster as many advertisements as possible on a wall or step and repeat, which is effective, but can be gaudy. This is also true of Step and Repeats, but not Logo Walls, as we’ll see below. Media walls can be cloth or vinyl. Some companies take the logos or advertisements, print them onto vinyl sheets, and tape or glue those onto the rigid boards of the media walls. Others print out large cloth banners that fit over the entire wall. Each process has its merits, but cloth is usually more expensive.\n\nThe same issues listed under Step and Repeats, in regards to image quality and printing, apply to the media wall. You will pay for what you get, and photographers will always want surfaces that don’t reflect too much light, while advertisers want their logos to pop. Because media walls are used at higher-end events, this is even more important.\n\nIn addition, with media walls you’ll find that suppliers construct their walls differently. Some construct a full, unbroken wall, while others build them in panels, usually 4 feet wide. Obviously the unbroken wall is studier and provides a more seamless experience, while the walls with seams might get moved, or end up showing up as cracks in photos and video. Then again, the smaller units are much easier to set up and take down. This factor really depends on the layout of your event, and what you’re supplier is capable of.\n\nLogo Walls\n\nLogo walls are definitely the least rigidly defined out of the three event backdrops. One of the common issues in the industry is that people don’t know what exactly to call of these event backdrops — which is why you are here reading about the differences. The logo wall functions most like a media wall with one major difference.\n\nIt will always have logos. While the media wall can be used for a variety of purposes and styles that don’t always include advertisements, a logo wall will. It’s like a Step and Repeat in that cloth or vinyl sections will be used, but more similar to the media wall in that an actual wall is constructed, and therefore very sturdy and higher end.\n\nLogo walls might also be used as more serious product placement, foregoing the concept that people will stand in front of them and get photographed. A logo wall could have a very large print of a company’s logo, like a large advertisement, which is then photographed on its own at an event. This is less common, but is sometimes referred to as a logo wall.\n\nUniversal Issues\n\nNow that you have a clear idea of the difference between the step and repeat, media walls, and logo walls, there are a few specifics that apply to all of these you should know about.\n\nYou can typically order any size you want when it comes to event backdrops, but the most common is 8 feet by 4 feet for a small backdrop. Typically, you add 2-3 feet for each person you hope to have in front of wall during a photograph. So an 8 by 4 backdrop is good for two people, often two people hugging or standing very close. An 8 x 8 will work for two-six people depending on how close they are. If you’re ordering for a sporting event, like a basketball game, consider getting a taller media wall.\n\nwhen it comes to event backdrops, but the most common is 8 feet by 4 feet for a small backdrop. Typically, you add 2-3 feet for each person you hope to have in front of wall during a photograph. So an 8 by 4 backdrop is good for two people, often two people hugging or standing very close. An 8 x 8 will work for two-six people depending on how close they are. If you’re ordering for a sporting event, like a basketball game, consider getting a taller media wall. Image quality. This is an issue we already talked about, but it’s important. As an advertiser or as a host, it’s absolutely necessary that the logos printed look good and are visible. Check with your individual manufacturer for the specific file type and size they need for their printers. Often Vector Outline EPS or Adobe Illustrator files are best, while PDF and JPEGs work, but aren’t preferred. Make sure pixel quality is extremely high to ensure crystal clear logos and ads.\n\nIf you’re a small organization or part of a small event, you don’t need a huge Step and Repeat. Consider the number of people you’ll need to photograph together in front of the advertising, and work from there. Plenty of events have a simple 8 x 4 Step and Repeat with a hanging banner at the very end of a event’s walk, or on stage behind a podium. This allows a single speaker to stand in front of the logos while being advertised.\n\nBottom Line\n\nThe step and repeat mystery and all its offshoots is hopefully a lot clearer now. But, remember to be clear with your step and repeat provider about details and timing. None of this will matter if your event backdrop is ordered too late! With that handled, you’re sure to have a successful event or advertising platform.", "images": ["http://www.stepandrepeat.com/img/menu.svg", "https://www.stepandrepeat.com/blog/wp-content/uploads/2016/04/Vinyl-Quality-150x150.jpg", "https://www.stepandrepeat.com/blog/wp-content/uploads/2016/04/Step-and-Repeat-Example-2-150x150.jpg", "http://www.stepandrepeat.com/blog/wp-content/uploads/2016/04/Logo-Wall.jpg", "https://www.stepandrepeat.com/blog/wp-content/uploads/2016/04/Logo-Wall-150x150.jpg", "https://www.stepandrepeat.com/blog/wp-content/uploads/2016/04/Step-and-Repeat-Example-2.jpg", "https://www.stepandrepeat.com/blog/wp-content/uploads/2016/04/Logo-Walls-150x150.jpg", "http://www.stepandrepeat.com/blog/wp-content/uploads/2016/04/Media-Wall.jpg", "http://www.stepandrepeat.com/blog/wp-content/uploads/2016/04/Vinyl-Quality.jpg", "https://www.stepandrepeat.com/blog/wp-content/uploads/2016/04/Media-Wall-150x150.jpg", "http://assets.pinterest.com/images/pidgets/pin_it_button.png", "http://www.stepandrepeat.com/blog/wp-content/uploads/2016/04/Logo-Walls.jpg"], "top_img": "https://www.stepandrepeat.com/blog/wp-content/uploads/2016/04/Step-and-Repeat-Example-2.jpg", "keywords": [], "authors": ["James Parsons"], "canonical_link": "https://www.stepandrepeat.com/blog/2016/04/media-wall-vs-step-and-repeat-vs-logo-walls/", "title": "Media Wall vs Step and Repeat vs Logo Walls", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "Media walls, step and repeats, and logo walls are all very similar, but have their distinct differences. Here's what sets them apart from each other.", "og": {"locale": "en_US", "type": "article", "title": "Media Wall vs Step and Repeat vs Logo Walls", "description": "Media walls, step and repeats, and logo walls are all very similar, but have their distinct differences. Here's what sets them apart from each other.", "url": "https://www.stepandrepeat.com/blog/2016/04/media-wall-vs-step-and-repeat-vs-logo-walls/", "site_name": "Step and Repeat Blog", "updated_time": "2016-05-04T21:56:52+00:00", "image": {"identifier": "https://www.stepandrepeat.com/blog/wp-content/uploads/2016/04/Step-and-Repeat-Example-2.jpg", "secure_url": "https://www.stepandrepeat.com/blog/wp-content/uploads/2016/04/Step-and-Repeat-Example-2.jpg", "width": 675, "height": 378}}, "article": {"section": "Step and Repeat Info", "published_time": "2016-04-14T00:09:28+00:00", "modified_time": "2016-05-04T21:56:52+00:00"}, "generator": "WordPress 4.9.10"}, "movies": [], "publish_date": 1460592568.0, "source": "http://www.stepandrepeat.com", "summary": ""}