{"url": "https://en.wikipedia.org/wiki/List_of_Marvel_Cinematic_Universe_films", "text": "Wikimedia list article\n\nThe Marvel Cinematic Universe (MCU) films are a series of American superhero films produced by Marvel Studios based on characters that appear in publications by Marvel Comics. The MCU is the shared universe in which all of the films are set. The films have been in production since 2007, and in that time Marvel Studios has produced and released 23 films, with eight more in various stages of development. It is the highest-grossing film franchise of all time, having grossed over $22 billion at the global box office.\n\nKevin Feige has produced every film in the series, alongside Avi Arad for the first two releases, Gale Anne Hurd for The Incredible Hulk, Amy Pascal for the Spider-Man films and Stephen Broussard for Ant-Man and the Wasp. The films are written and directed by a variety of individuals and feature large, often ensemble, casts. Many of the actors, including Robert Downey Jr., Chris Evans, Chris Hemsworth, Mark Ruffalo, Scarlett Johansson, and Samuel L. Jackson, signed contracts to star in numerous films. The films are currently distributed by Walt Disney Studios Motion Pictures, with the exception of the Spider-Man films which are owned, financed, and distributed by Sony Pictures.\n\nMarvel Studios releases its films in groups called \"Phases\". Their first film is Iron Man (2008), which was distributed by Paramount Pictures. Paramount also distributed Iron Man 2 (2010), Thor (2011) and Captain America: The First Avenger (2011), while Universal Pictures distributed The Incredible Hulk (2008). Disney began distributing the series with the crossover film The Avengers (2012), which concluded Phase One.[1] Phase Two comprises Iron Man 3 (2013), Thor: The Dark World (2013), Captain America: The Winter Soldier (2014), Guardians of the Galaxy (2014), Avengers: Age of Ultron (2015), and Ant-Man (2015).\n\nCaptain America: Civil War (2016) is the first film of Phase Three, and is followed by Doctor Strange (2016), Guardians of the Galaxy Vol. 2 (2017), Spider-Man: Homecoming (2017), Thor: Ragnarok (2017), Black Panther (2018), Avengers: Infinity War (2018), Ant-Man and the Wasp (2018), Captain Marvel (2019), Avengers: Endgame (2019), and Spider-Man: Far From Home (2019). The first three phases are collectively known as \"The Infinity Saga\".\n\nAs of July 2019 , Black Widow is filming, and Marvel Studios has two untitled films in active development for 2020, three for 2021, and three for 2022.\n\n\"The Infinity Saga\"\n\nThe films from Phase One through Phase Three are collectively known as \"The Infinity Saga\".[2][3]\n\nPhase One\n\nIron Man (2008)\n\n[16] produced Iron Man and The Incredible Hulk. Avi Arad, who helped secure early financing,producedand\n\nBillionaire industrialist Tony Stark builds himself a suit of armor after he is taken captive by a terrorist organization. Free from his captors, he decides to upgrade and don his armor in order to hunt down weapons that were sold under the table.[17]\n\nIn April 2006, Marvel hired Jon Favreau to direct Iron Man,[5] with the writing teams of Art Marcum and Matt Holloway and Mark Fergus and Hawk Ostby writing competing scripts.[5][18] Favreau consolidated both into one script, which was then polished by John August.[6] Robert Downey, Jr. was cast in the title role in September 2006, after growing out a goatee and working out to convince the filmmakers he was right for the part.[19] Principal photography began on March 12, 2007,[20] with the first few weeks spent on Stark's captivity in Afghanistan,[21] which was filmed in Inyo County, California.[22] Production also occurred on the former Hughes Company soundstages in Playa Vista, Los Angeles, California,[23] with additional filming at Edwards Air Force Base[24] and Caesars Palace in Las Vegas, Nevada.[25] Iron Man premiered at the Greater Union theater in George Street, Sydney, on April 14, 2008,[26] and was released internationally on April 30, and in the United States on May 2.[27][28]\n\nThe film ends with a post-credits scene featuring Samuel L. Jackson as Nick Fury, who approaches Stark regarding the \"Avenger Initiative\". Favreau said that he included the scene as \"a little tip of the hat for the fans...a way to sort of tee up The Avengers.\" Jackson was only on set for a day, with a skeleton crew to avoid the news of his cameo leaking.[29] Captain America's shield is also visible in the background of a scene; it was added by an ILM artist as a joke, and Favreau decided to leave it in the film.[30]\n\nThe Incredible Hulk (2008)\n\nAfter being exposed to gamma radiation that causes him to transform into the monstrous Hulk, scientist Bruce Banner goes on the run and isolates himself from his love, Betty Ross. Hunted by the military, Banner seeks to cure himself and prevent his condition from being weaponized.[31]\n\nIn January 2006,[32] Marvel reclaimed the film rights for the Hulk character from Universal Pictures after Universal failed to meet a deadline to develop a sequel to director Ang Lee's 2003 film Hulk.[33] Universal retained distribution rights for future Hulk films.[33] Instead of moving forward with a sequel, Marvel hired Louis Leterrier to direct The Incredible Hulk, a reboot.[7] Leterrier initially turned down the job out of respect for Lee, but later reconsidered and signed on.[7] The script was written by Zak Penn, who drafted a treatment for the 2003 film.[34] In April 2006, Edward Norton entered negotiations to portray Bruce Banner and rewrite Penn's script,[35] although Penn received sole credit for the screenplay.[8] Production began on July 9, 2007 and filming primarily took place in Toronto,[36] with additional filming in New York City and Rio de Janeiro.[37] The film premiered at the Gibson Amphitheatre on June 8, 2008, and was released on June 13.[38][39]\n\nThe film takes place simultaneously with the events of Iron Man 2 and Thor,[40] the former of which is set six months after the events of Iron Man.[41] Downey briefly reprised his role from Iron Man as Tony Stark in a cameo appearance at the end of the film. Downey said that the filmmakers \"were just cross-pollinating our superheroes. It happens to be a scene where I basically approach [actor William Hurt's character General Ross], and we may be considering going into some sort of limited partnership together. The great thing is he—and I don't want to give too much away—but he's in disrepair at the time I find him. It was really fun seeing him play this really powerful character who's half in the bag.\"[42] In addition, Captain America is briefly seen frozen in ice in an alternate opening of the film, included in the DVD release.[43]\n\nIron Man 2 (2010)\n\nIron Man and Iron Man 2, helped establish the shared universe concept with his inclusion of Samuel L. Jackson in a post-credits scene of the first film. Jon Favreau, the director ofand, helped establish the shared universe concept with his inclusion of Samuel L. Jackson in a post-credits scene of the first film.\n\nAfter Tony Stark reveals himself to be Iron Man, the U.S. government demands he hand over his technology. Meanwhile, a rival industrialist and a Russian scientist conspire to use his own technology against him.[44]\n\nImmediately following the successful release of Iron Man in May 2008, Marvel Studios announced it was developing a sequel, Iron Man 2.[45] Favreau returned as director[9] and Justin Theroux was hired to write the screenplay, which would be based on an original story by Favreau and Downey.[10] In October 2008, Downey signed a new four-picture deal, that retroactively included the first film, to reprise his role and Don Cheadle was hired to replace Terrence Howard as James Rhodes.[46][47] Jackson signed on to reprise his role as Nick Fury from the Iron Man post-credits sequence in up to nine films,[48] and Scarlett Johansson was cast as the Black Widow, as part of a multi-film commitment.[49] Principal photography began April 6, 2009,[50] at the Pasadena Masonic Temple in Pasadena, California.[51] The majority of filming took place at Raleigh Studios in Manhattan Beach, California.[52] Other locations included Edwards Air Force Base,[53] Monaco,[54] and the Sepulveda Dam.[52] Iron Man 2 premiered at the El Capitan Theatre in Los Angeles, California on April 26, 2010,[55] and was released internationally between April 28 and May 7 before releasing in the United States on May 7.\n\nThe film is set six months after the events of Iron Man,[41] and takes place simultaneously with the events of The Incredible Hulk and Thor.[40] The filmmakers continued to refer to other Marvel films by again including Captain America's shield. Favreau explained, \"We introduced Captain America's shield briefly in one shot in the last film. So now it really was in his room, so we had to figure out how to deal with the reality that the shield was in his workshop.\"[30] A scene toward the end of Iron Man 2 in a S.H.I.E.L.D. safe house contains several Easter eggs, ranging from footage from The Incredible Hulk displayed on a monitor to pointers on a map indicating several locales related to other Marvel films, including one pointing toward a region of Africa in reference to the Black Panther.[57] A young Peter Parker appears as the child wearing an Iron Man mask whom Stark saves from a drone; the appearance was confirmed in June 2017 by Spider-Man actor Tom Holland, Kevin Feige and Spider-Man: Homecoming director Jon Watts.[58][59] The film's post-credits scene showed the discovery of Thor's hammer in a crater.[60]\n\nThor (2011)\n\nThor, crown prince of Asgard, is banished to Earth and stripped of his powers after he reignites a dormant war. As his brother, Loki, plots to take the throne for himself, Thor must prove himself worthy and reclaim his hammer Mjölnir.[61]\n\nMark Protosevich was hired to develop a script for Thor in April 2006, after the rights were acquired from Sony Pictures.[5] In August 2007 Marvel hired Matthew Vaughn to direct the film,[62] however he exited the project in May 2008.[63] In September 2008, Kenneth Branagh entered into negotiations to replace Vaughn.[11] In May 2009, Chris Hemsworth was in negotiations to portray the titular character,[64] and Tom Hiddleston was set to play his brother, Loki.[65] Both actors were contracted to star in several films.[66] Marvel hired the writing team of Ashley Edward Miller and Zack Stentz to write a new script for the film, which was then rewritten by Don Payne.[12] Production began on January 11, 2010 in Los Angeles, California,[67] before moving to Galisteo, New Mexico in March.[68] Thor had its world premiere on April 17, 2011 at the Event Cinemas theatre in George Street, Sydney[69] and a U.S. premiere on May 2 at the El Capitan Theatre in Los Angeles, California.[70] The film was released internationally from April 21 to 30, and on May 6 in the United States.\n\nThe film takes place simultaneously with the events of The Incredible Hulk and Iron Man 2,[40] the latter of which is set six months after the events of Iron Man.[41] Clark Gregg, who appeared in Iron Man and Iron Man 2 as S.H.I.E.L.D. agent Phil Coulson, reprised the role in Thor. About his role in Thor he stated, \"Agent Coulson was one of the guys who wasn't really in the comic books, and he [had] a very kind of small role in Iron Man. And I was just very lucky that they chose to expand that character and [chose] to put him more into the universe of it.\"[72] After signing on to appear as Clint Barton / Hawkeye in The Avengers, Jeremy Renner made a cameo appearance as the character during a scene in Thor.[73] Branagh said that they \"were always going to have a guy in a basket above the action where Thor breaks in the S.H.I.E.L.D. camp\", and that he was thrilled when the producers told him they wanted to use Renner's Hawkeye for that role.[74] The film ends with a post-credits scene featuring Loki, watching as Erik Selvig and Nick Fury discuss the Tesseract.[75] The scene was directed by Joss Whedon, who directed The Avengers.[76] Stellan Skarsgård, who played Selvig, said the scene was not included when he first read the screenplay for Thor, and that he was sent pages for the scene after agreeing to appear in The Avengers.[77]\n\nCaptain America: The First Avenger (2011)\n\nIn 1942, Steve Rogers is deemed physically unfit to enlist in the U.S. Army and fight the German Reich in World War II. Recruited for a secret military operation, he is physically transformed into a super-soldier dubbed Captain America and must battle the Red Skull, head of a Nazi science division known as Hydra.[78]\n\nIn April 2006, Marvel hired David Self to write the script for a Captain America film.[5] Joe Johnston signed on to direct in November 2008,[13] and Christopher Markus & Stephen McFeely were hired to rewrite the script.[14] In March 2010, Chris Evans was cast as Captain America and Hugo Weaving was cast as the Red Skull.[79] Production began on June 28, 2010 in the United Kingdom,[80] with locations in London,[81] Caerwent,[82] Manchester and Liverpool.[83] The film premiered on July 19, 2011, at the El Capitan Theatre in Los Angeles, California,[84] and was released in the United States on July 22, and in international markets starting July 27.[85]\n\nThe Tesseract from the Thor post-credits scene appears as a MacGuffin in Captain America: The First Avenger.[86] In the film, Dominic Cooper portrays a young Howard Stark, the father of Tony Stark,[87] who hosts an early version of the Stark Expo, the fair Tony hosts in Iron Man 2.[88] The final scene of the film includes a brief appearance by Jackson's Nick Fury followed by a teaser trailer for Marvel's The Avengers after the credits.[89]\n\nMarvel's The Avengers (2012)\n\nNick Fury, the director of S.H.I.E.L.D., gathers the superheroes Iron Man, Thor, Captain America, the Hulk, Black Widow and Hawkeye to fight Thor's brother Loki, who plots to subjugate the Earth.[90]\n\nZak Penn, who wrote The Incredible Hulk, was hired to write a script for The Avengers in June 2007.[91] In April 2010, Joss Whedon closed a deal to direct the film, and to rework Penn's script.[15] Marvel announced that Edward Norton would not be reprising the role of Bruce Banner / Hulk,[92] and in July 2010, Mark Ruffalo was cast in his place.[93] Downey, Evans, Hemsworth, Johansson, Renner, Hiddleston and Jackson reprised their respective roles from previous films.[94] Principal photography began in April 2011 in Albuquerque, New Mexico,[90] before moving to Cleveland, Ohio in August,[95] and New York City in September.[96] The premiere was held on April 11, 2012 at the El Capitan Theatre in Los Angeles, California,[97] and the film was released in the United States on May 4.[98]\n\nGwyneth Paltrow, who portrayed Pepper Potts in Iron Man and Iron Man 2, was included in the film at Downey's insistence. Prior to this, Whedon had not intended the film to include supporting characters from the heroes' individual films, commenting, \"You need to separate the characters from their support systems in order to create the isolation you need for a team.\"[99] Avi Arad said that Sony Pictures and Disney discussed incorporating the OsCorp Tower from The Amazing Spider-Man into the climax of The Avengers,[100] but Feige said that \"the deal was never close to happening.\"[101] The supervillain Thanos appears in a mid-credits scene, portrayed by Damion Poitier.[102]\n\nPhase Two\n\nIron Man 3 (2013)\n\nKevin Feige has produced every film in the Marvel Cinematic Universe.\n\nTony Stark faces a powerful enemy, the Mandarin, who attacks and destroys his mansion. Left to his own devices and battling posttraumatic stress disorder, Stark struggles to get to the bottom of a series of mysterious explosions.[114]\n\nIn late 2010, Marvel and Disney announced that they were developing a third Iron Man film. In February 2011, Marvel hired Shane Black to direct Iron Man 3.[116] Black co-wrote the film's script with Drew Pearce.[103][104] Downey, Paltrow, and Cheadle reprised their roles from Iron Man 2, while Guy Pearce and Ben Kingsley joined the cast as Aldrich Killian and Trevor Slattery, respectively.[117] Filming began in May 2012, in North Carolina.[118] Additional filming took place in southern Florida,[119] China,[120] and Los Angeles.[121] Iron Man 3 premiered at Le Grand Rex in Paris, France on April 14, 2013 and at the El Capitan Theatre in Los Angeles, California on April 24.[122][123] The film was released internationally on April 25,[124] and in the United States on May 3.\n\nThe film is set in December 2013,[125][126] after the events of The Avengers.[127] In the film Tony Stark experiences PTSD-like symptoms following the Battle of New York in The Avengers. Black explained, \"that's an anxiety response to feeling inferior to The Avengers, but also to being humbled by sights he cannot possibly begin to understand or reconcile with the realities he's used to... There's a line in the movie about 'ever since that big guy with the hammer fell out of the sky, the rules have changed'. That's what we're dealing with here.\"[128] Bruce Banner appears in a post-credits scene, with Ruffalo reprising the role. About the scene, Ruffalo said \"They were about to wrap the movie and I saw Robert [Downey, Jr.] at the Academy Awards... and he said, 'What do you think about coming and doing a day?' I said, 'Are you kidding me? Bang, let's do it!' We sort of spitballed that scene, then I came in and we shot for a couple of hours and laughed.\"[129]\n\nThor: The Dark World (2013)\n\nThor reunites with astrophysicist Jane Foster as a series of portals, linking worlds at random, begin to appear. He discovers that Malekith and his army of Dark Elves have returned after thousands of years, and they seek a powerful weapon known as the Aether. Thor must join forces with his now-imprisoned brother Loki to stop them.[106]\n\nA sequel to Thor was first announced in June 2011, with Hemsworth reprising his role as Thor.[130] Hiddleston confirmed he would return as Loki in September,[131] and Alan Taylor signed on to direct the film in December.[105] The film's title was announced as Thor: The Dark World in July 2012 at the San Diego Comic-Con International,[132] and Christopher Eccleston was cast as Malekith a month later.[133] Production started in September 2012 in Bourne Wood, Surrey,[134] with additional filming taking place in Iceland and London.[135][136] The film premiered at the Odeon Leicester Square in London on October 22, 2013.[137] It was internationally released on October 30, 2013 and on November 8, 2013 in the United States.\n\nThe film is set one year after the events of The Avengers.[139] Evans briefly makes a cameo appearance in the film as Captain America when Loki shapeshifts into him while mocking Thor.[140] Hiddleston wore the Captain America costume while standing in for Evans, before Evans came to shoot the scene. Hiddleston said, \"I did an impression of Loki in the Captain America costume, and then they showed Chris [Evans] my performance on tape. It's him doing an impression of me doing an impression of him. And it's brilliant.\"[140] James Gunn, the director of Guardians of the Galaxy, directed the mid-credits scene that featured the Collector, played by Benicio del Toro. Asked about shooting the scene, Gunn said, \"I got the script that morning, and I did it in two hours at the end of a day of second unit shooting [for Guardians of the Galaxy].\"[141]\n\nCaptain America: The Winter Soldier (2014)\n\nSteve Rogers, now working with S.H.I.E.L.D., teams up with Natasha Romanoff / Black Widow and Sam Wilson / Falcon to expose a deep conspiracy which involves a mysterious assassin known only as the Winter Soldier.[142]\n\nA sequel to 2011's Captain America: The First Avenger was announced in April 2012. Anthony and Joe Russo were hired to direct in June,[107] and in July it was officially titled Captain America: The Winter Soldier.[132] Evans and Jackson were set to reprise their respective roles as Captain America and Nick Fury,[107] and Johansson would again play the Black Widow.[144] Sebastian Stan, who portrayed Bucky Barnes in Captain America: The First Avenger, returned as the Winter Soldier.[145] Production started in April 2013 in Manhattan Beach, California, and filming also took place in Washington, D.C. and Cleveland, Ohio.[146][147] The film premiered in Los Angeles on March 13, 2014.[148] Captain America: The Winter Soldier was released internationally on March 26[149] and in the United States on April 4.\n\nThe film is set two years after the events of The Avengers.[127] Stephen Strange, the alter-ego of the Marvel superhero Doctor Strange, is mentioned by name in the film by the character Jasper Sitwell.[150] A remodeled Stark Tower from The Avengers, now known as Avengers Tower, also makes an appearance in the film.[151] Whedon directed a post-credits scene featuring Baron Wolfgang von Strucker (Thomas Kretschmann), List (Henry Goodman), Quicksilver (Aaron Taylor-Johnson), and the Scarlet Witch (Elizabeth Olsen), who appear in Avengers: Age of Ultron.[152][153] The revelation in the film that S.H.I.E.L.D. had been infiltrated by Hydra informed the final six episodes of the first season of Agents of S.H.I.E.L.D., a television series set in the MCU.[154][155]\n\nGuardians of the Galaxy (2014)\n\nPeter Quill / Star-Lord and a group of misfits, including Gamora, Rocket, Drax the Destroyer and Groot, fight to keep a powerful orb from the clutches of the villainous Ronan.[156][157][158]\n\nNicole Perlman began writing a screenplay in 2009.[159] Marvel Studios announced it was developing a Guardians of the Galaxy film in July 2012.[132] The film is directed by James Gunn, based on his and Perlman's screenplay.[109] In February 2013, Chris Pratt was cast in the lead role, as Peter Quill / Star-Lord.[160] The film was shot at Shepperton Studios and in London from July to October 2013,[161] and post-production work was completed on July 7, 2014.[162] The film premiered on July 21, 2014 in Hollywood.[163] Guardians of the Galaxy was released in the United Kingdom on July 31, 2014,[164] and in the United States on August 1.[132]\n\nThe film is set in 2014.[165] Josh Brolin provides the voice and performance capture for Thanos,[166] the supervillain who appeared in The Avengers mid-credits scene. Gunn noted that the film would be connected to Avengers: Infinity War.[167] Several other objects of significance appear in the Collector's museum, including a Chitauri from The Avengers and a Dark Elf from Thor: The Dark World, among other characters. About their appearances Gunn said, \"There's a lot of stuff in the Collector's Museum. And for me, it was mostly just really fun. As a Marvel fan, giving the actual fans something that they can freeze frame on their Blu-Ray at home and just kind of pick out everything that's in there. So there are, I mean, seriously all those boxes have something interesting in them, so it's pretty fun.\"[168] Ronan's race, the Kree, were first introduced in the Agents of S.H.I.E.L.D. episode \"T.A.H.I.T.I.\".[169][170]\n\nAvengers: Age of Ultron (2015)\n\nThe Avengers and Avengers: Age of Ultron Joss Whedon, writer and director ofand\n\nCaptain America, Iron Man, Thor, the Hulk, Black Widow, and Hawkeye must work together as the Avengers to defeat Ultron, a technological enemy bent on human extinction, while encountering the powerful twins Pietro and Wanda Maximoff, as well as the new entity Vision.[171][172]\n\nA sequel to The Avengers was announced by Disney in May 2012, shortly after the first film's release.[173] In August 2012, Joss Whedon was signed to return as writer and director.[111] In June 2013, Downey signed a deal to reprise the role of Iron Man for the second and third Avengers films.[174] On July 20, 2013, at San Diego Comic-Con International, Whedon announced that the subtitle of the film would be Age of Ultron.[175] In August 2013, James Spader was announced to portray Ultron.[176] Second unit filming began on February 11, 2014 in Johannesburg, South Africa.[177][178] Principal photography began in March 2014 at Shepperton Studios in Surrey, England,[174][179] with additional footage filmed at Fort Bard and various other locations in the Aosta Valley region of Italy,[180] and Seoul, South Korea.[181] Filming was completed on August 6, 2014.[182] Avengers: Age of Ultron had its world premiere in Los Angeles on April 13, 2015,[183] and was released internationally beginning April 22,[184] and on May 1 in the United States.\n\nThe film confirms that the gem in Loki's scepter is an Infinity Stone, specifically the Mind Stone, and Brolin reappears as Thanos in the mid-credits scene wielding an Infinity Gauntlet.[186] It also features references to Vibranium and Wakanda, both connections to Black Panther, introducing both to the universe ahead of Black Panther's solo film. Additionally, Andy Serkis portrays Ulysses Klaue in the film, traditionally a Black Panther antagonist, and would subsequently appear in Black Panther.[187]\n\nAnt-Man (2015)\n\nThief Scott Lang must aid his mentor Dr. Hank Pym in safeguarding the mystery of the Ant-Man technology, which allows its user to decrease in size but increase in strength, from various menaces and plot a heist to defend the Earth.[112]\n\nAnt-Man is directed by Peyton Reed with a screenplay written by Edgar Wright & Joe Cornish and Adam McKay & Paul Rudd, from a story by Wright & Cornish, that includes both Scott Lang and Hank Pym.[112][113] Edgar Wright was initially slated to direct and write the film, but left the project in May 2014 due to creative differences.[188][189] In January 2013, Feige stated that Ant-Man would be the first film in Phase Three of the Marvel Cinematic Universe.[190] However, in October 2014, it was revealed that the film would be the last film of Phase Two.[191] Pre-production started in October 2013,[192] and principal photography took place from August to December 2014,[193] in San Francisco,[194] Fayette County, Georgia at Pinewood Atlanta,[195] and Downtown Atlanta.[196] In December 2013, Rudd was cast as Ant-Man,[197] followed in January 2014 with the casting of Michael Douglas as Pym and the confirmation of Rudd as Lang.[198] Ant-Man had its world premiere in Los Angeles on June 29, 2015,[199] and was released in France on July 14,[200] and in the United States on July 17.\n\nThe film is set several months after the events of Avengers: Age of Ultron.[202] Scott Lang attempts to infiltrate the new Avengers headquarters in Upstate New York featured in Age of Ultron, and confronts Sam Wilson / Falcon, played by Anthony Mackie. McKay and Rudd decided to add Falcon to Ant-Man after watching Captain America: The Winter Soldier.[203] The Russo brothers filmed the post-credit scene, which was footage from Captain America: Civil War,[204][205] and features Mackie as Falcon, Chris Evans as Steve Rogers / Captain America, and Sebastian Stan as Bucky Barnes / Winter Soldier.[206]\n\nPhase Three\n\nCaptain America: Civil War (2016)\n\nCaptain America: The Winter Soldier, Captain America: Civil War, Avengers: Infinity War and Avengers: Endgame. Anthony and Joe Russo, directors ofand\n\nThe Avengers become fractured into two opposing teams, one led by Captain America and another by Iron Man, after extensive collateral damage prompts politicians to pass an act regulating superhuman activity with government oversight and accountability for the Avengers while also facing against a new enemy, Helmut Zemo, who seeks revenge upon the Avengers.[227][228]\n\nBy January 2014, Anthony and Joe Russo had signed on to return to direct a third Captain America installment, which they confirmed in March 2014, with Chris Evans returning as Captain America, Feige returning to produce, and Christopher Markus & Stephen McFeely writing the screenplay.[229][208] In October 2014, the title was officially announced as Captain America: Civil War along with the reveal that Downey would appear in the film as Tony Stark / Iron Man.[230][231] The film is an adaptation from the \"Civil War\" storyline in the comics.[232] It is also the first film of Phase Three.[191][233][234] Filming began in April 2015 at Pinewood Atlanta,[235][236] and concluded in August 2015.[237] Captain America: Civil War had its premiere in Hollywood on April 12, 2016,[238] was released internationally beginning April 27,[239] and was released on May 6 in the United States.\n\nThe film is set one year after the events of Avengers: Age of Ultron.[241] Captain America: Civil War introduces Tom Holland as Peter Parker / Spider-Man and Chadwick Boseman as T'Challa / Black Panther to the MCU, who appear in solo films in 2017 and 2018, respectively.[242][243] William Hurt reprises his role as Thunderbolt Ross from The Incredible Hulk, and is now the US Secretary of State.[244] For the mid-credits scene, in which Black Panther offers Captain America and Bucky Barnes asylum in Wakanda, Joe and Anthony Russo received input from Black Panther director Ryan Coogler on the look and design of Wakanda.[245]\n\nDoctor Strange (2016)\n\nAfter Stephen Strange, the world's top neurosurgeon, is involved in a car accident that ruins his career, he sets out on a journey of healing, where he encounters the Ancient One, who teaches Strange the use of Mystic Arts and to defend the Earth from mystical threats.[246][247]\n\nIn June 2010, Thomas Dean Donnelly and Joshua Oppenheimer were hired to write the screenplay for a film starring the character Doctor Strange.[248] In January 2013, Kevin Feige confirmed that Doctor Strange would be a part of their Phase Three slate of films.[249] In June 2014, Scott Derrickson was hired to direct.[209] In December 2014, Benedict Cumberbatch was cast in the eponymous role, and Jon Spaihts was confirmed to rewrite the script.[250][251] In December 2015, C. Robert Cargill revealed he was a co-writer on the film,[252] and the following April, revealed that Derrickson also wrote the script.[253] Pre-production began in June 2014,[254] with filming beginning in November 2015 in Nepal, before moving to Longcross Studios in the UK later in the month.[255][256] Filming concluded in New York City in April 2016.[257][258] Doctor Strange had its premiere in Hong Kong on October 13, 2016,[259] and was released in the United Kingdom on October 25, 2016,[260] and on November 4 in the United States.[231]\n\nDerrickson stated that the events of the film take \"roughly\" a year, ending \"up to date with the rest of the MCU\". Doctor Strange introduces the Eye of Agamotto, a mystical relic that can manipulate time and is revealed to be an Infinity Stone at the end of the film,[261] specifically the Time Stone.[262] The film's mid-credits scene features a cameo appearance by Hemsworth as Thor, meeting with Strange, which was footage from Thor: Ragnarok. The scene was directed by Ragnarok director Taika Waititi.[262]\n\nGuardians of the Galaxy Vol. 2 (2017)\n\nGuardians of the Galaxy trilogy James Gunn, director of thetrilogy\n\nThe Guardians of the Galaxy travel throughout the cosmos and struggle to keep their newfound family together while helping Peter Quill learn more about his true parentage and facing against new enemies.[263]\n\nIn July 2014, Guardians of the Galaxy co-writer Nicole Perlman confirmed that Gunn would return to write and direct the sequel.[110][264] Chris Pratt returns for the sequel as Peter Quill / Star-Lord,[265][266] along with the other Guardians from the first film as well as additional cast members.[266] They are joined by Pom Klementieff as Mantis,[267][266] and Kurt Russell as Ego.[266][268] In June 2015, the film's title was revealed as Guardians of the Galaxy Vol. 2.[269] Filming began in February 2016 at Pinewood Atlanta,[270][271] and concluded in June 2016.[272] Guardians of the Galaxy Vol. 2 premiered in Tokyo on April 10, 2017,[273] and was released on May 5, 2017.[231]\n\nThe film is set two-to-three months after the events of Guardians of the Galaxy,[274][275] in 2014.[165] One of the film's post-credit sequences hints at the introduction of Adam Warlock,[276] after Gunn originally intended for Warlock to make a full appearance in Vol. 2. He noted that Warlock could appear in future Guardians films, and is considered \"a pretty important part\" of the cosmic side of the Marvel Cinematic Universe.[277] The Grandmaster, played by Jeff Goldblum, is seen dancing in the end credits, before his appearance in Thor: Ragnarok.[278]\n\nSpider-Man: Homecoming (2017)\n\nPeter Parker tries to balance being the hero Spider-Man with his high school life under guidance of Tony Stark as he deals with the threat of the Vulture.[279][280]\n\nOn February 9, 2015, Sony Pictures and Marvel announced that Sony would be releasing a Spider-Man film co-produced by Marvel Studios president Feige and Amy Pascal, with Sony Pictures continuing to own, finance, distribute, and have final creative control of the Spider-Man films.[281] In April 2015, Feige confirmed the character would be Peter Parker and added that Marvel had been working to add Spider-Man to the MCU since at least October 2014, when they announced their full slate of Phase Three films, saying, \"Marvel doesn't announce anything officially until it's set in stone. So we went forward with that Plan A in October, with the Plan B being, if [the deal] were to happen with Sony, how it would all shift. We've been thinking about [the Spider-Man film] as long as we've been thinking about Phase Three.\"[282] In June 2015, Tom Holland was cast in the role of Spider-Man and Jon Watts was hired to direct the film,[211] and the next month, John Francis Daley & Jonathan Goldstein were hired to write the screenplay.[283] Additional screenwriters include Watts & Christopher Ford and Chris McKenna & Erik Sommers.[212] In April 2016, the title was revealed to be Spider-Man: Homecoming.[284] Production began in June 2016 at Pinewood Atlanta,[285][286] and concluded in October 2016.[287] Spider-Man: Homecoming premiered on June 28, 2017 in Hollywood,[288] and was released in the United Kingdom on July 5,[289] and the United States on July 7, 2017.\n\nThe film is set several months after the events of Captain America: Civil War,[291] which is eight years after the events of The Avengers.[292] In April 2016, Feige confirmed that characters from previous MCU films would appear in the film,[293] with Robert Downey Jr. confirmed to reprise his role as Tony Stark / Iron Man shortly thereafter.[294] Favreau, Paltrow, and Evans also reprise their roles as Happy Hogan,[295] Pepper Potts,[296] and Steve Rogers / Captain America, respectively.[297] The clean-up crew Damage Control appear in the film (after previously being referenced in Iron Man and Agents of S.H.I.E.L.D.) ahead of an intended television series about them.[298][299][300] Various weaponry and artifacts from previous films are referenced throughout the film that Toomes and his crew repurpose for their weapons. In Parker's high school, one of his classes has a lesson about the Sokovia Accords,[301] and portraits of Bruce Banner, Howard Stark and Abraham Erskine are seen within the school.[302]\n\nThor: Ragnarok (2017)\n\nThor, trapped on another world without Mjölnir, must survive a gladiatorial duel against the Hulk and return to Asgard in time to stop the villainous Hela and the impending Ragnarök.[303]\n\nIn January 2014, Marvel announced that a third Thor film was in development, with Craig Kyle and Christopher L. Yost writing the screenplay,[304] and was officially announced as Thor: Ragnarok in October 2014.[231] By October 2015, Taika Waititi entered in negotiations to direct Thor: Ragnarok.[305][213] In December 2015, Stephany Folsom was hired to rewrite the script.[306] A year later, in January 2017, it was revealed that Eric Pearson wrote the screenplay, with Kyle, Yost and Folsom receiving story credit.[303] Pearson, Kyle and Yost would ultimately receive screenwriting credit for the film.[214][215] Hemsworth, Hiddleston, Idris Elba and Anthony Hopkins reprise their roles as Thor, Loki, Heimdall and Odin, respectively, and are joined by Cate Blanchett as Hela.[307] Production began in July 2016 in Australia at Village Roadshow Studios,[308][309] and wrapped in late October 2016.[310] Thor: Ragnarok premiered in Los Angeles on October 10, 2017,[311] began its international release on October 24, 2017 in the United Kingdom,[312] and was released on November 3, 2017 in the United States.\n\nThe film is set four years after the events of Thor: The Dark World, two years after the events of Avengers: Age of Ultron,[314][315] and around the same time period as Captain America: Civil War and Spider-Man: Homecoming. Producer Brad Winderbaum noted that \"Things happen on top of each other now in Phase Three. They're not as interlocked as they were in Phase One.\"[316] Mark Ruffalo and Benedict Cumberbatch appear in the film as Bruce Banner / Hulk and Doctor Stephen Strange, respectively.[307][262] The film reveals that the Infinity Gauntlet first seen in Odin's vault in Thor was a fake,[317] while also introducing Thanos' ship Sanctuary II in a post-credits scene.[318]\n\nBlack Panther (2018)\n\nT'Challa returns home as sovereign of the nation of Wakanda only to find his dual role of king and protector challenged by a long-time adversary in a conflict that has global consequences.[319]\n\nDocumentary filmmaker Mark Bailey was hired to write a script for Black Panther in January 2011.[320] In October 2014, the film was announced and Chadwick Boseman was revealed to be portraying T'Challa / Black Panther.[231][243] In January 2016, Ryan Coogler was announced as director,[216] and the following month, Joe Robert Cole was confirmed as the film's screenwriter.[217] In April 2016, Feige confirmed that Coogler was a co-screenwriter.[218] Filming began in January 2017 at EUE/Screen Gems Studios in Atlanta,[321][322] and concluded in April 2017.[323] Black Panther premiered in Los Angeles on January 29, 2018,[324] and began its international release on February 13, 2018,[325] and was released on February 16, 2018 in the United States. The film also had a \"cross-nation release\" in Africa, a first for a Disney film.[327][328]\n\nThe film is set one week after the events of Captain America: Civil War.[319] Florence Kasumba,[329] Serkis, Martin Freeman, and John Kani reprise their roles as Ayo, Ulysses Klaue, Everett K. Ross and T'Chaka respectively from previous MCU films.[319] The film's post-credits scene features a cameo appearance by Sebastian Stan, reprising his role as Bucky Barnes.[330]\n\nAvengers: Infinity War (2018)\n\nThe Avengers join forces with the Guardians of the Galaxy to try to stop Thanos from collecting all of the Infinity Stones.[331]\n\nThe film was announced in October 2014 as Avengers: Infinity War – Part 1.[231] In April 2015, Marvel announced that Anthony and Joe Russo would direct the film and in May, that Christopher Markus and Stephen McFeely would write the screenplay.[219][220] In July 2016, Marvel revealed the title would be shortened to simply Avengers: Infinity War.[332] Brolin reprises his role as Thanos,[333][334] and is part of an ensemble cast featuring many actors who have appeared in other MCU films. Filming for Infinity War began in January 2017 in Atlanta,[321][335] and lasted until July 2017.[336] Additional filming also took place in Scotland.[337] Avengers: Infinity War premiered in Los Angeles on April 23, 2018.[338] It was released worldwide on April 27, 2018, with a few debuts beginning as early as April 25 in a handful of countries.\n\nThe film is set two years after the events of Captain America: Civil War.[340] Marvel had been planting the seeds for Infinity War since their early films, by introducing the Infinity Stones as MacGuffins: the Tesseract / Space Stone in Captain America: The First Avenger, Loki's Scepter / Mind Stone in The Avengers, the Aether / Reality Stone in Thor: The Dark World, the Orb / Power Stone in Guardians of the Galaxy, and the Eye of Agamotto / Time Stone in Doctor Strange.[262] Additionally, Thanos is shown holding an empty Infinity Gauntlet in Avengers: Age of Ultron.[186] The Red Skull from Captain America: The First Avenger appears in the film, played by Ross Marquand instead of Hugo Weaving, and is the keeper of the final Infinity Stone, the Soul Stone.[341] The post-credits scene features Nick Fury transmitting a distress signal on a device, which has the insignia of Captain Marvel.[342]\n\nAnt-Man and the Wasp (2018)\n\nAnt-Man and Ant-Man and the Wasp Peyton Reed, director ofand\n\nScott Lang tries to balance his home life with his responsibilities as Ant-Man, when Hope van Dyne and Hank Pym present him with a new mission, requiring him to team up with Van Dyne as the Wasp.[222]\n\nAnt-Man and the Wasp was announced in October 2015. Peyton Reed confirmed that he would return to direct in November 2015, and that Paul Rudd and Evangeline Lilly would reprise their roles as Scott Lang / Ant-Man and Hope van Dyne / Wasp, respectively.[221] In December 2015, Andrew Barrer, Gabriel Ferrari, and Rudd were confirmed to write the screenplay,[343] with Chris McKenna and Erik Sommers revealed to have also contributed to the script in August 2017.[222] In February 2017, Michael Douglas confirmed he would reprise his role as Hank Pym in the film.[344] Michelle Pfeiffer was revealed as having been cast as Janet van Dyne in July 2017.[345] Filming began in August 2017 in Atlanta with additional filming in San Francisco,[222] and ended in November 2017.[346] Stephen Broussard also served as a producer on the film.[347] Ant-Man and the Wasp had its premiere in Hollywood on June 25, 2018,[348] and was released in the United States on July 6, 2018.\n\nThe film is set two years after the events of Captain America: Civil War and before the events of Avengers: Infinity War.[349][350] In the mid-credits scene, Hope van Dyne, Hank Pym, and Janet van Dyne are disintegrated as a result of the events of Avengers: Infinity War.[351]\n\nCaptain Marvel (2019)\n\nCarol Danvers becomes Captain Marvel, one of the galaxy's strongest heroes, after the Earth is caught in the center of an intergalactic conflict between two alien worlds.[352]\n\nIn May 2013, The Hollywood Reporter reported that Marvel had a working script for Ms. Marvel.[353] In October 2014, Marvel announced the film would be titled Captain Marvel and feature Carol Danvers.[231] In April 2015, Nicole Perlman and Meg LeFauve were announced as screenwriters.[354] At the 2016 San Diego Comic-Con, Brie Larson was confirmed to play the role of Carol Danvers.[355] In April 2017, Anna Boden and Ryan Fleck were hired to direct.[223] That August, Geneva Robertson-Dworet was revealed to be taking over as the film's screenwriter, replacing Perlman and LeFauve.[356] Boden, Fleck, and Robertson-Dworet received final screenplay credits on the film.[224] Location filming occurred in January 2018,[357][358] while principal photography began in March in Los Angeles[359] and concluded in July.[360] The film was released on March 8, 2019.\n\nThe film is set in 1995.[361] Jackson, Djimon Hounsou, Lee Pace, and Clark Gregg reprise their roles as Nick Fury, Korath, Ronan the Accuser, and Phil Coulson, respectively,[362][363] while the Skrull species are introduced to the MCU.[364] The Russo brothers filmed the mid-credits scene, which was footage supposed to occur offscreen before the first scenes of Avengers: Endgame, and features Chris Evans as Steve Rogers, Scarlett Johansson as Natasha Romanoff, Don Cheadle as James Rhodes and Mark Ruffalo as Bruce Banner. The post-credits scene shows Goose regurgitating the Tesseract on Fury's desk after swallowing it during the film's third act.[365]\n\nAvengers: Endgame (2019)\n\nAfter half of all life in the universe was killed due to the actions of Thanos in Avengers: Infinity War, the remaining Avengers and their allies must reassemble to revert those actions in one final stand.[366]\n\nThe film was announced in October 2014 as Avengers: Infinity War – Part 2.[231] In April 2015, it was revealed that Anthony and Joe Russo would direct the film and in May, that Christopher Markus and Stephen McFeely would write the screenplay.[219][220] In July 2016, Marvel revealed the title would be changed, being known simply at that time as the Untitled Avengers film.[332] Its title was revealed as Avengers: Endgame in December 2018.[367] Brolin reprises his role as Thanos,[333][334] and is part of an ensemble cast featuring many actors who have appeared in other MCU films. Filming began in August 2017 in Atlanta,[368] and ended in January 2018.[369] The film was released on April 26, 2019.[367]\n\nThe film begins three weeks after the events of Infinity War, before jumping ahead five years.[370] It does not have a post-credits scene, but features the sound of an Iron Man suit being hammered at the end of the credits as a callback to the first MCU film,[371] and a teaser trailer for Spider-Man: Far From Home was played after the credits in some screenings of the film a week after the film released.[372] Endgame was intended to mark the final appearances of Robert Downey Jr. as Tony Stark and Chris Evans as Steve Rogers.[373][374]\n\nSpider-Man: Far From Home (2019)\n\nSpider-Man: Homecoming and Spider-Man: Far From Home Jon Watts, director ofand\n\nPeter Parker goes on a school trip to Europe with his friends. While abroad, he is recruited by Nick Fury to team up with Mysterio to battle the Elementals.[375][376]\n\nIn December 2016, Sony Pictures scheduled a sequel to Spider-Man: Homecoming for release on July 5, 2019.[377] A year later, Watts was confirmed to be returning to direct the film.[225] Chris McKenna and Erik Sommers, two of the writers of the first film, returned to write the script.[226] Holland revealed the film's title as Spider-Man: Far From Home in late June 2018.[378] Filming began in July 2018, in England,[379] with filming also occurring in the Czech Republic, Venice,[380] and New York City.[381] and lasted until October 2018.[382] It was believed that the film would be the first film in Phase Four until April 2019, when Feige first publicly stated Far From Home would serve as the final film of Phase Three.[207] He later added that it would also be the conclusion to \"The Infinity Saga\".[3] Spider-Man: Far From Home had its premiere in Hollywood on June 26, 2019,[383] and was released in the United States on July 2, 2019.\n\nThe film is set eight months after Avengers: Endgame.[385] Jackson and Cobie Smulders reprise their roles as Nick Fury and Maria Hill, respectively, from previous MCU films.[386] The mid-credits scene features J.K. Simmons as J. Jonah Jameson. The post-credits scene features Ben Mendelsohn as Talos and Sharon Blynn as Soren, reprising their roles from Captain Marvel.[387]\n\nUpcoming\n\nBlack Widow (TBA)\n\nIn February 2014, Feige stated that after exploring Black Widow's past in Age of Ultron, he would like to see it explored further in a solo film.[391] Marvel has done some development work for the potential film, including a \"pretty in depth\" treatment by Nicole Perlman,[391][392] and by May 2016, Feige stated that Marvel was \"creatively and emotionally\" committed to creating the solo film.[393] By January 2018, Jac Schaeffer was hired to write the script.[389] That July, Cate Shortland was hired to direct, with Johansson reprising her role as Natasha Romanoff / Black Widow.[388] By February 2019, Ned Benson was hired to rewrite the script.[390] Filming began in late May 2019 in Norway and the United Kingdom, and will last until September of the same year.[394][395] Johansson will also serve as a producer on the film.[396]\n\nTimeline\n\nExternal image The Phase One Timeline infographic released by Marvel in May 2012[397]\n\nDuring Phase One of the MCU, Marvel Studios lined up some of their films' stories with references to one another, though they had no long-term plan for the shared universe's timeline at that point.[40] Iron Man 2 is set six months after the events of Iron Man,[41] and around the same time as Thor according to comments made by Nick Fury.[40] The official tie-in comic Fury's Big Week confirmed that The Incredible Hulk, Iron Man 2, and Thor all took place within a week, a year before the crossover film The Avengers. Writers Chris Yost and Eric Pearson tried to follow the logic of the films' timeline when plotting the comic, and received \"the seal of approval\" from Feige and Marvel Studios on the final timeline.[398] As promotion ahead of the release of The Avengers, Marvel released an official infographic detailing this timeline in May 2012.[397]\n\nWith Marvel no longer trying to complicate their timeline,[40] the Phase Two films were set roughly in real time relating to The Avengers: Iron Man 3 takes place about six months later, during Christmas;[125][127] Thor: The Dark World is set one year later;[139] and Captain America: The Winter Soldier is two years after.[127] Avengers: Age of Ultron and Ant-Man ended the phase in 2015, with several months passing between those films in-universe as in real life.[202] For Phase Three, directors the Russo brothers wanted to continue using real time, and so Captain America: Civil War begins a year after Age of Ultron,[241] with Avengers: Infinity War set two years after that.[340] However, producer Brad Winderbaum said the Phase Three films would actually \"happen on top of each other\" while being less \"interlocked\" as the Phase One films were,[316] with Black Panther and Spider-Man: Homecoming respectively beginning a week and several months after Civil War;[319][291] Thor: Ragnarok beginning four years after The Dark World and two years after Age of Ultron,[314][315] which is set around the same time as Civil War and Homecoming;[316] Doctor Strange taking place over a whole year and ending \"up to date with the rest of the MCU\";[261] Ant-Man and the Wasp also set two years after Civil War and shortly before Infinity War;[349] and both Guardians of the Galaxy and its sequel Vol. 2 being explicitly set in 2014,[165][275] which Feige believed would create a four-year gap between Vol. 2 and Infinity War, though the other MCU films up to that point do not specify years onscreen.[399]\n\nWhen Spider-Man: Homecoming was being developed, director and co-writer Jon Watts was shown a scroll detailing the MCU timeline that was created by co-producer Eric Carroll when he first began working for Marvel Studios. Watts said the scroll included both where the continuity of the films lined-up and did not line-up, and when fully unfurled it extended beyond the length of a long conference table. This scroll was used as the basis to weave the continuity of Homecoming into the previous films, such as The Avengers.[400] This was labelled in the film with a title card stating that eight years pass between the end of The Avengers and the events of Civil War, which was widely criticized as a continuity error that broke the established MCU timeline, in which only four years should have passed.[292][401] Additionally, dialogue in Civil War indicates that eight years pass between the end of Iron Man and the events of that film, despite the established continuity being closer to five or six years.[402][403] Infinity War co-director Joe Russo described the Homecoming eight years time jump as \"very incorrect\",[404] and the mistake was ignored in Infinity War which specified that its events were taking place only six years after The Avengers.[403] The public response to the Homecoming mistake inspired Marvel Studios to release a new timeline for all three phases,[401] and in November 2018, a timeline specifying dates for the films' events released to that point was included as part of the sourcebook Marvel Studios: The First 10 Years, celebrating the 10 year anniversary of the MCU.[405]\n\nMarvel Studios: The First 10 Years timeline from November 2018[405] Year(s) Feature films 1943–1945 Captain America: The First Avenger 2010 Iron Man 2011 Iron Man 2, Thor 2012 The Avengers, Iron Man 3 2013 Thor: The Dark World 2014 Captain America: The Winter Soldier, Guardians of the Galaxy, Guardians of the Galaxy Vol. 2 2015 Avengers: Age of Ultron, Ant-Man 2016 Captain America: Civil War 2016–2017 Doctor Strange 2017 Black Panther, Thor: Ragnarok, Avengers: Infinity War Notes: The Incredible Hulk, Spider-Man: Homecoming, and Ant-Man and the Wasp are discussed in the Marvel Studios: The First 10 Years sourcebook, but their events are not included in the timeline.[405]\n\nThis timeline ignores the two \"eight-year\" continuity errors, but also contradicts the events of Black Panther and Infinity War by placing them in 2017. Despite the latter apparent mistakes, Thomas Bacon of Screen Rant described the timeline as \"the closest Marvel has yet come to making an official statement on just when the different MCU events are set\", bringing \"some sense of balance to the MCU continuity\".[406] Following Infinity War, the Russo brothers said future films would not necessarily be set according to real time as there are \"a lot of very inventive ways of where the story can go from here\", with both Ant-Man and the Wasp and Captain Marvel set earlier in the timeline.[407] Avengers: Endgame begins shortly after Infinity War and ends in 2023 after a five year time jump. It confirms dates for several of the other films, including The Avengers in 2012, Thor: The Dark World in 2013, Guardians of the Galaxy in 2014, Doctor Strange around 2017, and Ant-Man and the Wasp in 2018 at the same time as Infinity War.[370] Spider-Man: Far From Home begins eight months after Endgame in 2024,[385] contradicting Amy Pascal's prior statement that it would begin only a few minutes after Endgame.[408]\n\nRecurring cast and characters\n\nList indicator(s)\n\nThis section shows characters who will appear or have appeared in multiple film franchises within the Marvel Cinematic Universe, and have appeared in the billing block for at least two films (see FAQ).\n\nAn empty, dark grey cell indicates the character was not in the film, or that the character's official presence has not yet been confirmed.\n\nV indicates a voice-only role.\n\n^ Norton's only film was The Incredible Hulk in 2008. ^ Iron Man 2, is Peter Parker.[59] In June 2017, Holland, Watts, and Feige stated that the child (played by Max Favreau) whom Tony Stark saves from a drone in, is Peter Parker. ^ Howard's only film was Iron Man in 2008. ^ The Avengers.[451] Damion Poitier portrayed Thanos in the post-credits scene of\n\nRelease\n\nHome media\n\nIn June 2012, Marvel announced a 10-disc box set titled \"Marvel Cinematic Universe: Phase One – Avengers Assembled\", for release on September 25, 2012. The box set includes all six of the Phase One films—Iron Man, The Incredible Hulk, Iron Man 2, Thor, Captain America: The First Avenger, and Marvel's The Avengers—on Blu-ray and Blu-ray 3D, in a replica of Nick Fury's briefcase from The Avengers.[463] In August 2012, luggage company Rimowa GmbH, who developed the briefcase for The Avengers, filed suit against Marvel Studios and Buena Vista Home Entertainment in U.S. federal court, complaining that \"Marvel did not obtain any license or authorization from Rimowa to make replica copies of the cases for any purpose.\"[464] The set was delayed to early 2013 for the packaging to be redesigned.[465] The box set, with a redesigned case, was released on April 2, 2013. In addition, the box set included a featurette on the then-upcoming Phase Two films, showing footage and concept art, as well as previously unreleased deleted scenes from all of the Phase One films.[466]\n\nIn July 2015, Marvel announced a 13-disc box set titled \"Marvel Cinematic Universe: Phase Two Collection\", for release on December 8, 2015, exclusive to Amazon.com. The box set includes all six of the Phase Two films—Iron Man 3, Thor: The Dark World, Captain America: The Winter Soldier, Guardians of the Galaxy, Avengers: Age of Ultron, and Ant-Man—on Blu-ray, Blu-ray 3D and a digital copy, in a replica of the Orb from Guardians of the Galaxy, plus a bonus disc and exclusive memorabilia. Material on the bonus disc includes all of the Marvel One-Shots with commentary, deleted scenes and pre-production creative features for each of the films, featurettes on the making of the post-credit scenes for the films, and first looks at Captain America: Civil War, Doctor Strange, and Guardians of the Galaxy Vol. 2.[467][468]\n\nIMAX 10th anniversary festival\n\nFrom August 30 to September 6, 2018, in conjunction with Marvel Studios' 10 year anniversary celebrations, all 20 films released at the time (Iron Man through Ant-Man and the Wasp) were screened in IMAX. The films were shown in release order, with four films per day. The final days of the festival were theme related, with one showing \"origin\" films (Iron Man, Spider-Man: Homecoming, Black Panther, and Doctor Strange), one showing \"team-ups\" (Guardians of the Galaxy Vol. 2, Captain America: Civil War, The Avengers, and Avengers: Infinity War),[469][470] and the final day showing Iron Man and The Avengers as chosen by the fans via a Twitter poll.[471] The festival also saw Iron Man, The Incredible Hulk, and Captain America: The First Avenger released in IMAX for the first time.[469][470]\n\nReception\n\nBox office performance\n\nThe Marvel Cinematic Universe films are the highest-grossing film franchise of all time worldwide, both unadjusted and adjusted-for-inflation, having grossed over $22 billion at the global box office. Several of its sub series such as the Avengers, Iron Man, Captain America, and Thor film series are among the most successful film series of all time.[472]\n\nEach film is linked to the \"Box office\" section of its article.\n\nCritical and public response\n\nEach film is linked to the \"Critical response\" section of its article.\n\nFuture\n\nDisney has scheduled multiple release dates for untitled Marvel Studios films. These include May 1 and November 6, 2020;[557] February 12, May 7, and November 5, 2021;[557] and February 18, May 6, and July 29, 2022.[557] Marvel had previously dated an untitled film for July 31, 2020, before removing it from their schedule in October 2018. In October 2016, Feige said it was a combination of knowing what films would occupy the 2020 dates and allowing some flexibility, saying, \"We know what [films] we'd like them to be for 2020. Over the years, where we're aiming we've been lucky enough that it's usually been the same thing but we always leave ourselves the opportunity to bob and weave and adapt if we have to.\"[559] Feige and Marvel have additional storylines planned through 2028,[560] resulting in 20 films \"on the docket that are completely different from anything that's come before—intentionally.\"[561] Feige also was not sure if Marvel would continue to group the films in phases once Phase Three concluded, that \"it might be a new thing\",[562] but Marvel was said to be using the term Phase Four in December 2018.[563] Feige noted Marvel hoped to reveal additional films after the release of Avengers: Endgame,[564] with Disney CEO Bob Iger indicating that Marvel would reveal its slate of post-Avengers: Endgame movies in mid-2019.[565]\n\nIn development\n\nThe Eternals\n\nBy April 2018, Marvel had met with multiple screenwriters to craft a film based on the Eternals, with a focus on the character Sersi. Feige stated that a film based on the group was \"one of many many many things that we are actively beginning to have creative discussions about to see if we believe in them enough to put them on a slate.\"[566] A month later, Matthew and Ryan Firpo were hired to write the script for the project.[567] By late-September, Marvel hired Chloé Zhao to direct the film.[568] Filming is expected to begin in August 2019 in Atlanta.[569]\n\nShang-Chi\n\nBy December 2018, Marvel was \"fast-tracking\" development on a Shang-Chi film, which would be their first Asian-led film. Chinese-American writer David Callaham was hired to work on the screenplay, with Marvel Studios looking to hire an Asian or Asian-American filmmaker to direct.[570] By March 2019, Marvel hired Destin Daniel Cretton to direct the film.[571] In June 2019, Guntis Sics, sound mixer on Thor: Ragnarok, revealed in an interview that the film will be shot in Australia.[572]\n\nUntitled Black Panther sequel\n\nBy October 2018, Ryan Coogler had completed a deal to write and direct a sequel to Black Panther.[573]\n\nUntitled Doctor Strange sequel\n\nBy December 2018, Scott Derrickson had completed a deal to return to direct a sequel to Doctor Strange. Marvel was beginning to search for a writer, with a plan to begin filming in early 2020. Benedict Cumberbatch and Benedict Wong will reprise their roles.[563]\n\nGuardians of the Galaxy Vol. 3\n\nIn April 2016, Kevin Feige stated that \"Guardians 3 is [one film that's] up there\" being considered for release beyond 2019.[574] In March 2017, Gunn stated that a third Guardians film would happen \"for sure\",[575] and the following month confirmed he would return to write and direct Guardians of the Galaxy Vol. 3.[576] However, in July 2018, Disney and Marvel severed ties with Gunn following the resurfacing of controversial tweets from 2008 and 2009 making light of topics such as rape and pedophilia.[577][578] Marvel planned to continue to use Gunn's script for the film.[579] Production was put on hold in August 2018,[580] ahead of the planned start of filming in January or February 2019.[581][580] In March 2019, Disney and Marvel reversed course and reinstated Gunn as the director of the film. Filming will begin in 2020 once he has completed his work for the DC Extended Universe film The Suicide Squad.[582][396]\n\nPotential projects\n\nSequels\n\nOriginals\n\nRepurposed projects\n\nThese projects were in development as films from Marvel Studios before becoming television series under Marvel Television:\n\nSee also", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/9/94/Jon_Favreau_2012.jpg/170px-Jon_Favreau_2012.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Joss_Whedon_%287595300416%29.jpg/170px-Joss_Whedon_%287595300416%29.jpg", "https://upload.wikimedia.org/wikipedia/en/e/ef/Marvel_Cinematic_Universe_-_Phase_One.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Global_thinking.svg/10px-Global_thinking.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5e/Kevin_Feige_SDCC_2013_1.jpg/170px-Kevin_Feige_SDCC_2013_1.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Green_check.svg/13px-Green_check.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c7/Peyton_Reed_%28cropped%29.jpg/170px-Peyton_Reed_%28cropped%29.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/6/61/Searchtool.svg/16px-Searchtool.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Avi_Arad_by_Gage_Skidmore.jpg/170px-Avi_Arad_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/26/Jon_Watts_by_Gage_Skidmore_2.jpg/170px-Jon_Watts_by_Gage_Skidmore_2.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Anthony_and_Joe_Russo_by_Gage_Skidmore.jpg/220px-Anthony_and_Joe_Russo_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/Split-arrows.svg/50px-Split-arrows.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/e/ef/Marvel_Cinematic_Universe_-_Phase_One.jpg/220px-Marvel_Cinematic_Universe_-_Phase_One.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/86/James_Gunn_-_Guardians_of_the_Galaxy_premiere_-_July_2014_%28cropped%29.jpg/170px-James_Gunn_-_Guardians_of_the_Galaxy_premiere_-_July_2014_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Cscr-featured.svg/20px-Cscr-featured.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/e/ef/Marvel_Cinematic_Universe_-_Phase_One.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/List_of_Marvel_Cinematic_Universe_films", "title": "List of Marvel Cinematic Universe films", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.13", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/e/ef/Marvel_Cinematic_Universe_-_Phase_One.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}