{"url": "www.msn.com/en-sg/entertainment/music/celebrity/selena-gomez-did-not-break-taylor-swift-%E2%80%9Cgirl-code%E2%80%9D-despite-report/ar-AAm8SXt?li=BBr8zL1", "text": "© 2016 Getty Images (Getty Images)\n\nSelena Gomez did NOT break the “girl code” with Taylor Swift, despite a ridiculous report. Gossip Cop can expose the absurdity of this inane story.\n\nHollywoodLife dramatically writes, “Did Selena Gomez just break girl code AGAIN? She and The Weeknd spent a romantic date night at John Mayer’s concert, but there’s a catch. The ‘Good For You’ singer’s BFF Taylor Swift used to date John… so shouldn’t she stay far away?” According to the webloid, “hanging out with your BFF’s ex-boyfriend seems off limits,” but Gomez “may have committed that cardinal sin” by attending John’s show.\n\n“Selena is spending time with John — Taylor’s ex,” declares the site, noting, “Some fans think she’s breaking girl code for the second time now. Ouch!” And yet HollywoodLies actually has no evidence whatsoever that Gomez is “spending time” with Mayer or “hanging out” with him. In truth, the two just happened to be at the same star-studded night club, in separate groups, with the crooner giving an impromptu performance.\n\nIt’s amazing that the bad blog twisted that into Gomez having a “date night at John Mayer’s concert,” committing a “cardinal sin,” and “breaking girl code.” This is nothing more than a hit piece, one designed to rile up fans and score clicks. Gomez didn’t do anything to break her “girl code” with Swift, but HollywoodLies once again managed to break several codes of journalism, like accuracy, with this sensational story.\n\nOf course, this isn’t surprising in the least. After all, we’re talking about the same disreputable outlet that spent most of 2014 falsely claiming Gomez and Swift were in a feud. Three years later, the site is still feuding with the facts.", "images": ["http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BBbyo11.img?h=17&w=0&m=6&q=60&u=t&o=t&l=f&f=png", "http://static-entertainment-eus-s-msn-com.akamaized.net/sc/57/a49b8d.gif", "http://sg.effectivemeasure.net/em_image", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/AACQhOP.img?h=66&w=88&m=6&q=60&u=t&o=t&l=f&x=622&y=421", "https://sb.scorecardresearch.com/p?c1=2&c2=3000001&cs_ucfr=1&rn=636985679021612375&c7=http%253A%252F%252Fwww.msn.com%252Fen-sg%252Fentertainment%252Fmusic%252Fcelebrity%252Fselena-gomez-did-not-break-taylor-swift-%25E2%2580%259Cgirl-code%25E2%2580%259D-despite-report%252Far-AAm8SXt%253Fli%253DBBr8zL1&c8=&c9=", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BBbyo11.img?h=100&w=100&m=6&q=60&u=t&o=f&l=f", "http://static-entertainment-eus-s-msn-com.akamaized.net/sc/82/c22c7d.gif", "http://c.msn.com/c.gif?udc=true&rid=1fff1ff1e64b451d96c16c4d6fe2ca2e&rnd=636985679021612375&rf=&tp=http%253A%252F%252Fwww.msn.com%252Fen-sg%252Fentertainment%252Fmusic%252Fcelebrity%252Fselena-gomez-did-not-break-taylor-swift-%25E2%2580%259Cgirl-code%25E2%2580%259D-despite-report%252Far-AAm8SXt%253Fli%253DBBr8zL1&di=3829&lng=en-sg&activityId=1fff1ff1e64b451d96c16c4d6fe2ca2e&d.dgk=downlevel.pc&d.imd=0&st.dpt=music&st.sdpt=entertainment-celebrity&subcvs=entertainment&pg.n=article&pg.t=article&pg.c=&pg.p=prime&anoncknm=&issso=0&aadState=0", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAm8Qn1.img?h=400&w=315&m=6&q=60&o=f&l=f&x=203&y=215", "http://otf.msn.com/c.gif?js=0&evt=impr&di=3829&pi=&ps=&su=http%253A%252F%252Fwww.msn.com%252Fen-sg%252Fentertainment%252Fmusic%252Fcelebrity%252Fselena-gomez-did-not-break-taylor-swift-%25E2%2580%259Cgirl-code%25E2%2580%259D-despite-report%252Far-AAm8SXt%253Fli%253DBBr8zL1&mkt=en-sg&pp=False&cv.partner=Gossip%2BCop&cv.publcat=Gossip%2BCop%2BMedia&st.dpt=music&st.sdpt=entertainment-celebrity&dv.Title1=&cts=636985679021612375&rf=&rid=1fff1ff1e64b451d96c16c4d6fe2ca2e&cvs=Browser&subcvs=entertainment&cv.entityId=AAm8SXt&cv.entitySrc=ar&provid=AAdsRm7&ar=0&d.dgk=downlevel.pc&d.imd=0&cv.parentId=BBr8zL1&isCorePV=&pgIdx=&pgTot=&activityId=1fff1ff1e64b451d96c16c4d6fe2ca2e&pm=&pg.n=article&pg.t=article&pg.c=&pg.p=prime&anoncknm=&issso=0&ex=&aadState=0", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BBTEmTk.img?h=66&w=88&m=6&q=60&u=t&o=t&l=f&x=1038&y=688", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/AADlWxc.img?h=66&w=88&m=6&q=60&u=t&o=t&l=f&x=955&y=860", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BBbyo1E.img?h=16&w=16&m=6&q=60&u=t&o=t&l=f"], "top_img": "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAm8Qn1.img?h=400&w=315&m=6&q=60&o=f&l=f&x=203&y=215", "keywords": [], "authors": [], "canonical_link": "http://www.gossipcop.com/selena-gomez-girl-code-taylor-swift/", "title": "Selena Gomez Did NOT Break Taylor Swift “Girl Code,” Despite Report", "meta_data": {"application-name": "Selena Gomez Did NOT Break Taylor Swift “Girl Code,” Despite Report", "cq": "passed", "robots": "noindex, nofollow", "description": "Selena Gomez did NOT break the “girl code” with Taylor Swift, despite a ridiculous report. Gossip Cop can expose the absurdity of this inane story. HollywoodLife dramatically writes, “Did Selena Gomez just break girl code AGAIN? She and The Weeknd spent a romantic date night at John Mayer’s concert, but there’s a catch. The ‘Good For You’ singer’s BFF Taylor Swift used to date John… so shouldn’t she stay far away?” According to the webloid, “hanging out with your BFF’s ex-boyfriend seems off limits,” but Gomez “may have committed that cardinal sin” by attending John’s show. “Selena is spending time with John — Taylor’s ex,” declares the site, noting, “Some fans think she’s breaking girl code for the second time now. Ouch!” And yet HollywoodLies actually has no evidence whatsoever that Gomez is “spending time” with Mayer or “hanging out” with him. In truth, the two just happened to be at the same star-studded night club, in separate groups, with the crooner giving an impromptu performance. It’s amazing that the bad blog twisted that into Gomez having a “date night at John Mayer’s concert,” committing a “cardinal sin,” and “breaking girl code.” This is nothing more than a hit piece, one designed to rile up fans and score clicks. Gomez didn’t do anything to break her “girl code” with Swift, but HollywoodLies once again managed to break several codes of journalism, like accuracy, with this sensational story. Of course, this isn’t surprising in the least. After all, we’re talking about the same disreputable outlet that spent most of 2014 falsely claiming Gomez and Swift were in a feud. Three years later, the site is still feuding with the facts. Share The Facts HollywoodLife Website Selena Gomez broke her “girl code” with Taylor Swift by hanging out with John Mayer. Monday, January 23, 2017 Share Read More Embed Information on embedding in your site Short Embed Code Share the Facts Widget Embed oEmbed Link https://www.sharethefacts.co/share/ae13d570-a5d7-485c-9410-cb0064455fb8", "viewport": "width=device-width,initial-scale=1, maximum-scale=1"}, "movies": [], "publish_date": null, "source": "http://www.msn.com", "summary": ""}