{"url": "https://www.cosmopolitan.com/uk/entertainment/a9961424/zayn-gigi-hadid-dating-timeline/", "text": "April 5th 2019 -\n\nZayn Malik says Gigi Hadid is the \"most amazing woman I have ever met\" as he defends her against Twitter trolls, following a tweet from him which many assumed was about her.\n\nLet's rewind for a second. So Gigi was spotted out with her friend Samuel Krost, and many paparazzi agencies immediately referred to him as her \"mystery man\". Gigi then took to Twitter to shut down any romance rumours, writing, \"If you outlets are going to continue writing bs headlines every time I’m seen with a friend of the male gender then there’s going to be a lot of unneeded confusion 🙃😑🤦🏼‍♀️ [sic]\"\n\nIf you outlets are going to continue writing bs headlines every time I’m seen with a friend of the male gender then there’s gunna be a lot of unneeded confusion 🙃😑🤦🏼‍♀️ — Gigi Hadid (@GiGiHadid) April 4, 2019\n\nTo any dumb fuck out there that wants to make they’re own stories up — zayn (@zaynmalik) April 4, 2019\n\nLater, Zayn tweeted, \"To any dumb fuck out there that wants to make their own stories up\", which many assumed was fighting Gigi's corner about the photos.\n\nThe singer later took to Twitter again, though, to not only deny his original tweet was about his ex-girlfriend, but to shut down any trolls who were attacking the model on social media. He wrote:\n\n\"My tweet was not about @GiGiHadid so leave her the f*** alone she is the most amazing woman I’ve ever known / And does nothing but love and support me when lord knows I don’t deserve it / So if you have anything to say @ me and I’ll put you the f*** straight / If you know nothing shut your fucking mouth.\"\n\nMy tweet was not about @GiGiHadid so leave her the fuck alone she is the most amazing woman I’ve ever known — zayn (@zaynmalik) April 4, 2019\n\nAnd does nothing but love and support me when lord knows I don’t deserve it — zayn (@zaynmalik) April 4, 2019\n\nSo if you have anything to say @ me and I’ll put you the fuck straight — zayn (@zaynmalik) April 4, 2019\n\nIf you know nothing shut your fucking mouth — zayn (@zaynmalik) April 4, 2019\n\nWe're as confused as you are about what's going on, but one thing is for sure: Zayn is still full of love for Gigi.\n\nCheck out the rest of their relationship timeline here.\n\nNovember 2015: Zayn and Gigi first spark romance rumours a few short weeks after she ends thing with Joe Jonas. Photographs of them leaving Justin Bieber’s American Music Awards after-party in L.A. surface, causing millions of Zayn fans to weep rivers.\n\n\n\nAccording to an Us Weekly source, the rumoured new couple aren’t using “boyfriend and girlfriend” terms just yet. “But seeing each other? Definitely. He’s chuffed.”\n\nDays later, Zayn stirs more romance rumours when he takes a selfie wearing what appears to be Gigi’s glasses.\n\nOn Nov. 29, Zayn and Gigi make things official by holding hands while leaving The Nice Guy together. This remains the most wonderful day for longtime ZiGi fans.\n\nBefore the month wraps, Joe Jonas quietly unfollows Gigi on Instagram and Twitter and deletes a #squad photo of himself with Zayn and Kanye West from earlier in the year.\n\nR.I.P., this image and Joe and Zayn’s friendship. Screenshot | Twitter\n\nGigi, meanwhile, posts and deletes four tweets likely directed at Joe. “Sometimes life just happens.. For whatever reason in whatever timing. And sometimes it doesn’t make sense 'til it does. That’s it,” reads one of the tweets.\n\nScreenshot | Twitter\n\nShe also posts this extremely suggestive “CHILL” photo for Joe and everyone because it’s less than one month into this new relationship, OK?\n\nJanuary 2016: Gigi takes things to the next level with a “Z” necklace. It first appears on her Instagram in a blink-and-you’ll-miss-it moment.\n\nInstagram\n\nNext up: Zayn's photo is spotted as Gigi’s background image on her phone after she touches down at Charles de Gaulle Airport in Paris ahead of Paris Fashion Week.\n\nAnd because teasing is better than the real thing (?), Zayn says he and Gigi are “good friends, yeah” while appearing on Apple’s Beats 1 radio show. Um, excuse me?\n\nMeanwhile, Gigi and Zayn star in his new music video for 'PILLOWTALK.' It’s his first music video as a solo artist and it’s so hot. Let's watch this video. Again.\n\nGigi solidifies herself as Zayn’s biggest fan by singing along to 'PILLOWTALK' en route to somewhere nice in the wee hours of the morning.\n\nIt's confirmed, Gigi is Zayn's biggest fan pic.twitter.com/oXokPirovF — nicole (@gigimypassion) January 29, 2016\n\nHe returns the gesture by commenting on her work in the music video.\n\n@zaynmalik nah musta missed it 😏😜\n\n\n\nJokes.. I wasn't looking at myself, trust me 😻🔥🔥🔥🔥🔥 — Gigi Hadid (@GiGiHadid) January 29, 2016\n\nApril 2016: Zayn and Gigi appear in their first photo shoot together as a couple for Vogue. They are so in love in Naples it hurts.\n\nCourtesy of Vogue\n\nThere’s a behind-the-scenes video too and yes, it’s also very pretty.\n\nMeanwhile, Gigi’s ex Joe Jonas weighs in on ZiGi, telling the Daily Mirror, “I think it’s interesting that she moved on so quickly. I mean, it was definitely very quick.” He also notes that people have been comparing him and Zayn “for years.”\n\nMay 2016: Zayn and Gigi walk the red carpet together at the Met Gala and are the beau and belle of the ball in Versace and Tommy Hilfiger, respectively.\n\nGetty\n\nGetty Images\n\nJune 2016: E! News reports that Gigi and Zayn have ended their relationship after seven months of dating. Sources claim that they’ve actually broken up and reunited “multiple times,” with the latest due to communication problems.\n\nThree days later, Gigi is spotted out in West Hollywood wearing her “Z” necklace, which could mean all is right in the world again.\n\nGetty\n\nTo further squash breakup rumours, Zayn and Gigi reveal his-and-hers Nutella containers in their New York kitchen via Gigi’s Snapchat. It’s the sweetest thing (get it?):\n\nJuly 2016: *CUTE PHOTO BREAK*.\n\nSeptember 2016: Zayn wishes Gigi good luck ahead of her Gigi X Tommy capsule show in NYC.\n\nTwo days later, Taylor Swift is spotted third-wheeling on a ZiGi night out. Is this where Zayn and Taylor's Fifty Shades Darker song idea first started?\n\nGetty\n\nZayn and Gigi jet off to London for Fashion Week, where they sit front row for the Versus Versace show.\n\nGetty\n\nGetty\n\nNovember 2016: Nearly one year to the day ZiGi was born, Zayn tells ES Magazine that he and Gigi met in early November 2015 at a Victoria’s Secret party.\n\nHe approached her after recognising her “from her picture” and proceeded to ask her out, taking her to The Bowery Hotel’s restaurant Gemma in New York City. “She’s a very intelligent woman,” he says of Gigi. “She knows how to carry herself. She’s quite classy and that. She’s not, like, arrogant in any way. She's confident. She carries it well. She’s cool.”\n\nDecember 2016: In an interview on Sirius XM’s Morning Mash Up, Zayn continues the ZiGi origin story. “I just asked her [out]. It was pretty straight up,” he said. “I just asked her if she wanted to go on a date. I was in New York.”\n\nJanuary 2017: Zayn and Gigi spark ~ENGAGEMENT RUMOURS~ after Gigi is spotted with a pretty gold ring on that finger while out in New York City. The next day, Zayn reveals a new tattoo – LOVE – written in cursive on his right hand. What does it all mean?\n\nGetty\n\nGetty\n\nMeanwhile, in an interview with British Vogue, Gigi reveals her typical night in with Zayn when she’s in L.A. For starters, they love “doing art” and cooking. “We like late-night movies and we order from this amazing place that does lattes and gingerbread cookies. I need coffee to stay up. I’m always like, ‘Babe, let’s go to a movie.’ Then I fall asleep halfway through and he’s like, ‘You’ve seen the first half of every movie out there and you have no idea how any of them end.’”\n\nFebruary 2017: ZiGi spend their second Valentine’s Day together and yes, there’s a cute Instagram in honour of the big day.\n\nShe also calls him “Love of my life” in an Instagram story. Open your eyes Zayn! They’re pretty and the world needs to see them.\n\nInstagram\n\nMarch 2017: Zayn and Gigi appear in a video together after he wins the Best Music Video award at the iHeartRadio Music Awards. The clip exists because he couldn’t accept the award in person. It all worked out though, because even his co-star got to squeeze in a cute thank-you.\n\nGigi photographs Zayn for the spring 2017 Versus Versace campaign, along with model Adwoa Aboah.\n\nGigi Hadid for Versus Versace\n\nGigi Hadid for Versus Versace\n\nSpeaking to the Sunday Times Style, Zayn reveals the couple’s nicknames for each other. “I call her Gee, she calls me Zee. There’s some other nicknames too, but I’ll keep those private,” he said.\n\nApril 2017: Zayn calls Gigi “my everything” in a birthday Instagram post.\n\nJuly 2017: Gigi reminds us how cute she and Zayn Malik are with adorable Instagram story of him cuddling a dog. Yes please.\n\nInstagram Stories/Gigi Hadid\n\nAugust 2017: Gigi's mum Yolanda Foster calls Zayn 'family' in the caption for an adorable photo of the couple cuddling, writing: \"Summer Loving....... #Family.\"\n\nNovember 2017: Zayn and Gigi celebrate their two year anniversary with an adorable smoochy video on Instagram, in which the model calls the singer her \"favourite human\". Adorable.\n\n\n\n\n\nDecember 2017: Gigi Hadid reminds us all that she and Zayn are still ver much in love with adorable throwback from the 2017 Met Gala.\n\nInstagram/Gigi Hadid\n\nJanuary 2018: Gigi shares sickly sweet Instagram post to mark Zayn's 25th birthday, writing, \"love this man more than I could ever put into words, & am inspired by his drive to be and do better everyday ✨ cheers to YOUR YEAR my @zayn - happiest happiest birthday & 25th year of life !! I’m proud to be by your side x\"\n\nJanuary 2018: Zayn debuts massive tattoo of Gigi's eyes on his torso in an Instagram video the model shared, along with the caption: \"birthday boogie 🕺🏻😍🤣 @zayn\"\n\nFebruary 2018: Gigi's mum Yolanda is asked whether she thinks her daughter will ever marry Zayn, to which she responds, \"He's a beautiful human being from Bradford, England. He's from the same background that I'm from, him and I get along great and he's like a son to me. It's all good.\n\n\"He has no family here and he's so far away so I understand that life because I lived that life. I think that I'm just a momma to him.\"\n\n13 March 2018: Zayn and Gigi confirm their split, following speculation the had gone their separate ways.\n\n\n\nZayn wrote,\n\n\"Gigi and I had an incredibly meaningful, loving and fun relationship and I have a huge amount of respect and adoration for Gigi as a woman and a friend. She has such an incredible soul. I'm grateful to all of our fans for respecting this difficult decision and our privacy at this time, we wish the news could have come from us first. We love you all. xZ\"\n\nGigi's statement added,\n\n\"Breakup statements often seem impersonal because there is really no way to put into words what two people experience together over a few years.. not only in the relationship, but in life in general.\n\n\"I'm forever grateful for the love, time, and life lessons that Z and I shared. I want nothing but the best for him and will continue to support him as a friend that I have immense respect and love for. As for the future, whatever's meant to be will always be. xG\"\n\n19 April 2018: Zayn is pictured turning up at Gigi's place in New York. He then leaves the next morning wearing the same clothes. THE SAME CLOTHES!\n\nGetty Images\n\nAnd soon after he left her apartment, Gigi liked one of Zayn's Instagram posts. So are things back on for ZiGi? God we hope so...\n\n30 April 2018: Goodness gracious - Zayn and Gigi are spotted kissing. THINGS ARE BACK ON, PEOPLE!\n\n4 May 2018: Despite all the recent K-I-S-S-I-N-G, Gigi is reportedly \"hesitant\" about getting back together with Zayn. A source told E! News that \"Zayn really wants to be with [Gigi] and has made it clear. He misses her and can't stand being apart,\" but \"Gigi's a little bit more hesitant.\"\n\nThe source added that Gigi \"does love him, but she isn't completely sure this is where she wants to be right now.\"\n\n\n\n6 June 2018: The couple have made their reconciliation Instagram official!\n\nInstagram\n\nLast night, the Gigi posted a selfie with someone who looks suspiciously like Zayn kissing her on the cheek while they played a game of Pokemon.\n\n\n\nYASSSSSSSSSSS.\n\n19 June 2018: During an interview with GQ magazine, Zayn comments that his reconciliation with Gigi doesn't need labelling right now. Which feels like a bit of a blow for Gigi...\n\n\"We're still really good friends, and we're still in contact,\" he said. \"No bad blood . . . Taylor Swift. We're adults. We don't need to put a label on it, make it something for people's expectations.\"\n\n27 June 2018: What better way to celebrate a rekindled romance than with a selfie while Gigi is made up like a space alien? Yeah, we're not sure either.\n\nInstagram Stories/Gigi Hadid\n\n5 July 2018: Gigi hits back at rumours she's dating Zayn as a PR stunt.\n\nGigi hit up the comments section on the private Instagram account @ExposingFakeeAssZigiii, writing a long but quite polite message in screen grabs obtained by E!.\n\n\"Seems like u guys tag me in a new post every day … pls stop,\" she said. \"It's just negative, I really have no hard feelings towards you I just know what a beautiful world there is to go out and live in instead of trying to dissect a relationship between two people that you don't even know and that you do not see 99% of. For someone who is virtually inactive on the app, I don't need his follow- my eyes are tattooed to his chest.\"\n\n\"The energy you put into this does not serve you our your life in any way kids…. truly 'beating a dead horse.' You guys can call it promo but I just post about my boyfriend like anyone else, whether I support z or he supports me is out of love and excitement for one another. There's nothing to figure out all the time… give it a break. This is my last comment on this matter but I hope u know it's not coming from a bad place. Just would love for you to find something else that inspires you in life…. x.\"\n\nGigi also responded to a fan who said she should have DM'd the account:\n\n\"I see your point that it should have been a direct message, and I agree- just didn't think of it. This is all just very frustrating and I'm only human ... I've seen the s--t on this account for just as long as u- and have too stand quiet. - I've just had enough.. just because I'm 'a celebrity' doesn't mean I don't feel, or that my time is too precious to not listen to what people have to say. I'm sure you can see how assumptions like this can be hurtful, especially about someone I love deeply- if you guys love him too, sooner or later you'll realise we're on the same team. ;)\"\n\n26 July 2018 - Yolanda Hadid shares an Instagram Story hanging out with Zayn. In with the fam, eh?\n\n\n\nInstagram Stories/Yolanda Hadid\n\n9 August 2018 - Gigi shared a video on Instagram wearing a necklace with Zayn's name on.\n\nIt's pretty hard to see the necklace properly - but luckily, the jeweller who designed it also shared a picture. How thoughtful!\n\n14 August 2018 - Gigi shares first proper selfie with Zayn since their romantic reconciliation, posting to Instagram Stories with the caption, \"Goodbye vacay we thank you\". Selfies mean it's serious, right?\n\nInstagram Stories/Gigi Hadid\n\n24 August 2018 - Yolanda Hadid posts this adorable photo of her daughter and Zayn celebrating Eid together.\n\nInstagram\n\n22 October 2018: Gigi and Zayn's relationship might've just gone through a rocky patch after the pair embarked on a bit of a break, but it looks like they've come out of the other side now, after Gigi shared a cute snap of the pair on Instagram.\n\n\"flyin[g] home to my happy place ❤️\" she wrote, alongside a candid shot of a topless Zayn hugging her from behind. Cute!\n\nDecember 12, 2018 - Zayn releases the track 'There You Are' an intense love song about relying on people that fans definitely think is about Gigi Hadid. Lyrics include, \"Friends that I rely on/Don't come through/They run like the river/But not you.\n\n\"Only you know me the way you know me / Only you forgive me when I'm sorry / Even when I messed it up / There you are.\"\n\nThis could refer to Zayn and Gigi's on-again-off-again relationship, or the fact the couple have previously touched on tough times in their relationship, which are ultimately resolved.\n\nJanuary 3rd 2019 - Have Zayn Malik and Gigi Hadid split?! The pair have reportedly been spending time apart 'since early November', with an insider saying it was for the sake of their future.\n\nAccording to a source at E! News, the singer, 25, and the model, 23, both \"think that time apart is best for the sake of their relationship right now. Both have been really focused on themselves and their separate careers.\n\n\"Zayn has been in the studio recording new music and pushing out his new album, while Gigi has been focusing a lot of time on herself.\"\n\nMarch 4th 2019 - Zayn Malik tweets about his love for Gigi Hadid, and fans are confused. While neither party have commented on the split claims so far, they also haven't been spotted together in public this year, so fans assumed they had broken up.\n\nThat is until Zayn tweeted Gigi yesterday [3 March] saying \"@GiGiHadid love you.\" Some outlets are reporting the singer deleted the tweet before Gigi had a chance to respond, but it is seemingly still live on the site:\n\nMarch 29th 2019 - A new report claims that despite Gigi Hadid still having love for Zayn Malik, they are currently not together, and haven't been since January.\n\n\"She still has feelings for him, of course, but he has major issues and she knows they aren’t compatible. She’s still very single\" said an Us Weekly insider, before adding that \"Gigi and Zayn still talk.\"", "images": ["https://www.cosmopolitan.com/sites/cosmopolitan/assets/images/logos/ipso_regulated_hires.png", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-528589628-1554458136.jpg?crop=1.00xw:0.752xh;0,0&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-528589628-1554458136.jpg?crop=1.00xw:0.752xh;0,0&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.cosmopolitan.com/entertainment/celebs/a9957861/zayn-gigi-hadid-dating-timeline/", "title": "Zayn Malik and Gigi Hadid's relationship timeline", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "Zayn Malik goes on sweary rant defending Gigi Hadid from trolls", "description": "\"She is the most amazing woman I’ve ever known\"", "url": "https://www.cosmopolitan.com/uk/entertainment/a9961424/zayn-gigi-hadid-dating-timeline/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-528589628-1554458136.jpg?crop=1.00xw:0.752xh;0,0&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 211620818858710}, "article": {"publisher": "https://facebook.com/cosmopolitanuk", "modified_time": "2019-04-05 09:57:25", "published_time": "2019-04-05 09:56:00", "section": "Entertainment"}, "twitter": {"site": "@CosmopolitanUK", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-528589628-1554458136.jpg?crop=1.00xw:0.752xh;0,0&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "Zayn Malik and Gigi Hadid's relationship timeline", "description": "From their first date to their numerous Instagrams, here are Zayn and Gigi Hadid's key moments from their relationship.", "keywords": "zayn malik, gigi hadid, zayn and gigi, zayn malik girlfriend, gigi hadid boyfriend, zayn gigi dating, zayn gigi timeline, zayn gigi relationship, zayn gigi first date, gigi hadid zayn malik hesitant", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-528589628-1554458136.jpg?crop=0.668xw:1.00xh;0.167xw,0&resize=320:*", "robots": "noindex", "sailthru.contenttype": "standard-article", "sailthru.tags": "Entertainment,entertainment,Gigi Hadid", "sailthru.date": "2019-04-05T09:56:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-528589628-1554458136.jpg?crop=1.00xw:0.752xh;0,0", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-528589628-1554458136.jpg?crop=0.668xw:1.00xh;0.167xw,0", "sailthru.socialtitle": "Zayn Malik goes on sweary rant defending Gigi Hadid from trolls", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1554472560.0, "source": "https://www.cosmopolitan.com", "summary": ""}