{"url": "https://www.self.com/story/how-i-apply-my-makeup-every-day", "text": "Learning how to apply makeup isn't as simple as it seems—and watching complicated YouTube tutorials can only make you more confused. Does foundation go before or after concealer? Should you put your eyeshadow on first or last? The truth: It’s pretty much all up to personal preference. But after years of being a beauty editor and talking to makeup pros, I’ve found a layering technique that works perfectly for me. For example, I fill in my brows before putting on foundation, since it’s one of the most important steps in my full routine. (So if I’m rushing at the end of my makeup routine, at least my brows will be done.) I also put on setting spray before mascara because I’ve ruined one too many makeup looks with runny black streaks doing it the other way around.\n\nI recommend this same application sequence to my girlfriends when I’m giving impromptu lessons in the bathroom before we go out, but don't worry—you can remove and add steps as you see fit. For instance, I spend more time in areas like brows and highlighter, but you might want to focus your efforts on your eye makeup. I also edit based on how much time I have. I only have five minutes? Then I’m priming, concealing, adding some blush and highlighter, and putting on a quick brow. If I’ve got an entire hour to prep, then I’m going all out. Really, you can customize this guide to fit your needs. Consider this a makeup beginner’s outline to layering your makeup, step by step.\n\nStep 1: Moisturize or apply a primer.\n\nKardashian favorite Mario Dedivanovic says using a hydrating cream before makeup helps all the powders and products you apply on top sink into the skin, making your makeup look less cakey. Since I prefer a dewy makeup look, I spray my face with a mist like MAC Prep + Prime Fix+ ($26). Then I massage in an illuminating primer or oil like Farsali Unicorn Essence ($54). You don’t have to use a product that is marketed as a primer; any moisturizer will do.\n\nStep 2: Fill in brows.\n\nShare via Pinterest Courtesy of Saba Karamouz\n\nI always start my makeup look with the most time-consuming element. For me, that’s my brows (others like to do eyeshadow first, but I’m pretty clueless when it comes to eye makeup). First, I use a pencil to fill in sparse areas with hairlike strokes. Currently I’m liking the Anastasia Beverly Hills Brow Wiz pencil ($21). I’ll stop here if I’m in a hurry. When I’m being extra, I add a powder or pomade to really define the ends of my brows, where there is basically no hair. For this, I use Kat Von D 24-Hour Super Brow Long-Wear Pomade ($19). Finally, I lock it all in with a gel, like It Cosmetics Brow Power Pomade ($24).\n\nStep 3: Apply foundation.\n\nShare via Pinterest Courtesy of Saba Karamouz\n\nI don’t like to use a lot of foundation, which is why I follow makeup artist Faye Lauren’s rule of thumb: Focus on the areas you want to even out and leave the rest of the face foundation-free. So, I apply my foundation starting at the center of my face: Around my nose, the eyes, and on my forehead, but I leave the area around my jawline only lightly covered. This prevents me from getting brown makeup stains everywhere when I put my hands on my chin throughout the day (that’s my thinking pose). I like to use a sponge or brush to apply my foundation, because I hate having my fingers dirty with product.\n\nStep 4: Cover dark spots with concealer.\n\nShare via Pinterest Courtesy of Saba Karamouz\n\nCarmen Williamson, a makeup artist at Joanna Czech Dallas, previously told SELF that the best way to layer on concealer is after foundation in order to make sure your makeup blends together and that you don’t overdo it. This method works best for me because I get the kind of brightening I need for my purplish-black dark circles. I use a shade that is a bit lighter than my foundation under my eyes. I also apply a little concealer to my lids to act as a primer for when I wear eyeshadow.\n\nStep 5: Add eyeshadow.\n\nShare via Pinterest Courtesy of Saba Karamouz\n\nYou know those YouTube tutorials with eyeshadow primer and four shadow colors? I can’t do all that. I just pick one shade that reflects my outfit or my mood and put it all over my lids. Sometimes I try to get fancy and do a darker color in the crease of my eye, but that’s only if I’m planning to be in a dark place (like a club or ballroom) where no one will notice my eyeshadow ineptitude .\n\nStep 6: Finish off the eye look with liner.\n\nShare via Pinterest Courtesy of Saba Karamouz\n\nI’m not a huge fan of complicated eyeliner looks (are you sensing an eye theme here?). I use a very fine pencil like the Marc Jacobs Fineliner Ultra Skinny Gel Eye Crayon ($24) to outline my waterline (that’s the area underneath the lashes). When I do eyeliner on top of my lid, I am bound to mess it up. So, I keep a stiff, angled eyeliner brush like the Trish McEvoy #50 Angled Eyeliner Brush ($29) to blend it out into a more natural-looking—and mistake free—line.\n\nStep 7: Add blush to the apples of cheeks.\n\nShare via Pinterest Courtesy of Saba Karamouz\n\nBlush is one of my favorite parts of applying makeup because a few swipes and I automatically look more put together. It probably has something to do with the fact that blush is usually the first colorful thing I add, whereas everything else is pretty neutral. I always use a powder blush in a bright vibrant color like orange or bright fuchsia. But first, I swipe a little setting powder under my eyes to set my concealer and down on my cheeks. This was a tip I learned from makeup artist Fiona Stiles.“If you try to apply a powder blush over liquid foundation, the pigment will streak and be impossible to blend,” she says. I apply the blush on the apples of my cheeks (that’s the best placement for my square face shape). I like to apply blush before highlighter because, as Stiles also told me, sometimes the shimmer in your blush is enough.\n\nStep 8: Apply highlighter.\n\nShare via Pinterest Courtesy of Saba Karamouz\n\nHighlighter is one of my go-to makeup items. When I only have five minutes to do makeup, I do brow, concealer, blush, highlight, and a lip. I start with a cream or liquid-based highlighter like Glossier Haloscope ($22) on my cheekbones and browbones as well as down my nose. I’ll stop here if I’m just doing my makeup for a day at the office. If it’s a night out, I add a powder like Nars Highlighting Powder ($38) on top to elevate my shine at least two levels.\n\nStep 9: Apply contour.\n\nShare via Pinterest Courtesy of Saba Karamouz\n\nThere’s much debate about what if contour should be first or last in the cheek trifecta (blush/highlighter/contour), but I like to do it last. That’s mostly because it’s got to be a very special occasion for me to contour . I use a stick like the Fenty Beauty Matte Skinstick ($25) to get the defined lines on my cheeks, forehead, and nose (the right tool is the key to getting a contour that isn’t too muddy). Then, I use an angled brush to blend it all in.\n\nStep 10: Swipe on a statement lip.\n\nShare via Pinterest Courtesy of Saba Karamouz\n\nOn lazy days, I skip straight to this step. Sometimes a lip has got to be enough. I cover my entire lip with liner to help my lipstick last a lot longer—a pro-approved tip I learned from my mother. Over that, I add a layer of matte liquid lipstick in a color that matches the liner pretty closely. Then apply a lipstick color that works well with the lip liner shade.\n\nStep 11: Set your entire face with setting powder or spray—or both.\n\nShare via Pinterest Courtesy of Saba Karamouz\n\nMakeup artist Hector Simancas likes to use both setting powder and spray to keep makeup in place, and I take a similar strategy. I use powder, like Maybelline Facestudio Master Fix Setting + Perfecting Loose Powder ($7), in the T-zone and underneath the eyes. Then, I spritz with my favorite setting spray, Urban Decay All Nighter Setting Spray ($32), to make sure I maintain the dewy look I like.\n\nStep 12: Finally, put on mascara.\n\nShare via Pinterest Courtesy of Saba Karamouz\n\nMascara is my very last step because I've found that if I put it on before my setting spray it usually ends up streaking down my face. I also make sure to keep Q-tips handy to easily clean up inevitable stray smudges without ruining all my work.", "images": ["https://media.self.com/photos/5cba14135fb6da50b816f426/4:3/h_130/beauty.jpg", "https://media.self.com/photos/5aa03fdc2a1b7629bd42d412/4:3/h_130/beauty-products.jpg", "https://media.self.com/photos/5ada55463cf6f501f025050d/2:1/pass/jessica.jpg", "https://media.self.com/photos/5ad9fe7c5996d57eda91cc67/4:3/w_728,c_limit/layering-lede.jpg", "https://collector-PX69t0oUvr.perimeterx.net/api/v1/collector/noScript.gif?appId=PX69t0oUvr", "https://media.self.com/photos/5bc78d82c965922df1c38e58/4:3/h_130/Talia-Coffee-Lipstick.jpg", "https://www.self.com/images/self-starter-failsafe.jpg"], "top_img": "https://media.self.com/photos/5ada55463cf6f501f025050d/2:1/pass/jessica.jpg", "keywords": [], "authors": ["Jessica Cruel", "April"], "canonical_link": "https://www.self.com/story/how-i-apply-my-makeup-every-day", "title": "Here’s a Step-by-Step Guide to How I Apply My Makeup Every Day", "meta_data": {"generator": "autopilot-build-Sat Jul 13 2019 10:43:18 GMT+0000 (UTC)", "msapplication-tap-highlight": "no", "viewport": "user-scalable=no, width=device-width, initial-scale=1, maximum-scale=1", "author": "Jessica Cruel", "copyright": "Copyright (c) Cond&#233; Nast 2019", "description": "Learning how to apply makeup can be confusing. That's why I've broken down my entire makeup routine—step by step. See exactly how I layer my makeup here.", "keywords": "makeup,shopping", "news_keywords": "Beauty,Makeup,makeup,shopping", "og": {"description": "A full rundown, from primer to mascara.", "image": "https://media.self.com/photos/5ada55463cf6f501f025050d/2:1/pass/jessica.jpg", "site_name": "SELF", "title": "A Step-by-Step Guide to Applying Makeup—Straight From a Beauty Editor", "type": "article", "url": "https://www.self.com/story/how-i-apply-my-makeup-every-day"}, "twitter": {"card": "summary_large_image", "creator": "@SELFmagazine", "description": "A full rundown, from primer to mascara.", "domain": "https://www.self.com", "image": {"src": "https://media.self.com/photos/5ada55463cf6f501f025050d/2:1/pass/jessica.jpg?mbid=social_retweet"}, "site": "SELFmagazine", "title": "A Step-by-Step Guide to Applying Makeup—Straight From a Beauty Editor"}, "fb": {"pages": 8908243810, "admins": "1515690174,835972574,1301604672,505160,43600163"}}, "movies": [], "publish_date": null, "source": "https://www.self.com", "summary": ""}