{"url": "https://www.newyorker.com/magazine/2018/08/06/les-moonves-and-cbs-face-allegations-of-sexual-misconduct", "text": "For more than twenty years, Leslie Moonves has been one of the most powerful media executives in America. As the chairman and C.E.O. of CBS Corporation, he oversees shows ranging from “60 Minutes” to “The Big Bang Theory.” His portfolio includes the premium cable channel Showtime, the publishing house Simon & Schuster, and a streaming service, CBS All Access. Moonves, who is sixty-eight, has a reputation for canny hiring and project selection. The Wall Street Journal recently called him a “TV programming wizard”; the Hollywood Reporter dubbed him a “Wall Street Hero.” In the tumultuous field of network television, he has enjoyed rare longevity as a leader. Last year, according to filings with the Securities and Exchange Commission, he earned nearly seventy million dollars, making him one of the highest-paid corporate executives in the world. In recent months, Moonves has become a prominent voice in Hollywood’s #MeToo movement. In December, he helped found the Commission on Eliminating Sexual Harassment and Advancing Equality in the Workplace, which is chaired by Anita Hill. “It’s a watershed moment,” Moonves said at a conference in November. “I think it’s important that a company’s culture will not allow for this. And that’s the thing that’s far-reaching. There’s a lot we’re learning. There’s a lot we didn’t know.” But Moonves’s private actions belie his public statements. Six women who had professional dealings with him told me that, between the nineteen-eighties and the late aughts, Moonves sexually harassed them. Four described forcible touching or kissing during business meetings, in what they said appeared to be a practiced routine. Two told me that Moonves physically intimidated them or threatened to derail their careers. All said that he became cold or hostile after they rejected his advances, and that they believed their careers suffered as a result. “What happened to me was a sexual assault, and then I was fired for not participating,” the actress and writer Illeana Douglas told me. All the women said they still feared that speaking out would lead to retaliation from Moonves, who is known in the industry for his ability to make or break careers. “He has gotten away with it for decades,” the writer Janet Jones, who alleges that she had to shove Moonves off her after he forcibly kissed her at a work meeting, told me. “And it’s just not O.K.” Thirty current and former employees of CBS told me that such behavior extended from Moonves to important parts of the corporation, including CBS News and “60 Minutes,” one of the network’s most esteemed programs. During Moonves’s tenure, men at CBS News who were accused of sexual misconduct were promoted, even as the company paid settlements to women with complaints. It isn’t clear whether Moonves himself knew of the allegations, but he has a reputation for being closely involved in management decisions across the network. Some of the allegations, such as those against the former anchor Charlie Rose, as reported by the Washington Post, have already become public. Other claims are being reported here for the first time. Nineteen current and former employees told me that Jeff Fager, the former chairman of CBS News and the current executive producer of “60 Minutes,” allowed harassment in the division. “It’s top down, this culture of older men who have all this power and you are nothing,” one veteran producer told me. “The company is shielding lots of bad behavior.” In a statement, Moonves said, “Throughout my time at CBS, we have promoted a culture of respect and opportunity for all employees, and have consistently found success elevating women to top executive positions across our company. I recognize that there were times decades ago when I may have made some women uncomfortable by making advances. Those were mistakes, and I regret them immensely. But I always understood and respected—and abided by the principle—that ‘no’ means ‘no,’ and I have never misused my position to harm or hinder anyone’s career. This is a time when we all are appropriately focused on how we help improve our society, and we at CBS are committed to being part of the solution.” According to CBS, there have been no misconduct claims and no settlements against Moonves during his twenty-four years at the network. A statement from the company said, “CBS is very mindful of all workplace issues and takes each report of misconduct very seriously. We do not believe, however, that the picture of our company created in The New Yorker represents a larger organization that does its best to treat its tens of thousands of employees with dignity and respect. We are seeing vigorous discourse in our country about equality, inclusion, and safety in the workplace, and CBS is committed to being part of the solution to those important issues.” The allegations are surfacing at a time when CBS is engaged in an increasingly acrimonious fight with its former parent company, Viacom, which acquired CBS in 1999 and spun it off as a separate entity seven years later. A holding company founded by the mogul Sumner Redstone still owns a majority stake in both Viacom and CBS, and Redstone’s daughter and heir, Shari Redstone, has sought to reunite the businesses. Moonves has resisted the move, and in May Redstone’s holding company and CBS filed lawsuits against each other. All of the women making allegations against Moonves began speaking to me before the current lawsuits, in independent interviews carried out during the past eight months. All said that they were not motivated by any allegiance in the corporate battle. But several felt that this was an opportunity to examine a workplace culture that many of the women in this story described as toxic.\n\nIlleana Douglas, who later received an Emmy nomination for her role in HBO’s “Six Feet Under,” was introduced to Moonves in 1996. At the time, she was meeting with networks, looking for a deal to write and perform for television. Moonves, who was then the president of CBS Entertainment, seemed to take a personal interest in her. He told Douglas that he was a fan of her performances in the Martin Scorsese films “Cape Fear” and “Goodfellas,” and urged her to work with CBS. “There was the big sell—he was telling me, ‘You’re gonna get a house with a pool, you’re gonna love it, it’s a great life,’ ” Douglas recalled. She agreed to sign a holding deal with CBS, which promised to pay her three hundred thousand dollars to appear exclusively in the network’s programs. CBS ultimately didn’t proceed with a pilot that Douglas wrote, but the network cast her in a comedy called “Queens,” as an eccentric native of the New York borough. In March, 1997, shortly before production of the pilot episode began, Moonves called Douglas’s manager, Melissa Prophet, and told her that he was concerned about Douglas’s attitude during a reading with her co-star, Penelope Ann Miller. Prophet relayed the concern to Douglas, who was surprised and confused: the reading, in front of a group of CBS executives, had elicited uproarious laughter. Moonves, she said, had taken her by the shoulders and congratulated her. Moonves had told Prophet that he wanted to meet with Douglas, alone, to insure that they were creatively aligned. (Prophet told me that she did not recall the conversation or setting up the meeting.) By then, Douglas had worked closely with Moonves for months. “He seemed more than just my boss,” she told me. “He was very much like a father figure.” When Douglas met with Moonves at his office, she began to raise concerns about the “Queens” script, but Moonves, she recalled, cut her off. “He interrupts me to ask me am I single,” she said. Douglas, whose nearly decade-long relationship with Scorsese was coming to an end, was caught off guard. “I didn’t know what to say at that point,” she told me. “I was, like, ‘I’m single, yes, no, maybe.’ ” She began talking about the script, but Moonves interjected, asking to kiss her. According to Douglas, he said that they didn’t have to tell her manager: “It’ll just be between you and me. Come on, you’re not some nubile virgin.” As Douglas attempted to turn the focus back to work, Moonves, she said, grabbed her. “In a millisecond, he’s got one arm over me, pinning me,” she said. Moonves was “violently kissing” her, holding her down on the couch with her arms above her head. “What it feels like to have someone hold you down—you can’t breathe, you can’t move,” she said. “The physicality of it was horrendous.” She recalled lying limp and unresponsive beneath him. “You sort of black out,” she told me. “You think, How long is this going to go on? I was just looking at this nice picture of his family and his kids. I couldn’t get him off me.” She said it was only when Moonves, aroused, pulled up her skirt and began to thrust against her that her fear overcame her paralysis. She told herself that she had to do something to stop him. “At that point, you’re a trapped animal,” she told me. “Your life is flashing before your eyes.” Moonves, in what Douglas assumed was an effort to be seductive, paused and asked, “So, what do you think?” Douglas told me, “My decision was to get out of it by joking my way out, so he feels flattered.” Thinking that reminding Moonves that he was her boss might discourage him, she told him, “Yes, for the head of a network you’re some good kisser.” Moonves frowned and got up. She scrambled to find her briefcase. “Well, this has been great. Thanks,” she recalled saying, moving toward the door. “I’ve got to go now.” Moonves, she said, followed her to the door and blocked her path. He backed her up to the wall, pressing against her, with his face close to hers. “It was physically scary,” Douglas told me. “He says, ‘We’re going to keep this between you and me, right?’ ” Attempting to put him off with a joke, she replied, “No, sir, we won’t tell anyone that you’re a good kisser.” Moonves released her and, without looking at her, walked away. “It was so invasive,” she said of the threatening encounter. “It has stayed with me the rest of my life, that terror.” Outside Moonves’s office, she began to cry. “My skirt is all twisted,” she recalled. “I’m standing in the hall and I thought of his family.” Moonves’s assistant, sitting nearby, asked whether her parking needed to be validated. Douglas told me, “I remember thinking, Does she know? Does this happen all the time?” In her car, Douglas said, “I lost it. I felt sick.” Prophet, her manager, called and, as Douglas worked up the nerve to tell her what had happened, Prophet said that she had just got off the phone with Moonves. He’d said that he and Douglas had a great meeting and “had a lot of fun.” Douglas told me, “I thought, Oh, my God, he’s covered his tracks.” In that moment, she said, “I decided, just bury it.” Later that day, Douglas returned to the house she was renting and told a friend who was staying with her, the actor Craig Chester, about the incident. “She was trying not to cry, but her voice was shaking. I’ve never seen her that emotional before,” Chester recalled. “She said that he got on top of her and held her down and she couldn’t get away. If it was any other situation outside business, I would have said, ‘Let’s go to the cops.’ ” But, Chester said, “there was no talk about going to the police or anything like that, because it was obvious that it would be career suicide.” The following week, Moonves showed up at the first day of rehearsals for “Queens.” “As soon as I saw him, I thought I was going to collapse. Everything came back to me. I was shaking,” Douglas told me. She felt that Moonves’s demeanor was intended to intimidate her. “He was eying me warily,” she said. Her distress was evident to her co-stars. “There was obviously something going on with her emotionally,” Penelope Ann Miller told me. “When she came in to test, everything was on. And then, after, on set, it was like she wasn’t there.” Last year, before the rise of #MeToo, Douglas told Miller what had happened. “Hearing her story, it all made sense,” Miller recalled. After the second rehearsal, Moonves took Douglas aside. “ ‘What the fuck do you think you’re doing out there? You’re not even trying,’ ” Douglas recalled Moonves saying. She took it as a reference to her failure to comply with his advances and to maintain her composure afterward. Douglas told me that she had “played by all the rules, I didn’t say anything, and now he was berating me.” On set, she struggled to keep her comedic timing, and cried in front of other cast members. Several days into rehearsals, Moonves called Douglas at home. “It was, you know, ‘You make me fucking sick. You are not funny,’ ” she recalled. Moonves told her that she wouldn’t “get a fucking dime” of the money she was owed, and that she would “never work at this network again.” (In a statement, CBS said that Moonves acknowledges trying to kiss Douglas, but that “he denies any characterization of ‘sexual assault,’ intimidation, or retaliatory action,” including berating her on set and personally firing her from “Queens.”) Prophet told me that Moonves and CBS Business Affairs called her to say that Douglas would be replaced on the show and that her deal would be cancelled. According to Douglas, Prophet called her and “said I’d burned all my bridges at CBS, that she was firing me.” (Prophet recalled firing Douglas and said that the two had a heated exchange. She said that she didn’t know about Douglas’s allegation, and denied the comment about burning bridges. “There are no bridges at CBS,” she said. “There is just Les Moonves.”) Douglas said that her agent, Patrick Whitesell, who was then at Creative Artists Agency, later called to say that the agency wished her well in future endeavors of her own. “I love the way C.A.A. fired me,” Douglas said. “They never told me I was fired. They just kept wishing me the best of luck.” (Whitesell told me that he had not been aware of Douglas’s allegation and did not recall that her departure from C.A.A. was related to the dissolution of her CBS deal.) Distraught, Douglas called Scorsese and told him the story, saying that she wanted to hire a lawyer and sue Moonves. Scorsese said that he remembers Douglas calling him about the allegation and being shocked by it. Scorsese urged her to be cautious about taking legal action against such a powerful person, but agreed to refer her to his law firm; there, Douglas began working with an attorney named Bill Sobel. Sobel confirmed that Douglas had described the encounter with Moonves at the time, and his contemporaneous notes back up her account. “I believed Illeana,” he told me. “What happened to her was reprehensible.” Douglas told me that Sobel warned her that it was a matter of her word against Moonves’s. Sobel, who said that he had a frank conversation with Douglas about the risks of suing, ultimately called CBS to attempt to recoup some of her lost wages. (She had received a fifty-thousand-dollar advance payment for her appearance in the “Queens” pilot, but felt that she was owed the remaining two hundred and fifty thousand.) After a junior staff member at CBS Business Affairs told Sobel that Douglas had been fired because of her poor performance in rehearsals, and that the network intended to withhold her pay, Sobel suggested that he ask Moonves about the meeting he had had alone with Douglas. “My conversation was simply ‘Hey, ask Les what happened in the room, and he’ll probably want you to do the right thing here,’ ” Sobel told me. “I felt he knew what I was saying.” According to communications and contracts reviewed by The New Yorker, the head of CBS Business Affairs, rather than the junior staffer, replied to Sobel with a new proposition. “When the head of the whole thing called me back,” Sobel said, “it was very clear to me that they took my comments about what happened in the room very seriously.” CBS proposed that the agreement be “settled out” for a hundred and twenty-five thousand dollars, and then agreed to pay Douglas an additional two hundred and fifty thousand to appear in a new miniseries. Douglas and Sobel both saw the miniseries as cover for a settlement; she didn’t even know what the show was about. “I go from being sexually assaulted, fired for not having sex with Les Moonves, fired by everyone, to ‘We are going to pay you in full and we also want you to be on this miniseries,’ ” Douglas recalled. “My understanding is, this is what they were going to do in exchange for not suing.” Shortly after the offer came, Douglas received a call from Moonves. “ ‘So, you’re gonna do the mini?’ ” she remembered him asking. Although she wanted accountability, she was still frightened, and said that she would do it. She recalled Moonves, sounding upbeat, remarking, “ ‘Tits and guns, baby. Tits and guns.’ ” (Douglas later learned that the miniseries, called “Bella Mafia,” focussed on the women of an Italian crime family and emphasized sex and violence.) Moonves asked Douglas if they were “O.K.,” and Douglas replied, “Yes, sir.” In its statement, CBS said that the agreement with Douglas about “Bella Mafia” was intended to fulfill her over-all deal with the network, and was unrelated to her meeting with Moonves. “There were no funds added for settlement purposes,” CBS said. “The amount paid was half of what she was owed, which is not what one might do if concerned about a claim such as this.” Jo An Kincaid, an executive producer on the “Queens” pilot and Penelope Ann Miller’s manager at the time, said that she was not consulted about Douglas’s dismissal. “One day she was just not there. Gone and replaced,” Kincaid said. “It was very unusual. I was an executive producer. There should have been an explanation.” In an e-mail, Judge Reinhold, one of Douglas’s co-stars, wrote, “Illeana was hilariously unique in her comedy and fun to work with.” He added, “We were all surprised and disappointed that she left.” Douglas told numerous people about the incident over the years, and even published a lightly fictionalized version of it in a 2006 compilation, “Fired!” She also performed the story before audiences. “I didn’t exactly keep it a secret,” Douglas said. “People used to come up to me afterward and go, ‘I know who it is,’ and just laugh about it.” Douglas appeared in “Bella Mafia,” and, afterward, C.A.A. resumed representing her. But she believes that the incident “derailed any future career I would have had at CBS.” In two instances, years later, personal connections helped her secure acting roles on shows that aired on the network, and a Web series of hers appeared on a CBS streaming service. But otherwise, in a career that has included extensive work with every other major network, she said, “I never auditioned or ever had any kind of television-show deal at CBS.” Like the other women I spoke to, she said that people around her discouraged her from publicly naming Moonves in this story. She told me that she was doing so because she wanted to protect other women, and that she wished she had been warned before her meeting. “In retrospect, of course, you say, ‘Oh, it’s all a crazy setup,’ ” she told me. “I was, I hate to say it, the perfect victim.”\n\nMore than a decade earlier, in the spring of 1985, Janet Jones was attempting to break into the industry as a writer. The producer Mike Marvin liked an idea that Jones had for a screenplay, and helped broker a meeting between her and Moonves, who at the time was a vice-president at Twentieth Century Fox. It was Jones’s first pitch meeting in Hollywood. Moonves’s assistant scheduled a late-afternoon appointment at his office. When Jones arrived, many employees were leaving for the day, but Moonves’s assistant was there. “I had my briefcase and my pants suit,” Jones recalled. “I was really prepared.” Moonves surprised her by asking if she wanted a glass of wine. She declined, sat down on the couch, and began pitching her screenplay. Suddenly, Jones told me, “he came around the corner of the table and threw himself on top of me. It was very fast.” Moonves, she said, began trying to kiss her. Jones said that she struggled, and then shoved Moonves away hard, yelling, “What do you think you’re doing?” Moonves, appearing startled, got up. “ ‘Well, I was hitting on you. I wanted a kiss,’ ” she recalled him saying. Jones began to leave. “He said, ‘Oh, come on, it’s nothing,’ ” she said. “ ‘Calm down, don’t be so excited.’ ” When Jones got to the door, it was locked. She was terrified. “If you don’t open this door,” she told him, “I am going to scream so loud and so long that everyone on the lot is going to come over.” She remembered Moonves walking to his desk or to a nearby bureau to unlock the door, rather than doing so directly. She fled, noticing on her way out that the assistant had left. “That’s when I got really upset,” she told me. “I just thought, Oh, my God. This wasn’t like a little momentary boo-boo. It was this well-thought-out thing.” Jones drove to the house of a friend, the artist Linda Salzman Sagan. There, Jones told me, “I just completely melted down, just crying and shaking.” Sagan told me that she remembers the visit clearly, and that Jones described the incident in detail at the time. “She was very, very upset,” Sagan recalled. “I had never seen her like that. I was really astounded by what she told me. I knew how powerful he was in terms of a career.” Jones also told her boyfriend at the time, Larry Jackson, who said, “She came home one day scared and in tears because she said Les had jumped her at a business meeting.” Mike Marvin told me that he remembers introducing Jones to Moonves, and that she was troubled by the meeting. He said that he confronted Moonves about it at a gathering, saying, “Whatever happened, that girl was upset.” Moonves, Marvin said, became furious. “We definitely had a screaming match over this,” Marvin told me. Not long afterward, Jones received a call from Moonves’s assistant, who said that she had Moonves on the line. “My heart went into my feet,” Jones recalled. Moonves began shouting at her. “ ‘People’s reputations are important. Do you understand?’ ” she remembered him saying. “ ‘I’m warning you. I will ruin your career. You will never get a writing job. No one will hire you. Do you understand what I’m saying to you?’ ” Jones hung up the phone, then threw up. “I was just absolutely mortified. Does this mean he’ll be putting me on a list somewhere and I’ll never get a job?” she recalled thinking. “This person could stop me from doing this passion, this career I had spent my whole life putting together. It’s kind of hard to fathom that one person could do that, but he could.” (CBS said that Moonves has no recollection of the interactions with Jones.) Jones told me that she found the threats more scarring than the original incident. She said, “The revenge behavior, the ‘I’ll get you for not kissing me, I’ll get you for not doing what the hell I want you to do’—it never quite leaves you.” Years later, she saw him at an industry event and, she said, “I almost fainted. I was still terrified.”\n\nTwo other women described Moonves forcibly touching or kissing them during business meetings. The producer Christine Peters was an industry veteran when she first encountered Moonves, in the early aughts. She had worked as a story analyst for the company behind “Rain Man” and “Gorillas in the Mist” before becoming a production head for Robert Evans, who had produced “The Godfather” and “Chinatown.” She became a close friend and confidante of Sumner Redstone, the owner of Viacom, to whom she was at times romantically linked in the press. (Peters, like the other women in this story, said that she had no interest in the battle over the future of Redstone’s empire.) After Viacom acquired CBS, Redstone enlisted Peters to help build a rapport with Moonves, who was the president and C.E.O. of CBS Television at the time. They had a series of dinners with Moonves and his wife in 2003 and 2004. Peters produced the 2003 romantic comedy “How to Lose a Guy in Ten Days,” which was based on a book she had acquired, and which ultimately grossed more than a hundred and seventy-seven million dollars. “I was proud to be bringing females into the seats and really addressing them,” she told me. In 2006, Moonves, who had become the chairman of CBS, had dinner with Peters and Redstone to discuss his plans to launch a film studio, CBS Films, which was founded the next year. Moonves was considering executives to oversee the endeavor, and Redstone suggested Peters. Moonves seemed excited about the idea. When Moonves and Peters met at his office to discuss the prospect, Peters told me, she came with a detailed presentation on her business model, which focussed on female audiences. “It was: this is the demographic, here are the underutilized release dates, here’s why female buyers predominate,” she said. “I remember him being very enthusiastic, saying it made a lot of sense.” She was sitting on a couch and, as she continued her pitch, he sat down uncomfortably close. “He said, ‘This is really great,’ ” she recalled. “Then he just put a hand up my skirt.” Moonves, she said, slid his hand up her thigh and touched her underwear. “I was in a state of shock,” Peters recalled. Immediately, she worried about how Moonves would react to a rejection. She tried to get out of the situation by gathering her documents and saying, “Oh, wow, oh, my God, it’s late, I have to be at another meeting. Can we finish this tomorrow? I’m so excited! So excited!” Moonves, she recalled, suggested that he walk her to her car. Fearing further advances, Peters said that she had a driver outside. She had come to the meeting with a colleague, who was waiting in the lobby. The colleague told me that Peters emerged earlier than anticipated, appearing shaken, and said that they had to leave quickly. An acquaintance of Peters’s told me that she recounted the story to him several years ago, describing an advance from a top executive and a job that she didn’t get afterward, without naming Moonves. Last year, Peters told him that the executive was Moonves. (CBS said that Moonves categorically denies any alleged touching or inappropriate conduct during the meeting.) Peters told me, “I remember sitting in the car and just crying. I worked my whole life to be here and I just lost my opportunity.” Because of her long tenure in the industry, Peters said, “I expected to be taken seriously. I never in a million years saw that coming.” She said that she was surprised in part because she thought her relationship with Redstone would have put Moonves on guard. “I couldn’t understand why he would do that in light of the situation with Sumner,” she told me. In the end, she decided not to tell Redstone, because she worried about what the fallout might be. Like Jones, Peters told me that Moonves “was smart enough to not have anyone there. It was a setup.” (Twice in later years, Peters participated in group meetings that involved Moonves.) A prominent actress who played a police officer on a long-running CBS program, who was too frightened of reprisals to use her name, said that she also attended a business meeting with Moonves that ended in unwanted advances. The actress had known Moonves for years. In the late eighties, at the height of her show’s popularity, Moonves, who was then at a production company called Lorimar, requested a lunch meeting at a restaurant. There, Moonves told the actress that he had long had a crush on her but had not said anything to her because she had been in a relationship with a mutual friend. She declined his advance but thanked him for lunch. “It wasn’t offensive,” she recalled. In 1995, when Moonves became president of CBS Entertainment, the actress called to congratulate him. “He said, ‘You should have fucked me when I asked you to,’ and I said, ‘No shit!’ ” the actress told me. They laughed. Soon afterward, CBS Business Affairs informed the actress that her series deal with CBS was being terminated. She called Moonves and expressed shock. He requested a lunch meeting in his private dining room at the office. She told me, “I went in, I thought, to make a deal.” At the lunch, Moonves told her that he intended to focus on younger talent, and that she was too old. “Then he again said, ‘I’ve always been so attracted to you,’ ” she told me. “I was so upset. I said, ‘Jesus, Leslie, I’m gonna go.’ ” Moonves asked her to sit down. She did so, pushing food around her plate until she had to leave. Then, she told me, “I walked over and leaned to give him a kiss on the cheek.” Moonves, she said, grabbed her and forcibly kissed her: “He shoved his tongue down my throat. I mean shoved.” Appalled, she pushed him away. “He had approached me to go to bed with him twice, but he did it politely,” she said. “But this time he just stuck his tongue down my throat.” As she left, she began to cry. “No one had ever done that to me before,” she said. “I found it sickening.” Like Douglas, the actress said that she never worked for CBS again. Almost two decades later, an executive at CBS contacted her about coming back to the network. It turned out that the executive wanted her to sign a book deal with Simon & Schuster, which is owned by CBS. (CBS said that Moonves has no recollection of making unwelcome advances toward the actress, and that he made no efforts to block future business between her and CBS.) The actress thought that the consequences would be too great if she told CBS about the incident. “I never reported it,” she told me. “I just thought, Gee, there goes my career.” At an event not long afterward, she encountered a showrunner who has overseen multiple programs at CBS, and told her the story. The showrunner, who had also worked with Moonves, recalled that the actress was still hurt by the incident and told me that she was “not surprised” by the story. “I had already had to deal with misogynist bullying from him myself,” she told me. “Our research has proved that the chicken came not just before the egg but before anything else in the known universe.”\n\nTwo women told me that they rebuffed unwanted advances from Moonves in professional settings, and that they believed career opportunities disappeared as a result. Dinah Kirgo, who won an Emmy as a writer for “The Tracey Ullman Show,” first encountered Moonves in the early eighties, when he was the vice-president of development at Saul Ilson Productions, a partnership with Columbia Pictures Television. She and her sister and producing partner, Julie Kirgo, met with Moonves and others about a television deal. “We left the meeting very confident we had an over-all deal with Leslie,” Kirgo told me. The sisters told their agent to expect an offer from Moonves. Instead, shortly after Kirgo got home, Moonves called her directly. “He said, ‘That was a great meeting, now we have to go out to dinner,’ ” she recalled. Kirgo replied that she and Julie would be happy to have dinner with him. “He said, ‘No, just you and me.’ He said, ‘You’re very expensive, and I need to know you’re worth it,’ ” Kirgo told me. “I was sort of in shock and I said, ‘Well, Leslie, I don’t think your wife would appreciate us having that kind of dinner.’ ” Moonves coldly ended the conversation. (CBS said that Moonves has no recollection of the meeting or the phone call.) Kirgo and her sister never heard from Moonves again. Afterward, Kirgo’s agents told her they had received reports that she had a reputation for being difficult to work with. Kirgo told me that she had never heard complaints before, and that she believed saying no to Moonves had hurt her career. “It’s very insidious, what he did,” she said. Julie Kirgo confirmed the details of her sister’s story and said that Dinah had told her about the call at the time. “It’s just kind of awful to feel that you have energy and talent and that’s being appreciated, and then suddenly to find out that that’s not where somebody’s interests lie at all. You feel betrayed,” she said. “It pisses me off to this day.” In 1992, a former child star who asked to be identified only by her first name, Kimberly, was introduced to Moonves by a friend, who was a member of Moonves’s staff and told her that Moonves could help her get back into television. At a dinner meeting that the three attended, Moonves began by asking questions about Kimberly’s acting career. But when the friend went to the bathroom Moonves turned to Kimberly and said, in a perfunctory way, “Let’s go. Let’s just get a hotel room. Let’s just do this.” She was shocked. “I said, ‘What are you talking about?’ ” When she explained that she had a husband and a child, Moonves became angry and left. (The friend recalled making the introduction to Moonves, and said that her only motivation in doing so was to help Kimberly’s career. CBS said that Moonves has no memory or record of the meeting.) “The power differential was so great,” Kimberly told me. “I was really scared, because I thought I was burning some sort of a bridge that was going to be great for me.” As a child star, she said, “I’d been taught that powerful people can hurt you, they can ruin you, they can ruin your career.” She said that the turn from business meeting to sexual overture seemed to be well practiced. “It was set up to be that way,” she said. “I thought, Wow, is this the way the world works and I just don’t get it?”\n\nCBS is a multibillion-dollar corporation, with dozens of divisions, and Moonves is only indirectly involved with many of them. However, experts on sexual harassment told me that misconduct by a chief executive can reverberate across aspects of even the largest companies. “If you have a company with an abuser on the top, they typically surround themselves with people like them, who engage in similar behavior,” Debra Katz, a lawyer specializing in sexual harassment, told me. “It can put a set of enablers in place, who protect powerful people when they get challenged for misconduct, and who work to discredit and manage out women who come forward with allegations.” Thirty current and former CBS employees described harassment, gender discrimination, or retaliation at the network. Many said that men accused of misconduct were promoted, even after the company was made aware of those allegations. Their stories match several that have already emerged in public reports. Earlier this year, Leslie Isaacs, a vice-president at Pop, the cable channel jointly operated by CBS and the film studio Lionsgate, filed a lawsuit alleging that CBS was aware of a hostile workplace at the channel. Her complaint described harassment and discrimination by male colleagues, including a vice-president who allegedly instructed female employees to “show your clients your tits.” Isaacs told me, “It wouldn’t be happening at Pop if it wasn’t covered up at CBS, and if CBS wasn’t complicit. They know, and it’s been tolerated.” (Isaacs has entered into a private mediation process with CBS. A Pop spokesperson said, “Pop engaged an independent investigator who conducted a complete investigation and found nothing to corroborate this alleged statement.” CBS said that it flatly denies any efforts to cover this up.) In December, CBS confirmed that Brad Kern, the showrunner and executive producer of “NCIS: New Orleans,” had been the subject of sexual-harassment and gender-discrimination allegations. He had retained his position for more than a year after the company was made aware of the claims. (This season, Kern stepped down from his position as showrunner, but he remains a consulting producer. Last month, the company said that it was launching a new investigation—its third—into Kern’s behavior. CBS said that the allegations were investigated and resulted in disciplinary action but that the matter “merits further inquiry.”) Other allegations have centered on CBS News. Last summer, Erin Gee, who worked at CBS for more than fifteen years, filed a lawsuit alleging that an executive director at “CBS Evening News” urged her to have sex with a co-worker with whom she was having difficulties in order to “break the ice,” and that she was demoted after complaining about gender discrimination. In May, a magistrate judge in New York criticized CBS for failing to save e-mails from the time of Gee’s allegation. “I find the conduct of CBS here to be shocking,” the judge, Sarah Netburn, reportedly said during a hearing. “It is hard to draw any other conclusion than that they were trying to avoid producing and saving those e-mails.” (The network has since reached a settlement with Gee, and her attorney declined to comment. CBS said that “the matter has been resolved.”) In 2015, a CBS reporter, Kenneth Lombardi, alleged in a lawsuit that a CBS News supervisor texted him links to pornography, and that a senior producer had grabbed his crotch. Lombardi claimed that when he complained to a manager she replied, “Never bring up gender discrimination again!” (An attorney for Lombardi said that he was not at liberty to discuss the suit. CBS said that the matter has been resolved.) In November, Charlie Rose was suspended after the Washington Post reported that eight women had accused him of sexual harassment, including groping. According to the Post, Rose has now been accused of sexual harassment by at least thirty-five women, and managers at the network were made aware of the allegations on at least three occasions. (Rose apologized in response to the initial allegations, but called the paper’s subsequent reporting on additional complaints “unfair and inaccurate.”) “60 Minutes,” the news division’s flagship program, for which Rose was a contributing correspondent, has been a focal point of allegations. Some of those allegations involve Jeff Fager, who is currently the executive producer of “60 Minutes,” and whom Moonves appointed chairman of CBS News in 2011, a position he held until 2015. Six former employees told me that Fager, while inebriated at company parties, would touch employees in ways that made them uncomfortable. One former “60 Minutes” producer told me, “It was always ‘Let’s go say hello to Jeff, ’cause you have to pay homage to him, but let’s do it early in the evening, before he starts getting really handsy.’ ” In one incident, at which several employees were present, Fager allegedly made drunken advances to an associate producer, commenting on her breasts and becoming belligerent when she rebuffed him. (Fager denied the allegations, saying that “they never happened.”) Others said that Fager protected men accused of misconduct, including men who reported to him. According to several people who were told about the incident at the time, a senior producer named Vicki Gordon alleged that another senior producer, Michael Radutzky, threatened to throw furniture at her and twisted her arm behind her back, causing her to scream. (Radutzky categorically denied the allegations, saying that they were fabricated.) The sources told me that Fager said he would address the matter with Radutzky directly, and instructed Gordon not to inform the CBS office of human resources. Later, Fager asked her to apologize to Radutzky, to mitigate conflict in the office. (Fager said, “I have never discouraged anyone from going to H.R.”) Radutzky, who left the network earlier this year, remained in his job for several years after the alleged incident. “It was common knowledge at ‘60 Minutes’ that Michael Radutzky was an out-of-control guy, especially but not exclusively toward women. We all saw it, almost on a daily basis,” David Gelber, a former producer, told me. “And yet Fager not only tolerated him—he elevated him to a position of leadership, even after Fager knew perfectly well how abusive he was.” (Radutzky strongly denied Gelber’s characterization of his behavior.) Sophie Gayter, a “60 Minutes” employee who alleged to the Post that Charlie Rose had groped her, told me that Fager “enabled the other men on the floor to do whatever the heck they wanted.” Fager, one network executive said, “would let people know he communicated with Les directly,” adding that “people took that to mean Les supported him completely.” CBS, one former associate producer said, “is an old network. Everything in there feels old: the people, the furniture, the culture, the mores.” Many of the women described the atmosphere at CBS News specifically as a “frat house.” One former employee said, “I had several producers and editors over the age of sixty who would greet me by kissing me on the mouth. I had people touch my butt a couple times.” She added, “Fager seemed to encourage that climate. It wasn’t even that he turned a blind eye toward it.” Katie Couric, who was an anchor at the network and a contributing correspondent for “60 Minutes” from 2006 to 2011, when Fager helped force her out, told me that it “felt like a boys’ club, where a number of talented women seemed to be marginalized and undervalued.” In a statement, Fager said, “It is wrong that our culture can be falsely defined by a few people with an axe to grind who are using an important movement as a weapon to get even, and not by the hundreds of women and men that have thrived, both personally and professionally, at ‘60 Minutes.’ ” He added, “A majority of our senior staff are women. All of them worked their way up the ranks and are now managers of our broadcast. Half of our producers and a majority of our associate producers are women. It is a challenging place to do well and promotions are earned on merit and are not based on gender.” Lesley Stahl, who has been a “60 Minutes” correspondent since 1991, told me, “This notion that ‘60 Minutes’ is an unpleasant, unwelcoming place for women isn’t true.” She said, “In my own experience, Jeff is supportive of women and decent to women.” Anderson Cooper, who has been a correspondent for the show since 2006, told me, “I work there part time, but in all the years I’ve been there I’ve never seen Jeff engage in any inappropriate behavior.” Gayter and another junior female employee told me that their bosses asked them to complete the company’s mandatory online sexual-harassment training programs for them. “Many assistants did it for their bosses,” Gayter said. “We’d book their travel, do their expenses, and then do their sexual-harassment training.” Former employees told me that there were few avenues for them to register confidential complaints about discrimination and misconduct. “People say, ‘You could call H.R.’ Honestly, I’ve never met a single person from H.R.,” one producer said. “There’s no oversight.” Some said that they had witnessed retaliation against those who did attempt to speak out. At CBS News, “there was no one to turn to,” one former producer told me, saying that she had reported Charlie Rose’s behavior, and that the complaint resulted in no repercussions for Rose. “If it’s just behavior from the top, tolerated at the top, and there’s no one to talk to, what do you do?” she said. A former journalist at “60 Minutes” named Habiba Nosheen told me that she had complained to management that Ira Rosen, a producer on the program, had subjected her to numerous sexual comments and suggested that she flirt with sources. Two other women told me that they had experienced similar conduct from Rosen. (In a statement, Rosen said that “CBS extensively investigated these complaints and found them to be false, misleading, and unsubstantiated.” He said, “I have always and continue to deny these allegations.”) “But seriously, folks, the way you raised me it’s no wonder I can’t get a gig in a real night club.” When Nosheen filed a written complaint and met with Fager about the allegations against Rosen, she said, he told her not to worry about the possibility that other women might be harassed by Rosen. She told me that Fager is “an enabler of this ‘Mad Men’ culture at ‘60 Minutes.’ ” Afterward, there appeared to be no repercussions for Rosen, and she was frozen out of assignments. Days after she made her complaint to Fager, he and two of his deputies called Nosheen into a meeting to go over criticisms of her work performance which she found specious. One involved a tense exchange with a co-worker that had happened a year earlier. The format of the meeting, she said, was highly unusual. “It was so obvious to me that they began to implement a strategy of retaliation,” she told me. In June, 2016, Nosheen filed a complaint with the Equal Employment Opportunity Commission. She resigned a month later. “As an investigative journalist, every day I try to hold people in power accountable. I look people in the eye and ask them why they turned their backs when they witnessed something unethical happening,” she told me. “I knew I couldn’t look myself in the mirror and hold others accountable if I wasn’t brave enough to do the same in my own place of work.” An e-mail from a CBS lawyer shows that, after Nosheen left the network, CBS threatened to enforce a non-compete clause in her contract, which would prevent her from seeking employment elsewhere, unless she withdrew her E.E.O.C. complaint and signed a nondisclosure agreement. The E.E.O.C. ultimately issued a Notice of Dismissal and Right to Sue letter, saying that it was unable to conclude whether or not a violation of federal law had occurred and that it would be up to Nosheen to pursue the matter in civil court. Another woman told me that she had spoken to CBS’s legal department about Rosen’s and Fager’s behavior. “I was shocked by the lack of seriousness and regard that CBS legal showed my story,” she told me. (In a statement, CBS’s chief compliance officer said, “It is the policy and practice of CBS to investigate all complaints and to promptly remediate any problems that are identified,” adding that “the policies against discrimination and harassment include anti-retaliation provisions, and anyone raising a complaint is assured that he or she will be protected from retaliation.”) The woman told me that she eventually left the network because of the atmosphere. “A lot of my memories of ‘60 Minutes’ are of other women coming into my office, closing the door, and just breaking down because of working as a woman at CBS,” she said. “Toward the end of my time there, I thought, God, I love the stories, I love the work, but this has to be easier somewhere else.” The producer who talked about Fager’s behavior at parties told me that she, too, left the show because of “a very toxic culture toward women.” She said, “What makes me really upset was this was something I really loved doing, and I was good at, and won a lot of awards for. And I basically had to leave the business, because where else am I going to go? There were other places, but nothing of that stature.” The New Yorker reviewed three six-figure settlements with “60 Minutes” employees who have filed complaints of sexual harassment or discrimination. The women who received those payments were required to sign nondisclosure agreements that prevented them from speaking about their experiences, with penalties for any breach. Several other women who have made allegations against CBS News declined to speak with me on the record, citing nondisclosure agreements. (The CBS chief compliance officer said, “On occasion, the resolution of allegations in the workplace has involved financial settlements,” adding that “settlements do not amount to admissions of guilt.”) “The N.D.A.s are a silencer and a bully tactic,” Mo Cashin, who worked in several roles for CBS News, including as a broadcast manager, told me. “It’s unfortunate and hypocritical, particularly in the media, where it appears executives have more interest in protecting and oftentimes rewarding fellow senior employees who have a documented history of bad behavior than protecting their victims.” Fager has tried to keep the allegations about the treatment of women at “60 Minutes” from surfacing publicly. According to the Times, in 2015 Fager took over the writing of a book about “60 Minutes” after the original author, Richard Zoglin, began asking people about the subject. In April, as two Washington Post reporters, Irin Carmon and Amy Brittain, were reporting an article about the allegations of harassment at CBS News, including complaints about Fager and Rosen, lawyers retained by Fager threatened to sue the Post, and presented testimonials about Fager’s good character. “There was this ham-handed effort to make women at the show say Jeff was a wonderful person,” one producer said. “It was so obvious we were doing it with a gun to our heads.” Fager’s lawyers also attacked the professionalism of the two reporters. In the end, the paper published a story that included complaints of harassment against Charlie Rose from dozens of women, but not allegations about Fager or Rosen. In a statement, the Post said, “The reporting throughout was vigorous and sustained and fully supported by Post editors. Nothing that met our longstanding standards for publication was left out. Nor did outside pressures, legal or otherwise, determine what was published.” CBS employees told me that they were alarmed by the attempts to kill the reporting. “The hypocrisy of an investigative news program shutting down an investigative print story is incredible,” one told me. Fager said, “There’s a reason these awful allegations have not been published before—despite the efforts of a few former employees who did not succeed at ‘60 Minutes.’ It is because they are false, anonymous, and do not hold up to editorial scrutiny.” The CBS chief compliance officer said, “CBS previously retained attorney Betsy Plevan of Proskauer Rose to conduct an independent investigation of alleged misconduct at CBS News. Ms. Plevan’s work is ongoing, and includes investigating allegations in this story. CBS has taken the allegations reported in the press seriously, and respects the role of the press in pursuing the truth, which is a role that is central to the mission of CBS News.” In June, Carmon, in a speech accepting a Mirror Award for the Post’s reporting on Charlie Rose, warned that stories of abuse by powerful men in the news industry were still being suppressed. “The stories that we have been doing are actually about a system. The system has lawyers and a good reputation. It has publicists,” she said. “Indeed, the system is sitting in this room. Some more than others. The system is still powerful men getting stories killed that I believe will someday see the light of day.” Fager was seated in the audience, and later in the ceremony accepted an award on behalf of “60 Minutes.”", "images": ["https://media.newyorker.com/cartoons/5b5b7c343e47e60bb379a34d/master/w_727,c_limit/180806_a22032.jpg", "https://media.newyorker.com/photos/5b5b36849246473a2ac794ab/4:3/w_728,c_limit/180806_r32520_rd.jpg", "https://media.newyorker.com/cartoons/5b5b7c3492497e4fd0017bb4/master/w_727,c_limit/180806_a21101_rd.jpg", "https://media.newyorker.com/photos/590979628b51cf59fc423803/4:3/w_620,c_limit/%25E2%2580%258BTalbot-FoxNewsAndTheRepercussionsOfSexualHarassment.jpg", "https://media.newyorker.com/cartoons/5b5b7c3487b14c6938366779/master/w_727,c_limit/180806_a20641.jpg", "https://media.newyorker.com/photos/5b5b36849246473a2ac794ab/16:9/w_1200,h_630,c_limit/180806_r32520_rd.jpg", "https://media.newyorker.com/photos/5a202dae8989ed395dbb8178/4:3/w_620,c_limit/DSF-Matt-Lauers-Firing-and-NBCs-Theater-of-Accountability.jpg", "https://media.newyorker.com/photos/5d28e3d5b28c9b0008243b43/4:3/w_620,c_limit/Blitzer-Safe3rdCountry-1.jpg", "https://media.newyorker.com/photos/5d1522c8075b0600087bc49a/4:3/w_620,c_limit/Bethea-CensusRulingStephanie.jpg", "https://media.newyorker.com/photos/5ad6062051fedf7258aa438c/1:1/w_130,c_limit/ronan_farrow-RD-2.png", "https://media.newyorker.com/photos/5b5b36849246473a2ac794ab/master/w_727,c_limit/180806_r32520_rd.jpg", "https://media.newyorker.com/photos/5ad6062051fedf7258aa438c/1:1/w_48,c_limit/ronan_farrow-RD-2.png", "https://media.newyorker.com/cartoons/5b5b7c3487b14c693836677a/master/w_727,c_limit/180806_a21846.jpg"], "top_img": "https://media.newyorker.com/photos/5b5b36849246473a2ac794ab/16:9/w_1200,h_630,c_limit/180806_r32520_rd.jpg", "keywords": [], "authors": ["Ronan Farrow", "Charles Bethea", "Jonathan Blitzer", "The New Yorker", "Kathryn Schulz", "Richard Brody", "Doreen St. Félix", "Margaret Talbot"], "canonical_link": "https://www.newyorker.com/magazine/2018/08/06/les-moonves-and-cbs-face-allegations-of-sexual-misconduct", "title": "Les Moonves and CBS Face Allegations of Sexual Misconduct", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=no,width=device-width,initial-scale=1,maximum-scale=1", "id": "5b58962892497e4fd001741c", "parsely-metadata": "{\"id\":\"5b58962892497e4fd001741c\",\"issueDate\":\"August 6 & 13, 2018\",\"dek\":\"Allegations of harassment against CBS and its chairman, Les Moonves, have surfaced in the wake of the #MeToo movement.\",\"section\":\"A Reporter at Large\",\"url\":\"https://www.newyorker.com/magazine/2018/08/06/les-moonves-and-cbs-face-allegations-of-sexual-misconduct\",\"image\":{\"@type\":\"ImageObject\",\"contentUrl\":\"https://www.newyorker.com/magazine/2018/08/06/les-moonves-and-cbs-face-allegations-of-sexual-misconduct\",\"url\":\"https://media.newyorker.com/photos/5b5b36849246473a2ac794ab/4:3/w_960,c_limit/180806_r32520_rd.jpg\"}}", "copyright": "Copyright (c) Condé Nast 2019", "description": "Ronan Farrow reports: Six women accuse the C.E.O. of harassment and intimidation, and dozens more describe abuse at his company.", "keywords": "cbs,sexual harassment,television,metoo", "apple-itunes-app": "app-id=1081530898", "fb": {"app_id": 1147169538698836}, "news_keywords": "Magazine, A Reporter at Large, cbs, sexual harassment, television, metoo", "og": {"locale": "en_US", "site_name": "The New Yorker", "image": "https://media.newyorker.com/photos/5b5b36849246473a2ac794ab/16:9/w_1200,h_630,c_limit/180806_r32520_rd.jpg", "title": "Les Moonves and CBS Face Allegations of Sexual Misconduct", "description": "Six women accuse the C.E.O. of harassment and intimidation, and dozens more describe abuse at his company.", "url": "https://www.newyorker.com/magazine/2018/08/06/les-moonves-and-cbs-face-allegations-of-sexual-misconduct", "type": "article"}, "twitter": {"site": "@NewYorker", "domain": "www.newyorker.com", "card": "summary_large_image", "title": "Les Moonves and CBS Face Allegations of Sexual Misconduct", "description": "Six women accuse the C.E.O. of harassment and intimidation, and dozens more describe abuse at his company.", "image": {"src": "https://media.newyorker.com/photos/5b5b36849246473a2ac794ab/16:9/w_1200,h_630,c_limit/180806_r32520_rd.jpg?mbid=social_retweet"}}, "pubdate": 20180727}, "movies": [], "publish_date": 1533528000.0, "source": "https://www.newyorker.com", "summary": ""}