{"url": "https://www.cheatsheet.com/money-career/one-surprising-reason-prince-harry-shouldnt-share-his-royal-fortune-with-meghan-markle.html/", "text": "Prince Harry has always been viewed as quite the catch. The dashing, ginger-haired royal has jetted around the globe for years to represent his family at charitable events. He’s been admired by many for his convictions to worthy causes. It was only a matter of time for the prince to meet his match in Meghan Markle, another successful socialite devoted to philanthropy.\n\nWhile each half of the couple is financially set in their own right, Prince Harry is said to be worth $40 million – which is only a fraction of his family’s worth, including palaces, jewels, and artwork. Once they have tied the knot, however, the prince is unlikely to share his royal fortune with his American bride for one surprising reason. It has to do with her nationality. Here we’ll take a look at the factors involved.\n\nMarkle will become a British citizen\n\nThe citizenship process takes 3 years.\n\nWhen the couple’s engagement was announced in December 2017, it was revealed Markle would become a British citizen. This process will likely take about three years. “She intends to become a U.K. citizen and will go through the process of that, which some of you know takes a number of years,” said Prince Harry’s communications secretary, Jason Knauf. “She will retain her U.S. citizenship through that process.”\n\nIt has not yet been revealed whether Markle will ultimately give up her American citizenship or maintain a dual nationality status.\n\nNext: The U.S. taxes its citizens living abroad.\n\nThe U.S. taxes Markle’s income\n\nSome of her $50,000-per-episode salary goes to Uncle Sam.\n\nWhile she remains a U.S. citizen, Markle’s income will continue to be taxed by Uncle Sam. Much of this income currently comes from her USA Network show Suits. It was revealed in November 2017 Markle would leave the popular legal drama at the end of Season 7. (The second half of that season is set to air in 2018.) Markle reportedly earns more than $50,000 per episode of Suits. Her estimated yearly income is $450,000, which also includes around $80,000 in endorsement money, according to knownetworth.com.\n\nNext: Prince Harry inherited millions.\n\nPrince Harry inherited half his mom’s millions\n\nThe two princes inherited $29.2 million from Princess Diana.\n\nWhen Princess Diana died in 1997, Prince Harry inherited half of her estate, which was worth about $29.2 million. He also shares a $4.7 million annual allowance with his brother and sister-in-law, Prince William and Kate Middleton. Taking that into account along with the rest of the royal family’s worth, Markle is about to marry into a fortune.\n\nNext: How the U.S. could get richer off the marriage\n\nUncle Sam would tax Markle’s royal money\n\nThe U.S. would want a piece of the royal pie.\n\nIf Markle receives any money from the royal family, she may need to pay U.S. income taxes on it. “If she receives money from her husband or his family, and that’s considered income, she would have to pay income tax on that,” royal expert Marlene Koenig told The Sun.\n\nInterestingly, if the couple were to marry and then live in the United States, Prince Harry wouldn’t be expected to file taxes in Britain. The U.S. system of taxing its citizens abroad is unusual. It originated during the Civil War to punish men who fled the country to avoid fighting in the war.\n\nNext: Well-kept secrets could be revealed.\n\nRoyal family secrets would be revealed\n\nInformation on royal finances could go public.\n\nOther than the royal pain of owing British money to the United States, Prince Harry and his family could take another hit. If Markle reports income from the royal family to the IRS, she would have to divulge details about the royal family’s estate on her tax forms. The family’s finances have long been “impenetrable” to others, according to David McClure, author of Royal Legacy: How the Royal Family Have Made, Spent and Passed on Their Wealth.\n\n“You can be sure that those at Buckingham Palace and those who run the accounts are looking very carefully at all of this to make sure that the royal family’s money does not get reported to the IRS!” royal expert Koenig said.\n\nNext: The royal family’s net worth\n\nHow much the royal family is worth\n\nRoyal family net worth: $88 billion\n\nSince the royal family has kept its money details under lock and key, it’s impossible to estimate the family’s net worth with 100% certainty. However, the most recent royal family net worth estimate was to the tune of a whopping $88 billion. Around $33 billion of that is made up from Buckingham Palace, the royal art collection, crown jewels, and the Duchies of Lancaster and Cornwall.\n\nAs accurate as that number may be, it’s still speculation, and the Royals will surely want to continue to guard their wealth secrets closely.\n\nNext: Meghan Markle’s personal net worth\n\nHow much Meghan Markle is worth\n\nMeghan Markle’s net worth: $7 million\n\nIf Prince Harry chooses to avoid the tax hassle by not sharing any royal family money with Markle for three years, she would likely get by just fine. Markle’s personal net worth is reported as $7 million by knownetworth.com. Other than her income from Suits and endorsements, she has also brought in almost $400,000 from three movies in which she appeared. She also worked as a freelance calligrapher for income during her early acting days.\n\nNext: A massive boost for the economy\n\nA $680 million royal boost\n\nThe wedding could boost the UK economy by $680 million.\n\nMarkle joining the royal family won’t mean all financial headaches. The couple’s May 19 wedding will reportedly boost the U.K. economy $680 million, according to Reuters. The report attributed $500 million of that to tourism, travel, and hotels. In addition, $67 million is predicted from the sale of commemorative items like T-shirts and hats. Commoners celebrating the royal wedding are expected to spend more than $200 million throwing parties.\n\nCheck out The Cheat Sheet on Facebook!", "images": ["https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "https://www.bizographics.com/collect/?pid=4708&fmt=gif", "https://www.cheatsheet.com/wp-content/uploads/2017/12/GettyImages-898515150.jpg", "https://www.cheatsheet.com/wp-content/uploads/2017/12/Meghan-Markle-on-TV.png?x46112", "https://www.cheatsheet.com/wp-content/uploads/2017/12/Prince-Harry-and-Meghan-Markle-engagement-photo-e1514400474670.png?x46112", "https://www.cheatsheet.com/wp-content/uploads/2017/11/GettyImages-495597362.jpg?x46112", "https://www.cheatsheet.com/wp-content/uploads/2017/11/buckingham-palace-aerial.jpg?x46112", "https://www.cheatsheet.com/wp-content/uploads/2017/08/Princess-Diana-on-VJ-Day-in-1995.jpg?x46112", "https://www.cheatsheet.com/wp-content/uploads/2015/05/uncle-sam.png?x46112", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.cheatsheet.com/wp-content/uploads/2017/12/GettyImages-898515150.jpg?x46112", "https://www.cheatsheet.com/wp-content/uploads/2017/12/Meghan-Markle-with-the-roya-family.jpg?x46112"], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2017/12/GettyImages-898515150.jpg", "keywords": [], "authors": ["Karen Bennett"], "canonical_link": "https://www.cheatsheet.com/money-career/one-surprising-reason-prince-harry-shouldnt-share-his-royal-fortune-with-meghan-markle.html/", "title": "Why Prince Harry Shouldn’t Share His Royal Fortune With Meghan Markle", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/money-career/one-surprising-reason-prince-harry-shouldnt-share-his-royal-fortune-with-meghan-markle.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "There’s one reason why Prince Harry shouldn’t share his royal fortune with his bride-to-be, American actress Meghan Markle.", "og": {"locale": "en_US", "type": "article", "title": "Why Prince Harry Shouldn’t Share His Royal Fortune With Meghan Markle", "description": "There’s one reason why Prince Harry shouldn’t share his royal fortune with his bride-to-be, American actress Meghan Markle.", "url": "https://www.cheatsheet.com/money-career/one-surprising-reason-prince-harry-shouldnt-share-his-royal-fortune-with-meghan-markle.html/", "site_name": "Showbiz Cheat Sheet", "updated_time": "2018-05-22T23:56:04+00:00", "image": {"identifier": "https://www.cheatsheet.com/wp-content/uploads/2017/12/GettyImages-898515150.jpg", "secure_url": "https://www.cheatsheet.com/wp-content/uploads/2017/12/GettyImages-898515150.jpg"}}, "article": {"publisher": "https://www.facebook.com/wallstcheatsheet", "tag": "Royal Wedding", "section": "Money & Career", "published_time": "2018-05-22T23:56:00+00:00", "modified_time": "2018-05-22T23:56:04+00:00"}, "twitter": {"card": "summary_large_image", "description": "There’s one reason why Prince Harry shouldn’t share his royal fortune with his bride-to-be, American actress Meghan Markle.", "title": "Why Prince Harry Shouldn’t Share His Royal Fortune With Meghan Markle", "site": "@cheatsheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2017/12/GettyImages-898515150.jpg", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.2.2", "position": 2}, "movies": [], "publish_date": 1527033360.0, "source": "https://www.cheatsheet.com", "summary": ""}