{"url": "https://www.self.com/story/gina-rodriguez-february-2018", "text": "When I spoke to Gina Rodriguez on a recent Wednesday night, I was still pumped from attending a press screening of her latest movie, Annihilation , earlier that day (a fact that Rodriguez met with delighted laughter, admitting that even she hadn’t seen it yet). I have very high standards for sci-fi and horror films—I expect to startle and gasp and cover my eyes—and this movie didn’t just clear my very high bar; it vaulted over it. But to be honest, even if it had failed to register on my scare-o-meter, I would have loved it for what it is at its heart: in Rodriguez’s words, “a human story and…bad bitches going into action.”\n\nIn the film, which lands in theaters nationwide on Friday, February 23, Rodriguez plays Anya Thorensen, a paramedic who has volunteered to explore The Shimmer, a mystifying, dangerous, ever-expanding territory. Those who go into The Shimmer often don’t return.\n\nVenturing into the force field alongside Anya are women toting guns, ammo, and advanced degrees in STEM: biologist Lena (Natalie Portman), physicist Josie (Tessa Thompson), geologist Cass (Tuva Novotny), and psychologist Dr. Ventress (Jennifer Jason Leigh). Together, they’re determined to do what practically no one else has: enter The Shimmer, discover what it is, and return unscathed.\n\nThe role fit Rodriguez like Anya’s well-worn fatigues. “The classic roles that are afforded to me— here, Gina, this is what you’re capable of doing —are usually roles I don’t even relate to,” she says, explaining that she identifies more with layered parts like the main character in Lady Bird than with parts inscribed by one-dimensional Latina stereotypes. Playing Anya? “It felt like butter.”\n\nShare via Pinterest Nadya Wasylko. Wardrobe Styling by Shibon Kennedy. Makeup by Carissa Ferreri with Tracey Mattingly. Hair by Paul Norton with Tracey Mattingly. On Gina: Bralette by Calvin Klein. Top by 3.1 Phillip Lim. Leggings by Opening Ceremony.\n\nMaybe that’s because the film could be a metaphor for her life for the last several years: Flanked by her own support squad, Rodriguez has marched headlong into a forbidding reality of chronic illness and come out stronger and bolder than ever. As she asserts her power in her personal life and her career, battling forces that, like The Shimmer, loom large and seemingly beyond her control, she is fighting not just for herself, but for other women in Hollywood and beyond, forging for them a path forward and up.\n\nRodriguez, 33, has Hashimoto’s disease, an autoimmune condition that wages war on the thyroid gland , which produces hormones that influence how your body uses energy. Hashimoto’s can lead to an underactive thyroid that doesn’t produce enough of these hormones, and symptoms can be devastating and wide-ranging, including fatigue , joint pain, memory issues, and weight gain , to name a few.\n\n“To the core of my being, I know what it’s like to feel like there is no way I can win this, so where do I even begin?”\n\nAt first, Rodriguez says, Hashimoto’s felt like “the curse of a lifetime,” especially in an industry that places so much emphasis on size. The disease, though treatable, has no cure. For years after being diagnosed with hypothyroidism at 19 and Hashimoto’s at 26, and putting on weight that wouldn’t budge, Rodriguez preferred to deny what she was going through rather than focus her efforts on doing whatever she could to feel better. “To the core of my being, I know what it’s like to feel like there is no way I can win this, so where do I even begin,” she reflects.\n\nShe tried to rebel against what she knew her body needed by not taking her medicine on time, eating foods that she knew would make her feel terrible (looking at you, dairy), or deciding working out wasn’t worth it if it wouldn’t change her body. Eventually, she realized something had to give: “[Hashimoto’s] affects so many aspects of your life. I’ve had it for so many years…that rebellion of not taking care of myself can’t exist anymore.”\n\nShare via Pinterest Nadya Wasylko. Wardrobe Styling by Shibon Kennedy. Makeup by Carissa Ferreri with Tracey Mattingly. Hair by Paul Norton with Tracey Mattingly. On Gina: Top by Chromat. Sweater and shorts by Fendi. Earrings by Jennifer Fisher.\n\nOver the years, she started taking her treatments seriously, changing her diet, and working out for health instead of weight loss. Though weight comes off naturally as a result of all her efforts combined, it’s also complicated by what roles she’s working on at a given time. To prepare for her intensely physical role in Annihilation , she weight trained and went vegan, so naturally, her body changed. When she spends 16-hour days on-set playing the titular character in the CW series Jane the Virgin —a role for which she’s determined not to lose weight —she’s at what she calls her “comfortable” weight, which she can maintain without an intense workout regimen and diet changes.\n\n“I’m OK in both of those,” she says. “I’m not less than because I’m 10, 15, 20 pounds more.” On the flip side, she knows it’s not inherently better—that she’s not inherently better—when she happens to weigh less, and that her handling of weight doesn’t say anything about her other than that she’s human.\n\nFive months ago, Rodriguez started working with “a great new nutritionist,” who identified a bunch of common foods that were getting in the way of her health. When she stays away from them, she says, “so many of my ailments are gone. It feels like freedom. This is new. I'm 33. It's taken me a while.\"\n\n“I can’t say I’m on point, always on it, because, man, I’m flawed.”\n\nShe qualifies: “I can’t say I’m on point, always on it, because, man, I’m flawed.” A raft of most-craved foods rolls off her tongue with ease. “I want the burger and the ice cream and the red velvet cupcakes. I want the croissant with my coffee, even though gluten doesn’t do me justice .” But it helps to remember it’s all about baby steps, about making healthy living a daily , or even hourly, decision. “When you say, just today, I’m going to choose this because I know it’s going to make me feel better, that’s not such a crazy Mount Everest.”\n\nHer boyfriend of one and a half years, Joe LoCicero, has been a cornerstone of the network of friends and family supporting her as she navigates the choppy waters of chronic illness. An actor and martial artist who practices Muay Thai (Thai boxing), LoCicero traveled to Thailand with Rodriguez in late 2016 so they could train in the sport together.\n\n“[He] has really helped me have a healthier perspective on [weight], that stupid number that can destroy us and feel like it’s equivalent to our self-worth,” she says. “This love is so easy,” she adds, describing her relationship with LoCicero as one of “respect and kindness, and generosity, and compromise, and sacrifice.”\n\nIt bothers her that another symptom of Hashimoto's—memory troubles—can make it seem like she doesn't always appreciate the little details that make their relationship so great. While she says that her forgetfulness hasn't interfered with memorizing lines, an important part of her job, \"I can't remember maybe a sweet thing my boyfriend has said to me a week ago. Or what we ate yesterday,\" she laments. \"It makes me feel shame. I don't want him to think that I'm not remembering our special moments together. And that stinks.\"\n\nRodriguez rose to fame in 2014 on Jane the Virgin (where she and LoCicero met). The show introduced enthusiastic swaths of America to the delicious drama of Latin American soap operas known as telenovelas. It has everything: murder, romance, and Jane’s accidental artificial insemination as a virgin, to boot. After its first season, the series won a People’s Choice Award and a Peabody, and Rodriguez took home a Golden Globe for best actress in a TV comedy or musical.\n\nShare via Pinterest Nadya Wasylko. Wardrobe Styling by Shibon Kennedy. Makeup by Carissa Ferreri with Tracey Mattingly. Hair by Paul Norton with Tracey Mattingly. On Gina: Coat by Bally. Leggings and Shoes by Puma. Bangle by Jennifer Fisher.\n\n“ Jane is just the greatest thing that ever happened to me,” Rodriguez says. But she is quick to point out that she works her ass off to help it—and herself—succeed.\n\n“I didn’t know my worth [at the start of my career] because the industry had such a specific perspective on what it should be as a brown woman,” Rodriguez says. “I had to start saying, ‘Well, I know if I work hard, I can show my worth,’ and I have been doing nothing but that.”\n\nRodriguez, who studied film at NYU, recently directed her first episode of the show, now in its fourth season. She also started a production company, I Can And I Will Productions, through which she is developing multiple projects with CBS Studios that portray the Latino experience. Stepping behind the camera, she realized it wasn’t some immutable force deciding what she was capable of and what she deserved. It was just other people. That knowledge primed her to advocate for herself. “Especially women, and especially women of color, really have to fight for equal pay,” she says. “My white sisters definitely have a higher starting point, my black sisters as well. Latinos really do live in the lower end of pay .”\n\n“I didn’t know my worth because the industry had such a specific perspective on what it should be as a brown woman. I had to start saying, ‘Well, I know if I work hard, I can show my worth,’ and I have been doing nothing but that.”\n\nA vocal advocate of the Me Too and Time’s Up movements, Rodriguez is harnessing her power to help fight for women not just in her industry, but in all of them. “It’s empowering and encouraging and viscerally stimulating to be a part and lend the little voice I have to this giant cause of beautiful change towards a more fair world, a more fair environment,” Rodriguez says. “It doesn’t take away from anyone or anything. It just makes everything easier and clearer and kinder and makes room for more possibility.”\n\nWhen I ask about her biggest professional goals, she doesn’t hesitate. “I’m ready to do my movie,” she says, meaning that she wants to direct a feature she’s “been mulling over for a while.” “Whether that means success or failure, I’m ready to go for it.” Other items on the list: producing more, along with creating more positions—both in front of and behind the camera—for women and Latino people, a cause she takes particularly seriously amidst today’s political tensions.\n\n“Obviously I come from a very specific lens and a very specific perspective,” she says. “I of course would love to see Latino communities uplifted and celebrated in a positive light, because our administration loves to show us in such a negative light. That’s going to be a part of my fight.”\n\nShare via Pinterest Nadya Wasylko. Wardrobe Styling by Shibon Kennedy. Makeup by Carissa Ferreri with Tracey Mattingly. Hair by Paul Norton with Tracey Mattingly. On Gina: Bralette by Calvin Klein. Top by 3.1 Phillip Lim. Jacket by Moncler. Leggings by Opening Ceremony. Shoes by Alexander Wang.\n\nWhatever she’s fighting for (or against)—whether it’s better representation in media , chronic illness, fair treatment for women in low-wage service jobs, or a terrifying evil force swallowing people and cities and mutating the world as we know it—Rodriguez is learning that you’ve gotta look out for number one, too.\n\n“I’ve just recently started getting really debilitating panic attacks and anxiety ,” she tells me. At various times, she’s pinned them on first-time-director nerves and the pressure to strike the right tone in her show, on stress and life changes, on “balancing reality with fiction, and reality with the bullshit of social media, the kind of psychological change that’s happening in our climate, period.” But she also realized she was taking too much thyroid medication, which was causing heart palpitations that spiraled into anxiety attacks. She lowered her dosage, and the attacks went away.\n\n“It is really important for us to be super self-aware,” she says. “I wasn’t banking on that. I wasn’t like, hey, yeah, let me get a disease that makes me have to be super aware. I don’t want to be super aware of myself all of the time.”\n\nAfter our call, I think about how Rodriguez describes Anya: \"She was that person, the one that pays the bills and gets shit done and fixes the car and fixes the leak.” I think about bad bitches going into action, both on and off the screen. But most of all, I think about Rodriguez’s reminder that every woman determined to make things happen—herself and Anya included—is really just a human, after all.", "images": ["https://media.self.com/photos/5bf3101f9bad4f734081d82c/4:3/h_130/woman-traveling-with-backpack-map.jpg", "https://media.self.com/photos/5b4cda7c41a5880bae10c1df/4:3/h_130/sophie-gray-selfies.png", "https://media.self.com/photos/5a85e2bee1c59b0841327607/4:3/w_728,c_limit/gina-rodriguez-alexander-wang.jpg", "https://media.self.com/photos/5a85e2bee1c59b0841327607/2:1/pass/gina-rodriguez-alexander-wang.jpg", "https://collector-PX69t0oUvr.perimeterx.net/api/v1/collector/noScript.gif?appId=PX69t0oUvr", "https://media.self.com/photos/5c38c9effbe32b1b6bdddc1b/4:3/h_130/journaling.jpg", "https://www.self.com/images/self-starter-failsafe.jpg"], "top_img": "https://media.self.com/photos/5a85e2bee1c59b0841327607/2:1/pass/gina-rodriguez-alexander-wang.jpg", "keywords": [], "authors": ["Zahra Barnes", "February"], "canonical_link": "https://www.self.com/story/gina-rodriguez-february-2018", "title": "Gina Rodriguez on Hashimoto's, Equal Pay, and Learning to Fight For Herself", "meta_data": {"generator": "autopilot-build-Sat Jul 13 2019 12:06:11 GMT+0000 (UTC)", "msapplication-tap-highlight": "no", "viewport": "user-scalable=no, width=device-width, initial-scale=1, maximum-scale=1", "author": "Zahra Barnes", "copyright": "Copyright (c) Cond&#233; Nast 2019", "description": "Actor and director Gina Rodriguez is taking on Hollywood, and dealing with Hashimoto's disease. She tells SELF about her health and her new movie, Annihilation.", "keywords": "Gina Rodriguez,hypothyroidism,mental health,panic attacks,anxiety,Hashimoto's disease", "news_keywords": "Culture,Gina Rodriguez,hypothyroidism,mental health,panic attacks,anxiety,Hashimoto's disease", "og": {"description": "The actor is taking on Hollywood, taking over her health, and taking it one day at a time.", "image": "https://media.self.com/photos/5a85e2bee1c59b0841327607/2:1/pass/gina-rodriguez-alexander-wang.jpg", "site_name": "SELF", "title": "Gina Rodriguez on Hashimoto's, Equal Pay, and Learning to Fight For Herself", "type": "article", "url": "https://www.self.com/story/gina-rodriguez-february-2018"}, "twitter": {"card": "summary_large_image", "creator": "@SELFmagazine", "description": "The actor is taking on Hollywood, taking over her health, and taking it one day at a time.", "domain": "https://www.self.com", "image": {"src": "https://media.self.com/photos/5a85e2bee1c59b0841327607/2:1/pass/gina-rodriguez-alexander-wang.jpg?mbid=social_retweet"}, "site": "SELFmagazine", "title": "Gina Rodriguez on Hashimoto's, Equal Pay, and Learning to Fight For Herself"}, "fb": {"pages": 8908243810, "admins": "1515690174,835972574,1301604672,505160,43600163"}}, "movies": [], "publish_date": null, "source": "https://www.self.com", "summary": ""}