{"url": "http://www.espn.com/espnw/sports/article/23938807/brazilian-court-rules-ryan-lochte-prosecuted-charge-filing-false-report", "text": "Brazilian court rules Ryan Lochte can be prosecuted on charge of filing false report\n\nSAO PAULO -- The prosecution of U.S. swimmer Ryan Lochte for filing a false police report during the 2016 Olympics is back on after a Brazilian court decision this week.\n\nDuring the Games in Rio de Janeiro, the 12-time Olympic medalist told NBC that he and fellow swimmers were robbed at gunpoint in a taxi by men with police badges while returning to the Olympic Village from a party. But prosecutors said Lochte invented the story to cover up the swimmers' vandalism of a gas station and an ensuing confrontation with security guards. The confrontation was captured by surveillance cameras at the gas station.\n\nLochte later acknowledged that he was intoxicated at the time of the incident and that his behavior led to the confrontation.\n\nMartin Bureau/AFP/Getty Images Prosecutors said Ryan Lochte invented a story of being robbed at gunpoint to cover up vandalism of a gas station and an ensuing confrontation with security guards.\n\nThe initial claim appeared to confirm widespread fears before the Olympics that the event would be marred by rising crime rates in Rio de Janeiro, which has long struggled with violence. As Lochte's version of events began to shift, many Brazilians became annoyed that a false story about crime drew so much attention, when the city had hosted the Games without major problems.\n\nThe scandal drew international headlines and grew to overshadow the final days of the Games. Lochte ended up serving a 10-month suspension from the U.S. national swim team for his behavior.\n\nLast year, a court dismissed the case against Lochte, but the Superior Court of Justice reversed that decision Tuesday. Prosecutor Rodrigo de Almeida Maia said Thursday that the next step is for Lochte's lawyers to present their defense. Lochte does not have to appear in person to defend himself, de Almeida Maia said.\n\nSteve Lochte, the swimmer's father, said by telephone that he had no comment and directed questions to his son or his son's lawyers.\n\nJeff Ostrow, a lawyer who has represented Lochte in the past, did not immediately respond to an email and a voicemail message seeking comment. It was not clear whether he would represent Lochte in this case.", "images": ["http://a3.espncdn.com/photo/2016/0818/r116491_800x450_16-9.jpg", "http://a2.espncdn.com/photo/2016/0818/r116491_600x400_3-2.jpg", "http://assets.pinterest.com/images/pidgets/pin_it_button.png"], "top_img": "http://a3.espncdn.com/photo/2016/0818/r116491_800x450_16-9.jpg", "keywords": [], "authors": ["Jun"], "canonical_link": "http://www.espn.com/olympics/swimming/story/_/id/23938807/brazilian-court-rules-ryan-lochte-prosecuted-charge-filing-false-report", "title": "Brazilian court rules Ryan Lochte can be prosecuted on charge of filing false report", "meta_data": {"viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=0", "description": "Brazil's Superior Court of Justice has ruled that U.S. Olympian Ryan Lochte can be prosecuted on a charge of filing a false police report.", "p": {"domain_verify": "339cdb136f8334a13faf3f2390fd430f"}, "fb": {"admins": 771834624, "app_id": 116656161708917}, "og": {"site_name": "espnW", "url": "http://www.espn.com/olympics/swimming/story/_/id/23938807/brazilian-court-rules-ryan-lochte-prosecuted-charge-filing-false-report", "title": "Brazilian court rules Ryan Lochte can be prosecuted on charge of filing false report", "description": "Brazil's Superior Court of Justice has ruled that U.S. Olympian Ryan Lochte can be prosecuted on a charge of filing a false police report.", "image": "http://a3.espncdn.com/photo/2016/0818/r116491_800x450_16-9.jpg", "type": "article"}, "twitter": {"account_id": 57333521, "site": "@espnW", "url": "http://www.espn.com/olympics/swimming/story/_/id/23938807/brazilian-court-rules-ryan-lochte-prosecuted-charge-filing-false-report", "title": "Brazilian court rules Ryan Lochte can be prosecuted on charge of filing false report", "description": "Brazil's Superior Court of Justice has ruled that U.S. Olympian Ryan Lochte can be prosecuted on a charge of filing a false police report.", "image": "http://a3.espncdn.com/photo/2016/0818/r116491_800x450_16-9.jpg", "card": "summary_large_image"}}, "movies": [], "publish_date": null, "source": "http://www.espn.com", "summary": ""}