{"url": "http://mentalfloss.com/article/64833/15-things-you-might-not-know-about-finding-nemo", "text": "Although we now recognize 2003's Finding Nemo as one of Pixar’s most critically and commercially successful films, the underwater masterpiece didn’t exactly kick off production as a guaranteed goldmine. Here are a few little-known facts about the rocky road leading up to the film’s status as a bona fide blockbuster, on the 15th anniversary of its release.\n\n1. THE FILM WAS INSPIRED BY THE DIRECTOR’S OVERPROTECTIVE NATURE.\n\n“Autobiographical” isn’t exactly the first adjective you’d expect to assign to a road comedy about marine life, but Finding Nemo co-writer/director Andrew Stanton’s story came from a very personal place. As a relatively new father during the film’s development, Stanton found himself at odds with his proclivity to veer into overprotective territory, much in the way viewers see Marlin combating his neuroses in raising his son Nemo. Stanton also had a love for all things aquatic that dated back to a childhood fascination with his dentist’s fish tank, so he used this lifelong interest as a funnel for a deeply emotional story about the challenges of being a good father.\n\n2. ANDREW STANTON WROTE A SCRIPT LONG BEFORE HE WAS “SUPPOSED TO.”\n\nPixar’s multi-tiered film production process begins with a basic premise pitch to the creative higher-ups, followed by (for all greenlit projects) a written story treatment. Stanton already had a script completed before this second step took place, the only Pixar project to proceed in this manner.\n\n3. IT TOOK ONLY ONE WORD TO GET THE GREEN LIGHT FOR FINDING NEMO.\n\n“You had me at ‘fish.’” That is precisely what Pixar’s chief creative officer told Stanton following his exhaustive pitch for his passion project.\n\n4. THE MOVIE’S ART TEAM WENT THROUGH MARINE TRAINING PRIOR TO PRODUCTION.\n\n\n\nDisney Pixar\n\nIn order to get the look and the feel of Finding Nemo’s characters and world just right, Pixar’s in-house art team was required to take courses and audit lectures in marine biology, oceanography, and ichthyology while enrolling in scuba diving classes.\n\n5. DOGS WERE USED AS MODELS FOR THE FISHY FACIAL EXPRESSIONS.\n\nWhile the Pixar team’s extensive research on the denizens of the deep yielded a wide variety of spectacular shapes and colors perfectly suited to an animated feature, the underwater populace proved consistently lacking when it came to one anatomical component. The dull eyes of the average finned critter weren’t especially conducive to building expressive characters, so Pixar had to look elsewhere for its optical models. The crew chose one of the most openly expressive members of the animal kingdom on which to model the eyes of its fish characters: dogs.\n\n6. THE ORIGINAL SCRIPT HAD A DIFFERENT TREATMENT FOR THE BARRACUDA INCIDENT.\n\nAt first, Stanton kept the inspiration for Marlin’s overprotective attitude—the loss of his wife and all but one of their unborn children in a barracuda attack—a secret to reveal gradually through intermittent flashback sequences. Ultimately, this technique made the revelation obvious and anticlimactic while making Marlin feel substantially less likable, so the script changed.\n\n7. MEGAN MULLALLY WAS FIRED AFTER PRODUCERS HEARD HER REAL VOICE.\n\nIn the early 2000s, Megan Mullally was best known for playing the rude and eccentric Karen Walker on Will & Grace. Chief among the character’s recognizable characteristics was her high-pitched voice, which Pixar producers apparently thought would be perfect for an animated fish. Upon hiring Mullally to voice an undisclosed character in the movie, the crew discovered that the actress’s natural voice was of average pitch and that Mullally was unwilling to reproduce “the Karen voice” for the film. As such, Mullally was dismissed from the Finding Nemo cast.\n\n8. GILL WAS A VILLAINOUS CHARACTER IN AN EARLIER VERSION OF THE STORY.\n\n\n\nPixar/Disney\n\nWhile the combination of somber coloration, a scowling beak, and the menacing vocals of Willem Dafoe render Nemo’s fish tank pal Gill an intimidating presence, we learn soon enough that he is in fact a good guy who has the best interests of his fellow captives at heart. The original cut of Finding Nemo was more ambiguous about Gill’s integrity, however, making him the owner of a falsified identity that he swiped from a nautical-themed children’s book housed in the dentist’s waiting room.\n\n9. ALBERT BROOKS REPLACED ANOTHER BIG STAR.\n\nAlthough Albert Brooks’s background in films like Broadcast News and Mother seems like it would have made him an obvious candidate to play the high-strung Marlin, the first actor cast in the role was William H. Macy. The Fargo star recorded his dialogue for an early screening of Finding Nemo, but producers ultimately felt that he lacked the warmth required for the role of the father fish.\n\n10. THE DIRECTOR RECORDED ALL OF ONE CHARACTER’S DIALOGUE WHILE LYING ON A COUCH.\n\nStanton never intended to commit his voice to the final cut of Finding Nemo, but only to sub in as a placeholder until the right actor could be cast to play Crush, the easygoing sea turtle with the California accent. Perhaps due to his understanding of his vocal contribution as merely temporary (or maybe, in fact, to get into the “slacker” mindset of his character), Stanton recorded all of Crush’s dialogue while lying on a couch in the office of his co-director, Lee Unkrich.\n\n11. THE CEO OF DISNEY THOUGHT FINDING NEMO WOULD BE A FAILURE.\n\nThe combination of a poorly cast Marlin, an unsympathetic Gill, and the running flashbacks made the earliest versions of Finding Nemo feel pretty dismal. Still, nobody was quite as defeatist as Michael Eisner, the Walt Disney Company's then-chief executive officer. Eisner predicted the underwater adventure would be a “reality check” for the yet unchallenged Pixar. Eisner’s only positive spin was that a commercial struggle would be helpful during contract renegotiations with the Disney subsidiary. Of course, Eisner’s judgment (and fund-cutting aspirations) came up short when Finding Nemo became Pixar’s highest grossing film—a superlative it would maintain until the release of Toy Story 3 in 2010. It has since been surpassed twice more: first by 2015's Inside Out, then in 2016 by its own sequel, Finding Dory (which maintains the top position).\n\n12. THE MOVIE’S POPULARITY LED TO POPULATION STRESS FOR CLOWNFISH.\n\n\n\nPixar/Disney\n\nChildren were so taken with the adorable Nemo following the release of the film that demand for clownfish as pets instantly skyrocketed. Excessive capture and sale of the ocean dwellers led to a steep decline in the organic population of the species; some natural habitats, such as the waters surrounding Vanuatu, saw a 75 percent drop in clownfish numbers.\n\n13. THE MOVIE ALSO LED TO SOME MISGUIDED FISH LIBERATION MOVEMENTS.\n\nOn the other hand, Finding Nemo’s anti-tank agenda did provoke a few ecologically-minded viewers to set their aquatic captives free. Unfortunately, not everyone took the necessary steps to ensure that their newly liberated pet fish were being transported to amenable waters. Certain marine communities suffered from the introduction of predatory and venomous species in unnatural locales, resulting in, once again, ecological imbalance.\n\n14. SEVERAL ORGANIZATIONS RELEASED “ANTI-FLUSHING” PUBLIC SERVICE ANNOUNCEMENTS FOLLOWING FINDING NEMO.\n\nWhile tanked fish Gill’s proclamation that “all drains lead to the ocean” contains a grain of truth, the movie fails to acknowledge the fact that a flushed fish is unlikely to survive a trip down the typical drain. Water treatment company JWC Environmental and Australia’s Marine Aquarium Council were among the companies that offered public warnings that flushing would prove fatal to any pet fish. The former organization suggested that a movie that realistically portrayed a household sea creature’s voyage through the municipal sewage system would be more accurately titled Grinding Nemo.\n\n15. A CHILDREN’S BOOK AUTHOR UNSUCCESSFULLY ACCUSED FINDING NEMO'S CREATORS OF PLAGIARISM.\n\n\n\nPixar/Disney\n\nA year before the release of Finding Nemo, French author Franck Le Calvez self-published the children’s book Pierrot Le Poisson-Clown, featuring a young clownfish on a quest to reunite with his estranged mother. (In fact, Le Calvez first wrote the story as a screenplay in 1995, but was unable to generate interest in the concept.) After Pixar’s admittedly similar tale hit theaters, Le Calvez sued the studio for copyright infringement, but lost two lawsuits and was ordered to pay $80,000 in damages and court costs.", "images": ["http://b.scorecardresearch.com/p?c1=2&c2=9929026&cv=2.0&cj=1", "https://images2.minutemediacdn.com/image/upload/c_crop,h_1347,w_2400,x_0,y_81/f_auto,q_auto,w_1100/v1562809477/shape/mentalfloss/587566-richardmunckton_wikimediacommons.jpg", "https://images2.minutemediacdn.com/image/upload/c_crop,h_3840,w_5709,x_51,y_0/f_auto,h_229,q_auto,w_344/v1562014281/shape/mentalfloss/586963-gettyimages-1030358908.jpg", "http://images2.minutemediacdn.com/image/upload/c_fit,f_auto,fl_lossy,q_auto,w_728/v1555466136/shape/mentalfloss/64833-pixar4.jpg?itok=Su8DikOx", "http://pontus.mentalfloss.com/sites/default/files/styles/width-constrained-728/public/20190617-showhomes-infographic-v1-05.png?itok=B6JJxbO6", "http://pontus.mentalfloss.com/sites/default/files/styles/width-constrained-728/public/20190617-showhomes-infographic-v1-02.png?itok=bQcha87Z", "http://pontus.mentalfloss.com/sites/default/files/styles/width-constrained-728/public/20190617-showhomes-infographic-v1-03.png?itok=-Ezl4zaO", "https://images2.minutemediacdn.com/image/upload/c_crop,h_1136,w_2020,x_0,y_0/f_auto,q_auto,w_1100/v1554924679/shape/mentalfloss/64833-pixar.jpg", "https://images2.minutemediacdn.com/image/upload/f_auto,fl_lossy,q_auto,w_1280/f_auto,h_487,q_auto,w_730/v1562865083/shape/mentalfloss/gettyimages-603906484.jpg", "http://pontus.mentalfloss.com/sites/default/files/styles/width-constrained-728/public/20190617-showhomes-infographic-v1-04.png?itok=UtdM0ZpS", "http://mentalfloss.com/bundles/mfsite/images/global/mf_logo_navbar_short.png", "http://images2.minutemediacdn.com/image/upload/c_fit,f_auto,fl_lossy,q_auto,w_728/v1555466136/shape/mentalfloss/64833-pixar2.jpg?itok=IBj9wD9S", "http://mentalfloss.com/bundles/mfsite/images/global/close_white.png", "http://mentalfloss.com/bundles/mfsite/images/global/mf_logo_navbar_long.png", "http://images2.minutemediacdn.com/image/upload/c_fit,f_auto,fl_lossy,q_auto,w_728/v1555466136/shape/mentalfloss/64833-pixar3.jpg?itok=CJ4CkeES", "https://images2.minutemediacdn.com/image/upload/c_crop,h_1136,w_2020,x_0,y_0/v1554924679/shape/mentalfloss/64833-pixar.jpg?itok=_kgLK5To", "https://images2.minutemediacdn.com/image/upload/c_crop,h_5304,w_7884,x_34,y_0/f_auto,h_229,q_auto,w_344/v1562603539/shape/mentalfloss/587292-gettyimages-905989512.jpg", "http://pontus.mentalfloss.com/sites/default/files/styles/width-constrained-728/public/20190617-showhomes-infographic-v1-01.png?itok=MyDhWVdc", "https://q.quora.com/_/ad/b9001c946b60404494c9b1d04243f62d/pixel?tag=ViewContent&noscript=1", "http://images2.minutemediacdn.com/image/upload/c_fit,f_auto,fl_lossy,q_auto,w_728/v1555466136/shape/mentalfloss/64833-pixar1.jpg?itok=tx__6F2o", "https://images2.minutemediacdn.com/image/upload/c_crop,h_719,w_1280,x_0,y_0/f_auto,q_auto,w_1100/v1562780114/shape/mentalfloss/maxresdefault_22.jpg", "http://pontus.mentalfloss.com/sites/default/files/styles/width-constrained-728/public/20190617-showhomes-infographic-v1-06.png?itok=DjSokZJF"], "top_img": "https://images2.minutemediacdn.com/image/upload/c_crop,h_1136,w_2020,x_0,y_0/v1554924679/shape/mentalfloss/64833-pixar.jpg?itok=_kgLK5To", "keywords": [], "authors": [], "canonical_link": "http://mentalfloss.com/article/64833/15-things-you-might-not-know-about-finding-nemo", "title": "15 Things You Might Not Know About Finding Nemo", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "animation, disney, entertainment, lists, movies, news, pop culture", "description": "Pixar’s beloved underwater masterpiece was released 15 years ago.", "ir-site-verification-token": "-2106322133", "og": {"url": "http://mentalfloss.com/article/64833/15-things-you-might-not-know-about-finding-nemo", "type": "article", "title": "15 Things You Might Not Know About <em>Finding Nemo</em>", "description": "Pixar’s beloved underwater masterpiece was released 15 years ago.", "image": "https://images2.minutemediacdn.com/image/upload/c_crop,h_1136,w_2020,x_0,y_0/v1554924679/shape/mentalfloss/64833-pixar.jpg?itok=_kgLK5To"}, "article": {"published_time": "2018-05-30T08:00:00-04:00", "section": "entertainment"}, "twitter": {"card": "summary_large_image", "site": "@mental_floss", "title": "15 Things You Might Not Know About Finding Nemo", "image": {"identifier": "https://images2.minutemediacdn.com/image/upload/c_crop,h_1136,w_1687,x_129,y_0/v1554924679/shape/mentalfloss/64833-pixar.jpg?itok=TRmq53Z0", "height": 120, "width": 120}, "description": "Pixar’s beloved underwater masterpiece was released 15 years ago."}}, "movies": [], "publish_date": 1527681600.0, "source": "http://mentalfloss.com", "summary": ""}