{"url": "https://www.independent.co.uk/news/uk/home-news/prince-harry-meghan-markle-wedding-royal-family-paid-st-georges-chapel-windsor-castle-a8080381.html", "text": "The royal family will pay for Prince Harry and Meghan Markle's wedding, Kensington Palace has announced.\n\nThe newly engaged couple are to marry in May at St George's Chapel in Windsor Castle.\n\nMs Markle, who will become a senior HRH on marrying into the royals, also intends to become a British citizen.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nAs the couple make preparations for their big day, the American actress, a protestant who went to a catholic high school, will be both baptised and confirmed, ready for the religious ceremony.\n\nThe royal family will pay for the church service, the music, the flowers and the reception, the palace said.\n\nIt was also announced the couple would carry out their first official engagement together at an Aids charity in Nottingham this coming Friday.\n\nMarkle, who rose to fame for playing Rachel Zane on popular US legal drama Suits, will become joint Patron of the Royal Foundation alongside Prince Harry and the Duke and Duchess of Cambridge.\n\nThe humanitarian and gender equality campaigner will be forced to relinquish her current charity commitments and embark on a new string of charitable endeavours as part of her new life in Britain.\n\nSt George's Chapel is a smaller venue for the wedding than Westminster Abbey where the Duke and Duchess of Cambridge tied the knot or St Paul's Cathedral where Prince Harry's parents wed.\n\nThe chapel, which is the burial place of ten monarchs including Henry VIII and Charles I, dates back more than 500 years. It has been a traditional venue for royal weddings since the future King Edward VII married Princess Alexandra of Denmark in 1863.\n\nShape Created with Sketch. Prince Harry and Meghan Markle – in pictures Show all 20 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Prince Harry and Meghan Markle – in pictures 1/20 Prince Harry and Meghan Markle announce their engagement. Getty Images 2/20 Meghan Markle and Prince Harry at the Crown Liquor Saloon, Belfast during their visit to Northern Ireland. Rex Features 3/20 Prince Harry and Meghan Markle pose for their engagement shoot. Alexi Lubomirski 4/20 Meghan Markle and Prince Harry attend Christmas Day Church service at Church of St Mary Magdalene on December 25, 2017 in King's Lynn. Chris Jackson/Getty Images 5/20 Prince Harry and Meghan Markle attend a wheelchair tennis event at the Invictus Games in Toronto. AP 6/20 Another picture from Prince Harry and Meghan Markle's engagement shoot. Alexi Lubomirski 7/20 Prince Harry and his fiancée Meghan Markle watch a dance performance by Jukebox Collective during a visit at Cardiff Castle for a day showcasing the rich culture and heritage of Wales. AFP/Getty Images 8/20 Meghan Markle shows off her engagement ring with Prince Harry. Getty Images 9/20 Prince Harry and Meghan Markle pose during a visit to Reprezent 107.3FM in Pop Brixton in London. The Reprezent training programme was established in Peckham in 2008, in response to the alarming rise in knife crime, to help young people develop and socialise through radio. Getty Images 10/20 Prince Harry and Meghan Markle listen to a broadcast through headphones at Reprezent 107.3FM in Pop Brixton. Getty 11/20 Prince Harry and Meghan Markle meet members of the public following a visit to youth-orientated radio station, Reprezent FM, in Brixton, south London PA 12/20 Prince Harry kisses Meghan Markle at the Invictus Games in Toronto. AP 13/20 AFP/Getty Images 14/20 Picture: Prince Harry and Meghan Markle look at some prosthetic limbs made by the Titanic FX company during a visit to Catalyst Inc science park in Belfast where they met some of Northern Ireland's brightest young entrepreneurs. Niall Carson/PA Wire/PA Images 15/20 Prince Harry and Meghan Markle pose at The Sunken Gardens. Getty Images 16/20 Prince Harry and Meghan Markle speak to an athlete after a Wheelchair Tennis match at the 2017 Invictus Games PA Wire/PA Images 17/20 Getty Images 18/20 Prince Harry and Meghan Markle watch a wheelchair tennis event at the Invictus Games AP 19/20 Prince Harry and Meghan Markle joke around Getty Images for the Invictus Ga 20/20 Prince Harry and Meghan Markle PA Wire/PA Images 1/20 Prince Harry and Meghan Markle announce their engagement. Getty Images 2/20 Meghan Markle and Prince Harry at the Crown Liquor Saloon, Belfast during their visit to Northern Ireland. Rex Features 3/20 Prince Harry and Meghan Markle pose for their engagement shoot. Alexi Lubomirski 4/20 Meghan Markle and Prince Harry attend Christmas Day Church service at Church of St Mary Magdalene on December 25, 2017 in King's Lynn. Chris Jackson/Getty Images 5/20 Prince Harry and Meghan Markle attend a wheelchair tennis event at the Invictus Games in Toronto. AP 6/20 Another picture from Prince Harry and Meghan Markle's engagement shoot. Alexi Lubomirski 7/20 Prince Harry and his fiancée Meghan Markle watch a dance performance by Jukebox Collective during a visit at Cardiff Castle for a day showcasing the rich culture and heritage of Wales. AFP/Getty Images 8/20 Meghan Markle shows off her engagement ring with Prince Harry. Getty Images 9/20 Prince Harry and Meghan Markle pose during a visit to Reprezent 107.3FM in Pop Brixton in London. The Reprezent training programme was established in Peckham in 2008, in response to the alarming rise in knife crime, to help young people develop and socialise through radio. Getty Images 10/20 Prince Harry and Meghan Markle listen to a broadcast through headphones at Reprezent 107.3FM in Pop Brixton. Getty 11/20 Prince Harry and Meghan Markle meet members of the public following a visit to youth-orientated radio station, Reprezent FM, in Brixton, south London PA 12/20 Prince Harry kisses Meghan Markle at the Invictus Games in Toronto. AP 13/20 AFP/Getty Images 14/20 Picture: Prince Harry and Meghan Markle look at some prosthetic limbs made by the Titanic FX company during a visit to Catalyst Inc science park in Belfast where they met some of Northern Ireland's brightest young entrepreneurs. Niall Carson/PA Wire/PA Images 15/20 Prince Harry and Meghan Markle pose at The Sunken Gardens. Getty Images 16/20 Prince Harry and Meghan Markle speak to an athlete after a Wheelchair Tennis match at the 2017 Invictus Games PA Wire/PA Images 17/20 Getty Images 18/20 Prince Harry and Meghan Markle watch a wheelchair tennis event at the Invictus Games AP 19/20 Prince Harry and Meghan Markle joke around Getty Images for the Invictus Ga 20/20 Prince Harry and Meghan Markle PA Wire/PA Images\n\nThe 33-year-old, who is fifth in line to the throne, and Markle have been dating for about a year and a half. The pair, who met through a mutual friend, announced their engagement on Monday.\n\nA statement from Clarence House said: “His Royal Highness and Ms Markle became engaged in London earlier this month. Prince Harry has informed Her Majesty The Queen and other close members of his family. Prince Harry has also sought and received the blessing of Ms Markle's parents\".\n\nDuring a TV appearance on Monday night, Prince Harry revealed he proposed to Markle in the kitchen over a roast kitchen while they enjoyed a \"standard, typical night\" in their cottage.\n\n“It was so sweet and natural and very romantic,” Markle told BBC.\n\nShe added: “As a matter of fact, I could barely let you finish proposing. I said, ‘Can I say yes now’?”\n\nAfter their relationship became public just over a year ago, Prince Harry lashed out at the paparazzi for subjecting Markle to a “wave of abuse and harassment”.\n\nIn an unusual public statement, the Palace attacked the “racial undertones” of media coverage of Markle and said the prince feared for her safety. The actor, whose father is white and mother is African American, has described herself as biracial and “half black and half white” on her website.\n\n“My dad is Caucasian and my mom is African-American. To say who I am, to share where I’m from, to voice my pride in being a strong, confident mixed-race woman,\" Markle has previously said.", "images": ["https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/11/28/11/harry-meghan-engagement-1.jpg", "https://trc.taboola.com/1036135/log/3/unip?en=page_view"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/11/28/11/harry-meghan-engagement-1.jpg", "keywords": [], "authors": ["Samuel Osborne", "Maya Oppenheim"], "canonical_link": "https://www.independent.co.uk/news/uk/home-news/prince-harry-meghan-markle-wedding-royal-family-paid-st-georges-chapel-windsor-castle-a8080381.html", "title": "Prince Harry and Meghan Markle's wedding will be paid for by royal family", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#db3739", "og": {"url": "http://www.independent.co.uk/news/uk/home-news/prince-harry-meghan-markle-wedding-royal-family-paid-st-georges-chapel-windsor-castle-a8080381.html", "title": "The royal family will pay for Prince Harry and Meghan's wedding", "description": "They newly engaged couple are will marry in May at St George's Chapel in Windsor Castle", "updated_time": "2017-11-28T16:32:13+00:00", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/11/28/11/harry-meghan-engagement-1.jpg", "site_name": "The Independent", "type": "article", "locale": "en_GB"}, "ia": {"markup_url": "https://www.independent.co.uk/pwamp/fbi/8080381"}, "description": "The royal family will pay for Prince Harry and Meghan Markle's wedding, Kensington Palace has announced. The newly engaged couple are to marry in May at St George's Chapel in Windsor Castle.  Ms Markle, who will become a senior HRH on marrying into the royals, also intends to become a British citizen.", "keywords": "Prince Harry, Meghan Markle, Royal Wedding, Home News, UK, News", "fb": {"pages": 13312631635, "admins": 729735830, "app_id": 235586169789578}, "article": {"author": "http://www.independent.co.uk/author/maya-oppenheim", "tag": "Prince Harry", "published_time": "2017-11-28T15:34:00Z", "modified_time": "2017-11-28T16:32:13+00:00", "section": "Home News", "author_name": "Samuel Osborne, Maya Oppenheim", "content_type": "story", "word_count": 569, "image_count": 1, "video_count": 0, "embed_count": 0, "internal_link_count": 8, "external_link_count": 0}, "twitter": {"title": "The royal family will pay for Prince Harry and Meghan's wedding", "description": "The royal family will pay for Prince Harry and Meghan Markle's wedding, Kensington Palace has announced. The newly engaged couple are to marry in May at St George's Chapel in Windsor Castle.  Ms", "card": "summary_large_image", "site": "@independent"}, "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Independent"}, "movies": [], "publish_date": 1511883240.0, "source": "https://www.independent.co.uk", "summary": ""}