{"url": "https://www.newsday.com/entertainment/celebrities/longest-lasting-celebrity-marriages-1.13022641", "text": "It’s not unusual to hear that a celebrity couple is splitting up, but what about those stars who got married long ago and are still going strong?\n\nFrom Beyonce and Jay Z to Tom Hanks and Rita Wilson, learn more about the actors and musicians whose marriages are surviving the test of time.\n\nAnne and Kirk Douglas YEARS OF MARRIAGE: 62 Anne Douglas, 97, met her 100-year-old husband Kirk while he was working in Paris in 1953. Anne (then Anne Buydens) was a native European--born in Germany, raised in Belgium and at the time living in France--and was using her understanding of several languages as a career tool. She was hired to help the actor with translating, and the two started seeing each other. Mr. Douglas soon returned to the U.S., and invited her to come to visit. Fearful she would once again leave, he arranged a quick visit to a justice of the peace, and the two were married in May 1954 in Las Vegas, NV (which means 41 of the 66 people mentioned in this list weren't even born yet when Kirk and Anne said \"I do\").\n\nJoy and Regis Philbin YEARS OF MARRIAGE: 45 Joy, 75, and Regis Philbin, 85, were married at Forest Lawn Cemetery in California in March 1970.\n\nSamuel L. Jackson and LaTanya Richardson YEARS OF MARRIAGE: 37 Jackson, 68, and LaTanya Richardson, 67, met in college, and married in January 1980.\n\nRingo Starr and Barbara Bach YEARS OF MARRIAGE: 35 Starr, 76, may have made his name as a member of The Beatles, but he met Bach, 69, on the set in 1980 of the 1981 film \"Caveman,\" in which the two starred. The couple married in April 1981.\n\nAli Hewson and Bono YEARS OF MARRIAGE: 34 Ali Hewson, 55, and U2 frontman Bono (born Paul Hewson), 56, first met while attending secondary school (high school) in Dublin, Ireland and married in August 1982.\n\nMaureen and Steven Van Zandt YEARS OF MARRIAGE: 34 Maureen, 65 and Steven \"Little Steven\" Van Zandt, 66, were married in Asbury Park, NJ in December 1982. Little Steven's longtime bandmate Bruce Springsteen was the best man, Reverend Richard Penniman--better known as Rock & Roll Hall of Fame member Little Richard--was the preacher that married the couple, and fellow Rock and Roll Hall of Fame inductee Percy Sledge sang his signature song \"When a Man Loves a Woman\" at the wedding reception.\n\nKeith Richards and Patti Hansen YEARS OF MARRIAGE: 33 Rolling Stones guitarist Richards, 73, first met model/ actress Hansen, 60, at the legendary Studio 54 nightclub in 1979 while she was celebrating her twenty-third birthday, but didn't get involved until meeting again on Richards' thirty-sixth birthday in December that same year. The couple eventually married on December 18, 1983 (which also happened to be Richards' fortieth birthday) in Cabo San Lucas, Mexico.\n\nTracy Pollan and Michael J. Fox YEARS OF MARRIAGE: 28 Pollan, 56, and Fox, 55, first met in 1985 while working together on the NBC networks sitcom \"Family Ties,\" but didn't begin dating until sharing a second gig in 1987 (the 1988 film \"Bright Lights, Big City\"). The two were married in Arlington, Vermont in July 1988.\n\nTom Hanks and Rita Wilson YEARS OF MARRIAGE: 28 Hanks and Wilson, both 60, first met on the set of Hanks' ABC networks sitcom \"Bosom Buddies\" but didn't really hit it off until they worked together again on the 1985 film \"Volunteers.\" The pair married in April 1988.\n\nKyra Sedgwick and Kevin Bacon YEARS OF MARRIAGE: 28 Sedgwick, 51, actually first met Bacon, 58, when she was 12--she approached the then 19-year-old Bacon to compliment him on his performance in a play--but the two didn't start dating until meeting again while working on the 1998 film \"Lemon Sky,\" at which point the two were both in their twenties. The two were married in September 1988.\n\nJon Bon Jovi and Dorothea Hurley YEARS OF MARRIAGE: 27 Bon Jovi, 54, may be a rock star with a heartthrob image, but the man has long been off the market as he married Hurley (also 54)--his high school sweetheart--in Las Vegas in April 1989, in a ceremony led by an Elvis impersonator.\n\nRobin Dearden and Bryan Cranston YEARS OF MARRIAGE: 27 Actors Dearden, 63, and Cranston, 60, first met while working together on the CBS network series \"Airwolf\" in 1986, but didn't start dating until a year later. The two married in July 1989.\n\nBruce Springsteen and Patti Scialfa YEARS OF MARRIAGE: 25 Scialfa, 63, was (and still is) a member of the 67-year-old Springsteen's E-Street Band, and their relationship first became public knowledge during the 1988 \"Tunnel of Love Express\" tour. The rockers tied the knot in the garden of their shared Beverly Hills mansion in June 1991.\n\nJohn Travolta and Kelly Preston YEARS OF MARRIAGE: 25 Actors Travolta, 62, and Preston, 54, met while shooting the 1989 film \"The Experts,\" started dating in 1990 and married in Paris in September 1991 (and had a second ceremony a week later in Daytona Beach, FL).\n\nKate Capshaw and Steven Spielberg YEARS OF MARRIAGE: 25 Capshaw, 63, and Steven Spielberg, 70, met while the two were working on the 1984 film \"Indiana Jones and the Temple of Doom\" (she was a co-star, he was the director). The two married in October 1991.\n\nAnnette Bening and Warren Beatty YEARS OF MARRIAGE: 24 Bening, 58, and Beatty, 79, met on the set of their 1991 film \"Bugsy,\" and started dating immediately after it wrapped, and married in March 1992 in a secret ceremony, so private it wasn't announced publicly for almost two weeks.\n\nSting and Trudie Styler YEARS OF MARRIAGE: 24 65-year-old Gordon Sumner (AKA Sting) and Trudie Styler, 63, first met as neighbors, and got romantically involved in 1981. The two got married in August 1992, in an lavish affair that took place at their mansion in Wiltshire, England that included her arriving on horseback and an unscheduled reunion of Sting's former group The Police.\n\nTed Danson and Mary Steenburgen YEARS OF MARRIAGE: 21 Actors Danson, 69, and Steenburgen, 63, met while working together on the 1993 film \"Pontiac Moon.\" The couple married in October 1995.\n\nHugh Jackman and Deborra-Lee Furness YEARS OF MARRIAGE: 20 Jackman, 48, met Furness, 61, years before he took on his role as Wolverine in the \"X-Men\" movie franchise, when he was just an up-and-coming actor and got a role on the 1995 Australian television drama \"Corelli,\" a program in which Furness was the star. They got married about a year later, in April 1996.\n\nKelly Ripa and Mark Consuelos YEARS OF MARRIAGE: 20 Ripa, 46, and Consuelos, 45, met while working together on the ABC networks soap opera \"All My Children,\" playing characters that fell in love and married. However, the actors fell in love in the real world, and eloped in Las Vegas in May 1996.\n\nFaith Hill and Tim McGraw YEARS OF MARRIAGE: 20 McGraw, 49, proposed to Hill, also 49, in June 1996 at a festival in Colorado. The two were both performers at the event, and Hill had already done her set when McGraw asked for her hand in marriage before he went on--and she didn't give him an answer. However, once he finished his set, he returned to his dressing room to find a \"Yes\" response written on the mirror with a Sharpie. The two married in October 1996.\n\nMatthew Broderick and Sarah Jessica Parker YEARS OF MARRIAGE: 19 Matthew Broderick, 54, and Sarah Jessica Parker, 51, were introduced by Parker's brother while all were at a movie in November 1991. The pair started dating in February 1992 and were married in May 1997.\n\nFelicity Huffman and William H. Macy YEARS OF MARRIAGE: 19 Felicity Huffman, 54, and William H. Macy, 66, met at New York's off-Broadway Atlantic Theater Company and dated for 15 years before finally marrying in September 1997.\n\nCourtney B. Vance and Angela Bassett YEARS OF MARRIAGE: 19 Actors Vance, 56, and Bassett, 58, first met in college, at the Yale School of Drama in 1980. The two started off as friends but a deeper relationship blossomed several years later in 1996, and the couple got married in October 1997.\n\nWill Smith and Jada Pinkett Smith YEARS OF MARRIAGE: 19 Smith, 48, and Pinkett-Smith, 45, met in 1995 when she (then simply Jada Pinkett) auditioned for Smith's NBC networks sitcom \"The Fresh Prince of Bel-Air;\" the open role was to play the girlfriend of Smith's character. She didn't get the job, but the two hit it off in real life and after dating for some time married on New Years' Eve 1997, at the Cloisters Castle in Maryland.\n\nChristine Taylor and Ben Stiller YEARS OF MARRIAGE: 18 Christine Taylor, 45, and Ben Stiller, 51, met while shooting an unsuccessful pilot for a show called \"Heat Vision and Jack,\" but did find romantic success and married on the Hawaiian island of Kaua in September 1998.\n\nDavid and Victoria Beckham YEARS OF MARRIAGE: 17 Today they are Victoria Beckham, 42, and David Beckham, 41--but back in 1997, she was better known as Posh Spice of the Spice Girls. Victoria (then Victoria Adams) was in the Manchester United players' lounge following a soccer match when David--then only a second-string player (today he's a member of the English Football Hall of Fame)--asked her for her phone number. The two started dating and eventually married in an Irish castle in July 1999, an affair at which Sir Elton John gave a private performance.\n\nJerry and Jessica Seinfeld YEARS OF MARRIAGE: 17 Jessica Seinfeld, 45, first met her 62-year-old comedian husband at a Manhattan fitness club in August 1998, and were married on Christmas Day (Dec. 25) in 1999.\n\nBeyonce and Jay Z YEARS OF MARRIAGE: 8 Beyonce Knowles, 35, and Shawn \"Jay Z\" Carter, 47, have managed to keep a great deal about their relationship private, but it's believed they met around 1999-2000 and possibly started dating in 2001. However, their marriage was made public after the musicians privately wed in April 2008.\n\nEllen DeGeneres and Portia de Rossi YEARS OF MARRIAGE: 8 Ellen DeGeneres, 58 and Portia de Rossi, 43, first met backstage at a VH1 awards program, and shortly following the May 2008 overturn of the same-sex marriage ban in California, the two married at their Beverly Hills home (in Aug. 2008).\n\nPeter Sarsgaard and Maggie Gyllenhaal YEARS OF MARRIAGE: 7 Sarsgaard, 45, and Gyllenhaal, 39 were quietly married at a chapel in Italy in 2009.\n\nSacha Baron Cohen and Isla Fisher YEARS OF MARRIAGE: 6 Sacha Baron Cohen, 45, and Isla Fisher, 40, met in 2002 at a party in Sydney, Australia. After a lengthy engagement, the couple exchanged wedding vows in at a private and small ceremony (only six guests attended) in Paris in March 2010.", "images": ["https://cdn.newsday.com/polopoly_fs/1.33747429.1562984026!/httpImage/image.jpg_gen/derivatives/preview_115/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.13017703.1485489768!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.13023722.1485527238!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.13017540.1485528992!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.13017587.1485481089!/httpImage/image.JPG_gen/derivatives/display_960/image.JPG", "https://cdn.newsday.com/polopoly_fs/1.13017607.1485525423!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.13017554.1485530324!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.13017594.1485494195!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.13017531.1485586476!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.13017728.1485587025!/httpImage/image.JPG_gen/derivatives/display_960/image.JPG", "https://cdn.newsday.com/polopoly_fs/1.13017560.1485549902!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.13017677.1485448128!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.33757595.1562955747!/httpImage/image.jpg_gen/derivatives/landscape_384/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.13017711.1485555198!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.13015783.1485558478!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.33724561.1562881912!/httpImage/image.jpg_gen/derivatives/landscape_384/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.13017681.1485447510!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.13017665.1485478321!/httpImage/image.JPG_gen/derivatives/display_960/image.JPG", "https://cdn.newsday.com/polopoly_fs/1.13017791.1485487391!/httpImage/image.JPG_gen/derivatives/display_960/image.JPG", "https://cdn.newsday.com/polopoly_fs/1.13017568.1485481746!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://www.newsday.com/img/newsday/newsdayLogo.svg", "https://cdn.newsday.com/polopoly_fs/1.33719284.1562865057!/httpImage/image.jpg_gen/derivatives/landscape_384/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.13024147.1485531633!/httpImage/image.jpg_gen/derivatives/landscape_1280/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.13017656.1485586915!/httpImage/image.JPG_gen/derivatives/display_960/image.JPG", "https://cdn.newsday.com/polopoly_fs/1.13015809.1485586696!/httpImage/image._gen/derivatives/display_960/image.", "https://cdn.newsday.com/polopoly_fs/1.33722524.1562966118!/httpImage/image.jpg_gen/derivatives/landscape_384/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.13017693.1485447160!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.13017671.1485448607!/httpImage/image.JPG_gen/derivatives/display_960/image.JPG", "https://cdn.newsday.com/polopoly_fs/1.13017731.1485585971!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.33786471.1563022255!/httpImage/image.jpg_gen/derivatives/preview_115/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.13017627.1485585427!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://www.newsday.com/img/loaders/landscape.png", "https://cdn.newsday.com/polopoly_fs/1.13017537.1485586400!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.13017652.1486396860!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.13015788.1485557550!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.33750172.1562935338!/httpImage/image.jpg_gen/derivatives/landscape_384/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.33739683.1562933427!/httpImage/image.jpg_gen/derivatives/preview_115/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.13017622.1485493361!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.13017578.1485556531!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.13017716.1485446578!/httpImage/image.JPG_gen/derivatives/display_960/image.JPG", "https://cdn.newsday.com/polopoly_fs/1.13017644.1485586324!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.13017557.1485586073!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.33721635.1562974324!/httpImage/image.jpg_gen/derivatives/landscape_384/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.13017617.1485586101!/httpImage/image.JPG_gen/derivatives/display_960/image.JPG", "https://cdn.newsday.com/polopoly_fs/1.13017633.1485446737!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg"], "top_img": "https://cdn.newsday.com/polopoly_fs/1.13024147.1485531633!/httpImage/image.jpg_gen/derivatives/landscape_1280/image.jpg", "keywords": [], "authors": ["Ian J. Stark"], "canonical_link": "https://www.newsday.com/entertainment/celebrities/longest-lasting-celebrity-marriages-1.13022641", "title": "Longest-lasting celebrity marriages", "meta_data": {"viewport": "width=100%,initial-scale=1.0,maximum-scale=2.0", "description": "It’s not unusual to hear that a celebrity couple is splitting up, but what about those stars who got married and are going strong?", "msvalidate.01": "AC41EB10D1EC6B5358F0ECA0E861CCAA", "google-site-verification": "WS-IPs_DqbPtrQ9XhKPi_32a-1spE4tjsjhWUqwVVns", "application-name": "Newsday", "msapplication-TileColor": "#1B3664", "msapplication-TileImage": "/img/newsday/nd-win8-icon.png", "p": {"domain_verify": "b22f651177478af415d53d6eb00b8167"}, "fb": {"pages": 19175874448, "app_id": 147686468041}, "ia": {"markup_url": "http://www.newsday.com/facebook/entertainment/celebrities/longest-lasting-celebrity-marriages-1.13022641"}, "article": {"content_tier": "metered"}, "news_keywords": "entertainment,valentine's day,celebrities,holiday,things to do,celebrity weddings,sarah jessica parker matthew broderick kevin bacon tom hanks bruce", "og": {"title": "33 longest-lasting celeb marriages", "url": "https://www.newsday.com/entertainment/celebrities/longest-lasting-celebrity-marriages-1.13022641", "image": "https://cdn.newsday.com/polopoly_fs/1.13024147.1485531633!/httpImage/image.jpg_gen/derivatives/landscape_1280/image.jpg", "site_name": "Newsday", "description": "It’s not unusual to hear that a celebrity couple is splitting up, but what about those stars who got married and are going strong?", "type": "article"}, "twitter": {"card": "summary_large_image", "site": "@Newsday", "title": "33 longest-lasting celeb marriages", "description": "It’s not unusual to hear that a celebrity couple is splitting up, but what about those stars who got married and are going strong?", "image": "https://cdn.newsday.com/polopoly_fs/1.13024147.1485531633!/httpImage/image.jpg_gen/derivatives/landscape_1280/image.jpg", "app": {"id": {"iphone": 358571317, "ipad": 358571317, "googleplay": "com.pagesuite.newsday"}}}, "sailthru.date": "Tue, 21 Mar 2017 19:51:00 -0400", "sailthru.title": "33 longest-lasting celeb marriages", "sailthru.tags": "entertainment,valentine's day,celebrities,holiday,things to do,celebrity weddings,sarah jessica parker matthew broderick kevin bacon tom hanks bruce", "sailthru.author": "Ian J. Stark", "isDesktop": "true"}, "movies": [], "publish_date": 1490143860.0, "source": "https://www.newsday.com", "summary": ""}