{"url": "https://en.wikipedia.org/wiki/The_Real_Housewives_of_Dallas_(season_2)", "text": "The second season of The Real Housewives of Dallas, an American reality television series, was broadcast on Bravo. It aired from August 14, 2017, until November 13, 2017, and was primarily filmed in Dallas, Texas. Its executive producers are Adam Karpel, Andrew, John Paparazzo, Rich Bye, Samantha Billett and Andy Cohen.\n\nThe second season focuses on the lives of Cary Deuber, Stephanie Hollman, LeeAnne Locken, Brandi Redmond, D'Andra Simmons and Kameron Westcott.\n\nCast [ edit ]\n\nThe second season premiered with D’Andra Simmons and Kameron Westcott joining the cast, and Hendra appearing in a guest capacity.[1]\n\nTaglines [ edit ]\n\nBrandi : \"I cheered for the Cowboys, so I never get played.\" [2]\n\n: \"I cheered for the Cowboys, so I never get played.\" Stephanie : \"I married into money, but family is my fortune.\"\n\n: \"I married into money, but family is my fortune.\" Cary : \"Every girl has skeletons in their closet. Mine are next to my Birkin.\"\n\n: \"Every girl has skeletons in their closet. Mine are next to my Birkin.\" D'Andra : \"I started from the Dallas dynasty, but I’ll finish with my own empire.\"\n\n: \"I started from the Dallas dynasty, but I’ll finish with my own empire.\" Kameron : \"Dumb blondes get noticed. Smart blondes get everything.\"\n\n: \"Dumb blondes get noticed. Smart blondes get everything.\" LeeAnne: \"I’m a true Texan. No bull, but all horns.\"\n\nEpisodes [ edit ]\n\nNo.\n\noverall No. in\n\nseason Title [3] Original air date U.S. viewers\n\n(millions) 12 1 \"Look Who's Not Talking\" August 14, 2017 ( ) 0.84[4] Brandi and Stephanie reveal that a summer-long feud has ended their friendship; an old police report about LeeAnne's past comes to light; everything comes to a head at Cary's birthday party for Mark, where Brandi and Stephanie come face to face. 13 2 \"Haute Dogs of Dallas\" August 21, 2017 ( ) 0.69[5] Stephanie tries to put a dent in Brandi's newfound friendship with LeeAnne; Travis drops millions on a house; D'Andra seeks to take over her mother's cosmetics business; Brandi and Stephanie meet again at the Howl-O-Ween dog costume contest. 14 3 \"Face to Two Face\" August 28, 2017 ( ) 0.80[6] Brandi and Stephanie attempt to repair their broken friendship; D'Andra tries not to be an evil stepmother to Jeremy's 20-year-old son; LeeAnne shows up at Stephanie's Halloween party dressed to kill. 15 4 \"By Invitation Only\" September 4, 2017 ( ) 0.85[7] Stephanie draws a line in the sand with Travis over expensive renovations; Brandi overhears LeeAnne gossiping about Stephanie; D'Andra demands to know when her mother will turn over the business; Brandi's invitation sparks a fight about manners. 16 5 \"Walking in Memphis\" September 11, 2017 ( ) 0.73[8] Kameron presents a business idea to her husband; Cary and Stephanie embark on Brandi's family trip; D'Andra receives unexpected news from her stepson; Brandi reaches out to her estranged grandmother. 17 6 \"Don't Cry Over Spilled Tea\" September 18, 2017 ( ) 0.85[9] LeeAnne gets a surprise at the Texas State Fair; D'Andra decides to call an Honestea at her house, where a little too much honesty threatens to send the teacakes flying. 18 7 \"Viva La Mexico\" September 25, 2017 ( ) 0.83[10] The women prepare for their getaway to Mexico; Kameron wins Court over, and he agrees to invest in her business idea; moments before LeeAnne goes under the knife for breast improvement, she threatens Cary's life and confides information about Mark. 19 8 \"A Mouthful in Mexico\" October 2, 2017 ( ) 0.80[11] In Mexico, the forecast calls for plenty of sun and tequila, until Brandi pushes Kameron overboard with an impressive novelty toy; LeeAnne shares exhilarating news about her relationship with Rich; Cary confronts LeeAnne about her dangerous threat. 20 9 \"You’ve Yacht to be Kidding\" October 9, 2017 ( ) 0.81[12] Brandi and Stephanie obtain LeeAnne and D'Andra's room key and search for the \"toy\" that Kameron loves to hate; a yacht trip sails into stormy waters as the truth comes out about vicious rumors leveled by LeeAnne and Cary at each other's husbands. 21 10 \"Don't Cry Over Shattered Glass\" October 16, 2017 ( ) 0.80[13] Brandi is infuriated when LeeAnne reveals that Cary can't be friends with her and Stephanie. 22 11 \"Ladies Who Launch\" October 23, 2017 ( ) 0.86[14] D'Andra's meeting at the cosmetics lab jeopardizes Dee's final decision to hand over the company; LeeAnne urges Brandi to make Stefanie choose her and lose Cary; Mark confronts LeeAnne; Cary challenges Brandi's assertion that she was Mark's nanny. 23 12 \"The Beginning of the End\" October 30, 2017 ( ) 0.80[15] It's LeeAnne and Rich's engagement party, and everyone is coming; D'Andra fails to complete her new product on time; as Brandi begins to see the light about LeeAnne, it sets the stage for a shocking turn of events that may destroy friendships. 24 13 \"Reunion Part 1\" November 6, 2017 ( ) 0.83[16] D'Andra dances a fine line between loyalty and accountability; Kameron's taste for raunchy humor resurfaces; Cary and Brandi lock horns over plastic surgery allegations; a mystery guest causes LeeAnne to be anything but quiet on the set. 25 14 \"Reunion Part 2\" November 13, 2017 ( ) 0.89[17] Cary and Mark address the rumors about their marriage; D'Andra and Kameron share their biggest regrets about the season; Stephanie shares her concerns regarding a future with Brandi; LeeAnne reveals who will be invited to her wedding.", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/8/82/RHODSeason2poster.jpg/250px-RHODSeason2poster.jpg", "https://upload.wikimedia.org/wikipedia/en/8/82/RHODSeason2poster.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Blank_television_set.svg/32px-Blank_television_set.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/8/82/RHODSeason2poster.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/The_Real_Housewives_of_Dallas_(season_2)", "title": "The Real Housewives of Dallas (season 2)", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.13", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/8/82/RHODSeason2poster.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}