{"url": "www.vanityfair.com/style/2014/04/sergey-brin-amanda-rosenberg-affair", "text": "A year later, Wojcicki gave birth to their first child just as Google executives started enjoying life as some of the richest people in the world. Schmidt was a pilot, and, according to the friend, he encouraged other Google executives to indulge their desires for yachts and planes. Brin, Page, and Schmidt purchased at least a half-dozen planes, including a 767 and a 757; they basically “own an airline,” says the friend. Brin also purchased a home in New York City’s West Village. Schmidt bought Ellen DeGeneres’s $20 million Montecito mansion, a $15 million New York apartment, which made an appearance as Shia LaBeouf’s pad in the film Wall Street: Money Never Sleeps, and, recently, a $22 million home near the Playboy Mansion, in Holmby Hills. Schmidt’s wife, Wendy, however, retreated to their compound on Nantucket and didn’t often make the Google social scene. Schmidt, now 58, was sometimes accompanied by younger women, one of whom briefly worked at Google. Several former Google employees say that the company is casual in its approach to dating at work. One says that Google is “intentionally agnostic about dating,” and that there are hundreds of “Google couples” among its global offices. In fact, Google’s code of conduct does not ban dating between employees, saying, “Romantic relationships between co-workers can, depending on the work roles and respective positions of the co-workers involved, create an actual or apparent conflict of interest. If a romantic relationship does create an actual or apparent conflict, it may require changes to work arrangements or even the termination of employment of either or both individuals involved.” Concerning the culture of office romances at Google, one Atherton socialite with close connections to the company says, “When you have executives dating employees, it’s like a doctor-nurse relationship—it’s not illegal, but it seems like it shouldn’t be happening. Tech is a man’s world. Most of these guys are married, and then there are these young fresh [female] sharks, and they’re smart too.” But the men have hundreds of millions of dollars. The socialite trots out an old saw: “It’s almost like you get a Stanford degree so you can work at Google, so you can find a husband.” Over the years, there have been several notable workplace romances at the top levels of Google, including one between Page and Marissa Mayer, now the C.E.O. of Yahoo. There were hallway discussions about the two of them dating, and some believed being close to Mayer was helpful when trying to quickly secure Page’s approval for a project.\n\nWojcicki, unlike many wives of rich men, wasn’t enthusiastic about collecting art or jewelry, and she argued against buying planes and boats, says the friend of the couple’s. Some say she can be headstrong and withholding of praise, hot to her own ideas and dismissive of others’. Wojcicki is adamant about wanting a “normalized” life, says a source close to her, using the Silicon Valley billionaires’ phrase for “normal.” But there’s nothing normal about the astronomical wealth, or the power that comes from being the ones changing the world. In 2006, Wojcicki co-founded 23andMe and soon raised several rounds of financing, including $6.5 million from Google. She hoped to attract over a million customers to her company, coaxing them to spit into a tube and send the saliva to her DNA-genotyping lab for today’s low price of $99. Her mission was to pass along as much information as possible about each person’s health and ancestry, on the principle that this knowledge, by rights, is ours. But not everyone receives good news; many have learned about elevated levels of risk for breast cancer, Alzheimer’s, or Parkinson’s. Some health-care professionals believe it is unwise to give individuals such daunting news without the support of personal counseling. Wojcicki, it turns out, had a more personal stake in her business than one might imagine. Brin’s great-aunt suffered from Parkinson’s, the neuro-degenerative disorder, and his mother was diagnosed with it in 1999. It was long thought that Parkinson’s was not hereditary. But beginning in 2004, researchers suggested that people with a certain gene mutation (more common among Ashkenazi Jews) have a risk of between 30 and 75 percent of succumbing to the disease. (The general population’s risk is about 1 percent.) When Wojcicki tested Brin, his results were positive for the mutation. Brin read the risk as possibly having only about 10 good years left, says the friend of the couple’s. After getting such news, some of us would curl up into a ball, but Brin didn’t. Unlike Steve Jobs, who fiercely guarded news about his health, Brin started a blog and announced his results publicly, at Google’s Zeitgeist conference in 2008 in Mountain View. Brin began exercising even more relentlessly than usual, and drinking coffee, which some doctors recommend for those at risk for the disease, even though he abhorred the taste. (He eventually switched to green tea.) He told Wired magazine that he hoped those steps might reduce his risk by half, and if research on the brain progresses, as he believes it will, his risk could be cut in half again. In addition, Wojcicki and Brin have the means to aid such research, and they have given more than $150 million to the Michael J. Fox Foundation and $7 million to the Parkinson’s Institute. They have also donated to the Breakthrough Prizes, one of which was awarded to a Parkinson’s researcher at a ceremony at the NASA Ames Research Center, in Mountain View, last fall co-hosted by Vanity Fair. Research on the 10,000 Parkinson’s sufferers that Wojcicki has recruited at 23andMe, the largest cohort of these genotypes in the world, might cut Brin’s risk even more. “Somewhere under 10 percent” is his own assessment. A New Life\n\nIn the years following his genetic test, Brin shifted his focus at Google. Like many leaders in Silicon Valley, he had grown bored with quotidian problems and started to dream more about things that were literally out of this world, like space travel and robots who will become our friends. As Microsoft co-founder Paul Allen invested $200 million on a superplane that can launch a rocket, and Tesla’s Elon Musk talked about the Hyperloop, Brin, working at a company with the country’s top engineers, threw his energy into Google X, the company’s “secret lab,” in two nondescript buildings near the Mountain View campus. In 2012, to debut Google Glass, Brin coordinated a skydiving stunt, with a team of jumpers leaping out of a zeppelin over downtown San Francisco. The media was enthralled: Brin, they said, was the real-life Tony Stark, the comic-book genius innovator played by Robert Downey Jr. in the Iron Man films. (Actually, director Jon Favreau says Musk was his inspiration.) Glass was Brin’s first big project at X; now he’s ready to turn his attention to driverless cars, beta versions of which are crisscrossing San Francisco today, like so many ghosts. The first incarnation of Glass, a 10-pound, head-mounted display attached to cables that looped to a box on the user’s belt, was not sexy, but Brin had it redesigned as sleek, lensless frames in shades of “cotton,” “tangerine,” and “sky.” Still, they screamed “nerd.” At an Allen & Co. conference in Sun Valley, Idaho, Brin and Wojcicki approached designer Diane von Furstenberg with an idea: perhaps she would like to collaborate. The designer was tickled by the notion of her models wearing Glass at a fashion show. It would lend a bit of tech gloss to her company, and fashion glamour for Glass. For the event the Glass team, including Amanda Rosenberg, descended on New York to collaborate with von Furstenberg’s studio. Brin and Wojcicki threw a party at their home in the West Village and Glass’s palette was matched to von Furstenberg’s clothes. On the day of the show, during New York’s Fashion Week, Rosenberg posed with von Furstenberg and Brin for celebratory photos. She posted a picture of herself sitting in the front row, using Glass to record the show. “You can see that everyone looks pretty cool, whereas I can barely contain my excitement,” Rosenberg wrote, with her usual sense of self-deprecating humor.\n\nWhile Glass was blowing up in the press, a friend admits, Wojcicki may have been a bit hard on Brin. “Anne is great, but she can be difficult,” says the friend. “She’s hard on Sergey, and she doesn’t let him get away with things.” She was focused on saving him: when research discovered that a gene variant might protect those with Brin’s rare Parkinson’s-related mutation, Wojcicki patented it. (Like many of her business decisions, patenting genes—a move often seen as an attempt to corner a drug market—is controversial in the medical establishment.) Wojcicki still wanted a normal life, or as normal as she could have: to be a dedicated mom and for the family to have dinner together. But “instead of just being a Google founder, Sergey was suddenly awesome, a cool person, a performer—a celebrity!” says the friend of the couple’s. “And he was like, ‘Wait a second—I’m doing all this cool stuff, and then I have to come home and change diapers?’ ” Wojcicki began to help Brin informally on Google Glass, says the friend. Rosenberg wanted to get the product into the hands of moms, so she came over to Wojcicki’s home to discuss reaching out to the many kid-oriented services in Los Altos. At the time, Rosenberg’s boyfriend was Hugo Barra, a high-ranking executive on Google’s Android team. A Brazilian educated at M.I.T., he was essentially the face of their new mini-tablet, the Nexus 7, and a well-regarded, creative product manager. Rosenberg posted internal videos of the two of them together and was “so proud when she started dating him,” says a co-worker. Over the holiday season in 2012–13, says the couple’s friend, Wojcicki and Rosenberg became close enough that Wojcicki bought Rosenberg a Christmas present. The two of them went to a birthday dinner for Russian investor Yuri Milner, with Barra, Brin, and both Wojcicki’s and Brin’s parents. Rosenberg was smoking cigarettes, and Barra wanted her to stop. Wojcicki lectured her about the health risks. Around that time, according to the friend, Wojcicki came across messages between Rosenberg and Brin that caused her to feel alarm, and she mentioned her concern to Rosenberg. (Rosenberg declined to comment for this article.) A few months later, in April, Brin moved out of their estate in Los Altos and into another home that they own nearby. He and Wojcicki maintained a cordial relationship. Wojcicki must have wondered at the way a partnership built on love, pragmatism, and a shared philosophy about the way the world works can be trumped by the passion and excitement of a new relationship. This wasn’t the outcome Wojcicki had desired for her marriage, but she could live with it. However, something odd was happening: Rosenberg was not leaving Barra. They were still dating while she was also seeing Brin. Allegedly, Page and Schmidt were aware of this. At this point, says a source close to the situation, Barra was making plans to move abroad with Rosenberg. He had attracted a competing job offer from a fast-growing Chinese mobile-phone maker, Xiaomi (pronounced *Shao-*me), to take their business international. Though Google can throw a lot of money at an employee to keep him, Barra was seriously considering taking the job in China. Still ignorant of his girlfriend’s relationship with Brin, Barra discussed planting roots in Hong Kong with her. But in late May, according to the source, Rosenberg told Barra that they needed to break up, though she did not tell him the reason.\n\nA few months later, Brin and Wojcicki began to discuss acknowledging their separation in the press. With so many divergent agendas, this process became messy. Wojcicki, in particular, was starting to feel uncomfortable when acquaintances at conferences would send their regards to Brin via her, without realizing they were no longer together. According to the friend of the couple’s, Brin wanted to go public with the news before Burning Man, which takes place at the end of August, because he hoped to attend the festival with Rosenberg. On August 23, The New York Times ran a story entitled “Women at Google Looking Past the Glass Ceiling,” for which a business reporter was given access to women on the Glass team at a luau-style lunch at the company. “If high fashion and high tech are worlds apart,” she wrote, “the women of Google Glass are like explorers, trying to connect the two.” One conspicuous female team member, Rosenberg, was not mentioned. Around the same time, according to sources, she removed many photographs from her Facebook and Google+ pages, including ones that showed her with Barra. News of the Wojcicki-Brin split finally broke on August 28, quickly followed by online speculation about Brin’s relationship with Rosenberg. “It was inappropriate,” says the source close to the situation, of the relationship. “Larry is so ethically strict. . . . I heard Larry was insanely upset by this whole situation and wasn’t talking to Sergey” for a time. The source adds that Brin and Rosenberg both remained at Google X. “At Google, some people were furious internally, especially women, that Sergey and Amanda were not [professionally] separated.” (Google would not comment for this article.) That same day, August 28, Google revealed that Barra was leaving the company to take the job at Xiaomi, earlier than he had planned to make the announcement. To some, it seemed too much of a coincidence: online news sites were soon abuzz with speculation about Brin’s relationship with Rosenberg. Barra was advised not to talk publicly about his departure from Google, leaving room for the press to conjecture that he was possibly pushed out of the company. “In China, so much for executives is about your image, and in one day Hugo’s value got cut in half,” says the friend of Brin and Wojcicki’s. Instead of Xiaomi regarding Barra as a top guy who was recruited from Google, now there were questions about whether he had been pushed out by the founder of Google for personal reasons. (This notion proved short-lived, and Barra’s public persona ultimately received a lift from the chatter.) While all this was playing out, Wojcicki took off for Fiji with some girlfriends to get some space, doing yoga while bobbing on the sea. If this was the entirety of the behind-the-scenes theatrics of Brin and Wojcicki’s relationship, it might make a good Lifetime movie, but there was another, and sadder, act to come. Brin likes his newfound freedom, says the friend of the couple’s, but he also likes being close to his wife and children. “He thinks his life is great now.” Brin attended Marissa Mayer’s annual extravagant Halloween party with Wojcicki and the kids. This didn’t sit well with Rosenberg, says the family friend—“the two of them have horrible, screaming fights. It’s part of the passion, the chemical attraction.” A couple of months ago, Rosenberg ran into a rough patch. As she wrote in an essay that she posted on her Tumblr blog, “I suffer from clinical depression. Whilst I’m not proud of it, I’m not ashamed of it either.” She called depression a “sneaky bugger,” adding, “You might seem happy on the outside. Smiling, talking to people at parties, saying things like Did you put lime in this hummus? It’s delicious, my face is having such a great time! But you, and others around you, may not realize how deeply the depression runs.” Turns out, she continues, that she was “a ticking time bomb. See, when you extreme hoard all the feelings (like finding-a-dead-pet-under-the-refrigerator kind of hoarding), you end up with none at all. . . . I’m in treatment and have been for 6 weeks. Reaching out for help is the single best and bravest decision I have ever made.”", "images": ["https://media.vanityfair.com/photos/54cac008b8f23e3a03159023/master/w_1600%2Cc_limit/image.jpg", "http://www.vanityfair.com/verso/static/vanity-fair/assets/logo-header.b6748104d0d362745b508aebea5a86c913809200.svg", "https://media.vanityfair.com/photos/5d015eed76711f0cbe7fe693/1:1/w_350%2Ch_350%2Cc_limit/emmys-documentary-2019-lede.jpg", "https://media.vanityfair.com/photos/5d161993734e1f0008f96106/1:1/w_350%2Ch_350%2Cc_limit/GettyImages-654204952.jpg", "https://media.vanityfair.com/photos/5cf99e33993bab58a90889f6/1:1/w_350%2Ch_350%2Cc_limit/trumpmexicotariffs.jpg", "https://media.vanityfair.com/photos/5d19fe5f5f741a0008ed063a/1:1/w_350%2Ch_350%2Cc_limit/Greenwich-Convict-08-2019-Lede.jpg", "http://www.vanityfair.com/verso/static/vanity-fair/assets/logo-reverse.6ef96ab8686439a35176e2ff8b2c4487e92fbaae.svg", "https://media.vanityfair.com/photos/54cac00851062027081ff7a4/16:9/w_1280%2Cc_limit/image.jpg", "https://media.vanityfair.com/photos/5d09080ca2036c4810753edd/1:1/w_350%2Ch_350%2Cc_limit/queen-elizabeth-royal-ascot-turnout.jpg", "https://media.vanityfair.com/photos/54cac008494254fc09974003/16:9/w_1280,c_limit/image.jpg", "https://media.vanityfair.com/photos/54cac008b624d691057695ee/master/w_1600%2Cc_limit/image.jpg", "https://media.vanityfair.com/photos/5d1521d35f741a0008ed0599/1:1/w_350%2Ch_350%2Cc_limit/01-lead-red-gate-farm.jpg"], "top_img": "https://media.vanityfair.com/photos/54cac008494254fc09974003/16:9/w_1280,c_limit/image.jpg", "keywords": [], "authors": ["Condé Nast", "Julie Miller", "Nick Bilton", "Bess Levin", "Vanessa Grigoriadi", "Chris Pomorski", "Erin Vanderhoof", "Katie Nicholl"], "canonical_link": "https://www.vanityfair.com/style/2014/04/sergey-brin-amanda-rosenberg-affair", "title": "Sergey Brin and Amanda Rosenberg: Inside the Google Co-Founder’s Romance with the Google Glass Marketing Manager", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Condé Nast", "copyright": "Copyright (c) Condé Nast 2019", "description": "The high-profile love triangle involving Sergey Brin, Anne Wojcicki, and Amanda Rosenberg has Silicon Valley facing emotional issues, from office romance to fear of mortality.", "keywords": "Google,Technology,Society,Magazine,April 2014 Issue", "robots": "index, follow", "og": {"description": "The high-profile love triangle involving Sergey Brin, Anne Wojcicki, and Amanda Rosenberg has Silicon Valley facing emotional issues, from office romance to fear of mortality.", "image": "https://media.vanityfair.com/photos/54cac008494254fc09974003/16:9/w_1280,c_limit/image.jpg", "site_name": "Vanity Fair", "title": "Sergey Brin and Amanda Rosenberg: Inside the Google Co-Founder’s Romance with the Google Glass Marketing Manager", "type": "article", "url": "https://www.vanityfair.com/style/2014/04/sergey-brin-amanda-rosenberg-affair"}, "twitter": {"card": "summary_large_image", "description": "The high-profile love triangle involving Sergey Brin, Anne Wojcicki, and Amanda Rosenberg has Silicon Valley facing emotional issues, from office romance to fear of mortality.", "domain": "https://www.vanityfair.com", "image": {"src": "https://media.vanityfair.com/photos/54cac008494254fc09974003/16:9/w_1280,c_limit/image.jpg?mbid=social_retweet"}, "site": "@VanityFair", "title": "Sergey Brin and Amanda Rosenberg: Inside the Google Co-Founder’s Romance with the Google Glass Marketing Manager"}, "fb": {"app_id": 305927716147259, "pages": 8810407571}}, "movies": [], "publish_date": null, "source": "http://www.vanityfair.com", "summary": ""}