{"url": "https://en.wikipedia.org/wiki/Raven%27s_Home", "text": "American television series\n\nRaven's Home is an American family sitcom[1] television series developed by Jed Elinoff and Scott Thomas that premiered on Disney Channel on July 21, 2017. The series stars Raven-Symoné, Issac Ryan Brown, Navia Robinson, Jason Maybaum, Sky Katz, and Anneliese van der Pol.\n\nBased on the characters created by Michael Poryes and Susan Sherman, the series is a spinoff of That's So Raven,[2][3] the second spinoff from that series after Cory in the House. The series centers around Raven Baxter, a divorced mother of preteen twins Booker and Nia, living with Chelsea, her childhood best friend, and her son Levi in Chicago, Illinois.\n\nPremise\n\nBest friends Raven and Chelsea, both divorced single mothers, are now raising their children in an apartment together in Chicago. Their house is turned upside down when they realize that Raven's son Booker has inherited the same psychic abilities as his mother.\n\nEpisodes\n\nSeason Episodes Originally aired First aired Last aired 1 13 July 21, 2017 ( ) October 20, 2017 ( 2017-10-20 ) 2 21 June 25, 2018 ( ) November 30, 2018 ( 2018-11-30 ) 3 TBA June 17, 2019 ( ) TBA\n\nCast and characters\n\nMain\n\nRaven-Symoné as Raven Baxter, [4] the single mother of twins Nia and Booker, who works as a fashion designer for dogs and later as a car rental service driver. It is revealed that prior to the series, Raven had gotten divorced from Devon Carter, an ex-boyfriend from high school, and now lives with Chelsea and her son in Chicago. Raven possesses psychic abilities, able to glimpse \"visions\" of the future. She decides not to tell her children about her visions as she believes they would not understand. However, in \"The Falcon and the Raven – Part Two\", she reveals to the children that she is psychic. During season two, Raven is working as a driver for the transportation business Scüt.\n\nthe single mother of twins Nia and Booker, who works as a fashion designer for dogs and later as a car rental service driver. It is revealed that prior to the series, Raven had gotten divorced from Devon Carter, an ex-boyfriend from high school, and now lives with Chelsea and her son in Chicago. Raven possesses psychic abilities, able to glimpse \"visions\" of the future. She decides not to tell her children about her visions as she believes they would not understand. However, in \"The Falcon and the Raven – Part Two\", she reveals to the children that she is psychic. During season two, Raven is working as a driver for the transportation business Scüt. Issac Ryan Brown as Booker Baxter-Carter, [4] Raven's son and Nia's twin brother, who has inherited his mother's psychic abilities. After he gets his first vision at school, he decides not to tell his mother about his psychic abilities as he thinks she would not believe him, unaware that his mother is also psychic. However, in \"The Falcon and the Raven – Part One\", he reveals to his mother that he has visions.\n\nRaven's son and Nia's twin brother, who has inherited his mother's psychic abilities. After he gets his first vision at school, he decides not to tell his mother about his psychic abilities as he thinks she would not believe him, unaware that his mother is also psychic. However, in \"The Falcon and the Raven – Part One\", he reveals to his mother that he has visions. Navia Robinson as Nia Baxter-Carter, [4] Raven's daughter and Booker's twin sister. She initially does not believe her brother's psychic abilities, insisting it is one of his made up stories. When her brother has a vision of Nia getting hit by a boxing bag that later becomes true, she finally believes him.\n\nRaven's daughter and Booker's twin sister. She initially does not believe her brother's psychic abilities, insisting it is one of his made up stories. When her brother has a vision of Nia getting hit by a boxing bag that later becomes true, she finally believes him. Jason Maybaum as Levi Grayson, [4] Chelsea's son. He is very mature for his age and often acts as the parent in his relationship with his mother.\n\nChelsea's son. He is very mature for his age and often acts as the parent in his relationship with his mother. Sky Katz as Tess, the street-wise best friend of Nia who lives in the same building as the rest of the family; her last name is revealed to be O'Malley in \"Oh Father, Where Art Thou?\".\n\nAnneliese van der Pol as Chelsea Grayson,[4] Raven's somewhat dim-witted and sweet best friend and the mother of Levi. It is revealed that prior to the series, Chelsea made a substantial sum of money from an infomercial product she invented called the \"Schmop\", but her fortune was stolen by her husband, Garrett Grayson. Afterward, Garrett was arrested for tax evasion and ended up having an affair with the federal agent who arrested him. Chelsea subsequently divorced him upon reclaiming some of her money and moved in with Raven. While living with Raven, Chelsea often tries to cook for the family, which goes horribly awry. In season 2, she builds a vegetable garden on their building's rooftop.\n\nRecurring\n\nDylan Martin Frankel as Mitch (season 2), the son of 352 Hauser Avenue's new owner Richard Moseley who runs the apartment while his father is busy.\n\nLaya DeLeon Hayes as Zeena (season 2), a student at George Washington Carver Community School who is the leader of the Red Hot Chili Steppers dance group and has an improving relationship with Nia and Tess.\n\nJenna Davis as Sienna (season 2), a popular and influential student at George Washington Carver Community School who lives in 352 Hauser Avenue and has a lot of followers on the media app Peanut Face.\n\nDonovan Whitfield as Curtis (season 2), a student at George Washington Carver Community School who is friends with Booker.\n\nNathan Blaiwes as The Guntz (season 2), a student at George Washington Carver Community School who is friends with Booker, is the best friend of Curtis, and enjoys dabbling in wrestling and trombone playing.\n\nNotable guest stars\n\nJonathan McDaniel as Devon Carter / Devon, [5] [6] [7] [8] Raven's ex-husband and the father of Booker and Nia who works as a meteorologist. He was Raven's boyfriend in high school and is now aware of Raven's abilities. After the two of them separated, Devon relocated to Dallas, Texas.\n\nRaven's ex-husband and the father of Booker and Nia who works as a meteorologist. He was Raven's boyfriend in high school and is now aware of Raven's abilities. After the two of them separated, Devon relocated to Dallas, Texas. Brian George as Dr. Sleevemore, [9] [10] [11] a clairvoyant and telekinetic scientist who helped out Raven with two of her psychic problems during her high school days. He later helped out Booker when he froze during mid-vision.\n\na clairvoyant and telekinetic scientist who helped out Raven with two of her psychic problems during her high school days. He later helped out Booker when he froze during mid-vision. Rondell Sheridan as Victor,[12] the father of Raven and the grandfather of Booker and Nia. He works as a chef and flies out to Chicago to help Raven while Chelsea is away on a Caribbean cruise.\n\nProduction\n\nEight years after That's So Raven ended, there was speculation and rumors that the series would get a second spinoff or revamp. On August 14, 2015, a reunion with Raven-Symoné and her former co-stars happened on The View, where they discussed all things about the series and past times. T'Keyah Crystal Keymáh and Rondell Sheridan were not present, but got a special mention from Raven-Symoné herself.[13]\n\nA pilot for the series was announced by Disney Channel on October 27, 2016,[1] and Raven-Symoné also announced that she was departing as co-host of The View later in 2016 in order to work on the series full time.[14] On November 14, 2016, it was announced that Anneliese van der Pol would reprise her role of Chelsea Daniels in the series as a divorced mother who is raising a son, Levi, and moves in with Raven.[3] Disney Channel officially greenlit the series, with the title of Raven's Home, on April 4, 2017.[15][16] Executive producers Jed Elinoff and Scott Thomas serve as showrunners and head writers, with Raven-Symoné also on the writing team as an executive producer.[17] The series is filmed at Hollywood Center Studios.\n\nDisney Channel renewed the series for a second season on October 10, 2017, which began filming in November 2017.[18] Additionally, starting with the second season, Michael Feldman and Dava Savel replaced Jed Elinoff and Scott Thomas as showrunners. Both Savel and Feldman served as writers and producers on That's So Raven.[19] On September 28, 2018, it was announced that a musical episode of the series would premiere on October 12, 2018.[20]\n\nFollowing a silent renewal, on November 28, 2018, it was announced that Eunetta T. Boone would be taking over as showrunner and executive producer for the third season.[21] On March 21, 2019, it was announced that production on the third season was temporarily shut down, following the death of Eunetta T. Boone.[22] On May 10, 2019, it was announced that the third season will premiere on June 17, 2019.[23]\n\nBroadcast\n\nThe world premiere of Raven's Home aired immediately after the premiere of Descendants 2 on the Disney Channel on July 21, 2017.[24] The first season concluded on October 20, 2017. The second season premiered on June 25, 2018.[25][26]\n\nReception\n\nCritical\n\nRaven's Home has received positive reviews. Writing for The Post, Georgia Davis appreciated the pilot for \"maintain[ing] the charm and energy\" of the original, praising Raven and Chelsea's characterizations, as well as the performances of the child actors.[27] Davis concluded, \"It might be too early to tell, but it seems Raven's Home is on the right path for success.\"[27] Emily Ashby of Common Sense Media wrote that \"That's So Raven fans will find plenty more of what they loved about the original series in this sharply written sitcom that plays up the woes of adulting and tween trials in a surprisingly great balance.\"[28]\n\nRatings\n\nSeason Episodes First aired Last aired Avg. viewers\n\n(millions) Date Viewers\n\n(millions) Date Viewers\n\n(millions) 1 13 July 21, 2017 ( ) 3.50[29] October 20, 2017 ( 2017-10-20 ) 1.27[30] 1.50 2 21 June 25, 2018 ( ) 0.96[31] November 30, 2018 ( 2018-11-30 ) 0.75[32] 0.83 3 4 June 17, 2019 ( ) 0.63[33] TBA TBD 0.61\n\nAwards and nominations", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/en/1/18/RavensHome.PNG", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/18/RavensHome.PNG/250px-RavensHome.PNG", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1"], "top_img": "https://upload.wikimedia.org/wikipedia/en/1/18/RavensHome.PNG", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Raven%27s_Home", "title": "Raven's Home", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.13", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/1/18/RavensHome.PNG"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}