{"url": "https://www.visitdeepcreek.com/pages/MemberNews1", "text": "Ski Industry Veteran Announces His Retirement\n\nWisp General Manager to retire this summer after 45 years at the resort\n\nDEEP CREEK LAKE, MARYLAND – Wisp Resort announced today that General Manager Jerry Geisler will be retiring this summer after more than four decades at Maryland’s only four season resort. Geisler has been the resort’s General Manager for the past six years and has served as an executive at the resort since 1982 when he became Operations Manager. His career at the ski area commenced in 1974 as a bartender at night and a ski instructor during the day shortly after he graduated from West Virginia University, and he has become a fixture at Wisp Resort over the ensuing 45 years.\n\n“My attachment to Wisp started even before I began working here,” noted Geisler. “I’ve been a season pass holder since 1968, so Wisp has been a big part of my life for 51 years. I met my wife, Nancy, here, and we raised our two daughters on these slopes, so Wisp has been home for us for both work and play for a very long time.”\n\nArtie Speicher, Director of Mountain Operations for Wisp, noted all that time at the mountain resort had its benefits, “Jerry has worked in almost every department at the ski area: bartender, waiter, ski instructor, marketing and advertising manager, race director, facilities manager, director of golf operations, transportation director, rental shop manager, manager of human resources, hotel manager, and I don’t even know what else, plus he has deep operational knowledge of our snow making systems, our tubing park, the mountain coaster, our lifts, and the whitewater course. When Jerry talks about running this place, it’s always worth listening because you know he has been there and done that.”\n\nDuring Geisler’s time at Wisp, the resort saw substantial growth. “When I got here, we had two chairlifts and three surface lifts. Today we have seven chairlifts and seven surface lifts for skiing plus one of the best teaching areas for beginner skiers and snowboarders in the country. In the summer we have two golf courses, a mountain adventure park with canopy tours, ropes courses, and a mountain coaster, plus a world famous mountain top whitewater rafting course. We’ve come quite a long way. When I took the job as Ops Manager, the owner of Wisp at the time, Helmuth Heise, promised me I’d never be bored, and he was right about that!”\n\n“I’ve been fortunate to work with three very committed ownership groups at Wisp over the last forty-five years,” commented Geisler. “The Heise family is the hardest working family and the greatest risk takers I’ve ever had the privilege to work for. Then came DC Development, and while they faced the challenges of the Great Recession, they did a lot of good too, from building the Lodestone Golf Course to developing the north side of the mountain to securing the water we have for snowmaking and the whitewater course. Most recently it’s been Pacific Group Resorts. One of the first things they did was show their commitment to skiing and snowboarding and the growth of the sport by building the Sundown Village and the new beginner terrain which is one of the best beginner areas in the U.S. I’m quite proud of the team here and what we have accomplished, and I’m very pleased to pass along a solid foundation for the next generation to build upon.\"\n\nGarrett County Commissioner Jim Hinebaugh explained Geisler has been an icon in the local community in addition to his involvement at the resort. “Jerry has been part of the fabric of the business community in the Deep Creek Lake area for decades. He’s been president of the Garrett County Chamber of Commerce, has served two terms on the Maryland State Tourism Board, has been a two term director of the Maryland State Chamber of Commerce, has been on the board of the Adventure Sports Center International, and has represented Wisp in numerous business organizations in Western Maryland. I know the resort is going to miss his presence, but as a community we’re going to miss him, too.”\n\nThe daughters the Geislers raised on the slopes of Wisp maintained their enthusiasm for the mountains and about ten years ago they both moved to Park City, Utah where the alpine skiing and snowboarding events were held during the 2002 Winter Olympics. “I’m not sure if it was a blessing or a curse, but once I introduced our girls to the mountains of Utah, it wasn’t long before they headed there for good,” remarked Geisler. “Nancy and I bought a place to retire to out there, and we look forward to spending our senior years together as a family enjoying our love of the outdoors while I’m still young enough to ski the black diamond runs with them.”\n\nVern Greco, President and CEO of Pacific Group Resorts, expressed his appreciation for Geisler, “Jerry is one of those highly skilled industry veterans who have seemingly been around forever, and who have seen almost everything the business can throw at you. Even with all that knowledge and experience, Jerry has always been open to new ideas, and he has been a great resource for both us and for the Garrett County community. His exit strategy is vintage Jerry. He’s leaving in good health, he’s in a good place, and he has given us enough time to allow for careful selection of a new general manager and the time for a thorough knowledge transfer between Jerry and the new GM. Everything he does, he does thoughtfully.”\n\nGeisler summed up his career succinctly saying, “To be able to work at one area for four and a half decades, and to help it develop from very modest beginnings into a one of the top resorts in the Mid-Atlantic has been a privilege and a lot of fun. To have a job at a place I fell in love with as a kid, and to be able to do something that has been a passion all my life is a pretty good way to spend a career if you ask me.”\n\nABOUT WISP\n\nWisp Resort, Maryland’s only all-season ski, golf and recreation resort, overlooks Deep Creek Lake from Marsh Mountain in the heart of Garrett County. With more than 65 miles of shoreline, Deep Creek Lake is Maryland’s largest freshwater lake. In winter, Wisp offers 172 acres of skiable terrain along with a Mountain Park with snow tubing and a mountain coaster plus a Nordic Center for cross country skiing and snowshoeing. Spring, summer and fall feature three canopy tour zip lines, Segway tours, archery, orienteering, chairlift rides, the mountain coaster, paddleboard and kayak rentals, downhill mountain biking, gem mining, disc golf, and the popular Escape Room Game. Groups gather in Wisp Resort’s 40,000 sq ft of function space for meetings, conferences, retreats, reunions and weddings. For more information about Wisp Resort, call 844.259.0267 or visit the website at www.wispresort.com.", "images": ["https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/847/CMS/Maryland-Tourism-Logo_URL_4C_website2.jpg", "https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/847/CMS/instagram.png", "https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/847/CMS/convert/www.visitdeepcreek.com/files/221.png", "https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/847/CMS/Member_News_PR/crodeheaver2019.jpg", "https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/847/CMS/248.jpg", "https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/847/CMS/Member_News_Photos/Hauser_home.jpg", "https://www.visitdeepcreek.com/content/seo3/images/tripbuilder_cart_icon.png", "https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/847/CMS/convert/www.visitdeepcreek.com/files/242.png", "https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/847/CMS/convert/www.visitdeepcreek.com/assets/layouts/gcc/images/watermark-bottom.png", "https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/847/CMS/MountainMarylandLogo_NEWwebsite-3.jpg", "https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/847/CMS/convert/www.visitdeepcreek.com/files/240.png", "https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/847/CMS/Member_News_Photos/Ron-Hawkes-headshot_1.jpg", "https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/847/CMS/Member_News_Photos/SusanFoley-2019_CMB_49-(2).jpg", "https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/847/CMS/Member_News_Photos/grmc-employee-of-year-2018.jpeg", "https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/847/CMS/Member_News_Photos/J.-Walsh-photo.jpg", "https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/847/CMS/Annual_AGF_Logo.jpg", "https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/847/CMS/convert/www.visitdeepcreek.com/files/244.jpg", "https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/847/CMS/Member_News_Photos/Lohr_home.jpg", "https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/847/CMS/Member_News_Photos/Crouse_home.jpg", "https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/847/CMS/convert/www.visitdeepcreek.com/files/241.png", "https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/847/CMS/convert/www.visitdeepcreek.com/files/248.jpg", "https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/847/CMS/convert/www.visitdeepcreek.com/files/243.png", "https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/847/CMS/convert/www.visitdeepcreek.com/assets/images/favicon.png", "https://devchambermaster.blob.core.windows.net/cms/media/icons/add-icon-flat.png", "https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/847/CMS/convert/www.visitdeepcreek.com/assets/layouts/gcc/images/watermark-top.png", "https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/847/CMS/Member_News_Photos/McDonald_home.jpg"], "top_img": "https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/847/CMS/convert/www.visitdeepcreek.com/assets/images/favicon.png", "keywords": [], "authors": [], "canonical_link": "", "title": "Garrett County Chamber of Commerce, MD", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "google-site-verification": "bjyG5Qi25FglgZwP992CTLTgewwezxwbM6avneSs_9g"}, "movies": [], "publish_date": null, "source": "https://www.visitdeepcreek.com", "summary": ""}