{"url": "https://en.wikipedia.org/wiki/Britney_Spears:_Piece_of_Me_Tour", "text": "Piece of Me Tour Tour by Britney Spears Promotional poster for the European leg Start date July 12, 2018 End date October 21, 2018 Legs 3 No. of shows 12 in North America\n\n18 in Europe\n\n30 total Attendance 260,531 Box office $54.3 million Britney Spears concert chronology\n\nBritney: Piece of Me\n\n(2017)\n\n(2017)\n\nPiece of Me Tour\n\n(2018)\n\n(2018)\n\nBritney: Domination\n\n(TBD)\n\nThe Piece of Me Tour[1] (also referred to as Piece of Me: Exclusive Limited Tour[2]) was the tenth concert tour by American recording artist Britney Spears. Although it largely mirrors her Las Vegas residency, Britney: Piece of Me, which concluded in December 2017;[3] the stage-show was updated with new remixes, production technology, visuals and set list modifications to accommodate for arena shows.[4]\n\nAfter performing 11 shows in during the summer of 2017 in Asia under a concert tour titled Britney: Live in Concert, the show was adapted to be performed in various select cities across North America and Europe.[5] The tour was announced in January 2018, and began in July.[6]\n\nThe Piece of Me Tour ranked at 86 and 30 on Pollstar's 2018 Year-End Top 100 Tours chart both in North America and worldwide, respectively. In total, the tour grossed $54.3 million with 260,531 tickets sold and was the 6th highest-grossing female tour of 2018, and was the United Kingdom's 2nd best-selling female tour of 2018.[7][8]\n\nThe tour became very notable in the media due to a fan attending one of the shows in Atlantic City, NJ. The July 19th show at Borgata Event Center was the night that super fan, Zachary Gordon-Abraham, achieved international Internet fame for shouting out “Who is it,” causing Britney to laugh before delivering the line, “It’s Britney, bitch!” He caught it all on camera, and the video went viral within minutes, gathering millions of views in less than 24 hours, and spawned official merchandise and gathered media attention from Billboard, Entertainment Tonight, BuzzFeed, and People Magazine, among other media outlets as well. Crowds caught wind of the quip and began collectively cheering, “Who is it,” in the same spot during the remaining tour dates.\n\nOn September 5, 2018, the tour was nominated for People's Choice Concert Tour of 2018 at the 44th People's Choice Awards, but lost to Taylor Swift's Reputation Stadium Tour.[9]\n\nBackground [ edit ]\n\nFollowing the release of Spears' ninth studio album, Glory, she expressed interest in performing internationally again. In March 2017, after several publications began leaking details about Spears' planned international shows, she confirmed the planned tour by announcing concert dates in the Philippines and Israel.[10] Coincidentally, her show in Israel was held on the same day as the Labor Party's primary election, which caused the election to be moved the next day due to an insufficient amount of security and traffic congestion from Spears' concert.[11] In the weeks following the announcement, Spears revealed additional Asian tour dates. Spears performed in the Philippines, Taiwan, Thailand, Hong Kong and Israel for the first time during the tour.[12] A special tour edition of her ninth studio album was released on May 31st, to coincide with the start of the tour.[13]\n\nFollowing allegations of lip-syncing during her concerts, Spears addressed the accusations during an Israeli phone interview, stating: \"I do have a little bit of playback, but there’s a mixture of my voice and the playback.\" However, critic responses to the veracity of these claims were mixed.[14][15] Days after, Spears sang a live rendition of \"Happy Birthday\" during her show in Singapore.[16] The local media reported that Britney performed for over 60,000 fans at Hayrkon Park, Tel Aviv, on July 3.[17] Due to the concert, the Israeli Labor Party delayed their election for a new chairperson by a day. It was originally scheduled for July 3, the same day as Spears's concert, but party officials feared traffic jams and that party members would choose the concert over finding a polling station.[18]\n\nOn December 22, 2017, Spears announced she will be bringing the show to Denmark for the Smukfest.[19] On January 23, 2018, Spears announced dates for North America and Europe.[20][21] On February 13, 2018, Spears announced additional dates for the UK and Paris. Spears also announced Pitbull will join her across selected dates in Europe.[22]\n\nShows in the United States are sponsored by PepsiCo,[23] while the UK shows are sponsored by Britney Spears Fragrances.[24]\n\nCritical reception [ edit ]\n\nThe tour received polarizing reviews throughout its run. Cristina Jerome from the Miami New Times stated \"The Piece of Me Tour was for Britney Spears’ day-one fans. The Princess of Pop allowed her audience to experience her career from the late '90s to the present day while sprinkling in a few hits from her latest studio album, Glory.\" Although complementing Spears' show production and stage presence, accusations of lip-syncing were mentioned.[25] In defence of Spears' lip-syncing accusations, Louis Staples from The Independent reviews the record-breaking Brighton Pride concert; \"It is Spears’ strength and vulnerability in the face of her troubles that most endears her to her fans. She is instantly forgiven for things that would normally sink other stars, such as her well-known aversion to live singing.\" Later mentioning that fans attend purely for the hits and \"her glittery performance[s] proves that few people can match her cultural impact, or personify the words “icon” or “megastar” quite like her. Twenty years on, people still want a piece of Spears.\"[26] On the other hand, the tour also received negative reviews especially in Europe; for instance, Inga Barthels from the German newspaper Der Tagesspiegel writes \"Once upon a time, Britney Spears was one of the world's greatest stars. Not anymore.\"[27] and a review by Lucia Odoom from the Danish news publication Politiken has the following title, \"Britney Spears may be playing the worst concert of the century\".[28]\n\nCommercial performance [ edit ]\n\nDemand in Europe and the United Kingdom saw ticket sites crashing, sparking Spears to add additional dates in London, Blackpool and Paris.[29] Tickets were sold-out in under 10 minutes for her date at 3Arena in Dublin; however, with a strict touring schedule, no additional date was added.[30] The tour was named the second best-selling female tour in the United Kingdom in 2018, according to StubHub, only behind the Taylor Swift's Reputation Stadium Tour.[31] In Oslo, the Piece of Me Tour was performed to over 20,000 spectators, making it one of Spears' highest European (excluding the United Kingdom) concert-attendances in her touring history.[32]\n\nThe concert in Bethlehem set a new record for the venue (previously held by The 1975), for the fastest selling tickets in the venue.[33] Spears' first date as part of her European leg was the Brighton Pride Festival, which was attended by a record-breaking crowd of 57,000 at Brighton's Preston Park.[34] On August 11, Britney performed for 10,951 fans at Göransson Arena, Sweden, and broke the 10,500-record set by Scorpions in 2012.[35]\n\nOn September 26, 2018, Spears was ranked at #17 on Pollstar's Concert Pulse with $13.1 million gross and 100,891 tickets sold in 8 cities. This total are including two nights at Radio City Music Hall in New York City, which sold 11,887 tickets and grossed $2.7 million, three shows at Hard Rock Live in Hollywood, which sold 9,756 tickets and grossed $1.98 million, Mohegan Sun Arena in Uncasville, which sold 6,998 tickets and grossed $946,100 and the first report from the 18-date European tour at Antwerps Sportpaleis in Belgium, which sold out 16,787 tickets and grossed $1.4 million.[36]\n\nThe Piece of Me Tour ranked at 86 and 30 on Pollstar's 2018 Year-End Top 100 Tours chart both in North America and worldwide, respectively. In total, the tour grossed $54.3 million with 260,531 tickets sold and was the sixth highest-grossing female tour of 2018, and was the United Kingdom's second best-selling female tour of 2018.[37][38]\n\nSet list [ edit ]\n\nThis set list is representative of the show on July 12, 2018, in National Harbor, Maryland. It is not intended to represent all shows.[39]\n\nNotes [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/d/de/Britney_Spears_Europe_Tour_Poster_2018.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/99/Question_book-new.svg/50px-Question_book-new.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/d/de/Britney_Spears_Europe_Tour_Poster_2018.png/220px-Britney_Spears_Europe_Tour_Poster_2018.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1"], "top_img": "https://upload.wikimedia.org/wikipedia/en/d/de/Britney_Spears_Europe_Tour_Poster_2018.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Piece_of_Me_Tour", "title": "Piece of Me Tour", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.11", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/d/de/Britney_Spears_Europe_Tour_Poster_2018.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}