{"url": "http://mona8888.com/tv-shows/the-real-housewives-of-new-york-city/season-9/episode-22/news", "text": "Which TV series will your friends (and the entire internet) be talking about this week? Stay informed — or at least be able to fake it — with SideReel's weekly guide to The Most Important Shows on TV. The Real Housewives of New York City (Reunion Part 3) Wednesday at 8 p.m. on Bravo Why: Any Housewives enthusiast knows that the real action happens during the 3rd reunion! We've already talked about Tom (and sadly this was filmed before the official split), the election, Bethenny's emotional state, Tinsley's drinking...so what's left? Well, if you know Andy Cohen and Bravo reunions at all, the answer is obviously rehashing the Ramona/Bethenny drama for the 7,000th time (even though they already mostly made up in Mexico). Duh! And we're here for it! They'll also revisit that glorious Mexico trip and hopefully replay clips of Luann tripping and falling no fewer than 20 more times. We're just bummed you can no longer find Ramona Pinot Grigio anywhere to bring to the party (it actually wasn't half bad). Prepare to talk about: When we'll actually get more dirt on Luann's divorce; whether we think Tinsley will make the cut for next season (we vote yes). Narcos (Season Premiere) Friday at 3 a.m. on Neflix Why: Spoiler alert (but not really since this happened for real, and in 1993 no less): Pablo Escobar is dead. While this may seem like there is no longer a show here, it is actually an exciting opportunity for a reboot! Season 3 of Narcos will focus on Escobar's real life successors, the Cali Cartel, referred to at the time as the \"new kings of coke\" (and we don't mean soda). Pedro Pascal is returning as DEA agent Javier Pena and will be joined by a handful of new castmembers including Michael Stahl-David, Matt Whelan, Kerry Bishe ( Halt and Catch Fire ), and Miguel Angel Silvestre ( Sense8 ). We can't deny that we'll miss our favorite anti-hero, but we're certainly willing to give a new crop of villains a chance to leave their mark! Prepare to talk about: How much of this stuff actually happened (a lot of it, says Netflix, but we're sure you'll still be googling); which drug lord is...best? Twin Peaks (Series Finale) Sunday at 8 p.m. on Showtime Why: This show has been oh so strange and confusing, but also unlike anything else on TV right now, which is if nothing else an accomplishment (thanks, David Lynch). Some people view it as a masterpiece. *And* it has finally started to make SO MUCH MORE SENSE! Granted, it will almost certainly end with a thousand unanswered questions, but we know we can expect a Good Cooper vs. Bad Cooper showdown and an answer as to Audrey's fate. Has she been in a coma? An institution? It will all become clear. Prepare to talk about: Who lived and who died; what was real and what was fake; is this show done now for real, or will it be back again in 25 more years? Rachel is the product manager of SideReel, and her favorite drug lord will always be Walter White. div.post p { text-align: justify; }", "images": ["http://cdn-gce.sidereel.com/assets/favicons/apple-touch-icon-57x57-f902359ce97444e49ef03d595bcb2ec3.png", "http://tps30.doubleverify.com/visit.jpg?ctx=2908533&cmp=2736444&sid=24324&plc=DV-RTHM20170324001&advid=2908534&region=30&btadsrv=rhythmone&app=appid&sup=sspid&DVP_DV_TT=2&DVP_DV_CT=1&DVP_APPID=NotApplicable&DVP_SSPID=NotApplicable&DVP_PUBID=NotApplicable&DVP_PP_BUNDLE_ID=NotApplicable&DVP_RO_SSPID=NotApplicable&DVP_PP_ORTB_PUB_ID=NotApplicable&DVP_RO_SITEID=NotApplicable&DVP_RO_TRAFFIC=NotApplicable&DVP_PP_DEAL_ID=NotApplicable&DVPX_PP_IMP_ID=NotApplicable&DVPX_PP_UID=NotApplicable&DVP_RO_CDID=NotApplicable&DVPX_PP_AUCTION_UA=Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/74.0.3729.169 Safari/537.36&DVP_PP_AUCTION_IP=35.191.2.193&turl=sidereel.com&dvtagver=6.1.img", "http://cdn-static.sidereel.com/tv_shows/21893/huge/84669-6.jpg", "http://cdn-gce.sidereel.com/assets/ads/amazon-c0c98b97c07161f879eb1c549a37cd06.jpg", "http://cdn-gce.sidereel.com/assets/registration/badge_icon_sidebar-1150433733eb341fa0182127010dfda3.png"], "top_img": "http://cdn-gce.sidereel.com/assets/favicons/apple-touch-icon-57x57-f902359ce97444e49ef03d595bcb2ec3.png", "keywords": [], "authors": ["E Online"], "canonical_link": "http://mona8888.com/tv-shows/the-real-housewives-of-new-york-city/season-9/episode-22/news", "title": "The Real Housewives of New York City Season 9 Episode 22 News", "meta_data": {"apple-itunes-app": "app-id=417270961", "viewport": "width=device-width, maximum-scale=1.0", "twitter": {"site": "@sidereel"}, "csrf-param": "authenticity_token", "csrf-token": "LJg02C1i34M9eFNNCM1kDFwuOFOhFq9xPaPN3QMb+AFpc1lDQx5y7+a3OxNV0r3zywa3ZE7DIsqqNMS/OSVKtw==", "msapplication-TileColor": "#55abca", "msapplication-TileImage": "http://cdn-gce.sidereel.com/assets/favicons/mstile-144x144-15c8934fb52c222298e9a4f0bacc2b61.png", "description": "Check out the latest news about The Real Housewives of New York City Season 9 Episode 22. Join SideReel for personalized news about your favorite TV shows. It's free!"}, "movies": [], "publish_date": null, "source": "http://mona8888.com", "summary": ""}