{"url": "https://www.wkyc.com/article/entertainment/report-khloe-kardashian-gives-birth-to-baby-girl-tristan-thompson-at-hospital/95-536603273", "text": "CLEVELAND -- The Cleveland Cavaliers have confirmed that reality star Khloe Kardashian gave birth to a baby girl early Thursday.\n\nThe baby's father, Cleveland Cavaliers center Tristan Thompson, was present at Hillcrest Hospital during the birth, though it's not confirmed if he was allowed in the room.\n\nCan confirm Tristan Thompson was indeed at Hillcrest. He has since left, however. #Khloe @wkyc pic.twitter.com/s6xPVSTnpJ — Tyler Carey (@TC_CLE) April 12, 2018\n\nTMZ is reporting Kardashian gave birth around 4 a.m. and that the baby girl does not yet have a name. TMZ also says Kardashian's mother, Kris Jenner, sisters, Kim and Kourtney, and best friend Malika Haqq, were present.\n\nJenner reportedly flew to Cleveland Wednesday morning and other family members were expected to arrive Thursday.\n\nThompson did not attend the Cavaliers practice Thursday afternoon.\n\nNo Tristan Thompson at Cavs practice today #3Cavs — Ben Axelrod (@BenAxelrod) April 12, 2018\n\nKardashian previously said she planned to give birth in Cleveland. She and Thompson began dating in September 2016, shortly before Thompson's former girlfriend, Jordan Craig, gave birth to his son.\n\nDéjà vu surfaced Tuesday, when video of Thompson appearing to cheat on Kardashian surfaced on TMZ. One video allegedly took place earlier this week, when the Cavaliers were in New York City to play the Knicks Monday night. Thompson can be seen taking an Instagram model back to his hotel.\n\nMORE | Report: Khloe Kardashian is 'devastated' following Tristan Thompson cheating allegations\n\nAnother video shows Thompson with three women in a Washington D.C. club. After kissing one woman, he appears to rub his head between another woman's breasts.\n\nJust hours ago, People Magazine published a statement from a Kardashian family friend which said in part:\n\nThe first reaction was that this was a set-up: that the girl in the club totally threw herself at him, made sure it was caught on tape, tipped off {photographers) to catch her going into the hotel, and then basically made sure they caught her leaving.\n\nPeople also reports Khloe plans to fly herself and her and Thompson's daughter back to Los Angeles as soon as possible, after previously planning to stay in Cleveland.\n\nEarlier this week, the Los Angeles OB/GYN who assisted Kylie Jenner's pregnancy and labor posted a photo while visiting a hospital, sparking speculation that Kardashian was preparing to give birth soon.\n\nThe doctor, identified as Dr. Thais Aliabadi, posted a photo of herself Saturday night. She blurred out the hospital's name but noted she was traveling for work. The photo has since been deleted, though it's still visible on TMZ.\n\nOn Monday morning, Kardashian posted a photo with Thompson to Instagram captioned, \"We are ready whenever you are little mama.\"\n\nA post shared by Khloé (@khloekardashian) on Apr 9, 2018 at 6:24am PDT\n\nThere are reports that the phones of people on the maternity ward are being checked to make sure no one is leaking information. WKYC has not been able to confirm this.\n\nThis is the second child of a Cavs players to be born in as many years at Hillcrest: J.R. Smith's wife gave birth to daughter Dakota at the hospital in January of 2017.\n\nMORE | Khloe Kardashian makes official pregnancy reveal with Tristan Thompson", "images": ["https://www.wkyc.com/content/logos/mobile/wkyc.png", "https://media.wkyc.com/assets/WKYC/images/537733849/537733849_1140x641.jpg"], "top_img": "https://media.wkyc.com/assets/WKYC/images/537733849/537733849_1140x641.jpg", "keywords": [], "authors": ["Author", "Published", "Am Edt April", "Updated", "Pm Edt April"], "canonical_link": "https://www.wkyc.com/article/entertainment/report-khloe-kardashian-gives-birth-to-baby-girl-tristan-thompson-at-hospital/95-536603273", "title": "Khloe Kardashian gives birth to baby girl; Tristan Thompson at Cleveland hospital for birth", "meta_data": {"viewport": "width=1170", "site": "wkyc.com", "fb": {"app_id": 145836432870387}, "og": {"site_name": "WKYC", "locale": "en_US", "url": "https://www.wkyc.com/article/entertainment/khloe-kardashian-gives-birth-to-baby-girl-tristan-thompson-at-cleveland-hospital-for-birth/95-536603273", "title": "Khloe Kardashian gives birth to baby girl; Tristan Thompson at Cleveland hospital for birth", "description": "Khloe Kardashian is officially a mom.", "type": "article", "image": {"identifier": "https://media.wkyc.com/assets/WKYC/images/537733849/537733849_1140x641.jpg", "width": 1140, "height": 641}, "article": {"published_time": "4/9/2018 3:21:13 PM"}}, "description": "Khloe Kardashian is officially a mom.", "category": "entertainment", "twitter": {"title": "Khloe Kardashian gives birth to baby girl; Tristan Thompson at Cleveland hospital for birth", "image": {"src": "https://media.wkyc.com/assets/WKYC/images/537733849/537733849_360x203.jpg"}, "card": "summary", "site": "WKYC", "description": "Khloe Kardashian is officially a mom.", "domain": "www.wkyc.com"}}, "movies": [], "publish_date": 1523301673.0, "source": "https://www.wkyc.com", "summary": ""}