{"url": "en.wikipedia.org/wiki/Efforts_to_impeach_Donald_Trump", "text": "Efforts to impeach Donald Trump have been proposed by various people and groups, who have asserted that President Donald Trump has engaged in impeachable activity during his presidency.[1][2] Talk of impeachment began before Trump took office.[3][4] Formal efforts were initiated by Representatives Al Green and Brad Sherman, both Democrats, in 2017, the first year of his presidency.[5][6] Grounds asserted for potential impeachment have included possible violations of the Foreign Emoluments Clause of the Constitution by accepting payments from foreign dignitaries; alleged collusion with Russia during the 2016 presidential election campaign; alleged obstruction of justice with respect to investigation of the collusion claim; and accusations of \"Associating the Presidency with White Nationalism, Neo-Nazism and Hatred\", which formed the basis of a resolution for impeachment brought on December 6, 2017.\n\nSince the Republicans controlled the House and the Senate during 2017 and 2018, the likelihood of impeachment during that period was remote.[7][8] A December 2017 resolution of impeachment failed in the House by a 58–364 margin.[9] The Democrats gained control of the House in 2019 and launched multiple investigations into Trump's actions and finances. Speaker Nancy Pelosi initially resisted calls for impeachment. In May 2019 she indicated that Trump's continued actions, which she characterized as obstruction of justice and refusal to honor Congressional subpoenas, might make an impeachment inquiry necessary. An increasing number of House Democrats and one Republican were requesting such an inquiry.\n\nIn December 2016, Democratic Senators Elizabeth Warren, Dick Durbin, Chris Coons, Ben Cardin, and Jeff Merkley introduced a bill that would require the president of the United States to divest any assets that could raise a conflict of interest, including a statement that the failure to divest such assets would constitute high crimes and misdemeanors \"under the impeachment clause of the U.S. Constitution.\"[3] Vanity Fair characterized this as a preemptive effort to lay the groundwork for a future impeachment argument.[3] Concerns had previously been expressed that Trump's extensive business and real estate dealings, especially with respect to government agencies in other countries, may violate the Foreign Emoluments Clause of the Constitution,[4] sparking debate as to whether that is the case.[10][11]\n\nImmediately after his inauguration, The Independent and The Washington Post each reported on efforts already underway to impeach Trump, based on what the organizers regard as conflicts of interest arising from Trump's ability to use his political position to promote the interests of \"Trump\"-branded businesses, and ongoing payments by foreign entities to businesses within the Trump business empire as a violation of the Foreign Emoluments Clause.[1][2] In March 2017, China provisionally granted 38 \"Trump\" trademark applications that were set to take permanent effect in 90 days, which were noted to come in close proximity to Trump making policy decisions favorable to China.[12]\n\nThe Washington Post further noted the creation of ImpeachDonaldTrumpNow.org by Free Speech For People and RootsAction, two liberal advocacy groups.[2] On February 9, Congressman Jerrold Nadler (D, NY) had filed a resolution of inquiry titled \"H.Con.Res. 5\" to force the Trump administration to turn over documents relating to potential conflicts of interest and to ties with Russia.[13] Some sources identified this as the first step in the process of impeaching Trump.[14][15] Fox News outlined two potential bases for impeachment, one being the Emoluments Clause and the other being complicity with Russian interference in the 2016 United States presidential election.[16] On March 21, it was widely reported that Congresswoman Maxine Waters tweeted \"Get ready for impeachment,\" which Waters explained was in reference to the allegations of collusion with Russian interference in the election.[17]\n\nOn January 17, 2019, new accusations involving Trump surfaced, claiming he instructed his long-time lawyer, Michael Cohen, to lie under oath surrounding Trump's involvement with the Russian government to erect a Trump Tower in Moscow.[18] This also sparked calls for an investigation and for the president to \"resign or be impeached\" should such claims be proven genuine.[19] The Mueller Report was released on April 18, 2019, and Robert Mueller himself made follow-up comments on May 29. The report reached no conclusion about whether Trump had committed criminal obstruction of justice. Mueller strongly hinted that it was up to Congress to make such a determination. Congressional support for an impeachment inquiry increased as a result.[20] As of June 4, 2019, the support in Congress for launching an impeachment inquiry is 57 House Democrats, 1 House Independent, 4 Senate Democrats, and 1 Senate Independent.[21]\n\nTimeline [ edit ]\n\nFebruary 2017 [ edit ]\n\nThe Impeach Trump Leadership PAC was started by California Democratic Party congressional candidate Boyd Roberts.[22]\n\nMay 2017 [ edit ]\n\nActions and revelations [ edit ]\n\nJames Comey on why he believes he was fired\n\nFollowing Trump's dismissal of FBI Director James Comey, multiple Democratic members of Congress discussed an \"impeachment clock\" for Trump, saying that he was \"moving\" toward impeachment and raising the future possibility of bringing forth articles of impeachment for obstruction of justice and criminal malfeasance, if proof of illegal activity were found.[23][24] Senator Richard Blumenthal of Connecticut stated in an interview: \"It may well produce another United States v. Nixon on a subpoena that went to United States Supreme Court. It may well produce impeachment proceedings, although we're very far from that possibility.\"[25]\n\nLater in May, news of Trump's disclosure of classified information to Russia led to further discussions about the possibility of impeachment, with Representative Maxine Waters (D-CA) in particular alluding to the possibility.[26]\n\nAt around the same time in May, the revelation that the president had asked Comey to drop the investigation into Michael Flynn led still more observers, including Senator Angus King (I-ME), to say that impeachment might be in the offing.[27]\n\nThe developments led Senator John McCain (R-AZ) to venture that matters had reached \"Watergate scope and size\".[28]\n\nPreparations for possible proceedings [ edit ]\n\nCongressman Al Green 's Floor Speech on the Impeachment of President Trump\n\nCongressman Luis Gutierrez : \"It is the Judiciary Committee in the House where impeachment begins.\"\n\nImpeachment proceedings begin with a resolution being introduced in the House of Representatives. The first two Representatives to publicly suggest such an action were Pramila Jayapal (D-WA)[29] and Al Green (D-TX).[30]\n\nTwo Republican Representatives, Justin Amash (R-MI) and Carlos Curbelo (R-FL), called for impeachment on the grounds that obstruction of justice charges against Trump were proven true.[31] Curbello was defeated in his bid for reelection in 2018,[32] but Amash was reelected, and following his reading of the redacted Mueller Report, reaffirmed his position, stating that the evidence supported the conclusion that Trump had committed impeachable offenses.[33]\n\nOn May 17, Representative Green made a call for impeachment on the house floor[34][35] and House Oversight Committee Chairman Jason Chaffetz (R-UT) announced that he was issuing subpoenas on the memo that FBI director James Comey wrote detailing possible obstruction of justice by the President.[36] On May 24, Green told CSPAN in an interview that he was drafting articles of impeachment and would shortly submit them as a privileged resolution, to begin the formal impeachment process.[37]\n\nHowever, some major Democratic figures have stressed the need for caution, patience and bipartisanship in any potential impeachment process.[38]\n\nAdministration officials have said that White House lawyers are indeed researching impeachment proceedings and how to deal with them.[39][40]\n\nIndependent counsel appointment [ edit ]\n\nOn May 17, former FBI Director Robert Mueller was appointed special counsel by Deputy Attorney General Rod Rosenstein, acting after the recusal of Attorney General Jeff Sessions, to lead a Special Counsel investigation to investigate Russian interference in the 2016 presidential election,[41] and any cover-up related to it by Trump or any White House officials.[42][43] According to sources close to the White House, the Trump administration is considering using various obscure legal means to slow down the investigation and undermine the special counsel.[44][45]\n\nJune 2017 [ edit ]\n\nFormer FBI Director James Comey agreed to testify before the Senate Intelligence Committee on June 8.[46] Some legal experts and politicians, such as Representative Eric Swalwell of California, argued that Trump's numerous comments in news interviews and on Twitter regarding the subjects Comey would testify on (such as whether or not Trump tried to improperly influence or coerce Comey and the reasons why Trump fired him) may well have voided the validity of an Executive Privilege claim in this instance.[47]\n\nOn June 7, an advance copy of Comey's prepared congressional testimony was submitted to the Senate Intelligence Committee[48] in which he said that the President attempted to persuade him to \"let go\" of any investigation into Michael Flynn on February 14.[49] He added that Trump requested his personal loyalty, to which Comey replied he would give his \"honest loyalty\" to the President.[50] Comey said Trump on several occasions inquired whether there were an investigation into the President himself and Comey replied each time there was not.[51] Comey states that Trump requested that he publicly declare this so that Trump's image could be improved, but Comey says he told the President he would need to have approval from the Attorney General's office for reasons of legality.[52]\n\nComey recounted his final conversation with President Trump on April 11:\n\nOn the morning of April 11, the President called me and asked what I had done about his request that I \"get out\" that he is not personally under investigation. I replied that I had passed his request to the Acting Deputy Attorney General, but I had not heard back. He replied that \"the cloud\" was getting in the way of his ability to do his job. He said that perhaps he would have his people reach out to the Acting Deputy Attorney General. I said that was the way his request should be handled. I said the White House Counsel should contact the leadership of DOJ to make the request, which was the traditional channel. He said he would do that and added, \"Because I have been very loyal to you, very loyal; we had that thing you know.\" I did not reply or ask him what he meant by \"that thing\". I said only that the way to handle it was to have the White House Counsel call the Acting Deputy Attorney General. He said that was what he would do and the call ended. That was the last time I spoke with President Trump.[50]\n\n\"Impeaching Donald John Trump, President of the United States, for high crimes and misdemeanors\" by Congressman Brad Sherman\n\nOn June 7, Congressman Al Green announced that Congressman Brad Sherman would join with him in drafting articles of impeachment against President Trump.[5] On June 12, Sherman began circulating an article of impeachment among his colleagues.[6] Sherman said: \"I'm not going to be deterred.\"[5] Green stated: \"In the spirit of keeping the republic, I have concluded that the president has obstructed justice and in so doing, the remedy for obstruction of justice is impeachment. The president will not be indicted while he is in office, and while there is some merit in talking about the judicial process, the impeachment process is the one that will bring him before the bar of justice.\"[5]\n\nFormer United States Attorney Preet Bharara said in a June 11 interview with ABC News that \"there's absolutely evidence to begin a case\" regarding obstruction of justice by Trump.[53] Bharara went on to note: \"No one knows right now whether there is a provable case of obstruction. [But] there's no basis to say there's no obstruction.\"[53]\n\nOn June 14, The Washington Post reported that Trump was being investigated by Special Counsel Robert Mueller for possible obstruction of justice relating to his actions in regard to the investigation into Russia.[54]\n\nJuly 2017 [ edit ]\n\nOn July 12, Congressman Sherman formally introduced in the House of Representatives an Article of Impeachment (H.Res. 438),[55] accusing the President of obstructing and impeding the investigation of justice, regarding the investigation of Russian interference in the 2016 presidential election.[56]\n\nThe Democrats in the House Judiciary committee demanded that hearings begin as soon as possible,[57] but the Republicans demurred, rewriting the request in favor of investigations into Hillary Clinton's emails.[citation needed]\n\nAugust–November 2017 [ edit ]\n\nRepresentative Steve Cohen introduced articles of impeachment in November 2017.\n\nIn August 2017, following controversial comments by Trump about the Unite the Right rally in Charlottesville, Virginia, Representative Steve Cohen announced that he would introduce articles of impeachment because Trump had \"failed the presidential test of moral leadership.\"[58][59]\n\nThere was a brief debate about impeaching the president before a privileged resolution introduced by Representative Al Green was withdrawn.[60][61] In late October, progressive activist hedge-fund manager Tom Steyer funded an impeachment campaign that quickly garnered 1.3 million signatures.[62] By mid-November, the campaign had garnered over 1.9 million signatures.[63] As of December 2018, the campaign's signature count is over 6.5 million.[64]\n\nOn November 15, six Democrats including Cohen introduced H.Res. 621 with five articles of impeachment.[65] Cohen said that Trump's \"train of injuries to our Constitution must be brought to an end.\"[66] The five accusations were \"obstruction of justice,\" \"violation of the foreign emoluments clause,\" \"violation of the domestic emoluments clause,\" \"undermining the independence of the federal judiciary\" and \"undermining the freedom of the press.\"[65] Many Democrats opposed this action.[66]\n\nA survey showed nearly 40% of American citizens were in favour of impeachment (up from 30% in February), with almost 75% of Democrats and 7% of Republicans supporting possible impeachment, although Trump's approval rating among Republicans fell from 91% in June to 79% in November.[65] For impeachment to occur, a simple majority is needed in the House and for conviction/removal from office to occur a two-thirds majority is needed in the Senate. At the time both the House and Senate were controlled by Republicans. At this date, 12 Republican Senators had individually indicated a willingness to take action against Trump's presidency: if supported by all 48 Democratic Senators, 8 more Republican Senators would be needed to successfully remove the President.[65]\n\nDecember 2017 and January 2018 House votes [ edit ]\n\nOn December 6, a second privileged resolution on articles of impeachment, H.Res. 646, was brought on the floor by Representative Al Green, Democrat of Texas. The resolution listed two articles, i.e. proposed reasons for impeachment: \"Associating the Presidency with White Nationalism, Neo-Nazism and Hatred\" and \"Inciting Hatred and Hostility.\"[67] House Majority Leader Kevin McCarthy, Republican of California, moved for the resolution to be defeated (\"tabled\"), which was agreed to by a 364–58 vote with four members voting present.[9]\n\nAmong Republicans, 238 voted to table the articles of impeachment and one did not vote. Among Democrats, 126 voted to table the articles of impeachment, 58 voted against tabling the articles of impeachment, four voted \"present\" and five did not vote.[68]\n\nGreen's effort did not receive the support of Democratic leadership. House Minority Leader Nancy Pelosi and Minority Whip Steny Hoyer issued a statement saying that \"[l]egitimate questions have been raised about [Trump's] fitness to lead this nation,\" but that \"[n]ow is not the time to consider articles of impeachment\" given ongoing investigations by congressional committees as well as the investigation by the special counsel.[9]\n\nOn January 19, 2018, Green brought up the resolution a second time. On this attempt his motion was defeated by a vote of 355–66. 234 Republicans and 121 Democrats voted against the motion. All the votes for the motion were from Democrats: three Democrats voted present and three Republicans and three Democrats did not cast a vote.[69][70]\n\n2018 mid-term elections [ edit ]\n\nThe matter became an issue, primarily for Republicans, in the midterm elections,[71][72] with both conservatives and the president himself warning of dire consequences if he is impeached.[73][74] The Democrats won control of the House, and they have promised to launch investigations into various actions by Trump and his administration, but Democratic leaders were reported as reluctant to address impeachment, at least until after the report of the Special Counsel is released.[75]\n\nPost-2018 mid-term elections [ edit ]\n\nOn March 11, 2019, Nancy Pelosi said, \"I'm not for impeachment, Impeachment is so divisive to the country that unless there's something so compelling and overwhelming and bipartisan, I don't think we should go down that path, because it divides the country. And he's just not worth it. No. I don't think he is. I mean, ethically unfit. Intellectually unfit. Curiosity wise unfit. No, I don't think he's fit to be president of the United States.\" She then scolded herself for \"coming across too negatively\".[76][77][78]\n\nWith the Democrats in control of the House, and with a direct impeachment inquiry deemed somewhat toxic,[79] the work of investigations into Trump's possible crimes were divided into several committees while waiting for some outside force, such as the Mueller probe or the Southern District to force the Democratic leadership's hands.\n\nHearings and investigations: December 2018–February 2019 [ edit ]\n\nFebruary 27: Michael Cohen hearings [ edit ]\n\nOn February 27, 2019, Cohen publicly testified before the House Oversight committee on possible high crimes and misdemeanors committed by President Trump both prior and after taking office.[91][92] His testimony occurred under oath, which also means additional criminal charges of perjury could be filed if it were proven that he lied.[93] In his opening remarks, obtained in advance by The New York Times, he expresses his regret and shame at lying to Congress and working for a \"racist\" and a \"con man\", and accuses Trump of numerous lies and illegal actions. White House officials dismissed the credibility of his testimony in advance, calling him a \"disgraced felon\" and \"convicted liar\".[94]\n\nDuring his testimony, Cohen described how he protected Trump from potential scandals during the 2016 campaign through payoffs.[95] He stated that he and National Enquirer owner David Pecker conspired to \"catch and kill\" potentially damaging stories about Trump and that Trump also was concerned that the allegations by Stormy Daniels and other women would result in the general public being reminded of a tape which aired on Access Hollywood at the beginning of October 2016 where Trump was caught a decade prior discussing how he groped, grabbed and kissed women without their permission.[95] He also stated that Trump would inflate his personal wealth for financial benefits, such as a failed bid to buy the Buffalo Bills,[96] and that he and Trump conspired with Trump Organization CFO Allen Weisselberg and the President's son Donald Trump Jr. to organize more payoffs in 2017.[95] Cohen also showed lawmakers a check for $35,000 which the President wrote to him on August 1, 2017, and stated that it was used as a part of a hush money payoff to Stormy Daniels as well.[95]\n\nThe testimony implicated the President as committing a minimum of 11 impeachable offenses.[97][98]\n\nHearings and investigations: February–April 2019 [ edit ]\n\nFebruary 28: Cohen testifies in private before the House Intelligence Committee.\n\nCohen testifies in private before the House Intelligence Committee. March 3: House Judiciary Committee Chairman Jerrold Nadler announces requests for over sixty documents from the White House and other sources in his overisight investigations. [99]\n\nHouse Judiciary Committee Chairman Jerrold Nadler announces requests for over sixty documents from the White House and other sources in his overisight investigations. March 4: The House Judiciary issues requests to 81 people for documents and testimony in a \"pre-impeachment\" investigation into obstruction of justice and other alleged threats to the rule of law. [100] [101] [100]\n\nThe House Judiciary issues requests to 81 people for documents and testimony in a \"pre-impeachment\" investigation into obstruction of justice and other alleged threats to the rule of law. March 6: Cohen finishes testimony at the HIC. [102]\n\nCohen finishes testimony at the HIC. March 22: Mueller Report is delivered to Attorney General William Barr. [103]\n\nMueller Report is delivered to Attorney General William Barr. March 24: According to Barr, the investigation \"did not find evidence to charge other Americans (including Trump associates) in conspiring with Russia in 2016,\" and did not come to a conclusion about obstruction of justice. [103]\n\nAccording to Barr, the investigation \"did not find evidence to charge other Americans (including Trump associates) in conspiring with Russia in 2016,\" and did not come to a conclusion about obstruction of justice. March 27: While the Congress is waiting for the Mueller report to drop, Rep. Rashida Tlaib (D-MI) introduces another resolution, H.Res. 257, calling for a formal impeachment investigation of the President, [104] which was referred to the Committee on Rules.\n\nWhile the Congress is waiting for the Mueller report to drop, Rep. Rashida Tlaib (D-MI) introduces another resolution, H.Res. 257, calling for a formal impeachment investigation of the President, which was referred to the Committee on Rules. April 18: The Mueller Report is made public. In it, Mueller lists multiple actions by Trump that could be considered obstruction of justice, but chooses for several reasons not to accuse the president of any crime, indicating that Congress should make that decision.[105][106]\n\nMueller Report and impeachment debate [ edit ]\n\nA Department of Justice spokesperson called Nadler's subpoena \"premature and unnecessary,\" detailing that the publicly released version of the report had \"minimal redactions\" and that Barr had made arrangements for Nadler and other lawmakers to review a version of the final report with fewer redactions.[107][108]\n\nHouse Majority Leader Steny Hoyer stated that \"Based on what we have seen to date, going forward on impeachment is not worthwhile at this point,\" \"[109] while Speaker Nancy Pelosi was more noncommittal, telling the majority caucus: \"We will update you on the next steps that must be taken. The Caucus held a conference call on April 22 to discuss the matter.[110] It was decided to go full bore on the investigations and deal with actual impeachment later.[111]\n\nAfter reading the report, Rep. Justin Amash (R-MI) in May 2019 became the first Republican member of Congress to call for Trump's impeachment, stating that Trump had engaged in \"impeachable conduct\". Amash was also critical of Attorney General Barr, stating that he felt Barr had deliberately misrepresented the contents of the report.[112] Shortly thereafter, former long-serving Republican Congressman Tom Coleman (R-MO) also called for Trump's impeachment.[113] In addition, conservative attorney George Conway, husband of Kellyanne Conway, called for Trump's impeachment.[114]\n\nThe Mueller Report was released on April 18, 2019, and Robert Mueller himself made follow-up comments on May 29. The report described ten actions by the president that could have been construed as obstruction of justice. Investigators reached no conclusion about whether those actions amounted to a crime, indicating that the evidence they had obtained presented \"difficult issues\" that prevented them from \"conclusively determining\" that Trump committed no criminal obstruction.[115] Mueller added, \"The Constitution requires a process other than the criminal justice system to formally accuse a sitting president of wrongdoing,\" which was taken as meaning that it would be up to Congress to make such a determination.[116] Congressional support for at least an impeachment inquiry increased as a result.[20] Near the end of April 2019, the hashtag #RepublicansForImpeachment went viral, on one day being used an average of every 3.8 seconds; the hashtag was created by a group seeking Republican grassroots support for impeachment \"for us to have a chance of conviction in the Senate\".[117]\n\nImpeachment resolutions in the 116th Congress [ edit ]\n\nHearings and investigations: April–July 2019 [ edit ]\n\nMueller hearings [ edit ]\n\nOn July 17, 2019, Robert Mueller and several of his aides are scheduled to testify about the investigation's consequences before both the House Judiciary and Intelligence committees. There will be both open and closed sessions of each.\n\nSubpoenas and lawsuits [ edit ]\n\nSeveral committees in the House of Representatives have issued subpoenas for materials and testimonies from people and institutions within the Trump administration as well as external entities. The President's personal lawyers have issued letters saying that all such requests will be ignored or opposed [121] and have filed several lawsuits to prevent release of any information to Congress.\n\nUnredacted version of Mueller report [ edit ]\n\nThe House Judiciary Committee has subpoenaed the unredacted Mueller report and Attorney General Barr has rebuffed this,[136] leading to a contempt citation from the committee. A lawsuit is also contemplated.[137]\n\nTrump et al v. Mazars et al [ edit ]\n\nThe House Oversight Committee issued a subpoena to the Mazars accounting firm for Trump's financial information from before his election to the presidency. The President and his lawyers have tried to delay or prevent this information from getting to the committee by seeking a court injunction against both the committee's leadership and Mazars.[138][139]\n\nOn April 23, 2019 U.S. District Judge Amit Mehta set a May 14 date for the preliminary hearing,[140] although several weeks later, he decided that the entire suit would be heard on that date.[141] May 20, Mehta ruled that accounting firm Mazars had to provide its records of Donald Trump's accounts from before his presidency to the House Oversight Committee in response to their subpoena.[142] In a 41-page opinion, he asserted that Congress has the right to investigate potential illegal behavior by a president, including actions both before and after the president assumed office.[143] The ruling was appealed by Trump's personal legal team[143] and briefs for such were due by no later than July 12, 2019,[144] when oral arguments were scheduled.[145]\n\nTrump's attorneys filed an appeal brief with the Court of Appeals for the DC Circuit on June 10, 2019, contending that Congress may not investigate a president for criminal activities except in impeachment proceedings. The brief asserted Congress's investigation was an \"exercise of law-enforcement authority that the Constitution reserves to the executive branch.\"[146] In an opinion piece two days later, attorneys George Conway and Neal Katyal called the brief \"spectacularly anti-constitutional,\" arguing that it places the president above the law while noting that Congress routinely investigates criminal matters.[147]\n\nTrump et al v. Deutsche Bank et al [ edit ]\n\nThe House Financial Services and Intelligence committees issued subpoenas to Deutsche Bank and Capital One bank asking for financial records relating to Trump, his adult children, and his businesses. Trump's personal attorneys tried to delay or prevent the information from being given to the committees by getting a court injunction. Although the defendants are Deutsche Bank and Capital One bank, U.S. District Judge Edgardo Ramos permitted representatives of the House committees to take part.[148] Ramos canceled a May 9, 2019 preliminary hearing when the committees agreed to hand over \"substantial portions\" of the subpoenas to the plaintiffs.[149] On May 22 Ramos affirmed the validity of the subpoenas. Trump's lawyers had asked Ramos to quash the subpoenas, but Ramos said such a request was \"unlikely to succeed on the merits.\"[150] The committees later reached an agreement with Trump's lawyers to delay enforcement of the subpoenas while an appeal is filed, provided the appeal is filed in an \"expedited\" manner.[151] On May 28, Ramos granted Trump's attorneys their request for a stay so they could pursue an expedited appeal through the courts.[152] and briefs for it are due by no later than July 12, 2019.[144] On June 18th, The Trump legal team filed a brief similar to the one in the Mazars case.[153]\n\nOral Arguments are scheduled for August 2019.[145]\n\nSuits filed by Trump opponents [ edit ]\n\nMany of the lawsuits filed against Trump ask for declaratory relief. A court's declaratory judgment compels no action as it simply resolves a legal question. A declaration that the president has accepted emoluments would make the work of House Managers easier in an impeachment.[154] Blumenthal v. Trump asks for declaratory relief as to emoluments. In CREW and National Security Archive v. Trump and EOP, a declaratory finding that the administration willfully failed to retain records would support a charge of obstruction of justice.[155] The CREW v. Trump case was dismissed in December 2017 for lack of standing.[156] Blumenthal v. Trump, on the other hand, was not.[157]\n\nStatements by Trump [ edit ]\n\nDuring an August 2018 Fox & Friends interview, Trump was asked about the possible ramifications of him being potentially impeached after his ex-lawyer Michael Cohen pleaded guilty to charges and implied he had done so by Trump's direction. Trump stated, \"I don't know how you can impeach someone who's done a great job. I tell you what, if I ever got impeached, I think the market would crash, I think everybody would be very poor. Because without this [points at his head, referring to his brain and his thinking], you would see numbers that you wouldn't believe in reverse.\"[158]\n\nIn a January 2019 tweet, Trump expressed bewilderment at the possibility, saying among other things, \"How do you impeach a president who [...] had the most successful first two years of any president?\"[159]\n\nIn late April 2019, Trump vowed to take a possible impeachment to the Supreme Court,[160] even though the Supreme Court has twice ruled that the judiciary has no power over the process.[161]\n\nOn May 22, Trump walked out of a planned White House meeting about infrastructure with Pelosi and Majority Leader Chuck Schumer, because he said Pelosi had earlier that morning met with the House Democratic Caucus \"to talk about the I-word\" and because Pelosi had accused him of carrying out a cover-up.[162] He said he would refuse to work with the Democrats on infrastructure or anything else until they end all investigations into him.[163]\n\nOn May 30, 2019, Trump stated, \"I can't imagine the courts allowing [his impeachment].\"[164]\n\nStatements by Democrats [ edit ]\n\nIn May 2019 House Speaker Nancy Pelosi suggested that Trump is goading House Democrats to impeach him \"to solidify his base.\"[165][166] She said that his recent actions are \"almost self-impeaching... he is every day demonstrating more obstruction of justice and disrespect for Congress' legitimate role to subpoena.\"[167] She added, \"That’s where he wants us to be...The White House is just crying out for impeachment” to divide Democrats and distract from Trump's policies.[168][169][170][171]\n\nBy May 2019, an increasing number of Democrats and one Republican member of Congress were concluding that impeachment, or at least an impeachment inquiry, could be the only alternative available to Congress should Trump continue to \"stonewall\" their demands for information and testimony.[172][173]\n\nSome pundits and political figures have argued that Trump actually wants to be impeached, in order to remain the focus of national attention and obtain a perceived political advantage.[174][165][175][176] Juan Williams suggested that Trump would consider being impeached by the House but acquitted by the Senate to be a victory that would allow him to claim that accusations against him were false.[175] Greg Gutfeld suggested that Trump might feel that it would actually add to his legacy, and to be impeached while the economy was doing well would elevate him to the status of folk hero.[175] Rich Lowry, writing for Politico, has argued that Trump would relish the drama of an impeachment fight, and that Trump is temperamentally better suited to engage in such a conflict than to engage in governance.[176]\n\nSymbolic municipal resolutions [ edit ]\n\nCity councils that have made formal resolutions calling for the impeachment of President Trump include those in the San Francisco Bay Area cities of Alameda, Berkeley, Oakland and Richmond[177][178][179] as well as the city of Los Angeles.[180] On the East Coast, the Cambridge, Massachusetts city council passed a policy order to support a House resolution to investigate Emoluments Clause conflicts.[181]\n\nPublic opinion polling on impeachment [ edit ]\n\nPublic opinion is a key factor in impeachment proceedings, as politicians including those in the House of Representatives look to opinion polls to assess the tenor of those they represent.[182][183][184] Any action would have to be based on the requisite legal grounds for impeachment, but such action is more likely to be taken in the face of support from public opinion.[182][183][184]\n\nAs of January 26, 2017, Public Policy Polling reported that 35% of voters supported the impeachment of President Trump, while 50% opposed.[185] By the following week, after the controversial rollout of Executive Order 13769, which barred people from seven majority-Muslim countries from entering the United States, support for impeachment had grown to 40%.[186] The following week, support for impeachment reached 46%, matching opposition to impeachment.[187]\n\nIn May 2017, after the firing of James Comey, for the first time more Americans supported impeaching Trump (48%) than opposed impeaching Trump (41%), with 11% not sure.[188] At the beginning of August 2017, one poll showed that number falling substantially with 53% of people being opposed to impeachment and 40% in favor, according to PRRI studies,[189] but by the end of August 2017 and following political fallout from the Unite the Right rally in Charlottesville, Virginia, 48% of people were again in favor of impeachment and 41% were opposed.[190] In December 2017, Public Policy Polling conducted the first public poll showing majority support for impeachment (51% support, 42% oppose, 7% not sure).[191]\n\nIn March 2019, a CNN Poll found that 36% of respondents support the impeachment.[192]\n\nIn May 2019, a NBC/WSJ poll with Republican pollster Bill McInturff found that 17% thought enough evidence existed for the House to begin impeachment hearings, 32% wanted Congress to continue investigating and decide on impeachment later, and 48% said that the House should not pursue impeachment.[193][194] A Reuters/Ipsos poll taken in the same month found 45% of Americans supported impeachment, while 42% opposed.[195]\n\nOn June 16, 2019, Trump tweeted, “Almost 70% in new Poll say don’t impeach.”[196] According to NBC News, Trump was apparently referring to their poll, according to which twenty-seven percent of Americans believe that there is now sufficient evidence to begin impeachment hearings.[197] Later that day, Fox News released a poll showing 50% of registered voters supported Trump's impeachment, while 48% opposed impeachment.[198]\n\nSee also [ edit ]\n\nReferences [ edit ]", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/James_Comey_on_why_he_believes_he_was_fired_%28C-SPAN%29.webm/220px--James_Comey_on_why_he_believes_he_was_fired_%28C-SPAN%29.webm.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/d/df/2017_July_-_Impeaching_Donald_John_Trump%2C_President_of_the_United_States%2C_for_high_crimes_and_misdemeanors.pdf/page1-220px-2017_July_-_Impeaching_Donald_John_Trump%2C_President_of_the_United_States%2C_for_high_crimes_and_misdemeanors.pdf.jpg", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/bf/Stevecohen.jpeg/170px-Stevecohen.jpeg", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/43/Congressman_Al_Green%27s_Floor_Speech_on_the_Impeachment_of_President_Trump.webm/220px--Congressman_Al_Green%27s_Floor_Speech_on_the_Impeachment_of_President_Trump.webm.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/32px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/84/Trump-Inauguration2017-1050707_%2832392343466%29.jpg/1200px-Trump-Inauguration2017-1050707_%2832392343466%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/36/Seal_of_the_President_of_the_United_States.svg/70px-Seal_of_the_President_of_the_United_States.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/0/01/A_coloured_voting_box.svg/28px-A_coloured_voting_box.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/84/Trump-Inauguration2017-1050707_%2832392343466%29.jpg/220px-Trump-Inauguration2017-1050707_%2832392343466%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/bb/Rep._Gutierrez_%27It_is_the_Judiciary_Committee_in_the_House_where_impeachment_begins.%27_%28C-SPAN%29.webm/220px--Rep._Gutierrez_%27It_is_the_Judiciary_Committee_in_the_House_where_impeachment_begins.%27_%28C-SPAN%29.webm.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/Donald_Trump_Signature.svg/150px-Donald_Trump_Signature.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/53/Donald_Trump_official_portrait_%28cropped%29.jpg/75px-Donald_Trump_official_portrait_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/Johnny-automatic-scales-of-justice.svg/32px-Johnny-automatic-scales-of-justice.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/84/Trump-Inauguration2017-1050707_%2832392343466%29.jpg/1200px-Trump-Inauguration2017-1050707_%2832392343466%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Efforts_to_impeach_Donald_Trump", "title": "Efforts to impeach Donald Trump", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.11", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/84/Trump-Inauguration2017-1050707_%2832392343466%29.jpg/1200px-Trump-Inauguration2017-1050707_%2832392343466%29.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}