{"url": "https://www.vogue.com/article/beyonce-grammys-2018-dress-story-behind", "text": "Loading View on Instagram\n\nBeyoncé is on a roll. The music legend shut down the Grammys tonight when she arrived midway, joining husband Jay-Z in the audience, and given her gown, it was easy to see why. Dressed in all black by Nicolas Jebran and accented by a single white rose, the star smartly capped off a week filled with great looks chosen with her stylist, Marni Senofonte. Though the visual appeal of her latest look is instantly clear, the story behind it may come as a surprise.\n\nAccording to Jebran, the inspiration for the dress was rooted in the traditions of social justice. “The idea was to create a moment, a memorable design with meaning because it’s more than just a gown,” shared the designer via email from Paris. After he was contacted by Senofonte to create a custom piece for the event, Jebran sought to innovate. Though he’s worked with Beyoncé and her team in the past, creating one of a kind looks for appearances at the Video Music Awards and other events, the 2018 Grammys required something special.\n\nAdvertisement 1 / 4\n\nCiting the 1960s Black Panther movement as a reference point—one that Beyoncé has revisited multiple times, from her Super Bowl 50 performance to Lemonade—Jebran aimed to capture the spirit of vitality with his creation. It took more than 100 hours to craft the lengthy black velvet gown from start to finish, and Jebran and his team focused on including elements that embodied strength. “I love the dramatic slits and touches of sheer [fabric],” said Jebran, who kept the details unexpected throughout. “My favorite element [was] the bold, broad shoulders because they symbolize power.”\n\nWith its thigh-high slits, crystal embellishment, and oversize fascinator, the look was an arresting grand finale to the series of outfits Beyoncé has worn throughout Grammys weekend. Accessorized with Lorraine Schwartz jewels and a pair of cat-eye shades from Alain Mikli, it hit all the right notes. Making waves at Roc Nation’s pre-Grammys brunch yesterday, she pulled out a custom metallic navy Ralph & Russo gown with layers of Lorraine Schwartz diamonds before switching it up at Clive Davis’s gala that same night in a ruffled black silk crepe and velvet number by Azzi and Osta couture. It came complete with a transparent skirt that showed off her sculpted legs and an aptly named 'Carter' beret by Eugenia Kim.\n\nLoading View on Instagram\n\nThree statement gowns in less than 24 hours might sound like a lot of looks, but for the designers behind each outfit, nothing beats the Queen Bey seal of approval. “We feel so many emotions but most importantly [we’re] honored. We are filled with happiness and love seeing her smile and glow wearing our design,” said Assaad Osta. The sentiment was echoed by Jebran, who still has a “pinch me” moment no matter how many times he designs for the superstar: “Although I’ve dressed Beyoncé in the past, each time still feels like the first—I am honored that she feels confident in my designs.”\n\nSee every look from the 2018 Grammy Awards red carpet:", "images": ["https://collector-PX0lizzs6W.perimeterx.net/api/v1/collector/noScript.gif?appId=PX0lizzs6W", "https://www.vogue.com/wp-content/themes/vogue/images/logo_vogue.svg", "https://assets.vogue.com/photos/5a6e8a0e8e4ddb686de2c01d/16:9/pass/beyonce-grammys-social-tout.jpg"], "top_img": "https://assets.vogue.com/photos/5a6e8a0e8e4ddb686de2c01d/16:9/pass/beyonce-grammys-social-tout.jpg", "keywords": [], "authors": ["Janelle Okwodu"], "canonical_link": "https://www.vogue.com/article/beyonce-grammys-2018-dress-story-behind", "title": "Beyoncé’s 2018 Grammy Awards Look Was Inspired by the Black Panthers", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=no, width=device-width, initial-scale=1, maximum-scale=1", "copyright": "Copyright (c) Condé Nast 2019", "og": {"site_name": "Vogue", "url": "https://www.vogue.com/article/beyonce-grammys-2018-dress-story-behind", "title": "Why Beyoncé’s Epic Grammys Look Was Inspired by the Black Panthers", "description": "The designers behind the superstar’s epic Grammy night looks share their inspirations.", "image": "https://assets.vogue.com/photos/5a6e8a0e8e4ddb686de2c01d/16:9/pass/beyonce-grammys-social-tout.jpg", "type": "article"}, "twitter": {"site": "@voguemagazine", "card": "summary_large_image", "domain": "www.vogue.com", "title": "Why Beyoncé’s Epic Grammys Look Was Inspired by the Black Panthers - Vogue", "image": {"src": "https://assets.vogue.com/photos/5a6e8a0e8e4ddb686de2c01d/16:9/pass/beyonce-grammys-social-tout.jpg"}, "creator": "@voguemagazine", "description": "The designers behind the superstar’s epic Grammy night looks share their inspirations."}, "apple-itunes-app": "app-id=1087973225, app-argument=https://www.vogue.com/article/beyonce-grammys-2018-dress-story-behind, affiliate-data=ct=smart-banner&pt=45076", "description": "The designers behind Beyoncé’s epic 2018 Grammy Awards looks share their inspirations and how the singer pulled off the fearless styles.", "keywords": "Fashion,Celebrity Style,Beyoncé,Grammy Awards,mobileAppReadyTrue", "news_keywords": "Fashion,Celebrity Style,Beyoncé,Grammy Awards,mobileAppReadyTrue", "articleSection": "Fashion", "article": {"publisher": "http://www.facebook.com/vogue"}}, "movies": [], "publish_date": 1517194483.469, "source": "https://www.vogue.com", "summary": ""}