{"url": "https://www.metacritic.com/feature/tv-premiere-dates", "text": "TUE / September 3\n\nGreenleaf Trailer Drama OWN, 10p\n\nMayans M.C. Drama 10p\n\nWED / September 4\n\nHulu's new 1990s-set drama series is based on the true origin story of the legendary New York rap outfit Wu-Tang Clan and comes from Alex Tse (SuperFly) and Wu-Tang's own RZA. The latter will be played in the series by Moonlight's Ashton Sanders, while Shameik Moore, Siddiq Saunderson (playing Ghostface Killah), Marcus Callender, Zolee Griggs, and Erika Alexander fill out the cast. Three episodes stream today, with the remaining seven arriving weekly.\n\nFRI / September 6\n\n▣ Good Talk With Anthony Jeselnik Talk 11p\n\nThe comedian interviews fellow stand-ups, including Kumail Nanjiani, Natasha Leggero, Tig Notaro, and Nick Kroll.\n\nTUE / September 10\n\nMr. Mercedes Drama DirecTV/AT&T\n\nWED / September 11\n\nNFL: The Grind Reality/Sports Epix, 9p\n\nTHU / September 12\n\nMr. Inbetween Comedy/Drama 10p\n\nThis Close Drama/Comedy Sundance, midnight ET\n\nFRI / September 13\n\nRed Bull Peaking Reality/Sports 9p\n\nSUN / September 15\n\nAurora Teagarden Mysteries: tbd Drama HMM, 9p\n\n▣ Country Music Documentary/Music 8p\n\nKen Burns chronicles the history of country music in an 8-part, 16-hour miniseries. Episodes air nightly from Sunday-Wednesday both this week and next.\n\nMON / September 16\n\nDancing With the Stars Reality competition 8p\n\nTUE / September 17\n\nThe American Game Documentary/Sports ESPN, tbd\n\nEleven-episode series (airing weekly on Tuesdays) examines the history of college football.\n\nConan Without Borders: Ghana Comedy special TBS, 10p\n\nWED / September 18\n\nAmerican Horror Story: 1984 Drama/Horror 10p\n\nThis season's cst includes Emma Roberts, Gus Kenworthy, Billie Lourd, Cody Fern, Angelica Ross (Pose), John Carroll Lynch, Matthew Morrison, and Leslie Grossman—but likely not Sarah Paulson.\n\nTHU / September 19\n\nThe Deed: Chicago Reality CNBC, 10p\n\nFive Day BIz Fix Reality CNBC, 9p\n\nThe Greatest Documentary/Sports ESPN, tbd\n\nFRI / September 20\n\nThe long-running web series—a low-budget talk-show spoof featuring a clueless Zach Galifianakis interviewing major celebrities—comes to Netflix for a movie produced by Funny or Die and directed by Ferns co-creator Scott Aukerman. The film finds Galifianakis (who is likely #1 on the call sheet) heading out on a road trip to \"restore his reputation\" by interviewing even more A-listers (whose identities have not been confirmed but are rumored to include David Letterman, Bradley Cooper, and Keanu Reeves).\n\nDisenchantment Animation/Comedy\n\nSUN / September 22\n\n71st Annual Primetime Emmy Awards Live event 8p ET\n\nAurora Teagarden Mysteries: tbd Drama HMM, 9p\n\nThe Circus News 8p\n\nMON / September 23\n\n9-1-1 Drama 8p\n\n▣ All Rise Trailer Drama 9p\n\nA Los Angeles-set legal procedural that examines all aspects of the criminal court system, from judges and jurors to DAs and baliffs, All Rise stars Marg Helgenberger, Simone Missick, Jessica Camacho, and Wilson Bethel. The drama comes from Greg Spottiswood, who previously created the Canadian shows Remedy and King.\n\nOnce a TV lawyer, always a TV lawyer. Jimmy Smits returns to the network where he first rose to fame (on late-1980s hit L.A. Law) for a new legal drama that finds him playing a top Memphis attorney who asks his estranged daughter (Caitlin McGee) to join his firm after her mother suddenly passes away. The series comes from Dean Georgaris (The Brave) and also stars Michael Luwoye, Scott Shepherd, and Barry Sloane.\n\nThe latest CBS sitcom from Chuck Lorre stars Billy Gardell (the titular Mike of Lorre's previous CBS comedy Mike & Molly) as the titular Bob, a \"middle-aged sock businessman from Detroit\" who suffers a heart attack. When he recovers, he immediately falls in love with his nurse, a Nigerian immigrant named Abishola (Folake Olowofoyeku), and he'll do anything to win her over. Christine Ebersole and Matt Jones also star. Lorre, comedian Gina Yashere, frequent Lorre collaborator Eddie Gorodetsky, and Al Higgins (who previously teamed with Lorre on the Netflix series The Kominsky Method) are the credited series creators.\n\nBull Drama 10p\n\nThe Good Doctor Drama 10p\n\nThe Neighborhood Comedy 8p\n\n▣ Prodigal Son Trailer Drama 9p\n\nOne of three shows picked up this season for television's busiest producer, Greg Berlanti, this darkly comedic crime procedural centers on a brilliant young NYPD criminal psychologist (Tom Payne) whose father (Michael Sheen) was a notorious serial killer. Bellamy Young and Lou Diamond Phillips also star. The series comes from Chuck writer Chris Fedak and Blunt Talk scribe Sam Sklaver.\n\nThe Voice Reality competition 8p\n\nTUE / September 24\n\nblack-ish Comedy 9:30p\n\nBless This Mess Comedy 8:30p\n\nThe Conners Comedy 8p\n\n▣ Diego Maradona Documentary/Sports 8p\n\nAsif Kapadia (Amy) directs this look at the Argentine soccer legend.\n\n▣ Emergence Trailer Drama 10p\n\nThis conspiracy thriller comes from Michele Fazekas and Tara Butters, who previously created the CW series Reaper and short-lived ABC drama Kevin (Probably) Saves the World. Allison Tolman (Fargo) heads the cast as a police chief who discovers an amnesiac child (Alexa Swinton) at the scene of a mysterious accident. Clancy Brown, Donald Faison, Zabryna Guevara, and Owain Yeoman also star. The pilot was actually developed by NBC, but that network passed on the series after failing to find an open slot for it, and ABC (which produces the show anyway) quickly picked it up.\n\nEmpire Drama 9p\n\nFBI Drama 9p\n\n▣ mixed-ish Trailer Comedy 9p\n\nThe second spinoff from ABC's comedy hit black-ish (following grown-ish, which airs on Freeform) is a prequel centering on a young version of Tracee Ellis Ross' character Rainbow Johnson in the 1980s, when she grew up in a suburban mixed-race family after her parents moved from a hippie commune to a neighborhood with better schools. Arica Himmel plays the young Bow and Tika Sumpter plays her mother, while Mark-Paul Gosselaar (replacing the originally cast Anders Holm) portrays her father. Weirdly, mixed-ish will lead into the returning black-ish on Tuesday nights rather than the other way around.\n\nNCIS Drama 8p\n\nNCIS: New Orleans Drama 10p\n\nNew Amsterdam Drama 10p\n\nThe Resident Drama 8p\n\nThis Is Us Drama 9p\n\nWED / September 25\n\nChicago Fire Drama 9p\n\nChicago Med Drama 8p\n\nChicago P.D. Drama 10p\n\nThe Goldbergs Comedy 8p\n\nIt's Always Sunny in Philadelphia Comedy 10p\n\nThe Masked Singer Reality competition 8p\n\nSpecial two-hour premiere.\n\nModern Family Comedy 9p\n\nSchooled Comedy 8:30p\n\nSingle Parents Comedy 9:30p\n\n▣ Stumptown Trailer Drama 10p\n\nAn adaptation of the Oni Press comic series Stumptown (a nickname for Portland, Oregon, where both the graphic novels and TV series are set), this drama stars Cobie Smulders as Dex Parios, a \"sharp-witted\" Army veteran now working as a private investigator after she has trouble holding down a steady job as a civilian. The adaptation comes from Jason Richman (Detroit 1-8-7, Lucky 7) and also stars Jake Johnson (a late replacement for Mark Webber), Michael Ealy, Camryn Manheim, and Cole Sibus.\n\nSurvivor Reality competition 8p\n\nTHU / September 26\n\nThe latest sitcom vehicle for Patricia Heaton (The Middle, Everybody Loves Raymond) finds her playing a mother who, after retiring from teaching and raising two children, opts for a late-in-life challenge: becoming a doctor. Created by Emily Halpern and Sarah Haskins (who previously combined for the one-and-done ABC sitcom Trophy Wife, among other projects), the multi-camera comedy also stars Kyle MacLachlan and Lucas Neff.\n\n▣ Evil Trailer Drama 10p\n\nCreated by The Good Wife team of Michelle and Robert King, this science vs. religion drama finds a clinical psychologist and skeptic (Westworld's Katja Herbers) teaming up with a priest in training (Mike Colter) and a carpenter (whose beliefs are apparently unknown to the CBS employee writing the show summary) to investigate seemingly paranormal phenomena, miracles, and demonic possessions. Michael Emerson and Aasif Mandvi also star.\n\nThe Good Place Comedy 9p\n\nGrey's Anatomy Drama 8p\n\nHow to Get Away With Murder Drama 10p\n\nLaw & Order: SVU Drama 10p\n\nA Million Little Things Drama 9p\n\nMom Comedy 9p\n\nBradley Whitford plays a former Princeton music professor who stumbles into a small-town church choir practice, and—this being a sitcom—winds up staying to ultimately learn just as much from his new mismatched family as they do from him. Or something like that. The single-camera comedy comes from Life in Pieces writer Lesley Wake Webster and also stars Anna Camp, Tymberlee Hill, and Will Greenberg.\n\n▣ Sunnyside Trailer Comedy 9:30p\n\nKal Penn is the co-creator (with Matt Murray) and star of this comedy about a disgraced New York politician who was the city's youngest city councilman in history until he was brought down by a public intoxication incident. But he gets an opportunity to rebuild his life when he is hired by a group of immigrants who hope to become American citizens. Mike Schur (The Good Place, Parks and Recreation) is also among the producers.\n\nSuperstore Comedy 8p\n\nThursday Night Football Sports/Live event 7:30p ET\n\nThis single-camera comedy centers stars Walton Goggins as a recently widowed father of two daughters who navigates both the dating world and the parenting world with the help of a tight-knit group of friends and family. Rob Corddry and Michaela Watkins round out the main cast. Unicorn comes from writers Bill Martin and Mike Schiff, who previously combined for the dreadful Cavemen (yes, the GEICO commercial-turned-series) and Grounded for Life.\n\nYoung Sheldon Comedy 8p\n\nFRI / September 27\n\n20/20 Newsmagazine 9p\n\nAmerican Housewife Comedy 8p\n\nBlue Bloods Drama 10p\n\nDateline NBC Newsmagazine 9p\n\nFresh Off the Boat Comedy 8:30p\n\nHawaii Five-0 Drama 8p\n\nMagnum P.I. Drama 9p\n\nRyan Murphy's first Netflix original series (which has already been renewed for a 2nd season) is an hourlong dark comedy anthology focusing on a different (fictitious) political race each season, though each one will involve a wealthy and ambitious Santa Barbara resident played by Ben Platt, beginning with his quest to become student body president of his high school. As with any Murphy show, there's a huge, impressive cast: Gwyneth Paltrow, Jessica Lange, Dylan McDermott, Lucy Boynton, Zoey Deutch, Bette Midler, Judith Light, Bob Balaban, January Jones, and Laura Dreyfuss are just some of the faces you'll see this year. The series was originally reported to include musical numbers, though it is unclear if that remains the case.\n\nSAT / September 28\n\n48 Hours Newsmagazine 10p\n\nSUN / September 29\n\n60 Minutes Newsmagazine 7:30p\n\nAmerica's Funniest Home Videos Reality 7p\n\nAurora Teagarden Mysteries: tbd Drama HMM, 9p\n\nOne of two new animated comedies headed to Fox this season, Harts comes from former SNL, Last Man on Earth, and Parks & Rec writer and Up All Night creator Emily Spivey, and also counts Phil Lord and Christopher Miller among its producers. The series focuses on a financially struggling but happy group of Southerners (inspired by Spivey's own North Carolina family) voiced by Kristen Wiig, Maya Rudolph, Jillian Bell, Ike Barinholtz, and Drew Tarver. While Mike Judge is not involved in the project, the series will technically take place in the same universe as King of the Hill since the Harts will do their shopping at the Mega Lo Mart.\n\nBob's Burgers Animation/Comedy 9p\n\nFamily Guy Animation/Comedy 9:30p\n\nGod Friended Me Drama 8:30p\n\nForest Whitaker plays real-life crime boss Bumpy Johnson in this 1960s-set drama series from Chris Brancato (Narcos) and Paul Eckstein. Vincent D'Onofrio and Giancarlo Esposito also star.\n\nNCIS: Los Angeles Drama 9:30p\n\nThe Rookie Drama 10p\n\nShark Tank Reality competition 9p\n\nThe Simpsons Animation/Comedy 8p\n\nTUE / October 1\n\n▣ Sorry for Your Loss Drama Facebook Watch\n\nWED / October 2\n\n▣ Almost Family Trailer Drama 9p\n\nFriday Night Lights' Jason Katims and The Path's Annie Weisman team for an adaptation of the Australian drama series Sisters, originally picked up under the title Not Just Me. The series centers on a woman (Brittany Snow) who believes herself to be an only child until her dad (Timothy Hutton)—a fertility doctor—admits to secretly using his own sperm to father over 100 children. Now, she finds herself with two new sisters (Megalyn Echikunwoke and Emily Osment) ... and more to come. Leslye Headland (Sleeping with Other People) directs the pilot.\n\niHeartRadio Music Festival (Part 1) Music 8p\n\nSEAL Team Drama 9p\n\nS.W.A.T. Drama 10p\n\nTHU / October 3\n\niHeartRadio Music Festival (Part 2) Music 8p\n\nFRI / October 4\n\nThe Blacklist Drama 8p\n\nWWE SmackDown Live \"Sports\" 8p\n\nMoves to Fox from USA.\n\nSUN / October 6\n\n▣ Back to Life Comedy tbd\n\nDaisy Haggard co-writes and stars in this six-episode British series as an ex-con adjusting to life on the outside after completing an 18-year prison sentence. The darkly comedic series earned great reviews when it aired on BBC3 earlier this year.\n\n▣ Batwoman Trailer Drama 8p\n\nRuby Rose (Orange Is the New Black) stars as DC Comics heroine Kate Kane, better known as Batwoman, who will become TV's first live-action lesbian superhero lead character. (Rose first played Kane in the \"Elseworlds\" DC crossover event on The CW last season.) It's yet another Greg Berlanti production, and the adaptation comes from Caroline Dries (The Vampire Diaries), who serves as showrunner. Dougray Scott, Rachel Skarsten, Meagan Tandy, and Nicole Kang also star. CW will give the series a boost this week by repeating tonight's premiere on Monday and Tuesday.\n\nCrossword Mysteries: tbd Drama HMM, 9p\n\n▣ Kids Say the Darndest Things Reality/Comedy 8p\n\nTiffany Haddish hosts a revival of the classic series.\n\nMadam Secretary Drama 10p\n\nSupergirl Drama 9p\n\nMON / October 7\n\nAll American Drama 8p\n\nTUE / October 8\n\nThe Flash Drama 8p\n\nWED / October 9\n\n▣ Nancy Drew Trailer Drama 9p\n\nNewcomer Kennedy McMann stars as young sleuth Nancy Drew in this adaptation of the classic book series that is set in the summer after Drew's high school graduation. The first season finds the new grad's college hopes put on hold when she becomes caught up in a family tragedy and a murder investigation. Scott Wolf, Riley Smith (Proven Innocent) and Leah Lewis also star. Despite numerous attempts by multiple networks over the past decades, the character has never actually had her own television series before, though she did appear in the late 1970s as part of The Hardy Boys/Nancy Drew Mysteries on ABC. This adaptation comes from the team of Josh Schwartz and Stephanie Savage (The O.C., Gossip Girl, Marvel's Runaways) along with Noga Landau.\n\nRiverdale Drama 8p\n\nTHU / October 10\n\nLegacies Drama 9p\n\nSupernatural Drama 8p\n\nFRI / October 11\n\n▣ The Birch Comedy Facebook Watch\n\nCharmed Drama 8p\n\nDynasty Drama 9p\n\nSUN / October 13\n\nCrossword Mysteries: tbd Drama HMM, 9p\n\nInside the Actors Studio Talk Ovation, 10p ET\n\nThe long-running series moves from Bravo to Ovation, where a variety of hosts (including Alec Baldwin and Jane Lynch) will replace the retired James Lipton.\n\nMON / October 14\n\nLetterkenny Comedy Hulu\n\nThe cult hit Canadian comedy series returns for a seventh season (and it's now a Hulu exclusive in the U.S.)\n\nLooking for Alaska Drama Hulu\n\nThis long-gestating miniseries adaptation of John Green's best-seller set in a boarding school comes from Josh Schwartz (Gossip Girl) and stars Charlie Plummer, Kristine Froseth, Ron Cephas Jones, and Timothy Simons.\n\nTUE / October 15\n\nArrow Drama 9p\n\nWED / October 16\n\n▣ Limetown Drama Facebook Watch\n\nJessica Biel and Stanley Tucci star in an adaptation of the fiction podcast of the same name.\n\nSUN / October 20\n\nCrossword Mysteries: tbd Drama HMM, 9p\n\nMON / October 21\n\nBlack Lightning Drama 9p\n\nTUE / November 5\n\nRunning Wild With Bear Grylls Reality Nat Geo, tbd\n\nSeries moves from NBC to Nat Geo for its 5th season.\n\nSUN / November 10\n\n2019 E! People's Choice Awards Special E!, 9p\n\nTUE / November 12\n\nEncore! Reality Disney+\n\nThis spinoff of the 2017 ABC special of the same name returns host Kristen Bell, who reunites (now adult) former high school classmates to re-stage musicals that they performed many years ago while students.\n\nForky Asks a Question Animation/Family Disney+\n\nPixar's first series for the Disney+ streaming service features Forky, the Tony Hale-voiced character (who is technically a spork) introduced in Toy Story 4.\n\nHigh School Musical: The Musical: The Series Comedy/Drama Disney+\n\nHigh School Musical: The Musical: The Series: The Blurb: Disney's new streaming series is a spinoff from its hugely successful TV movie franchise that follows a group of high school students preparing for their school's inaugural stage production of High School Musical.\n\nDisney's latest live-action remake (exclusive to the new Disney+ streaming service) features a screenplay by mumblecore master Andrew Bujalski. Tessa Thompson, Justin Theroux, Thomas Mann, Janelle Monáe, Kiersey Clemons, and Ashley Jensen star.\n\nThe Mandalorian Drama/Sci-fi Disney+\n\nThe first-ever live-action series set in the Star Wars universe comes from Jon Favreau, though he won't direct any of the first season's eight episodes. (Instead, directors include Taika Waititi, Dave Filoni, Rick Famuyiwa, Deborah Chow, and Bryce Dallas Howard.) Narcos star Pedro Pascal plays the titular character, a lone gunfighter in the outer reaches of the galaxy sometime during the gap between the sixth and seventh Star Wars films. Joining him in the cast are Nick Nolte, Gina Carano, Giancarlo Esposito, Carl Weathers, and filmmaker Werner Herzog (who plays a villain, naturally). Expect a more character-driven, smaller-scope approach rather than constant action and expensive special effects—and prior knowledge of Star Wars is not a prerequisite to following the story. New episodes stream weekly.\n\nMarvel's Hero Project Reality Disney+\n\nYes, the new Disney+ streaming service will eventually have both live-action and animated shows featuring Marvel characters. This is not one of them. Instead, the network's first Marvel-branded series profiles young, real-world \"heroes\" who have made a positive impact on their community.\n\nThe World According to Jeff Goldblum Reality Disney+\n\nSUN / November 24\n\n2019 American Music Awards Live event/Music 8p\n\nSUN / December 1\n\nBrain Games Reality Nat Geo, tbd", "images": ["https://static.metacritic.com/images/features/main/gq2015_wiiu-28.jpg", "https://static.metacritic.com/images/features/networks/showtime20.png", "https://static.metacritic.com/images/features/media/graphics/new.gif", "https://static.metacritic.com/images/features/main/netflix201907-50.jpg", "https://static.metacritic.com/images/features/main/tvpremieredates-180.jpg", "https://static.metacritic.com/images/features/main/hbo201907-50.jpg", "https://static.metacritic.com/images/features/main/starz201907-50.jpg", "https://static.metacritic.com/images/features/networks/cbs20.png", "https://static.metacritic.com/images/features/main/hulu201907-50.jpg", "https://static.metacritic.com/images/features/networks/netflixnew50.jpg", "https://static.metacritic.com/images/features/_graphics/movie.gif", "http://static.metacritic.com/images/features/networks/fx20.png", "https://static.metacritic.com/images/features/networks/nbc20.png", "https://static.metacritic.com/images/features/main/midyear2019tv-180.jpg", "https://static.metacritic.com/images/features/main/amazon201907-28.jpg", "https://static.metacritic.com/images/features/main/201920tvseasonscorecard-28.jpg", "https://static.metacritic.com/images/features/_graphics/special.gif", "https://static.metacritic.com/images/features/main/_THUMBNAILscorsesegallery-180.jpg", "https://static.metacritic.com/images/features/networks/fox20.png", "https://static.metacritic.com/images/features/networks/fxx25.png", "https://static.metacritic.com/images/features/main/dvd_2019_07-28.jpg", "https://static.metacritic.com/images/features/networks/hbo20.png", "https://static.metacritic.com/images/features/_graphics/miniseries.gif", "https://static.metacritic.com/images/features/main/midyear2019music-180.jpg", "https://static.metacritic.com/images/features/main/2017best_games_zeldabreathofthewild-28.png", "https://static.metacritic.com/images/features/main/midyear2019tv-50.jpg", "https://static.metacritic.com/images/features/networks/abc20.png", "https://static.metacritic.com/images/features/networks/amc20.png", "https://static.metacritic.com/images/features/main/gamescorecard_2019_summer-180.jpg", "https://static.metacritic.com/images/features/main/tvpremieredates-28.jpg", "https://www.metacritic.com/images/icons/dark_logo.png", "https://static.metacritic.com/images/features/main/dvd_2019_07-50.jpg", "https://www.metacritic.com/media/networks/pbs25.png", "https://static.metacritic.com/images/features/main/tvpreview201907-50.jpg", "https://www.metacritic.com/media/networks/cw20.png", "https://static.metacritic.com/images/features/main/amazon201907-50.jpg", "https://static.metacritic.com/images/features/main/bestof_2019_05-28.jpg", "https://www.metacritic.com/images/icons/search_inactive.png", "https://static.metacritic.com/images/features/main/music2019summerpreview-28.jpg", "https://www.metacritic.com/images/icons/search_active.png", "https://static.metacritic.com/images/features/main/moviepreview2019_07-28.jpg", "https://static.metacritic.com/images/features/networks/comedycentralnew20.png"], "top_img": "https://static.metacritic.com/images/features/main/tvpremieredates-180.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.metacritic.com/feature/tv-premiere-dates", "title": "2019 Summer/Fall TV Premiere Calendar", "meta_data": {"description": "Find a calendar of premiere dates for all upcoming new and returning television shows, plus TV movies and specials.", "viewport": "width=1024", "application-name": "Metacritic", "msapplication-TileColor": "#000000", "msapplication-TileImage": "/images/win8tile/76bf1426-2886-4b87-ae1c-06424b6bb8a2.png", "og": {"title": "2019 Summer/Fall TV Premiere Calendar", "type": "article", "url": "https://www.metacritic.com/feature/tv-premiere-dates", "image": "https://static.metacritic.com/images/features/main/tvpremieredates-180.jpg", "site_name": "Metacritic", "description": "Find a calendar of premiere dates for all upcoming new and returning television shows, plus TV movies and specials."}, "fb": {"app_id": 123113677890173}, "twitter": {"site": "@metacritic", "creator": "@metacritic", "card": "https://static.metacritic.com/images/features/main/tvpremieredates-180.jpg"}}, "movies": [], "publish_date": null, "source": "https://www.metacritic.com", "summary": ""}