{"url": "https://www.usatoday.com/story/life/movies/2017/05/01/guardians-on-galaxy-vol-2-set-visit-chris-pratt-kurt-russell/101098586/", "text": "CLOSE Kurt Russell and Chris Pratt talk about playing an estranged father and son in 'Guardians of the Galaxy Vol. 2' and bonding in real life. USA TODAY\n\nKurt Russell, 66, and Chris Pratt, 37, star as father and son in 'Guardians of the Galaxy Vol. 2.' (Photo: Robert Hanashiro, USA TODAY)\n\nCorrection & clarifications: An earlier version of this report misidentified the location of Pinewood Studios. It is south of Atlanta.\n\nFAYETTEVILLE, Ga. — Chris Pratt has the most awesome space dad ever.\n\nOn this sunny afternoon at Pinewood Studios just south of Atlanta, Kurt Russell is holding court on the set of Guardians of the Galaxy Vol. 2 (in theaters Thursday night), telling stories over a campfire. Not tales from Big Trouble in Little China or Escape From New York, though — Russell is in cosmic character as Ego, a living planet who’s just met his long-lost son, Peter Quill, aka Star-Lord (Pratt).\n\nYes, you read that right: Russell plays an all-powerful living planet and that's not even the craziest aspect of the Guardians’ corner of the Marvel Cinematic Universe. A talking raccoon, a sentient alien tree with a three-word vocabulary (\"I am Groot\") and the rest of this misfit accidental family took the world by storm with the 2014 runaway summer hitGuardians of the Galaxy. The sequel — which is on track to open with $150 million domestically — doubles down on the eye-popping new worlds, over-the-top personalities and family drama.\n\nCLOSE Baby Groot steals the show in 'Guardians of the Galaxy Vol. 2.' USA TODAY NETWORK\n\n\"Guardians has gone from being an untested, little-known risky Marvel side project with an unusual cast and offbeat sensibility, to a premier brand worthy of its ascension to the coveted opening summer weekend slot,\" says Paul Dergarabedian, senior media analyst for comScore.\n\nThe biggest asset at the heart of this sci-fi space opera? A crew of “damaged souls who are looking for some form of love or redemption and haven’t really ever experienced either of those things,” says returning writer/director James Gunn.\n\nRocket Raccoon (voice of Bradley Cooper, left) and Baby Groot (voice of Vin Diesel) are friends till the end. (Photo: Marvel)\n\n“The reason why so many people love this movie and feel so connected to these characters is because they’re utterly outcasts and oddballs and strange,\" Gunn says. \"They're not the Avengers, they're not the pitch-perfect group of guys who have everything going on. They’re losers often, and even though they have some extraordinary abilities, they’re no better or worse than we are.”\n\nThe Guardians — the rogueish Star-Lord, assassin Gamora (Zoe Saldana), overly literal warrior Drax (Dave Bautista), sarcastic yet damaged Rocket (voiced by Bradley Cooper) and adorably precocious Baby Groot (voiced by Vin Diesel) — have already saved the universe, though Peter is still in search of his real father after having been raised from childhood by space outlaw Yondu (Michael Rooker).\n\nThe sequel has them on the run from the conceited aliens known as the Sovereign, and after having saved the heroes from certain doom, Ego is enjoying a meal with his son on the forest planet Berhart, though Peter is curious why Dad never came back for him when his mother died and instead hired Yondu to pick him up.\n\nEgo (Kurt Russell, center) reconnects with his son Peter Quill (Chris Pratt) over a campfire meal while Gamora (Zoe Saldana) looks on with distrust. (Photo: Marvel)\n\n“I would have done so myself, but I was in the midst of an outlandish adventure battling demonic forces to save this dimension or some such nonsense. I don’t even recall. It all bleeds together after a while,” Ego explains. He wonders aloud why Yondu kept Peter instead of returning him, leaving Ego searching for his boy ever since.\n\n“Because I was a skinny kid who would squeeze into places adults couldn’t and it made thieving easier,” says Quill, clad in a shirt sporting an alien candy logo.\n\nYet there’s as much humor as serious stuff in a Guardians film, and Drax is the first to break the tension. “I thought Yondu was your father,” he says, leading everyone to look at the muscular warrior like he’s nuts.\n\n“Wait. After all this time hanging out together, you thought Yondu was my blood relative?” Quill says in exasperation, leading Drax to deadpan, “You look exactly alike.”\n\nYondu (Michael Rooker, center) is ousted from his role as leader of the Ravagers. (Photo: Marvel)\n\nRocket chimes in “One’s blue!” — though Cooper hasn't yet added the furry guy’s vocals. Gunn’s brother Sean (who also returns as Yondu’s Ravager buddy Kraglin) does Rocket’s motion-capture performance and line reading with co-stars.\n\nJames Gunn has put together a close-knit clan of friends and actual family on his Guardians films, and it’s reflected in the sequel’s story of \"fathers, sons, stepfathers, sons who have never seen their father, fathers who have lost their son,” Russell says. “And when they finally get back together, everybody’s got to get used to each other. They’re not quite the way you had made them out to be in your imagination.”\n\nAdds Gunn: “It’s a father/son story that could take place if your father’s a living planet in another galaxy or if your father’s a Wall Street broker.\"\n\nDirector James Gunn (left) goes over a scene with Zoe Saldana and Chris Pratt on the Atlanta set of 'Guardians of the Galaxy Vol. 2.' (Photo: Marvel)\n\nPratt is effusive with praise for his legendary co-star Russell. “It’s a dream. I’ve been a huge fan of his for ages. There’s nothing disappointing about working with him,” says the actor, who enjoyed Russell’s frequent stories from his heroic roles in such movies as Tombstone and Tango & Cash.\n\nSo how does an icon like Russell play a planet? He leans into the machismo and quirks of those old parts. “There’s a lot of baggage that’s right for this in terms of the kinds of things I can bring as an actor to the table,” he says. “And some of the things we created years ago have an element of connection to this character.”\n\nGamora is skeptical of Ego’s extreme interest in Peter, though she's also dealing with her adoptive sister and frenemy Nebula (Karen Gillan), a villain from the first film whom the Guardians have taken captive. Nebula is looking extremely irked while handcuffed as everybody else is gobbling Ego’s blue space chow. (It’s not very good, Russell reports. “It’s prop Jell-O. We never ask questions, we just eat it.”)\n\nNebula (Karen Gillan) returns with a bone to pick with her sister in 'Guardians of the Galaxy Vol. 2.' (Photo: Chuck Zlotnick)\n\nBut everybody needs and seeks a sense of belonging, even Nebula. “She’s been raised to be a killing machine and not have any empathy or emotion,” Gillan says. “However, she has these natural feelings toward her sister that she’s trying to suppress but can’t.”\n\nSaldana is just glad to have more women around — not just Gillan but also new cast member Pom Klementieff, who plays the Guardians’ insect-like telepathic ally Mantis. “The older I get, the more I realize that it’s pretty lonely being the only female in the cast,” Saldana says. “You’re going to be surrounded by a whole bunch of dudes talking about their (manhood) and bodybuilding and eating healthy.”\n\nShe loves her dudes, though, and there’s a connection between the stars of that original Guardians. Saldana is proud of how Pratt lost weight and got fit for the first movie while “still remaining this super-humble and sweet and charming individual,” and she’s continually wowed by Bautista’s gentleness and subtlety.\n\nDrax (Dave Bautista, left) and Gamora (Zoe Saldana) launch into a new mission to save the universe in 'Guardians of the Galaxy Vol. 2.' (Photo: Marvel)\n\n“He doesn’t believe that he’s funny,” Saldana says. “I hope that day doesn’t come where Dave goes, ‘You know what, you’re (messing) up my take here.’ ”\n\nMore than anyone, the success of the original Guardians has been career-making for Bautista, a former pro wrestler who parlayed Drax into a high-profile role as the villainous Mr. Hinx in the 2015 James Bond movie Spectre.\n\nHis Marvel character looks like “a powerhouse who’ll rip your head off and then he says something completely ridiculous,” says Bautista, though as emotionally scarred as he is, “there's definitely a sense of innocence about him.” Drax also has a body full of tattoos, and Bautista had a sauna outside of his trailer to soak off all the makeup and prosthetics daily. “You’d think I’m like a diva with a sauna. But no.”\n\nDrax (Dave Bautista) and Mantis (Pom Klementieff) enjoy a laugh in 'Guardians of the Galaxy Vol. 2.' (Photo: Marvel)\n\nDrax meets his quirky match in Klementieff’s Mantis, and the French actress is impressed that Gunn is so good at casting. “Everybody he chose has a big heart and I think it shows on screen.”\n\nThe director wears his fandom on his sleeve, with pop-culture references aplenty and scads of Easter eggs and cameos born from a lifetime of reading comic books. \"Anybody can delve into comic history and pull out obscure characters,” says Marvel Studios president Kevin Feige. “Not everybody can turn them into emotionally resonant and relatable characters that audiences can fall in love with.”\n\nGunn says the emotion he feels for his family and friends is “a bigger inspiration than even the comic-book characters.” He dedicated the movie to his parents in the audience at Vol. 2’s Hollywood premiere, and Gunn looks out for those closest to him.\n\nSean Gunn plays Kraglin the Ravager in 'Guardians of the Galaxy Vol. 2' and also provides the motion-capture performance for Rocket Raccoon. (Photo: Chuck Zlotnick)\n\nThe filmmaker went to bat for his close friend Rooker when it came to casting Yondu. “I don’t think I was Marvel’s first choice. I’m sure there are many other stars and actors that would have brought in more money,” Rooker says. “I wasn’t in the room when he was convincing them, but I would bet you my right arm that he had my back in a big way.”\n\nAnd Sean Gunn embraces his status as “the utility infielder of the Guardians cast” with pride. Watching his older brother’s rise has been “probably more fun and gratifying for me than just about anyone. I feel like I’ve had a front-row seat to his success.”\n\nTaserface (Chris Sullivan, right) and the Ravagers take Rocket and Groot prisoner in the 'Guardians of the Galaxy' sequel. (Photo: Marvel)\n\nJames Gunn has already started writing Guardians of the Galaxy Vol. 3 to complete his trilogy, discussing the story with Pratt and having “some pretty intense conversations” with Saldana about a significant role in the threequel. The only travels Gunn has on his docket in the near future, though, are relaxing ones to “get my head on straight after three years of waking up and going to sleep and thinking about a talking raccoon.”\n\nIn the Marvel galaxy, there’s room for more than one awesome space dad.\n\n“I love these characters,” Gunn says. “Including my father and my dog, my mother had eight kids, and I have all these Guardians. They’re my kids.”\n\nRead or Share this story: http://usat.ly/2pnJz4G", "images": ["https://www.gannett-cdn.com/-mm-/38ba418b3a94b08b199815ab64361abd002a9e3f/c=363-0-3106-3657/local/-/media/2017/04/30/USATODAY/USATODAY/636291106295849038-COVER-ART-GUARDIANS-OF-THE-GALAXY-VOL.-2-COVER151-90458956.JPG?width=534&height=712&fit=crop", "https://www.gannett-cdn.com/sites/usatoday/images/site-nav-logo-dark@2x.png", "https://www.gannett-cdn.com/uxstatic/usatoday/usat-web-static-5005.62.0/images/sprites/icon_close.png", "https://www.gannett-cdn.com/-mm-/bf7cf13831bd0e6b7b436120bb2bde156b3bb4e7/c=0-0-3547-2667/local/-/media/2017/04/30/USATODAY/USATODAY/636291107570377208-LUP-05822-R.jpg?width=540&height=405&fit=crop", "https://www.gannett-cdn.com/-mm-/2e0acba52ae67db351771a83f49dbf3ac97c522c/c=596-0-3039-1837/local/-/media/2017/04/30/USATODAY/USATODAY/636291120479771960-SCA0610-CMP-v059.1006.jpg?width=540&height=405&fit=crop", "https://www.gannett-cdn.com/uxstatic/usatoday/usat-web-static-5005.62.0/images/indicators/facebook-loading.gif", "https://www.gannett-cdn.com/-mm-/c6c6a657947fc34f8e026a45dcf4598ec9f2e0e0/c=226-0-3773-2667/local/-/media/2017/04/30/USATODAY/USATODAY/636291120531876294-LUP-14156-R.jpg?width=540&height=405&fit=crop", "https://www.gannett-cdn.com/-mm-/8fb539d94131647245874b3be7a82db1ad6c9b98/c=267-0-3814-2667/local/-/media/2017/04/30/USATODAY/USATODAY/636291120492096039-LUP-01399-R.jpg?width=540&height=405&fit=crop", "https://www.gannett-cdn.com/-mm-/822651f77c3b2269a2c037ec6af00829b46f5828/c=348-0-3140-2099/local/-/media/2017/04/30/USATODAY/USATODAY/636291106083219675-TCH1030-CMP-v003.1015.jpg?width=540&height=405&fit=crop", "https://www.gannett-cdn.com/-mm-/8a9b70691d2bb733beb5ee384cccb5a80d8f2067/c=393-0-3185-2099/local/-/media/2017/04/30/USATODAY/USATODAY/636291120489132020-EBB0320-CMP-v074.1029.jpg?width=540&height=405&fit=crop", "https://www.gannett-cdn.com/-mm-/bf7cf13831bd0e6b7b436120bb2bde156b3bb4e7/c=0-0-3547-2667/local/-/media/2017/04/30/USATODAY/USATODAY/636291106087431702-LUP-19927-R.jpg?width=540&height=405&fit=crop", "https://www.gannett-cdn.com/-mm-/955720ad17b8834d2daf5c8e361cdf7aa4fe2679/c=0-383-3459-2337/local/-/media/2017/04/30/USATODAY/USATODAY/636291106295849038-COVER-ART-GUARDIANS-OF-THE-GALAXY-VOL.-2-COVER151-90458956.JPG?width=3200&height=1680&fit=crop", "https://www.gannett-cdn.com/sites/usatoday/images/site-masthead-logo-dark@2x.png", "https://www.gannett-cdn.com/-mm-/0929ce5999396bdb7f881b74731ecc4982817b5c/c=528-0-3320-2099/local/-/media/2017/04/30/USATODAY/USATODAY/636291120498648081-ECM0400-CMP-v096.1032.jpg?width=540&height=405&fit=crop", "https://www.gannett-cdn.com/-mm-/2580c81a6c754545f536fa1a8098ace6639b2c64/c=577-0-3381-2108/local/-/media/2017/04/30/USATODAY/USATODAY/636291106081971667-IRL0140-CMP-v506.1280.jpg?width=540&height=405&fit=crop"], "top_img": "https://www.gannett-cdn.com/-mm-/955720ad17b8834d2daf5c8e361cdf7aa4fe2679/c=0-383-3459-2337/local/-/media/2017/04/30/USATODAY/USATODAY/636291106295849038-COVER-ART-GUARDIANS-OF-THE-GALAXY-VOL.-2-COVER151-90458956.JPG?width=3200&height=1680&fit=crop", "keywords": [], "authors": ["Brian Truitt", "Published P.M. Et May"], "canonical_link": "https://www.usatoday.com/story/life/movies/2017/05/01/guardians-on-galaxy-vol-2-set-visit-chris-pratt-kurt-russell/101098586/", "title": "'Guardians of the Galaxy Vol. 2': On set with Marvel's misfit space family", "meta_data": {"Content-Type": "text/html; charset=UTF-8", "google": "notranslate", "description": "The cosmic heroes from the 2014 runaway summer hit return for campfire tales with Chris Pratt and Kurt Russell, a father/son story and relative chaos.", "fb": {"app_id": 215046668549694, "pages": "6271782579,6566864515,6581478870,7197664863,7850621533,8031989578,9812439851,10482066215,11277320498,13642915529,13652355666,14073085963,16511263815,17540977705,18884137648,19125738813,23332504801,25003338948,31185662683,36808884697,37412800032,41044579289,42128399297,43612894510,46050757230,47020221001,47692649063,48490808881,48958576760,48976713989,49060990988,49607602899,49680588265,49896855793,50095226239,50978409031,52929678682,54660221594,55529405081,56434454301,56732457944,62464848082,62811590881,63475094632,63475094632,63582312713,65299040658,66049156099,66281684861,68903794473,69357466992,70423731350,70657021294,71807382333,72088679443,72139486384,73736978810,74475819815,76240820015,76276576343,77475586904,79333461561,79437403137,80117331717,80335432797,81086717085,81320873283,81668556783,81917682064,82415033847,83300095936,83563566820,87171906471,87448932499,87448932499,88584644204,90329609573,94480694479,94700656192,95712466848,95926318753,97657252278,99020906334,100825602361,101112717264,103261740968,103678546758,104331357951,104935809704,105714200321,105814368912,105878288262,106644919984,107327575587,108555442934,109146355881,109686244216,109793107867,110252103235,110404119877,110527555449,115611960606,115967868757,117907407522,118427210363,121866005065,122786733297,124755637015,125551044242,126226324691,129236178055,132159529312,132779306963,133049345480,134076752154,134394490084,136737914809,138770030135,141962110815,146089950343,148668982786,152774630192,153308622465,158094820767,164935760159,168684165430,173007618420,182922701188,188894693348,189867939238,190632318566,201996980631,227627281180,231239152914,242752084180,250325640686,264717798098,274620738925,275678631915,312966181232,314817944972,319611510288,323213251787,329923389135,338437548341,347221378913,362300531934,363363051861,371547464003,385926141498,427414745045,488720200095,100855786673970,105233922869839,105347532857165,105550656158763,106451856091222,106819879363130,107117249323169,108029922557289,108981615791456,109280192597421,109280192597421,109652569058713,110311752340743,110471702456365,110743725611909,110936258937026,111203872270080,112875149052352,113056925415668,113544088682099,113819202011100,115535341805950,115612465136194,117941352212869,119027288135308,119794264705307,119941731380546,120356424669462,121160355264720,121227371225765,121242251236815,121422567927897,124075397608772,124307640925620,124528254305153,127729820590459,128075747844406,129752560371732,130211193676772,130407246974813,130934216964240,136941796341905,137098406340114,137341919636249,137698179626815,137935586280481,138064052876960,138170199553897,140615052641118,140616965982144,141822679203700,142195472502819,143851392316295,145525478832716,146112055409819,146137498764266,146315142126130,146798045922062,147760805252234,148251148521543,149641051719383,152527031492851,152785861474173,153525871324757,154425934607982,154443518023678,155874144456588,156345381090801,157305941529632,157456661011568,158095147555989,159385590790009,160735830621443,161639923860040,165912253479205,167334979948476,167487199962004,169254356561132,169571899725267,169908223021026,176115302489104,176983469019018,177037772444433,177938742707529,180004588791896,183850168300771,183882195384562,184094471609920,184741935370451,185457134911754,187466604613310,187899791275353,190953458083653,192069610842446,196267627213508,197490563626275,205576782811630,207319989616043,209524799494208,212808112063652,220757414638542,222348701505747,224163964346315,225067797622802,225571757789261,225618707473378,231988790171331,235484153604672,236655713446291,236665340121443,241091022598958,243031846042424,251228454889939,261119230567728,263714980315631,279914708715884,281030418652036,281331052320274,285377081517877,288382484929799,288570077828603,295018040526596,297522096960113,305068052985746,307826419595702,310942265948388,315461641910509,315942225236045,315942225236045,320453738073595,321223331243188,327249521057460,330565860307724,332382433821098,334297859927211,339575256116022,351359635259904,353404615129492,368424599844024,373087836097009,399493863726488,401783903349050,405292372992577,410195352524708,412113499123835,420941268096348,421255071314156,422375144525783,426754640812333,438452439879553,458808827485318,469694573429026,471891632935599,477690595750196,480464022311783,487732368292520,510151039081225,535045576657973,535551216797440,556150611109468,562348203875693,566432520196581,569900189687627,581529871999163,592673674105043,593739520831583,611437275717153,637561026326153,642020402627050,677476185677499,686958778091339,704313986314492,717947288315597,756473301219510,757336147711096,813218208713830,850378298431411,872296879526971,877111212410602,911836215623184,917342785050040,927427260614748,945986872102221,1561238324154800,1822461518079800,1889753241275160,1003311406396687,1007667299356254,1095671673874517,1111939365618797,1170250869768985,1199725526840512,1203830176364044,1224613924286312,1244424538911767,1260369167415906,1282648301845288,1413320388972813,1422299337837954,1425793144356745,1432665186743737,1443524575938047,1473996709497771,1504884589584087,1525148737812812,1526198127405784,1583851541911383,1588113081458198,1596218533974035,1602646926431957,1603698749645413,1621466394844549,1627621717510471,1667234726635829,1725861847686522,1747180218844657,1759005871036426,1774393409526131,1797367867256626,1847787168808886,1878073225844519,1946209538938897,1972936962947967,2047091012096533"}, "og": {"site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/955720ad17b8834d2daf5c8e361cdf7aa4fe2679/c=0-383-3459-2337/local/-/media/2017/04/30/USATODAY/USATODAY/636291106295849038-COVER-ART-GUARDIANS-OF-THE-GALAXY-VOL.-2-COVER151-90458956.JPG?width=3200&height=1680&fit=crop", "width": 3200, "height": 1680}, "title": "'Guardians of the Galaxy Vol. 2': On set with Marvel's misfit space family", "description": "The cosmic heroes from the 2014 runaway summer hit return for campfire tales with Chris Pratt and Kurt Russell, a father/son story and relative chaos.", "url": "https://www.usatoday.com/story/life/movies/2017/05/01/guardians-on-galaxy-vol-2-set-visit-chris-pratt-kurt-russell/101098586/", "type": "article"}, "ROBOTS": "NOODP, NOYDIR", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/-mm-/955720ad17b8834d2daf5c8e361cdf7aa4fe2679/c=0-383-3459-2337/local/-/media/2017/04/30/USATODAY/USATODAY/636291106295849038-COVER-ART-GUARDIANS-OF-THE-GALAXY-VOL.-2-COVER151-90458956.JPG?width=1600&height=800&fit=crop", "site": "@usatoday", "creator": "@usatoday", "title": "'Guardians of the Galaxy Vol. 2': On set with Marvel's misfit space family", "description": "The cosmic heroes from the 2014 runaway summer hit return for campfire tales with Chris Pratt and Kurt Russell, a father/son story and relative chaos."}, "news_keywords": "guardians of the galaxy, guardians of the galaxy 2, sequel, chris pratt, kurt russell, zoe saldana, dave bautista, bradley cooper, vin diesel, marvel,", "viewport": "width=1070"}, "movies": [], "publish_date": 1493611200.0, "source": "https://www.usatoday.com", "summary": ""}