{"url": "https://www.cnn.com/2017/10/01/us/oj-simpson-released-from-prison/index.html", "text": "(CNN) O.J. Simpson is beginning post-prison life in the city where he committed the crime that saw him locked up.\n\nAfter serving nine years for a Las Vegas kidnapping and armed robbery he left prison early Sunday to start a new chapter as a parolee.\n\nSimpson's parole plan was agreed upon at Lovelock Correctional Center prior to his release, Nevada's Division of Parole and Probation said.\n\n\"Mr. Simpson submitted a parole release plan for a residence in Las Vegas, Nevada. The plan was investigated and approved by the Division of Parole and Probation,\" it said.\n\nThe center did not provide more specifics of Simpson's release plan, saying it was up to Simpson, his family and his attorney as to whether they wanted such information shared.\n\nHowever, now that the former NFL star is out of prison, those who know him are not expecting him to become a recluse.\n\n\"He's not going to hide,\" said longtime friend Tom Scotto, who attended Simpson's parole hearing this summer.\n\nSeveral associates told CNN Simpson would be living in a gated residence with unspecified friends in a wealthy Las Vegas suburb, and planned to move to Florida later on.\n\n\"He's going to focus on kids, friends, his family and golf,\" Scotto said. \"Maybe not the first day or second, but he is going to go out.\"\n\nTwo of Simpson's children live in the Tampa Bay area in Florida, one lives in Los Angeles and another in Georgia.\n\n'Don't come back'\n\nSimpson was picked up by a friend shortly after midnight local time Sunday, according to Brooke Keast, a spokeswoman for the Nevada Department of Corrections.\n\n\"I told him, 'Don't come back,' and he responded, 'I don't intend to,'\" she said. \"He was upbeat, personable and seemed happy to get on with his life.\"\n\nUnlike previous instances, where controversy followed wherever he went, Simpson was released in the middle of the night to avoid media attention.\n\n\"Our biggest concern was our safety and the public's safety and not wanting anybody, paparazzi, to follow him,\" Keast said. \"He left through a big blue door through the front gatehouse and exited quietly. He looked down because he didn't want to be photographed.\"\n\nMeeting with parole officer\n\nBefore his release, prison officials did an inventory of what he wanted to take with him or leave behind. He walked out of prison with paperwork and \"three or four boxes about the size of a microwave,\" according to Keast.\n\nInside the boxes were items such as a hot plate, clothing and shower shoes, she said.\n\nSimpson also met with one person who'll become a fixture in his post-prison life: his parole officer.\n\n\"They went over what he needs for parole and where he needs to check in, what he should do to get a driver's license, et cetera, (and) instructions on what to do once he's out there,\" Keast said.\n\nThe Nevada Board of Parole Commissioners voted unanimously in July to release Simpson after he served nine years of a 33-year sentence for armed robbery and kidnapping.\n\nDuring that robbery in 2007, he was part of a group that raided a hotel and casino to steal sports memorabilia at gunpoint. Simpson, a former player for the Buffalo Bills, said the items belonged to him.\n\nNo drugs, no alcohol\n\nAs a parolee, Simpson will have to meet a number of conditions set by the Nevada parole board.\n\nWhile out of prison, he won't have the liberty to consume alcohol in large quantities or hang out with ex-convicts. The Nevada parole board forbids parolees from associating with convicted felons and people who engage in criminal activity, or possessing guns and drugs. Alcohol abuse can get a parolee hauled back to prison.\n\n\"You are permitt ed to consume alcoholic beverages but not in excess,\" the conditions of parole supervision read. \"You shall submit to a medically recognized test for blood/breath content. Test results of .08 alcohol or higher shall be sufficient proof of excess.\"\n\nSimpson received a bad score on his parole risk assessment guideline in the drug/alcohol abuse category, with the document citing him for \"frequent abuse, serious disruption of functioning.\"\n\nHe testified that he had been drinking alcohol the day of the raid on memorabilia dealers that led to his arrest and conviction.\n\nPhotos: The rise and fall of O.J. Simpson O.J. Simpson reacts after learning he was granted parole at Lovelock Correctional Center on Thursday, July 20, in Lovelock, Nevada. Simpson is serving a nine-to-33-year prison term for a 2007 armed robbery and kidnapping conviction. Click through the gallery to see moments from the notable life of the former football and media star. Hide Caption 1 of 23 Photos: The rise and fall of O.J. Simpson As a University of Southern California running back, Simpson accepts the Heisman Trophy in December 1968. Hide Caption 2 of 23 Photos: The rise and fall of O.J. Simpson Simpson, pictured in 1974, was a running back for the Buffalo Bills from 1969 to 1977. Hide Caption 3 of 23 Photos: The rise and fall of O.J. Simpson Simpson with his wife, Marguerite Whitley, his daughter Arnelle and son Jason, circa 1974. The couple were married from 1967 to 1979. They had another daughter, Aaren, who died as a toddler in a drowning accident. Hide Caption 4 of 23 Photos: The rise and fall of O.J. Simpson Simpson in action during a Buffalo Bills game against the New York Jets. Hide Caption 5 of 23 Photos: The rise and fall of O.J. Simpson Simpson married Nicole Brown Simpson in 1985. Here the couple appears at a Los Angeles nightclub around 1976. Hide Caption 6 of 23 Photos: The rise and fall of O.J. Simpson Coach Lou Sabin and O.J. Simpson Hide Caption 7 of 23 Photos: The rise and fall of O.J. Simpson Simpson branched out into acting. He appears with Bill Murray, left, Laraine Newman and Garrett Morris in a \"Saturday Night Live\" skit in 1978. Hide Caption 8 of 23 Photos: The rise and fall of O.J. Simpson As a running back for the San Francisco 49ers, Simpson carries the ball against the Oakland Raiders during a preseason game circa 1978. Hide Caption 9 of 23 Photos: The rise and fall of O.J. Simpson Simpson becomes a commentator on ABC's \"Monday Night Football\" in the mid-'80s. He appears with Joe Namath, left, and Frank Gifford. Hide Caption 10 of 23 Photos: The rise and fall of O.J. Simpson Simpson and his children attend Nicole Brown Simpson's funeral in June 1994. Hide Caption 11 of 23 Photos: The rise and fall of O.J. Simpson Ronald Goldman was slain with Simpson's ex-wife Nicole Brown Simpson on June 12, 1994. Hide Caption 12 of 23 Photos: The rise and fall of O.J. Simpson In footage seen on TV screens around the world, police chase a white Ford Bronco with a fugitive Simpson inside on the Los Angeles freeways on June 17, 1994. The Bronco eventually returned to Simpson's home in the Brentwood section of Los Angeles, and he surrendered to police on murder charges in the deaths of his ex-wife and Ronald Goldman. Hide Caption 13 of 23 Photos: The rise and fall of O.J. Simpson Simpson's mug shot after his arrest on murder charges. Hide Caption 14 of 23 Photos: The rise and fall of O.J. Simpson Fans leave signs of support outside Simpson's house in June 1994. Hide Caption 15 of 23 Photos: The rise and fall of O.J. Simpson Lead defense attorney Johnnie Cochran Jr. and prosecutor Marcia Clark face off during a hearing in the murder trial that riveted a nation. Hide Caption 16 of 23 Photos: The rise and fall of O.J. Simpson \"If it doesn't fit, you must acquit\" was defense attorney Cochran's mantra during the trial. Here, Simpson tries on a leather glove tied to the crime scene at his murder trial on June 15, 1995. Hide Caption 17 of 23 Photos: The rise and fall of O.J. Simpson Simpson cheers with his attorneys F. Lee Bailey, left, and Johnnie Cochan Jr. on October 3, 1995, after being found not guilty of killing Nicole Brown Simpson and Ronald Goldman. Though cleared of criminal charges, a civil jury later slapped the former football star with a $33 million wrongful death judgment, and attorneys for the Goldman family have doggedly pursued his assets. Hide Caption 18 of 23 Photos: The rise and fall of O.J. Simpson Simpson continued to encounter legal problems, including a \"road rage\" trial in the Miami area in October 2001. He was found not guilty on charges stemming from a traffic altercation with another motorist. Hide Caption 19 of 23 Photos: The rise and fall of O.J. Simpson Simpson appears in court with attorneys Gabriel Grasso, left, and Yale Galanter before sentencing in the sports memorabilia case in December 2008 in Las Vegas. Simpson contended he was retrieving personal items that had been stolen from him and were being sold as memorabilia. He later accused Galanter of having a conflict of interest and failing to mount an effective defense. Hide Caption 20 of 23 Photos: The rise and fall of O.J. Simpson The Palace Station hotel room, the scene of Simpson's reported confrontation with sports memorabilia dealers, is displayed on a monitor during Simpson's trial in September 2008. Hide Caption 21 of 23 Photos: The rise and fall of O.J. Simpson Simpson embraces his sister, Carmelita Durio, while his friend Tom Scotto looks on in court after a guilty verdict was reached in October 2008. Simpson was convicted of leading a group of associates into a room at the Palace Station Hotel and Casino and using threats, guns and force to take back items from two dealers. Hide Caption 22 of 23 Photos: The rise and fall of O.J. Simpson Disgraced football star O.J. Simpson appears in court on May 13, 2013, seeking to get his robbery, assault and kidnapping convictions thrown out after spending more than four years in prison. He argued that bad legal advice led to his arrest and conviction in a confrontation with sports memorabilia dealers. His 2008 conviction came 13 years after his acquittal on murder charges in the deaths of ex-wife Nicole Brown Simpson and Ronald Goldman. Hide Caption 23 of 23\n\nState of Florida 'objects'\n\nFlorida Attorney General Pam Bondi wrote a letter to Florida's Department of Corrections on Friday saying she did not want Simpson to move to her state and asking them to \"notify all appropriate authorities of the State of Nevada that the State of Florida objects to the granting of such permission.\"\n\nBut Simpson lawyer Malcolm LaVergne lambasted Bondi over the letter, accusing her of exploiting the issue to score political points ahead of elections.\n\n\"One hundred percent Mr. Simpson will be able to move to Florida,\" he said Sunday. \"She doesn't have jurisdiction over his move.\"\n\nBut Shawn Arruti, spokesman for Nevada Parole and Probation, said it's not a sure thing.\n\n\"Interstate compact is not a guaranteed thing,\" he said after Simpson's parole hearing in July, referring to an agreement between two states. \"Interstate compact is a privilege, but it's a privilege based on meeting certain criteria. And Florida, when they do their investigation, they'll make the determination of whether or not they're going to be willing to accept his case. \"\n\nFrom NFL star to murder suspect\n\nSimpson spent a lifetime in the limelight -- first for his athletic prowess, charm and good looks, then as a murder suspect in the 1994 killing of his ex-wife, Nicole Brown Simpson, and her friend, Ron Goldman.\n\nHis murder trial in Los Angeles was dubbed \"the trial of the century\" and sparked years of debate over race and justice.\n\nSimpson pleaded \"100% not guilty\" and assembled a team of famous local and national lawyers. He was eventually acquitted in 1995, but many questioned whether he got away with murder.\n\nThe victims' families filed a suit for wrongful death. Two years after his acquittal, he was ordered to pay $33.5 million in damages.", "images": ["https://cdn.cnn.com/cnnnext/dam/assets/170718155816-0718-oj-simpson-13-restricted-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180312041333-oj-simpson-intv-screengrab-large-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180307123618-oj-lost-confession-large-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170720131017-oj-parole-large-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170718150555-0718-oj-simpson-restricted-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170718160405-0718-oj-simpson-15-restricted-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170718155407-0718-oj-simpson-11-restricted-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/171001041246-oj-simpson-released-prison-vercammen-bpr-nr-00013304-large-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170718151125-0718-oj-simpson-02-restricted-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170718151125-0718-oj-simpson-02-restricted-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170718160216-0718-oj-simpson-14-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170718153047-0718-oj-simpson-07-restricted-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170718161457-0718-oj-simpson-20-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170718160614-0718-oj-simpson-16-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170718155816-0718-oj-simpson-13-restricted-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170718151535-0718-oj-simpson-03-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/171001041246-oj-simpson-released-prison-vercammen-bpr-nr-00013304-exlarge-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170718161047-0718-oj-simpson-18-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170718161305-0718-oj-simpson-19-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/130515110754-oj-retrial-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170718161047-0718-oj-simpson-18-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170718161305-0718-oj-simpson-19-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170720150728-o-j-simpson-head-down-parole-verdict-large-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170721080147-oj-simpson-manager-conflict-free-life-newday-00000000-large-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170720152327-26-oj-simpson-parole-hearing-0720-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170718152747-0718-oj-simpson-06-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170720143455-bruce-fromong-close-7-20-2017-large-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170720130319-01-oj-simpson-parole-hearing-0720-large-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170718151535-0718-oj-simpson-03-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170718152323-0718-oj-simpson-05-restricted-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170718152323-0718-oj-simpson-05-restricted-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170718155159-0718-oj-simpson-10-restricted-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170718155617-0718-oj-simpson-12-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170718153456-0718-oj-simpson-08-restricted-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/130515110754-oj-retrial-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170720135026-daughter-large-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170718154057-0718-oj-simpson-09-restricted-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170718155407-0718-oj-simpson-11-restricted-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170718160817-0718-oj-simpson-17-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170718160010-0718-oj-simpson-13-restricted-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170718154057-0718-oj-simpson-09-restricted-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170720152327-26-oj-simpson-parole-hearing-0720-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170720151706-24-oj-simpson-parole-hearing-0720-large-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170718160010-0718-oj-simpson-13-restricted-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170718161457-0718-oj-simpson-20-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170718160405-0718-oj-simpson-15-restricted-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/180312083151-judith-regan-large-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170718151917-0718-oj-simpson-04-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170718161047-0718-oj-simpson-18-large-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170718150555-0718-oj-simpson-restricted-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170718155159-0718-oj-simpson-10-restricted-small-11.jpg", "data:image/gif;base64,R0lGODlhEAAJAJEAAAAAAP///////wAAACH5BAEAAAIALAAAAAAQAAkAAAIKlI+py+0Po5yUFQA7", "https://cdn.cnn.com/cnnnext/dam/assets/170718160216-0718-oj-simpson-14-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170718155617-0718-oj-simpson-12-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170720143743-oj-simpson-toobin-disgrace-parole-hearing-nr-00000000-large-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170718152747-0718-oj-simpson-06-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170720134325-o-j-simpson-parole-hearing-explanation-sot-00012208-large-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170718151917-0718-oj-simpson-04-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170718153047-0718-oj-simpson-07-restricted-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170721084439-f-lee-bailey-large-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170718153456-0718-oj-simpson-08-restricted-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170720152327-26-oj-simpson-parole-hearing-0720-super-tease.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170718160817-0718-oj-simpson-17-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170720132745-11-oj-simpson-parole-hearing-0720-large-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170718160614-0718-oj-simpson-16-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170622114327-o-j-simpson-large-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/170717155341-04-oj-simpson-parole-look-back-large-169.jpg"], "top_img": "https://cdn.cnn.com/cnnnext/dam/assets/170720152327-26-oj-simpson-parole-hearing-0720-super-tease.jpg", "keywords": [], "authors": ["Paul Vercammen", "Faith Karimi"], "canonical_link": "https://www.cnn.com/2017/10/01/us/oj-simpson-released-from-prison/index.html", "title": "O.J. Simpson walks out of Nevada prison after 9 years", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0", "section": "us", "referrer": "unsafe-url", "og": {"pubdate": "2017-10-01T07:44:51Z", "url": "https://www.cnn.com/2017/10/01/us/oj-simpson-released-from-prison/index.html", "title": "O.J. Simpson walks out of Nevada prison after 9 years", "description": "O.J. Simpson is beginning post-prison life in the city where he committed the crime that saw him locked up.", "site_name": "CNN", "type": "article", "image": {"identifier": "https://cdn.cnn.com/cnnnext/dam/assets/170720152327-26-oj-simpson-parole-hearing-0720-super-tease.jpg", "width": 1100, "height": 619}}, "pubdate": "2017-10-01T07:44:51Z", "lastmod": "2017-10-02T04:19:21Z", "author": "Paul Vercammen and Faith Karimi, CNN", "article": {"author": "https://www.facebook.com//pages/Faith-M-Karimi/315603561843179"}, "twitter": {"title": "O.J. Simpson walks out of Nevada prison after 9 years", "description": "O.J. Simpson is beginning post-prison life in the city where he committed the crime that saw him locked up.", "card": "summary_large_image", "image": "https://cdn.cnn.com/cnnnext/dam/assets/170720152327-26-oj-simpson-parole-hearing-0720-super-tease.jpg"}, "description": "O.J. Simpson is beginning post-prison life in the city where he committed the crime that saw him locked up.", "keywords": "us, O.J. Simpson walks out of Nevada prison after 9 years - CNN", "thumbnail": "https://cdn.cnn.com/cnnnext/dam/assets/170720152327-26-oj-simpson-parole-hearing-0720-super-tease.jpg", "vr": {"canonical": "https://www.cnn.com/2017/10/01/us/oj-simpson-released-from-prison/index.html"}, "fb": {"app_id": 80401312489, "pages": "5550296508,18793419640"}, "template-top": "us,news,art-vid-vls-col,col-o.j.-simpson"}, "movies": [], "publish_date": 1506830400.0, "source": "https://www.cnn.com", "summary": ""}