{"url": "https://screenrant.com/oceans-8-set-images-anne-hathaway/", "text": "Share Tweet Email Copy Link Copied\n\nThere is a modern trend of Hollywood mining established franchises to minimize the risk of a flop at the box office. Disney's Tomorrowland is one example of a costly film ($190 million) based on an original idea that fell well short of recouping its production costs, further discouraging studios from bringing new properties to the big screen in the process. Remakes/reboots aren't a surefire thing either though, what with this year's Ghostbusters featuring an A-list cast and grossing $220 million worldwide - but doing so on a $140 million production budget, marketing not included.\n\nSpinoffs are more popular than ever right now for related reasons, and Warner Bros. Pictures is moving forward with one such project in Ocean's Eight: a spin-off to the popular George Clooney and Brad Pitt-starring Ocean's Eleven franchise, featuring all-female leads. The movie recently started filming, with Sandra Bullock and Cate Blanchett being spotted on set in New York.\n\nOcean's Eight, which is set to be released during the (already packed) 2018 summer season, also stars Anne Hathaway (The Dark Knight Rises), Rihanna (Battleship), Sarah Paulson (American Horror Story), Mindy Kaling (The Mindy Project), Helena Bonham Carter (the Harry Potter series), and Awkwafina (Neighbors 2: Sorority Rising). Coming Soon has just posted new Ocean's Eight set photos from New York that feature Carter with Blanchett and Bullock - and tease Anne Hathaway's role in the film.\n\nIt's been reported that Sandra Bullock is playing Danny Ocean's (George Clooney) ex-con sister in Ocean's Eight, with Cate Blanchett occupying Rusty's (Brad Pitt) sidekick role to Bullock. The pair will reportedly work alongside others to steal a necklace from the Met Ball, with the intention of pinning the heist on a “villainous gallery owner.”\n\nWhat's perhaps most interesting is Anne Hathaway's role in Ocean's Eight. While not featured live in these set photos, Hathaway is prominently displayed on an ad atop the taxi that Bullock, Blanchett, and Carter are exiting in the images. It thus appears that Hathaway will be some sort of a celebrity in the upcoming film.\n\nIt is worth noting that Ocean's Twelve included a joke where Julia Roberts played both Danny's wife and, well, Julia Roberts. So, it is possible that Anne Hathaway could be playing a similar double role, where she impersonates her doppelganger, Academy-Award winner Anne Hathaway. Odds are likely against using that joke a second time, so expect Hathaway's character to be someone of fame and/or importance in the upcoming film.\n\nOcean’s Eight opens in U.S. theaters on June 8th, 2018.\n\nSource: Coming Soon\n\nNew Justice League Images Show the Original Arkham Scene", "images": ["https://screenrant.com/public/build/images/tg-logo-full-white.fc9e742a.svg", "https://screenrant.com/public/build/images/sr-logo-full-white.b0cc2b44.svg", "https://q.quora.com/_/ad/91f52889f6a04390a65ad2591c59986e/pixel?tag=ViewContent&noscript=1", "https://screenrant.com/public/build/images/th-logo-full-white.7684e614.svg", "https://screenrant.com/public/build/images/hc-logo-full-white.5f66cfe4.svg", "https://screenrant.com/public/build/images/tr-logo-full-white.090c581a.svg", "https://screenrant.com/public/build/images/mm-logo-full-white.fe72c74c.svg", "https://screenrant.com/public/build/images/tv-logo-full-white.642d3d01.svg", "https://screenrant.com/public/build/images/tt-logo-full-white.04a6f0d4.svg", "https://screenrant.com/public/build/images/cb-logo-full-white.afca2e29.svg", "https://screenrant.com/public/build/images/bg-logo-full-white.8242bbb9.svg", "https://screenrant.com/public/build/images/tq-logo-full-white.7436bde3.svg", "https://www.facebook.com/tr?id=297467373958238&ev=PageView&noscript=1", "https://static2.srcdn.com/wordpress/wp-content/uploads/Anne-Hathaway-as-Catwoman-in-The-Dark-Knight-Rises.jpg", "https://screenrant.com/public/build/images/ts-logo-full-white.54beb4cf.svg", "http://b.scorecardresearch.com/p?c1=2&c2=21868715&cv=2.0&cj=1"], "top_img": "https://static2.srcdn.com/wordpress/wp-content/uploads/Anne-Hathaway-as-Catwoman-in-The-Dark-Knight-Rises.jpg", "keywords": [], "authors": ["Mike Jones", "Sandy Schaefer", "Daniel Alvarez"], "canonical_link": "https://screenrant.com/oceans-8-set-images-anne-hathaway/", "title": "Ocean's 8 Set Photos Tease Anne Hathaway's Role in the Film", "meta_data": {"viewport": "user-scalable=yes, initial-scale=1.0, width=device-width", "description": "Additional set photos from Ocean's Eight - now filming in New York - tease Anne Hathaway's role in the Ocean's Eleven spinoff.", "og": {"title": "Ocean's Eight Set Photos Tease Anne Hathaway's Role in the Film", "type": "article", "image": {"identifier": "https://static2.srcdn.com/wordpress/wp-content/uploads/Anne-Hathaway-as-Catwoman-in-The-Dark-Knight-Rises.jpg", "width": 1400, "height": 700}, "url": "https://screenrant.com/oceans-8-set-images-anne-hathaway/", "locale": "en_US", "description": "Additional set photos from Ocean's Eight - now filming in New York - tease Anne Hathaway's role in the Ocean's Eleven spinoff.", "site_name": "ScreenRant"}, "article": {"published_time": "2016-10-27T08:10:31Z", "section": "Movie News"}, "fb": {"app_id": 822150531210883, "pages": 10765693196}}, "movies": [], "publish_date": 1477555831.0, "source": "https://screenrant.com", "summary": ""}