{"url": "www.vogue.com/article/justin-bieber-selena-gomez-relationship-timeline", "text": "Over 2,665 days ago, Justin Bieber and Selena Gomez were spotted—arm in arm—at a Philadelphia IHOP. And so began the long, complicated, and endless saga of “Jelena,” which, in its latest of many twists, has the on-again, off-again couple once again hitting the “off“ switch.\n\nHow did we get here, exactly? You’re forgiven for not knowing. After all, IHOP was centuries ago, or at least 2010, when Barack Obama was a first-term president and America watched American Idol and Survivor. Here’s a comprehensive guide to their on-and-off, up-and-down, are-they-or-aren’t-they relationship.\n\nDecember 2010—The Infamous IHOP Date\n\nTMZ breaks the news that the teen idols enjoyed a “cuddly” date at an IHOP in Philadelphia ahead of a Q102’s Jingle Ball. Gomez tells Us Weekly that it was platonic, and that Bieber is “one of my best friends . . . It was just pancakes!”\n\nBieber, too, stays mum on the subject, telling MTV that she’s “an amazing person,” but, “I think that people are always gonna be interested in my personal life . . . but I gotta keep some things to myself. I’m just having fun being a teenager.”\n\nJanuary 2011—The New Year’s Weekend Kiss\n\nWith dating rumors swirling, paparazzi pictures catch the then 16- and 18-year-olds kissing on a yacht in St. Lucia, essentially proving what fans already suspected—they’re an item.\n\nFebruary 2011—The Big Debut\n\nAt the Vanity Fair Oscar Party, the teen-dream couple made their red carpet debut together, thereby confirming their relationship. They even take some lovey-dovey pictures in the photo booth.\n\nMay 2011—Young and (Visibly) in Love\n\nAfter a glamorous appearance at the Billboard Music Awards, Justin Bieber and Selena Gomez jet off to Maui, Hawaii. Photographers catch them canoodling in the ocean–Gomez noticeably rocking some statement hoops—and the photos go viral.\n\nSeptember 2011—The Staples Center Date\n\nHere we reach peak Jelena—reports surface that Bieber rented the entire Staples Center arena so he and his lady love could watch Titanic, alone. “Romance isn’t dead,” Bieber tweeted. “Treat your lady right fellas.”\n\nNovember 2011—Baby Mama Drama\n\nA storm brews in paradise as a woman accuses Bieber of fathering her child. After a paternity test, the case is thrown out.\n\nDecember 2011–October 2012—All Is . . . Well?\n\nFor the next 10 months, all seems content on the Jelena front. They’re spotted at a Lakers game, on a helicopter ride, at the Teen Choice Awards, and celebrating her birthday. But some tabloid sites start alleging that the two may not be as solid as people think.\n\nNovember 2012—The First Split\n\nBieber and Gomez break up for the first time. Conflicting schedules, trust issues, and their young ages are all rumored to be causes of the demise.\n\nApril 2013—Hidden Lyrics?\n\nAlthough the two aren’t together, and despite the fact that Gomez tells Ryan Seacrest “it’s not really about a specific person,” fans theorize that her new song “Come & Get It,” with lyrics like “Can’t stop because I love it, hate the way I love you / All day all night, maybe I’m addicted for life, no lie,” is about Bieber.\n\nFuel is added to the fire when Bieber allegedly posts—and then quickly deletes—an Instagram with Gomez.\n\nBut at the end of 2013, Bieber admits the two aren’t speaking, although he still loves her.\n\n2014—Are They or Aren’t They?\n\n2014, to put it lightly, was a confusing year in the Jelena timeline. First of all, it’s the year that Bieber’s image goes full-on bad boy—after bizarre incidents in 2013, like peeing in a bucket and losing custody of his monkey—he gets in real, tangible trouble. In January alone, he’s arrested for drunk driving, resisting arrest, and driving without a valid license, and he was also accused of vandalism for egging his neighbors. (January isn’t great for Gomez, either, who checks into rehab.) The tabloids viciously suggest it’s because of Bieber and/or a drug problem, but a frustrated Gomez later tells GQ that it was to seek help for lupus.\n\nBut before the rehab and before the DUI, the couple is spotted riding Segways in Calabasas, California. Throughout the year, and all the drama, the “maybe dates” continue: a Starbucks run in Texas and a day at the zoo. Then, the Instagram—Bieber posts (and also deletes) a bunch of pictures of his former beau, including one that calls their love “unconditional.”\n\nBut concurrently woven in those sightings are other ones . . . with Bieber and other women. He’s associated with a slew of models, up-and-coming actresses, and other beauties—including Kendall and Kylie Jenner, who Gomez at one point reportedly unfollows on Instagram, and she also unfollowed Bieber.\n\nThen there’s the international incident in July 2014, when Orlando Bloom and Justin Bieber get into fist fight, allegedly over Gomez.\n\nIn November, Gomez releases “The Heart Wants What It Wants,” which she suggests is about Bieber. She gives an emotional performance of the song at the American Music Awards, which some signal to mean the relationship has finally run its course. That same month, Bieber unfollows her on Instagram. In December, he posts a picture of himself with Hailey Baldwin, but in the caption says he’s “super single.”\n\n2015—Are They or Aren’t They? (Part Two)\n\nWe’re entering the second of the lost Jelena years, where no one knows quite what’s going on, perhaps not even the Bieber and Gomez themselves.\n\nAfter being spotted holding hands at a Golden Globes party, Gomez and Zedd enjoy a brief romance. Zedd admits two years later to Billboard that he wasn’t ready to date an international superstar like Gomez: “Reporters were calling my parents. People were hacking my friends’ phones. I was pissed. [Though] I kind of knew what I was getting myself into,” he said.\n\nBieber continues to post throwback pictures of Gomez on Instagram, confusing just about everyone—including Drake. Reconciliation rumors ramp up after he tells Ellen DeGeneres that a number of songs on his new album Purpose are about Gomez, and a video surfaces of Bieber serenading her with “My Girl” at a hotel in Beverly Hills.\n\nBut Gomez makes it clear she’s sick of being defined by their relationship. In her cover story with Elle, she says her November 2014 AMA performance was her personal life swan song. “Everybody was talking about the same thing: my relationship,” she remembers. “I was so exhausted. I said, ‘I want this [performance] to be the last time I have to talk about this. And acknowledge this feeling.’ ”\n\nEarly 2016—Here We Go Again\n\nIn January 2016, Justin Bieber posts steamy pictures with Hailey Baldwin in St. Barth’s, which many take to mean they are dating. The speculation increases when Baldwin makes a cameo in Bieber’s GQ cover story. He describes her as “someone I really love. We spend a lot of time together.”\n\nHowever, Baldwin later tells Marie Claire that they weren’t ever official. “We are not an exclusive couple. He’s about to go on tour,” she said. “Relationships at this age are already complicated, but I don’t really like to talk about it because it’s between me and him.”\n\nBieber posts a throwback picture of him and Gomez kissing, and she comments “perfect.”\n\nAugust 2016—Full-Out War\n\nAlthough claiming they’re just friends, Bieber posts a series of Instagrams with Sofia Richie. However, after backlash from fans, Bieber posted “I’m gonna make my Instagram private if you guys don’t stop the hate this is getting out of hand, if you guys are really fans you wouldn’t be so mean to people that I like.”\n\nGomez responded in the comments section: “If you can’t handle the hate then stop posting pictures of your girlfriend lol—it should be special between you two only. Don’t be mad at your fans. They love you.”\n\nThat, allegedly, kicked off a full-on Instagram war between the couple, involving many comments, including cheating accusations on both sides, which are now said to be deleted. Gomez later takes to her Snapchat to say that what she did was “selfish and pointless.” Bieber deletes his Instagram.\n\nA few months later, it's reported that Gomez cut her Revival Tour short to seek treatment at a facility in Tennessee. “My self-esteem was shot. I was depressed, anxious. I started to have panic attacks right before getting onstage, or right after leaving the stage. Basically I felt I wasn’t good enough, wasn’t capable,” she later told Vogue.\n\nJanuary 2017—New Beginnings\n\nGomez begins to date The Weeknd.\n\nMay 2017—Fashionable Debuts\n\nGomez and The Weeknd hit the red carpet couple together at the 2017 Met Gala.\n\nSeptember 2017—Health Scares\n\nGomez reveals on Instagram that she underwent a kidney transplant. (The donor was her friend Francia Raisa.)\n\nOctober 2017—Reunited Again\n\nBieber and Gomez are seen hanging out together again, but multiple sources say it’s just as friends. Allegedly, their church, Hillsong, as well as Gomez’s kidney transplant caused to two to reconnect. And The Weeknd was reportedly fine with it.\n\nHowever, just about a week after the reports, Selena Gomez and The Weeknd announce their split (although, apparently, Bieber was not the cause).\n\nNovember 2017—Conscious Re-Coupling\n\nIn the weeks following Gomez’s breakup with The Weeknd, she's spotted canoodling with Bieber. . . again and again and again. On November 15, they kiss at his hockey game—fueling tabloid speculation that they are back together and better than ever. A few weeks later, they're seen at the Beverly Hills Montage.\n\nJanuary 2018—Yep, This is a ThingAlthough there is no official statement that they are back on, a flurry of sightings (including a New Year's trip to Los Cabos and joint-gym workout) confirm the inevitable: Jelena is definitely a thing.\n\nFebruary 2018—Going StrongFirst, there's a Valentine’s Day date at the Montage Beverly Hills (is this their spot? It's totally their spot). Then, the duo jet off to Jamaica for Bieber's fathers wedding, providing a much-needed distraction to an otherwise terrible news cycle.\n\nMarch 2018—Instagram Official\n\nGomez wishes Bieber a happy birthday on Instagram: \"March 1, 1994 someone I know that happens to be super cool was born. Boom,\" she writes. March 1 is (yes, you guessed it) the day the Sorry singer was born.\n\nYet, days later, reports surface that the two are pressing pause on their relationship. But is it a break. . . or a break up?\n\nPerhaps a People anonymous source put it best: “They’ve been having disagreements, but it wouldn’t be surprising if they’re back together in a week.”\n\nWatch Selena Gomez on Family, Obsessions, and Her Go-To Dance Moves:", "images": ["https://www.vogue.com/wp-content/themes/vogue/images/logo_vogue.svg", "https://assets.vogue.com/photos/59f8964626e9dc667d9ddc1d/16:9/pass/00-social-image-selena-gomez-and-justin-bieber-relationship-timeline.jpg", "http://collector-PX0lizzs6W.perimeterx.net/api/v1/collector/noScript.gif?appId=PX0lizzs6W"], "top_img": "https://assets.vogue.com/photos/59f8964626e9dc667d9ddc1d/16:9/pass/00-social-image-selena-gomez-and-justin-bieber-relationship-timeline.jpg", "keywords": [], "authors": ["Elise Taylor"], "canonical_link": "https://www.vogue.com/article/justin-bieber-selena-gomez-relationship-timeline", "title": "A Detailed History of Selena Gomez and Justin Bieber’s On-Again, Off-Again Relationship", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=no, width=device-width, initial-scale=1, maximum-scale=1", "copyright": "Copyright (c) Condé Nast 2019", "og": {"site_name": "Vogue", "url": "https://www.vogue.com/article/justin-bieber-selena-gomez-relationship-timeline", "title": "A Detailed History of Selena Gomez and Justin Bieber’s On-Again, Off-Again Relationship", "description": "So you can truly understand the latest news.", "image": "https://assets.vogue.com/photos/59f8964626e9dc667d9ddc1d/16:9/pass/00-social-image-selena-gomez-and-justin-bieber-relationship-timeline.jpg", "type": "article"}, "twitter": {"site": "@voguemagazine", "card": "summary_large_image", "domain": "www.vogue.com", "title": "A Detailed History of Selena Gomez and Justin Bieber’s On-Again, Off-Again Relationship - Vogue", "image": {"src": "https://assets.vogue.com/photos/59f8964626e9dc667d9ddc1d/16:9/pass/00-social-image-selena-gomez-and-justin-bieber-relationship-timeline.jpg"}, "creator": "@voguemagazine", "description": "So you can truly understand the latest news."}, "apple-itunes-app": "app-id=1087973225, app-argument=https://www.vogue.com/article/justin-bieber-selena-gomez-relationship-timeline, affiliate-data=ct=smart-banner&pt=45076", "description": "So you can truly understand the latest news.", "keywords": "Living,Selena Gomez,Justin Bieber,mobileAppReadyTrue", "news_keywords": "Living,Selena Gomez,Justin Bieber,mobileAppReadyTrue", "articleSection": "Living", "article": {"publisher": "http://www.facebook.com/vogue"}}, "movies": [], "publish_date": 1522359600.0, "source": "http://www.vogue.com", "summary": ""}