{"url": "www.businessinsider.com/prince-harry-meghan-markle-prince-william-kate-and-11-other-royals-all-live-in-the-same-palace-2018-5", "text": "The many royals of Kensington Palace, and where they live. Harry and Meghan will leave this home in early 2019. Alamy/Business Insider\n\nPrince Harry and Meghan Markle are moving out of Kensington Palace to set up a new home in the grounds of Windsor Castle to prepare for their first child, leaving their royal neighbors behind.\n\nThe couple currently shares the royal residence with more than a dozen other major royals, but they will move to Frogmore Cottage in early 2019.\n\nKensington Palace palace, a royal residence since the 1600s, is easily the most bustling of the royal family's many grand homes. Its resident were at the centre of the two royal weddings and royal birth this year.\n\nA view of Kensington Palace, featuring a statue of its first royal inhabitant, William III. Getty Images\n\nWithin its grounds are a host of separate properties, ranging from relatively humble cottages, to the grand 20-room apartment occupied by Prince William, Kate Middleton, and their young family.\n\nAs well as royal living quarters, which tend to be relatively sedately decorated, it is also home to lavish state rooms used for grand occasions, like this one:\n\nOne of Kensington Palace's many grand interior rooms, which are occasionally opened to the public. Getty Images\n\nHarry and Meghan have been living in Nottingham College:\n\nWhile they may be moving soon, until now Prince Harry and Meghan Markle have been living in a two-bed cottage in the palace grounds.\n\nThey lived there before they got married on May 19, and came back two days after the ceremony to make it their marital home.\n\nThe cottage, nicknamed \"Nott Cott\" and often described as \"snug,\" has been Harry's home since 2013.\n\nMeghan moved in just after their engagement was made public in November 2017. Harry proposed to Meghan when they were spending an evening together at Nottingham Cottage, surprising her while they were roasting a chicken.\n\nAfter announcing their engagement, they gave an interview from the cottage, sitting on its sofa, which is one of the only times the public has seen inside:\n\nPrince Harry and Meghan Markle gave an interview from Nottingham College following their engagement. BBC News\n\nThey will leave Kensington Pace behind in early 2019.\n\nHere's a breakdown of who's who, and where they live in Kensington Palace:\n\nPrince William, Kate Middleton, Prince George, Princess Charlotte, and Prince Louis: Apartment 1A\n\nWilliam, Kate, and their children are not only the largest group of royals in Kensington Palace but the closest to the throne.\n\nPerhaps unsurprisingly, they have the best rooms going. The family of five occupies Apartment 1A, a collection of 20 stately rooms with a commanding view of Hyde Park.\n\nThey moved to Kensington Palace full time in October 2013, not long after their first child, Prince George, was born. Princess Charlotte followed in 2015, and Prince Louis in April 2018.\n\nThe public rarely get to see inside, but photographers were allowed to take photos of a reception room when William and Kate hosted the Obamas in 2016:\n\nGetty Images\n\nWe also saw another view (or maybe even another room) where Prince George played on a rocking horse before meeting the US president.\n\nGetty Images\n\nDuke of Gloucester and Duchess of Gloucester: Apartment 1\n\nThe Duke of Gloucester, one of Queen Elizabeth II's cousins, and his wife, the Duchess of Gloucester, were the last to reside in Apartment 1. It isn't clear whether they moved out during the renovation work.\n\nIt is also not clear if they continued to live in the apartment while renovations were underway. British newspaper The Sun had previously reported that the couple offered to vacate the property to make way for Prince Harry and Meghan Markle, though this plan has not come to fruition in light of their move to Windsor.\n\nThe Duchess and Duke of Gloucester in 2016. Getty Images\n\nLike William and Kate's home at 1A, the dwelling is a large complex of rooms in the main palace building. The two used to be one enormous set of rooms until they were divided in the 1950s.\n\nThe complex has 21 rooms, slightly pipping the size of William and Kate's, but few details are available other than its overall size.\n\nPrincess Eugenie and Jack Brooksbank: Ivy Cottage\n\nThe newest royals at Kensington Palace are Princess Eugenie, who is William's and Harry's cousin, and her husband, Jack Brooksbank, a London socialite.\n\nAccording to The Sun, the couple moved into a cottage right next to Harry and Meghan's about the same time Kate was in the hospital delivering Prince Louis.\n\nPrincess Eugenie's engagement photo with Jack Brooksbank. It was taken in Buckingham Palace. Jonathan Brady/WPA Pool/Getty Images\n\nThe couple announced their engagement in January, a few weeks after getting engaged while vacationing in Nicaragua.\n\nThey got married at Windsor Castle in the same chapel as Harry and Meghan on October 12, but the occasion attracted less publicity.\n\nPrince and Princess Michael of Kent: Apartment 10\n\nPrince Michael of Kent, another of the queen's cousins but from a more junior line, lives in the main palace building with his wife.\n\nShe is known as Princess Michael, in the old-fashioned tradition by which the wives of princes take their husband's name.\n\nPrince and Princess Michael of Kent in 2016. Getty Images\n\nThis same rule means that Kate can technically be referred to as Princess William of Cambridge, and Meghan as Princess Henry of Wales, but the names are not widely used.\n\nTheir apartment, No. 10, consists of five bedrooms and five receptions rooms. They used to have use of the property rent-free, but since 2008 they have been paying a reported£10,000 ($13,600) per month in rent.\n\nThe Duke and Duchess of Kent: Wren House\n\nThe Duke of Kent, Prince Michael's older brother, also lives in the Kensington Palace grounds with his wife, the Duchess.\n\nTheir home, Wren House, is named after the famous British architect Christopher Wren, who built St Paul's Cathedral and several properties for the royal household.\n\nThe Duke and Duchess of Kent in 2014. Getty Images\n\nFew details about their home have ever been made public. It is physically between Ivy and Nottingham cottages and appears to be of a similar size.\n\nWhat about the queen?\n\nQueen Elizabeth II lives at Buckingham Palace with her husband, Prince Philip. It's about 2 miles from Kensington Palace, across Hyde Park and Green Park.\n\nGoogle Maps\n\nIt's not quite as cosy as living on the same property, but if Her Majesty ever wants to drop in on her cousins, grandchildren or great-grandchildren, they aren't far away.", "images": ["https://amp.businessinsider.com/images/5aef5e2419ee8625008b48f9-1136-568.jpg", "https://amp.businessinsider.com/images/5aef5e2419ee8625008b48f9-750-375.jpg"], "top_img": "https://amp.businessinsider.com/images/5aef5e2419ee8625008b48f9-1136-568.jpg", "keywords": [], "authors": ["Kieran Corcoran", "Sinéad Baker", "Samantha Lee"], "canonical_link": "https://www.businessinsider.com/prince-harry-meghan-markle-prince-william-kate-and-11-other-royals-all-live-in-the-same-palace-2018-5", "title": "Prince Harry and Meghan Markle are moving out of their London palace home — here are the 13 other royals they leave behind", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "ii-ab-test": {"hpi4": "control"}, "msapplication-config": "//media.businessinsider.com/public/assets/BI/US/favicons/browserconfig.xml", "theme-color": "#1d607c", "date": "2018-11-26", "sailthru.date": "2018-11-26", "news_keywords": "Prince Harry, Meghan Markle, Prince WIlliam, Kate Middleton, Prince George, Princess Charlotte, princess eugenie, Royal Family, Kensington Palace, Royal Wedding, BI Graphics, Arts & Culture, Royal Wedding 2018, Kieran Corcoran, Sinéad Baker, Samantha Lee", "sailthru.tags": "Prince Harry, Meghan Markle, Prince WIlliam, Kate Middleton, Prince George, Princess Charlotte, princess eugenie, Royal Family, Kensington Palace, Royal Wedding, BI Graphics, Arts & Culture, Royal Wedding 2018, Kieran Corcoran, Sinéad Baker, Samantha Lee", "description": "Kensington Palace in London is home to many royals, but Prince Harry and Meghan Markle are moving before the birth of their first child.", "sailthru.description": "Kensington Palace in London is home to many royals, but Prince Harry and Meghan Markle are moving before the birth of their first child.", "title": "Prince Harry and Meghan Markle are moving out of their London palace home — here are the 13 other royals they leave behind", "sailthru.verticals": "thewire, thelife", "sailthru.title": "Prince Harry and Meghan Markle are moving out of their London palace home — here are the 13 other royals they leave behind", "linkedin": {"owner": "mid:1d5f7b"}, "tbi-image": "https://amp.businessinsider.com/images/5aef5e2419ee8625008b48f9-1136-568.jpg", "sailthru.image.full": "https://amp.businessinsider.com/images/5aef5dfe19ee8626008b4a13-1136-852.jpg", "sailthru.image.thumb": "https://amp.businessinsider.com/images/5aef5dfe19ee8626008b4a13-160-120.jpg", "tbi-vertical": "Entertainment", "sailthru.author": "Samantha Lee", "og": {"title": "Prince Harry and Meghan Markle are moving out of their London palace home — here are the 13 other royals they leave behind", "description": "Kensington Palace in London is home to many royals, but Prince Harry and Meghan Markle are moving before the birth of their first child.", "type": "article", "url": "https://www.businessinsider.com/prince-harry-meghan-markle-prince-william-kate-and-11-other-royals-all-live-in-the-same-palace-2018-5", "image": "https://amp.businessinsider.com/images/5aef5e2419ee8625008b48f9-1136-568.jpg", "site_name": "Business Insider"}, "article": {"publisher": "businessinsider"}, "author": "Kieran Corcoran, Sinéad Baker, Samantha Lee", "twitter": {"url": "https://www.businessinsider.com/prince-harry-meghan-markle-prince-william-kate-and-11-other-royals-all-live-in-the-same-palace-2018-5", "title": "Prince Harry and Meghan Markle are moving out of their London palace home — here are the 13 other royals they leave behind", "description": "Kensington Palace in London is home to many royals, but Prince Harry and Meghan Markle are moving before the birth of their first child.", "card": "summary_large_image", "image": "https://amp.businessinsider.com/images/5aef5e2419ee8625008b48f9-1136-568.jpg", "creator": "@kj_corcoran", "site": "@EntInsider"}, "Business Insider": "Snapchat", "Prince Harry and Meghan Markle are moving out of their London palace home — here are the 13 other royals they leave behind": "The Fastest Way to Share a Moment!", "fb": {"pages": 20446254070}, "apple-itunes-app": "app-id=554260576"}, "movies": [], "publish_date": 1543208400.0, "source": "http://www.businessinsider.com", "summary": ""}