{"url": "https://www.self.com/story/biggest-fitness-trends-of-2018", "text": "While there's no \"right\" way to get sweaty, there's no question that fitness trends can influence how people work out. And with the American College of Sports Medicine's annual survey, we're getting a look at what's going to be big this year. They've pinpointed the top fitness trends of 2018 to watch for, and chances are, if you haven't gotten in on any of them yet, you just might soon.\n\nPublished in the ACSM’s Health & Fitness Journal , more than 4,000 fitness professionals (including trainers, exercise physiologists, and fitness directors) gave their thoughts on the trends they think will be big in 2018. The survey respondents represented organizations including the American College of Sports Medicine, American Council on Exercise, National Council on Strength and Fitness, and The Cooper Institute. The responses were international, too, coming from 41 countries across the world and nearly every continent.\n\nIn the survey, the ACSM made an important distinction between a trend and a fad to the participants. While a trend was defined as “a general development or change in a situation or in the way that people are behaving,\" a fad was \"a fashion that is taken up with great enthusiasm for a brief period.\" (Shout-out to '80s Jazzercise and '90s Tae Bo.) For the purposes of this survey, the ACSM was interested in trends, which have more staying power. Survey respondents were asked to rank 40 potential fitness trends on a 10-point scale, where 1 was least likely to be a trend in 2018, and 10 was most likely to be a trend in 2018.\n\nHere are the top 10 fitness trends of 2018, according to the pros—and what you need to know about each one.\n\n1. High-Intensity Interval Training\n\nHigh-intensity interval training (or HIIT) took the top spot in this year's survey (it was also number one in 2014). A HIIT training session involves bursts of maximum-effort, very hard work (typically about 20 to 90 seconds), followed by a period of low-intensity recovery. The goal is to recover enough that you can go hard again during your next work interval. If you're a beginner, you might have longer rest intervals, or work intervals that are challenging but not at maximum effort.\n\nThe ACSM says HIIT workouts are typically 30 minutes or less, although they can be longer. But while they may be short, they definitely aren't sweet. As the name suggests, HIIT workouts are designed to be high intensity, and a major part of the appeal is that they're an incredibly efficient and effective way to get your cardio in and burn lots of calories (if that's something that matters to you) without requiring a ton of time.\n\nThat said, because they're so intense, you shouldn't be doing HIIT workouts every day. This can lead to overtraining and an increased risk of injury (which survey respondents expressed concerns about, according to the ACSM). Read more about how to correctly do HIIT workouts here .\n\n2. Group Training\n\nGroup training (or group fitness classes) didn't make the top 20 trends until 2017, but their popularity is rapidly rising. The ACSM defines group training as a workout for five or more people led by an instructor, designed to be motivational and effective for people of different fitness levels. This could be anything from trendy HIIT classes like OrangeTheory Fitness, to dance cardio classes, to old-school step classes at the YMCA.\n\nNo matter here are plenty of benefits of group fitness classes. They can be a great way to try a new workout or mix up your routine (many boutique fitness studios offer free or discounted first classes, as a bonus). There's also a social aspect—classes can be a fun way to sweat it out with friends or meet new people. Plus, when you sign up for a class, you're committing to your workout, which can help you stay on track with your routine.\n\n3. Wearable Technology\n\nActivity trackers , smart watches, and heart rate monitors are as popular as ever—if you're into seeing your workouts by the numbers, wearable technology can give you interesting feedback about how you move. Many estimate your steps, sleep, standing time, calories burned, and time spent working out.\n\nHeart rate monitors in particular can also give you objective information about how hard you're actually working during a sweat session, which can be helpful if you're training to be in a specific heart rate zone . (How you feel isn't always an effective measure of how hard you're working—factors including the room temperature and how much you like your workout can also influence how hard a workout feels to you.)\n\nWearable tech is going beyond the Fitbits and Apple Watches people wear on their wrists, too, the ACSM says. The sleek Motiv Ring was recently released, which tracks activity via your finger. Smart fabric and textiles are also on the rise, says the ACSM—Wearable X just introduced the Nadi X yoga pants , which delivers vibrational feedback to the wearer to encourage good form and alignment. The ACSM also notes that smart eyeglasses are gaining in popularity.\n\n4. Bodyweight Training\n\nWhile bodyweight training has been around for a long time, it's been re-popularized by the fitness world over the past several years, says the ACSM. Bodyweight training is popular thanks in part to its convenience. There's no equipment and minimal space required, so bodyweight exercises are great for anytime, anywhere workouts. Most bodyweight exercises are accessible for any fitness level, and they're often easy to modify, too.\n\nPlus, your own body really is an incredible resistance training tool in its own right. Using your bodyweight during exercises including push-ups, squats, planks, lunges, and more can be an incredibly challenging and effective way to work your muscles. Here are 53 at-home bodyweight exercises to try.\n\n5. Strength Training\n\nStrength training has been a strong trend since the first year of the survey, according to the ACSM. And with good reason: Strength training is an extremely important element of any fitness routine. Strength training helps prevent the age-related decline of muscle mass, keeps your bones and heart healthy, and helps prevent pain and injury in everyday life. Muscle mass also plays a role in maintaining a healthy metabolism (although it won't drastically increase the number of calories your body burns at rest).\n\n6. Educated, Certified, and Experienced Fitness Professionals\n\nWhile this might not seem like a particularly glamorous trend, it is an important one. According to the ACSM, there's been growth of educational programs and certification programs that have been accredited through legitimate organizations (such as the Committee on Accreditation for the Exercise Sciences ). Certification standards differ by organization, but in general, a certification means that a trainer has taken a standardized test to demonstrate knowledge of gym safety, exercise form, and training principles.\n\nThere's also an increased interest in more regulation of the industry, according to the ACSM. Overall, it's important that fitness professionals know their stuff to lead clients and classes in a way that's safe and effective.\n\n7. Yoga\n\nWhile yoga has landed on the trends list for many years, it moved up one spot in 2018. The ACSM credits yoga's consistent popularity with being refreshed and reinvented every year—there's no shortage of styles to choose from, including Iyengar yoga, power yoga , Bikram yoga, and more, and each come in and out of popularity.\n\nDevoted practicers credit yoga with mental clarity and stress management, and it's also a great workout for improving flexibility and balance (which are important to an overall fitness routine). Depending on the style, it can also help build muscle strength and endurance.\n\n8. Personal Training\n\nPersonal training has been in the top 10 trends since this survey began, according to the ACSM. Getting one-on-one time with a trainer can help many people reach their goals in a safe and effective way that works for them. Of course, personal training isn't the only way to have an efficient and individualized workout routine—it can be pretty expensive, so while personal training can be helpful, it's also not realistic for everyone.\n\nPart of this trend is also in making sure personal trainers are educated, notes the ACSM—in fact, recent legislation has been introduced in several states to establish licensing of personal trainers (although none of it has been adopted yet). Here's what to consider if you're thinking about hiring an online personal trainer.\n\n9. Fitness Programs for Older Adults\n\nAccording to the ACSM, there's a growing market for fitness programs that are tailored to older adults. After all, staying active is a great way for people to maintain bone and muscle mass with age, in addition to overall health benefits. In 2018, there may be more specific classes and fitness programs designed for retired people looking to make fitness a priority.\n\n10. Functional Fitness\n\nAccording to the ACSM, \"functional fitness is defined as using strength training to improve balance, coordination, force, power, and endurance to enhance someone’s ability to perform activities of daily living.\" For example, a squat is a functional exercise because it also works the muscles you use to squat down to grab the phone you dropped.\n\nThink of functional training as training for life, whether you're hauling boxes into a new home or reaching up to grab a suitcase from the overhead bin on a plane. It's about feeling strong and capable in all areas of your life—not just at the gym.\n\nRelated:", "images": ["https://media.self.com/photos/5ae786345635d315eb4326cb/4:3/h_130/DSC_9427.jpg", "https://media.self.com/photos/5a6b4f2b080d59414359e815/4:3/h_130/fitness-routine.jpg", "https://media.self.com/photos/57f80ec2fb1e273f1c402a0f/2:1/pass/hiit-workout-benefits.jpg", "https://media.self.com/photos/57f80ec2fb1e273f1c402a0f/4:3/w_728,c_limit/hiit-workout-benefits.jpg", "https://collector-PX69t0oUvr.perimeterx.net/api/v1/collector/noScript.gif?appId=PX69t0oUvr", "https://media.self.com/photos/5c14016b71c2e92ac17cdab8/4:3/h_130/GettyImages-1012617912.jpg", "https://www.self.com/images/self-starter-failsafe.jpg"], "top_img": "https://media.self.com/photos/57f80ec2fb1e273f1c402a0f/2:1/pass/hiit-workout-benefits.jpg", "keywords": [], "authors": ["Alexa Tucker", "January"], "canonical_link": "https://www.self.com/story/biggest-fitness-trends-of-2018", "title": "The 10 Biggest Fitness Trends of 2018", "meta_data": {"generator": "autopilot-build-Sat Jul 13 2019 03:47:10 GMT+0000 (UTC)", "msapplication-tap-highlight": "no", "viewport": "user-scalable=no, width=device-width, initial-scale=1, maximum-scale=1", "author": "Alexa Tucker", "copyright": "Copyright (c) Cond&#233; Nast 2019", "description": "The  American College of Sports Medicine's annual survey found the top fitness trends of 2018, according to professionals. Here's what to watch for this year.", "keywords": "news,fitness trends,fitness news,ACSM", "news_keywords": "Fitness,news,fitness trends,fitness news,ACSM", "og": {"description": "Learn what these rising trends can do for you.", "image": "https://media.self.com/photos/57f80ec2fb1e273f1c402a0f/2:1/pass/hiit-workout-benefits.jpg", "site_name": "SELF", "title": "The 10 Biggest Fitness Trends of 2018", "type": "article", "url": "https://www.self.com/story/biggest-fitness-trends-of-2018"}, "twitter": {"card": "summary_large_image", "creator": "@SELFmagazine", "description": "Learn what these rising trends can do for you.", "domain": "https://www.self.com", "image": {"src": "https://media.self.com/photos/57f80ec2fb1e273f1c402a0f/2:1/pass/hiit-workout-benefits.jpg?mbid=social_retweet"}, "site": "SELFmagazine", "title": "The 10 Biggest Fitness Trends of 2018"}, "fb": {"pages": 8908243810, "admins": "1515690174,835972574,1301604672,505160,43600163"}}, "movies": [], "publish_date": null, "source": "https://www.self.com", "summary": ""}