{"url": "revolt.tv/stories/2018/05/31/love-kanye-wests-important-album-070077548b", "text": "UPDATE: This article previously referred to Kanye West's album as 'Love Everyone,' and has been edited to reflect its title 'ye.'\n\nThat's not being facetious. Considering the controversy surrounding Kanye West, his loosening grip on occupying the pinnacle of hip hop and ye being his eighth studio album, this album has the distinction of being a make-or-break point of the Chicago rapper and producer’s career. Yes, this is even more important than 2007’s Graduation, where West and 50 Cent went head-to-head with 'Ye coming out on top and signaling a shift from ultra aggressive rap to something more conscious. That was about the tone of hip hop; this is about the individual.\n\nObviously, every album can be deemed as the most important of an artist’s career. But this is different. Kanye West spent much of his career demanding respect from his peers. He questioned any review that wasn’t the equivalent of a classic and provided a bridge from the underground to the mainstream as rappers such as Talib Kweli, Common and Mos Def were pushed into the limelight. He was determined to be ambitious. The College Dropout redefined a sound while Late Registration took extra steps to refine it. Graduation represented the shift in musical ideology while 808s & Heartbreak introduced a new style and thematic content that a new wave of rappers would adopt. My Beautiful Dark Twisted Fantasy is arguably the crown jewel of Kanye West albums that was universally acclaimed and earned him the classic status that he so desperately sought after. Watch The Throne was West tooting his horn as the pinnacle of rap royalty alongside JAY-Z and Yeezus would be his most daring project.\n\nBut somewhere down the line, the wheels started to come off. The rollout for The Life of Pablo was questionable at best and produced an album that was a sonic mess, but maintained cultural relevancy and acclaim. This acclaim was arguably a byproduct of the individual behind it rather than it being willingly accepted by fans. If TLOP was delivered by any other artist than Kanye West, chances are that it would have been panned. His lyrics drifted away from the self-conscious and relatable to mindless drivel that focused more on aesthetic than substance. It lacked the ambitious focus of Yeezus and felt like a direct reflection of Kanye’s life at the time. Deeply flawed but unable to pull himself away from the spotlight, legitimate questions regarding West’s reign at the top surfaced. Especially when the world has witnessed the rise of Drake, Kendrick Lamar and J. Cole while JAY-Z re-established himself as one of the greatest to ever do it with 4:44.\n\nBut the music wasn’t so much in question as Kanye’s character. From his interruption of Taylor Swift’s reception of Best Female Video at the 2009 MTV Video Music Awards and the infamous “How Sway?” rant in 2013, to numerous questions regarding his mental health, possible drug addictions and the burning spotlight of being married to Kim Kardashian, it felt like we were watching Kanye West’s life unravel in front of our eyes. His obsessions appeared to be less about the music and more about fashion.\n\nBut nothing was worse than when the 40-year-old took to Twitter in May to profess his undying love for Donald Trump followed by an ill-advised appearance on TMZ when he suggested that slavery was a choice. Even the staunchest of Kanye supporters were ready to turn their lifelong fanclub cards in. With his credibility on the line, Kanye has stated that his new album will explain everything. That statement puts a great deal of pressure on a man who has had quite the intriguing fall from grace over the past couple of months.\n\nHowever, through it all, the music has been the one thing that could force many of us to overlook his questionable antics. Because, at the root, it’s all about the music, right?\n\nTo be honest, for some, Kanye has already reached the point of no return. But there’s also this part about separating the art from the artist that still holds true. And if Kanye West is able to explain away any of his previous transgressions with this album, he would be forgiven for those questionable antics.\n\nWhat also makes the pending release of ye more significant is the fact that he already delivered a Pusha T album that was immediately embraced as a classic. West proved that he wasn’t trapped in the stylings of aggro-rap and went back to the basics with chopped samples and wicked drums. If that’s any indication of what we could see on Kanye’s album, we may be in for a treat.\n\nAs for the lyrics, that’s another question in its entirety. West’s subject matter has dissolved into the absurd over the past couple of albums. Like his life, West’s rhymes haven’t necessarily been rooted in a reality that any of us can understand. He’s spent much of his time waxing poetic about celebrity status and being a God and less about things that his fans can find tangible. Then again, that has been the appeal of Kanye West to a certain segment of fans. Production is only half the battle because rhymes are just as (if not more) important to the equation. West has never been a deft lyricist but he has been serviceable with a penchant for nailing a quotable here and there. Lately though? Not so much.\n\nA lot of this pressure he put on himself over the course of his career. He desired the spotlight so badly that it nearly ruined him. And now that he’s at a place where he can’t breathe without people questioning his motives, his new album is going to be dissected unlike any release before it. We’ll be searching for answers regarding his opioid abuse, liposuction, his love for Trump and all of this “free thinking” rhetoric he has been spilling for the past month.\n\nMuch will be answered when ye is released. It may not be the defining moment of a career that has had so many significant instances. However, given the spotlight and controversy surrounding the talented rapper from the Windy City, a lot is riding on this moment.", "images": ["https://res-3.cloudinary.com/revolttv/image/upload/w_938/c_crop,f_auto,fl_lossy.force_strip,q_auto:best,h_394,w_700,x_76,y_7/rojur2dkrhcimerliolq.png", "https://res-3.cloudinary.com/revolttv/image/upload/c_fill,f_auto,fl_lossy.force_strip,q_auto:best,g_faces,h_394,w_700/pxkfl6szz3v7qhuu6hpq.jpg", "https://res-2.cloudinary.com/revolttv/image/upload/c_fill,f_auto,fl_lossy.force_strip,q_auto:best,g_faces,h_394,w_700/ghqpkl2zlxka3wpoeozd.png", "https://res.cloudinary.com/revolttv/image/upload/footer_1.jpg", "https://res-3.cloudinary.com/revolttv/image/upload/c_fill,f_auto,fl_lossy.force_strip,g_faces,h_225,w_400/y2ul1tzd6cxfbitrw6us.jpg", "https://www.facebook.com/tr?id=819806951474948&amp;ev=PageView&amp;noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=17345295&ns_site=revolt&ns_alias=859a4b00-6ac0-4906-969c-16e6fb7073b3&rtv_site=web&name=web.stories.story.love-kanye-wests-important-album-070077548b&category=web.story&rtv_page_type=story", "https://res-4.cloudinary.com/revolttv/image/upload/c_fill,f_auto,fl_lossy.force_strip,q_auto:best,g_faces,h_394,w_700/pky13mowlnpgmqcxraau.jpg", "https://res-2.cloudinary.com/revolttv/image/upload/c_fill,f_auto,fl_lossy.force_strip,q_auto:best,g_faces,h_394,w_700/qpbms58amzasqbu2prnl.jpg", "https://res.cloudinary.com/revolttv/image/upload/footer_2.jpg", "https://res.cloudinary.com/revolttv/image/upload/footer_3.jpg", "data:image/jpeg;base64,/9j/4AAQSkZJRgABAQAAAQABAAD/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAUACQDASIAAhEBAxEB/8QAGAABAAMBAAAAAAAAAAAAAAAAAAYHCAX/xAAoEAABBAEDAgUFAAAAAAAAAAABAAIDBBEFBiEHEhMUMUFRFSIjMnH/xAAXAQEBAQEAAAAAAAAAAAAAAAACBAMB/8QAHhEAAgICAgMAAAAAAAAAAAAAAAECBAMREjEhIkH/2gAMAwEAAhEDEQA/ALa0ePz1COeNuGv5wupp8La11plx2HgquNL6jaXpWgmq+Q+Za0gY+VDtr9VPLape+sWHywO5jHws4YtJbKMsnyeiwOtNarDRrSwyAlz/AEVYN7TC3BU63E2turbrbjL0cQb+QRk8kLpbV2ppd3TonSRdzi0ZOVhmrSnLwU1rUcUPYztue21urPb64aEWlLfTPb1icySUQ5x98onGvpaBK2m20ZttuIrMfn7nckrg3f3DvdEVvwjfZLKdycbZ8USO72u7R/FovpTI6bbdWWQ5eWjJREYdnZ9E4cOUREgH/9k=", "https://res-5.cloudinary.com/revolttv/image/upload/w_700/c_crop,f_auto,fl_lossy.force_strip,q_auto:best,h_394,w_700,x_0,y_0/ydujcv6gihphe4xihtor.jpg", "https://res-4.cloudinary.com/revolttv/image/upload/w_700/c_crop,f_auto,fl_lossy.force_strip,q_auto:best,h_394,w_700,x_0,y_82/bncvlan1dgrsngck7vop.jpg", "https://res.cloudinary.com/revolttv/image/upload/c_fill,f_auto,fl_lossy.force_strip,g_faces,h_630,w_1200/hig7yr5g10y5iugrdfkw.png", "https://res-3.cloudinary.com/revolttv/image/upload/w_1300/c_crop,f_auto,fl_lossy.force_strip,q_auto:best,h_731,w_1300,x_0,y_0/hig7yr5g10y5iugrdfkw.png"], "top_img": "https://res.cloudinary.com/revolttv/image/upload/c_fill,f_auto,fl_lossy.force_strip,g_faces,h_630,w_1200/hig7yr5g10y5iugrdfkw.png", "keywords": [], "authors": [], "canonical_link": "https://revolt.tv/stories/2018/05/31/love-kanye-wests-important-album-070077548b", "title": "'ye' could be Kanye West's most important album", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0", "fb": {"pages": 392148947525572, "app_id": 843938542358554}, "msapplication-TileColor": "#8B0C10", "msapplication-TileImage": "/assets/favicon-144.png", "description": "Now that he can’t breathe without people questioning his motives, his new album will be dissected unlike any other. We’ll be searching for answers.", "keywords": "hip hop, news, interest, new releases, Kanye West, album news, new music", "og": {"type": "website", "title": "'ye' could be Kanye West's most important album", "description": "Now that he can’t breathe without people questioning his motives, his new album will be dissected unlike any other. We’ll be searching for answers.", "image": {"identifier": "https://res.cloudinary.com/revolttv/image/upload/c_fill,f_auto,fl_lossy.force_strip,g_faces,h_630,w_1200/hig7yr5g10y5iugrdfkw.png", "width": 1200, "height": 630}, "url": "https://revolt.tv/stories/2018/05/31/love-kanye-wests-important-album-070077548b", "site_name": "REVOLT TV"}, "twitter": {"card": "summary_large_image", "site": "@revolttv", "title": "'ye' could be Kanye West's most important album", "image": "https://res.cloudinary.com/revolttv/image/upload/c_fill,f_auto,fl_lossy.force_strip,g_faces,h_630,w_1200/hig7yr5g10y5iugrdfkw.png", "description": "Now that he can’t breathe without people questioning his motives, his new album will be dissected unlike any other. We’ll be searching for answers."}}, "movies": [], "publish_date": 1527739200.0, "source": "http://revolt.tv", "summary": ""}