{"url": "https://en.wikipedia.org/wiki/Jada_Pinkett_Smith", "text": "American actress\n\nJada Pinkett Smith (; born September 18, 1971)[1] is an American comedian, actress, singer-songwriter, and businesswoman.\n\nShe began her acting career in 1990, with a guest appearance on the short-lived sitcom True Colors, and subsequently starred in the television series A Different World (1991–1993). She made her feature film debut in Menace II Society (1993). Her breakthrough came opposite Eddie Murphy in The Nutty Professor (1996), and she has since starred in more than 20 feature films, including Set It Off (1996), Scream 2 (1997), Ali (2001), The Matrix Reloaded (2003), The Matrix Revolutions (2003), Collateral (2004), the Madagascar films (2005–2012), Bad Moms (2016), and Girls Trip (2017). On television, she has starred in Hawthorne (2009–2011) and Gotham (2014–2016).\n\nPinkett Smith launched her music career in 2002, when she helped create the metal band Wicked Wisdom, for which she is a singer and songwriter. Along with her husband Will Smith, she has a production company, and has had producing credits in films, documentaries, and television series. She also wrote a children's book, Girls Hold Up This World, which was published in 2004.\n\nJada has been married to Will Smith since 1997, with whom she has two children, son Jaden and daughter Willow. Through their marriage she is also stepmother to Smith's son from his first marriage, Trey Smith.\n\nFamily and early life [ edit ]\n\nBorn in Baltimore, Maryland, Jada Pinkett Smith was named after her mother's favorite soap-opera actress, Jada Rowland.[1] Pinkett Smith is of Jamaican and Barbadian descent on her mother's side and African American descent on her father's side.[2][3][4] Her parents are Adrienne Banfield-Jones, the head nurse of an inner-city clinic in Baltimore, and Robsol Pinkett, Jr., who ran a construction company. Banfield-Jones, who during the 2010s became Adrienne Banfield-Norris,[5] became pregnant in high school; the couple married but divorced after several months.[6][7] Banfield-Jones raised Pinkett with the help of her own mother, Marion Martin Banfield, a Jamaican-born social worker.[8][9] Banfield noticed her granddaughter's passion for the performing arts and enrolled her in piano, tap dance, and ballet lessons.[10]\n\nPinkett Smith has remained close to her mother and said, \"A mother and daughter's relationship is usually the most honest, and we are so close.\" She also added: \"[My mother] understood what I wanted and never stood in my way.\"[11] She participated as the maid of honor in Banfield-Norris' 1998 wedding to Paul Jones, a telecommunications executive.[12] Pinkett Smith has shown great admiration for her grandmother, saying, \"My grandmother was a doer who wanted to create a better community and add beauty to the world.\"[13]\n\nPinkett Smith attended the Baltimore School for the Arts, where she met and became close friends with her classmate, rapper Tupac Shakur. When she met Shakur, she was a drug dealer.[14] She majored in dance and theatre and graduated in 1989.[15]\n\nActing career [ edit ]\n\nBeginnings (1990–1995) [ edit ]\n\nPinkett began her acting career in 1990, when she starred in an episode of True Colors. She received guest roles in television shows such as Doogie Howser, M.D. (1991) and 21 Jump Street (1991), and earned a role on comedian Bill Cosby's NBC television sitcom A Different World in 1991, as college freshman Lena James.[6]\n\nIn 1994, Pinkett Smith acted with Keenen Ivory Wayans in the action and comedy film A Low Down Dirty Shame. She described her character, Peaches, as \"raw\" with \"major attitude\",[16] and her acting garnered positive reviews. The New York Times noted, \"Ms. Pinkett, whose performance is as sassy and sizzling as a Salt-n-Pepa recording, walks away with the movie.\"[17] In 1994, she also starred as a title character in Doug McHenry's romantic drama Jason's Lyric (1994), opposite Allen Payne, and in 1995, played a convict on work release in the horror film Demon Knight (1995). Roger Ebert, in his review for the former film, praised the chemistry between Payne and Pinkett Smith, writing: \"[He] has powerful chemistry with the enigmatic, teasing, tender character played by Pinkett; they really seem to like one another, which is not a feeling you always pick up in screen romances\".[18]\n\nRise to prominence (1996–2003) [ edit ]\n\nPinkett Smith starred with actor and comedian Eddie Murphy in the 1996 remake of The Nutty Professor, portraying the love interest of a kind-hearted University professor who is morbidly obese. The film was a commercial success, earning US$25 million in its first weekend in North America; it eventually made US$274 million worldwide.[19][20] She also had a role in Set It Off (1996), a crime drama about four women who rob banks to escape from poverty, opposite Queen Latifah, Vivica A. Fox, and Kimberly Elise. Her acting in the film was noted in the San Francisco Chronicle, where they said she was \"the one to watch\".[21] Budgeted at US$9 million, Set It Off made US$41 million globally.[22]\n\nIn 1997, Pinkett Smith had a cameo role in Scream 2 as a college student who is brutally murdered in front of hundreds of cinemagoers. The film made more than US$100 million at the North American box office. In 1998, she played a news reporter in the thriller Return to Paradise, with Joaquin Phoenix and Vince Vaughn, and took on the title role of an extroverted woman, alongside Tommy Davidson, in the comedy Woo. While giving positive reviews to her performance in Woo, Derek Armstrong of AllMovie stated that the script was \"formulaic\" and \"not much of a vehicle for its impish starlet\".[23] She next starred in Spike Lee's film Bamboozled (2000), as a personal assistant to the main character portrayed by Damon Wayans. Although the film met with mediocre reviews, it won the Freedom of Expression Award by the National Board of Review.[24]\n\nPinkett Smith in 2001\n\nIn 2001, Pinkett Smith portrayed a loud mouthed wife in the moderately successful comedy Kingdom Come, with LL Cool J, Vivica A. Fox, Anthony Anderson, Toni Braxton, and Whoopi Goldberg.[25] In the biographical sports drama Ali (also 2001), she played Sonji Roi, the first wife of boxer Muhammad Ali, opposite Will Smith. While she loved the final product, she initially did not think she was the right person for the role: \"I felt like because we were a couple off screen, for people to see us together on the screen in a movie like this, would take people out of the movie, that people would see Will and Jada there — they wouldn’t see Ali and Sonji\".[26]\n\nPerhaps her best-known role to date is the part of human rebel Niobe in the films The Matrix Reloaded (2003) and The Matrix Revolutions (2003), sequels to 1999's The Matrix, and the related video game Enter The Matrix (2003). The character was written specifically with Pinkett Smith in mind.[27] Directly after she filmed her scenes for Ali, Pinkett Smith flew to Australia to work on the Matrix sequels. The New York Times highlighted the film's \"postmodern purview that accords equal weight to philosophical ideals from people of color\" and noted that \"few actresses have ever been as luminously photographed as Ms. Pinkett Smith\".[28] The sequels earned over US$91 million and US$48 million during their North American opening weekends, respectively.[29][30]\n\nActing, producing, and directing (2004–2013) [ edit ]\n\nIn the neo-noir thriller Collateral (2004), alongside Jamie Fox and Tom Cruise, Pinkett Smith obtained the role of a U.S. Justice Department prosecutor and the target of a contract killer. The film was a critical and commercial success, grossing US$217.8 million worldwide.[31] She voiced Gloria, a strong, confident, but sweet hippopotamus, in the computer animated film Madagascar (2005).[32] Tom McGrath, one of the film's directors, stated they found all these traits in her voice when they listened to her.[33] Despite a mixed response from critics,[34] the film was a commercial success, earning US$532 million worldwide,[35] making it one of the biggest hits of 2005.[36] In 2007, she played the wife of an affluent dentist in the drama Reign Over Me, with Adam Sandler, Don Cheadle, Liv Tyler, and Donald Sutherland. Entertainment Weekly described the film as a \"strange, black-and-blue therapeutic drama equally mottled with likable good intentions and agitating clumsiness\", and found Pinkett Smith to be \"graceful\" in it.[37]\n\nIn 2008, Pinkett Smith took on the role of a lesbian author in the all-female comedy The Women, opposite Meg Ryan, Annette Bening, Debra Messing, and Eva Mendes.[38] Though a commercial success, The Women was panned by critics, with Pinkett Smith earning a nomination for the Golden Raspberry Award for Worst Actress for her performance. Her directorial debut was the drama The Human Contract (also 2008); she also wrote, and starred as the sister of a successful but unhappy businessman, with Paz Vega and Idris Elba. It debuted at the Cannes Film Festival in May 2008.[39] The success of Madagascar led Pinkett Smith to return to the role of Gloria in the 2008 sequel Madagascar: Escape 2 Africa, which earned US$603 million at the international box office.[40]\n\nPinkett Smith was an executive producer and starred as a Chief Nursing Officer in the TNT medical drama Hawthorne, which premiered on June 16, 2009.[41] USA Today remarked: \"Pinkett Smith's Hawthorne is tired in every sense of the word, and she's not the only one. Every character and event falls under the category of painfully predictable\".[42] Hawthorne ended on August 16, 2011, after three seasons. While she reprised the voice role of Gloria in Madagascar 3: Europe's Most Wanted (2012), which made over US$746 million,[43] she also voiced the character in the NBC Christmas special Merry Madagascar (2009) and the direct-to-DVD film Madly Madagascar (2013).\n\nCommercial success (2014–present) [ edit ]\n\nBeginning in 2014, Pinket Smith starred in the first season of the FOX crime drama Gotham, as Gotham City gangster Fish Mooney.[44][45] She returned, recurrently, in the second and third seasons of the series. In 2015, she starred in the comedy Magic Mike XXL, as the manager of a star stripper club, opposite Channing Tatum and Joe Manganiello. The film made US$122.5 million worldwide.[46] She starred with Mila Kunis, Kristen Bell and Christina Applegate in the comedy Bad Moms (2016), as the sidekick of a domineering parent-teacher association head.[47] It received mixed reviews from critics, who praised the cast and humor, though did not feel it could \"take full advantage of its assets\".[48] The film, nevertheless, earned more than US$183.9 million.[49]\n\nPinkett Smith next took on the role of a nurse and uptight mom in the comedy Girls Trip (2017), alongside Regina Hall, Queen Latifah and Tiffany Haddish. The film was chosen by Time magazine as one of its top ten films of 2017,[50] and grossed US$140 million worldwide, including over US$100 million domestically, the first comedy of 2017 to do so.[51] Beginning in May 2018, Pinkett Smith has hosted the Facebook Watch talk show Red Table Talk, which features her mom and her daughter and focuses on a wide range of topics, with these being watched from three different perspectives.[52] In a positive review, USA Today's Maeve McDermott praised the series for its \"insightful guests, no-holds-barred topics and Smith’s magnetic hosting presence\".[53]\n\nMusical career [ edit ]\n\nI listened to all kinds of metal as a kid. Metallica Guns N' Roses . I would always look at Axl Rose and say, \"Why aren't there any chicks out there doing this now?\" I always wanted an opportunity to get out there and rock out. —Pinkett Smith on why she created Wicked Wisdom[54]\n\nUnder the stage name Jada Koren, Pinkett Smith formed the metal band Wicked Wisdom in 2002.[54] The band consists of Pinkett Smith performing lead vocals, Pocket Honore (guitar, vocals), Cameron \"Wirm\" Graves (guitar, keyboard, vocals), and Rio (bass, vocals). The band is managed by James Lassiter and Miguel Melendez of Overbrook Entertainment, a company co-founded by Pinkett Smith's husband Will Smith.[55]\n\nThe band's self-titled debut album was released on February 21, 2006, by Pinkett Smith's production company 100% Womon and Suburban Noize Records. Will Smith served as the project's executive producer.[56] The album made it to Billboard's Top Heatseekers chart, and peaked at number 44 during the week of March 11, 2006. AllMusic reviewer Alex Henderson said of the album, \"[Pinkett Smith] shows herself to be an expressive, commanding singer\" and that \"[Wicked Wisdom] shows considerable promise\".[57] The band promoted the album in 2006, touring with heavy metal band Sevendust.[58]\n\nOnyx Hotel Tour [ edit ]\n\nWicked Wisdom landed a slot on Britney Spears' Onyx Hotel Tour in 2004, one of the year's highest-profile tours. The band opened for Spears for eight dates in April and May 2004, during the European leg of the tour.[59]\n\nOzzfest 2005 [ edit ]\n\nIn 2005, Sharon Osbourne went to see Wicked Wisdom perform at a small nightclub in Los Angeles. She said, \"I was blown away. When you see and hear Jada with her band it's apparent that she has nothing but love and respect for this genre of music\".[55] In May 2005 organizers announced Wicked Wisdom would perform on the second stage of 2005's Ozzfest.[60] Fans of the festival were outraged, claiming the band did not have the credibility to perform at the music festival. Aware of the questions about the band's addition to Ozzfest, Pinkett Smith said, \"I'm not here asking for any favors. You've got to show and prove. And not every audience is going to go for it.\"[61] Wicked Wisdom's guitarist Pocket Honore said while early dates of the tour were rocky, \"once word got out that we weren't a joke, people started coming out and by the sixth or seventh gig we were on fire\".[54] Pinkett Smith agreed, saying, \"After seven dates within the Ozzfest tour, the whole attitude of it started to turn around once the word of mouth started getting out.\"[58]\n\nOther ventures [ edit ]\n\nBusiness [ edit ]\n\nAfter opening her music company 100% Womon Productions,[41] Pinkett Smith created her own fashion label, Maja, in 1994. The clothing line features women's T-shirts and dresses embellished with the slogan \"Sister Power\", sold primarily through small catalogs.[10]\n\nIn 2003, Pinkett Smith and Smith helped to create the television series All of Us, which aired on UPN/The CW. Pinkett Smith published her first children's book, Girls Hold Up This World, in 2004. \"I wrote the book for Willow and for her friends and for all the little girls in the world who need affirmation about being female in this pretty much masculine world. I really tried to capture different sides of femininity. I want girls in the world to feel powerful, to know they have the power to change the world in any way they wish.\"[62]\n\nIn 2005, Pinkett Smith became one of many celebrities to invest a combined total of US$10 million in Carol's Daughter, a line of beauty products created by Lisa Price.[63] She became a spokesperson for the beauty line, and said, \"To be a part of another African American woman's dream was just priceless to me.\"[64]\n\nPhilanthropy [ edit ]\n\nTogether with Will, Pinkett Smith has created the Will and Jada Smith Family Foundation in Baltimore, Maryland, a charity which focuses on youth in urban inner cities and family support. Her aunt, Karen Banfield Evans, is the foundation's executive director. The charity was awarded the David Angell Humanitarian Award by The American Screenwriters Association (ASA) in 2006. The Will and Jada Smith Family Foundation has provided grants to non-profit organizations such as YouthBuild,[65] and Pinkett Smith has made personal donations to organizations such as Capital K-9s.[66]\n\nWhen Pinkett Smith's aunt, Karen Banfield Evans, was diagnosed with lupus,[67] the Will and Jada Smith Family Foundation, in association with the Lupus Foundation of America and Maybelline, held the first annual \"Butterflies Over Hollywood\" event on September 29, 2007, at the El Rey Theatre in Los Angeles. The event raised funds for LFA public and professional educational programs.[68] The Will and Jada Smith Family Foundation was presented with an award in 2007 at the 4th Annual Lupus Foundation of America Awards.[69]\n\nIn 2012, on behalf of PETA, Pinkett Smith wrote a letter to Baltimore's mayor, asking that the visiting Ringling Brothers Circus \"comply with Baltimore’s absolute prohibition of the use of devices such as bullhooks\" and not harm the elephants.[70] In 2013, she appeared in a video clip for Gucci's \"Chime for Change\" campaign that aims to raise funds and awareness of women's issues globally.[71]\n\nIn 1997, Pinkett Smith was the emcee of the Million Woman March in Philadelphia.[72][73][74]\n\nPersonal life [ edit ]\n\nFamily [ edit ]\n\nPinkett Smith with her husband and children at the 2009 Nobel Peace Prize Concert\n\nJada met Will Smith in 1994 on the set of Smith's television show The Fresh Prince of Bel-Air, when she auditioned for the role of his character's girlfriend, Lisa Wilkes. She was considered too short and the role went to actress Nia Long. Jada and Will became friends, and began dating in 1995. On December 31, 1997, about 100 guests attended their wedding at The Cloisters, near her hometown of Baltimore, Maryland.[75] Regarding her marriage, Jada said that they are \"private people\"[76] and told one interviewer, “I will throw my career away before I let it break up our marriage. I made it clear to Will. I'd throw it away completely.”[77]\n\nJada and Will have two children, Jaden (b. 1998),[75][78] and Willow (b. 2000). She is also the stepmother of Trey Smith, Will's son from a previous marriage.[9][75]\n\nWill commented in 2008 on their parenting styles: \"We're not strict but we definitely believe it's a very important component for rearing children. It creates safety for them. They understand that they need guidance.\"[79] Jaden and Willow are currently being homeschooled.[13] The family resides in a 27,000 square foot (2,500 m2) home, on 100 acres (40 ha), in Malibu.[11]\n\nScientology [ edit ]\n\nAfter meeting Tom Cruise during the filming of Collateral in 2004, Pinkett Smith and Smith donated US$20,000 to the Hollywood Education and Literacy Program (HELP), Scientology's basis for homeschooling.[80] In October 2018, Leah Remini and Jada Smith cleared their differences on Red Table Talk where both stated that Jada and Will were never involved with the Church.[81]\n\nFilmography [ edit ]\n\nVideo games Year Title Role Notes 2003 Enter the Matrix Niobe Live-action cutscenes and voice\n\nAwards and nominations [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/1/18/Pinkett-Smith.jpg/170px-Pinkett-Smith.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ef/Nobel_Peace_Price_Concert_2009_Will_Smith_and_Jada_Pinkett_Smith_with_children2.jpg/170px-Nobel_Peace_Price_Concert_2009_Will_Smith_and_Jada_Pinkett_Smith_with_children2.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4b/Jada_Pinkett_Smith_1998.jpg/170px-Jada_Pinkett_Smith_1998.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/99/Question_book-new.svg/50px-Question_book-new.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/Jada_Pinkett_Smith_at_NY_PaleyFest_2014_for_Gotham.jpg/220px-Jada_Pinkett_Smith_at_NY_PaleyFest_2014_for_Gotham.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Wikinews-logo.svg/40px-Wikinews-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/b/bd/Jada_Pinkett_Smith_at_NY_PaleyFest_2014_for_Gotham.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/f/fd/Portal-puzzle.svg/16px-Portal-puzzle.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/94/Symbol_support_vote.svg/19px-Symbol_support_vote.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/b/bd/Jada_Pinkett_Smith_at_NY_PaleyFest_2014_for_Gotham.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Jada_Pinkett_Smith", "title": "Jada Pinkett Smith", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.13", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/b/bd/Jada_Pinkett_Smith_at_NY_PaleyFest_2014_for_Gotham.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}