{"url": "http://www.criticschoice.com/critics-choice-awards/", "text": "“ROMA” NAMED BEST PICTURE, TAKES FOUR AWARDS AT 24TH ANNUAL CRITICS’ CHOICE AWARDS\n\n“BLACK PANTHER” AND “VICE” EACH EARN THREE AWARDS\n\n“THE AMERICANS” AND “THE MARVELOUS MRS. MAISEL” LEAD TELEVISION RECIPIENTS WITH THREE AWARDS\n\n(Los Angeles, CA – January 13, 2019) – The Broadcast Film Critics Association (BFCA) and Broadcast Television Journalists Association (BTJA) announced the winners of the 24th Annual Critics’ Choice Awards tonight, live from the Barker Hangar in Santa Monica. Hollywood’s brightest shined at the gala event, which aired on The CW Network and was hosted by acclaimed film, television, and stage star Taye Diggs.\n\nIn the film categories, “Roma” took home four awards, the most of the night, including Best Picture, Best Director and Best Cinematography for Alfonso Cuarón, and Best Foreign Language Film. “Black Panther” and “Vice” followed close behind, each winning in three categories.\n\nThe top film acting awards resulted in a tie for Best Actress between Glenn Close for “The Wife” and Lady Gaga for “A Star Is Born,” while Best Actor was bestowed upon Christian Bale for his transformative performance in “Vice.” Best Supporting Actor went to Mahershala Ali for “Green Book” and Regina King took home the Best Supporting Actress award for her work in “If Beale Street Could Talk.”\n\n“The Marvelous Mrs. Maisel” took home three awards, including Best Comedy Series for the second consecutive year. Its leading lady, Rachel Brosnahan, was also a repeat winner for Best Actress in a Comedy Series, and Best Supporting Actress in a Comedy Series went to Alex Borstein. “The Americans” earned three trophies as well including Best Drama Series, Best Actor in A Drama Series for Matthew Rhys, and Best Supporting Actor in a Drama Series for Noah Emmerich. Sandra Oh received Best Actress in a Drama Series honors for “Killing Eve,” with Best Actor in a Comedy Series going to Bill Hader for “Barry.”\n\nAs previously announced, Best Supporting Actress nominee Claire Foy received the Critics’ Choice #SeeHer Award, which was presented by former #SeeHer Award recipient Viola Davis. Chuck Lorre, creator of such acclaimed TV comedies as “The Big Bang Theory,” “Mom,” “Young Sheldon,” and “The Kominsky Method” (which all received Critics’ Choice Award nominations this year), was honored with the Critics’ Choice Creative Achievement Award. The cast of “The Big Bang Theory,” including Mayim Bialik, Kaley Cuoco, Johnny Galecki, Simon Helberg, Kunal Nayyar, Jim Parsons, and Melissa Rauch, was on hand to recognize Lorre, just in time to celebrate the show’s final season.\n\nOther major winners on the film side included Elsie Fisher for Best Young Actor/Actress in “Eighth Grade,” “Mission: Impossible – Fallout” for Best Action Movie, “Crazy Rich Asians” for Best Comedy, “A Quiet Place” for Best Sci-Fi/Horror Film, and “Shallow” from “A Star Is Born” for Best Song.\n\nCritics’ Choice Awards are bestowed annually by the BFCA and BTJA to honor the finest in cinematic and television achievement. The BFCA is the largest film critics organization in the United States and Canada, representing more than 330 television, radio and online critics. BFCA members are the primary source of information for today’s film-going public. BTJA is the collective voice of journalists who regularly cover television for TV viewers, radio listeners and online audiences. Historically, the Critics’ Choice Awards are the most accurate predictor of the Academy Award nominations.\n\nThe 24th annual Critics’ Choice Awards show was produced by Bob Bain Productions and Berlin Entertainment. The BFCA and BTJA are represented by Dan Black of Greenberg Traurig and WME.\n\nAbout BFCA/BTJA The Broadcast Film Critics Association (BFCA) is the largest film critics organization in the United States and Canada, representing more than 330 television, radio and online critics. The Broadcast Television Journalists Association (BTJA) is a partner organization to the BFCA and includes TV, radio and Internet journalists who cover television on a regular basis. For more information, visit: www.CriticsChoice.com.\n\nFollow the 24th annual Critics’ Choice Awards on Twitter and Instagram @CriticsChoice and on Facebook/CriticsChoiceAwards.\n\nAbout The CW: THE CW TELEVISION NETWORK launched in 2006 as America’s fifth broadcast network, with programming targeting younger viewers, a demographic highly sought after by advertisers. The CW, a joint venture between Warner Bros. Entertainment and CBS Corporation, broadcasts a six-night, 12-hour primetime lineup, Sunday through Friday. The CW’s primetime programming is also available to stream for free, without authentication, on the ad-supported cwtv.com and The CW app, now available on every major OTT platform. In daytime, The CW broadcasts a Monday through Friday afternoon block, and a three-hour Saturday morning kids block. The CW’s digital network, CW Seed, launched in 2013, and offers original short-form digital content as well as past seasons of fan-favorite television series. For more information about the network and its programming, visit www.cwtvpr.com.\n\nCONTACTS:\n\nAndy Gelb/Elyse Weissman\n\nSLATE PR 310-461-0111\n\n[email protected] / [email protected]\n\nJodi Karp\n\nThe CW\n\n818-977-2609\n\n[email protected]\n\nWINNERS OF THE 24TH ANNUAL CRITICS’ CHOICE AWARDS\n\nFILM:\n\nBEST PICTURE “Roma” (Netflix)\n\nBEST ACTOR Christian Bale – “Vice” (Annapurna)\n\nBEST ACTRESS – TIE Glenn Close – “The Wife” (Sony Pictures Classics) Lady Gaga – “A Star Is Born” (Warner Bros.)\n\nBEST SUPPORTING ACTOR Mahershala Ali – “Green Book” (Universal)\n\nBEST SUPPORTING ACTRESS Regina King – “If Beale Street Could Talk” (Annapurna)\n\nBEST YOUNG ACTOR/ACTRESS Elsie Fisher – “Eighth Grade” (A24)\n\nBEST ACTING ENSEMBLE “The Favourite” (Fox Searchlight)\n\nBEST DIRECTOR Alfonso Cuarón – “Roma” (Netflix)\n\nBEST ORIGINAL SCREENPLAY Paul Schrader – “First Reformed” (A24)\n\nBEST ADAPTED SCREENPLAY Barry Jenkins – “If Beale Street Could Talk” (Annapurna)\n\nBEST CINEMATOGRAPHY Alfonso Cuarón – “Roma” (Netflix)\n\nBEST PRODUCTION DESIGN Hannah Beachler, Jay Hart – “Black Panther” (Disney)\n\nBEST EDITING Tom Cross – “First Man” (Universal)\n\nBEST COSTUME DESIGN Ruth Carter – “Black Panther” (Disney)\n\nBEST HAIR AND MAKEUP “Vice” (Annapurna)\n\nBEST VISUAL EFFECTS “Black Panther” (Disney)\n\nBEST ANIMATED FEATURE “Spider-Man: Into the Spider-Verse” (Sony)\n\nBEST ACTION MOVIE “Mission: Impossible – Fallout” (Paramount)\n\nBEST COMEDY “Crazy Rich Asians” (Warner Bros.)\n\nBEST ACTOR IN A COMEDY Christian Bale – “Vice” (Annapurna)\n\nBEST ACTRESS IN A COMEDY Olivia Colman – “The Favourite” (Fox Searchlight)\n\nBEST SCI-FI OR HORROR MOVIE “A Quiet Place” (Paramount)\n\nBEST FOREIGN LANGUAGE FILM “Roma” (Netflix)\n\nBEST SONG\n\nShallow – “A Star Is Born” (Warner Bros.)\n\nBEST SCORE Justin Hurwitz – “First Man” (Universal)\n\nTELEVISION:\n\nBEST DRAMA SERIES “The Americans” (FX Networks)\n\nBEST ACTOR IN A DRAMA SERIES Matthew Rhys – “The Americans” (FX Networks)\n\nBEST ACTRESS IN A DRAMA SERIES Sandra Oh – “Killing Eve” (BBC America)\n\nBEST SUPPORTING ACTOR IN A DRAMA SERIES Noah Emmerich – “The Americans” (FX Networks)\n\nBEST SUPPORTING ACTRESS IN A DRAMA SERIES Thandie Newton – “Westworld” (HBO)\n\nBEST COMEDY SERIES “The Marvelous Mrs. Maisel” (Amazon)\n\nBEST ACTOR IN A COMEDY SERIES Bill Hader – “Barry” (HBO)\n\nBEST ACTRESS IN A COMEDY SERIES Rachel Brosnahan – “The Marvelous Mrs. Maisel” (Amazon)\n\nBEST SUPPORTING ACTOR IN A COMEDY SERIES Henry Winkler – “Barry” (HBO)\n\nBEST SUPPORTING ACTRESS IN A COMEDY SERIES Alex Borstein – “The Marvelous Mrs. Maisel” (Amazon)\n\nBEST LIMITED SERIES “The Assassination of Gianni Versace: American Crime Story” (FX Networks)\n\nBEST MOVIE MADE FOR TELEVISION “Jesus Christ Superstar Live in Concert” (NBC)\n\nBEST ACTOR IN A LIMITED SERIES OR MOVIE MADE FOR TELEVISION Darren Criss – “The Assassination of Gianni Versace: American Crime Story” (FX Networks)\n\nBEST ACTRESS IN A LIMITED SERIES OR MOVIE MADE FOR TELEVISION – TIE Amy Adams – “Sharp Objects” (HBO) Patricia Arquette – “Escape at Dannemora” (Showtime)\n\nBEST SUPPORTING ACTOR IN A LIMITED SERIES OR MOVIE MADE FOR TELEVISION Ben Whishaw – “A Very English Scandal” (Amazon)\n\nBEST SUPPORTING ACTRESS IN A LIMITED SERIES OR MOVIE MADE FOR TELEVISION\n\nPatricia Clarkson – “Sharp Objects” (HBO)\n\nBEST ANIMATED SERIES “BoJack Horseman” (Netflix)\n\nWINNERS BY FILM FOR THE 24TH ANNUAL CRITICS’ CHOICE AWARDS\n\nA QUIET PLACE (PARAMOUNT) – 1 Best Sci-Fi or Horror Movie\n\nA STAR IS BORN (WARNER BROS.) – 2 Best Actress (TIE) – Lady Gaga Best Song – Shallow\n\nBLACK PANTHER (DISNEY) – 3 Best Production Design – Hannah Beachler, Jay Hart Best Costume Design – Ruth Carter Best Visual Effects\n\nCRAZY RICH ASIANS (WARNER BROS.) – 1 Best Comedy\n\nEIGHTH GRADE (A24) – 1 Best Young Actor/Actress – Elsie Fisher\n\nTHE FAVOURITE (FOX SEARCHLIGHT) – 2 Best Acting Ensemble Best Actress in a Comedy – Olivia Colman\n\nFIRST MAN (UNIVERSAL) – 2 Best Editing – Tom Cross Best Score – Justin Hurwitz\n\nFIRST REFORMED (A24) – 1 Best Original Screenplay – Paul Schrader\n\nGREEN BOOK (UNIVERSAL) – 1 Best Supporting Actor – Mahershala Ali\n\nIF BEALE STREET COULD TALK (ANNAPURNA) – 2 Best Supporting Actress – Regina King Best Adapted Screenplay – Barry Jenkins\n\nMISSION: IMPOSSIBLE – FALLOUT (PARAMOUNT) – 1 Best Action Movie\n\nROMA (NETFLIX) – 4 Best Picture Best Director – Alfonso Cuarón Best Cinematography – Alfonso Cuarón Best Foreign Language Film\n\nSPIDER-MAN: INTO THE SPIDER-VERSE (SONY) – 1 Best Animated Feature\n\nVICE (ANNAPURNA) – 3 Best Actor – Christian Bale Best Actor in a Comedy – Christian Bale Best Hair and Makeup\n\nTHE WIFE (SONY PICTURES CLASSICS) – 1 Best Actress (TIE) – Glenn Close\n\nWINNERS BY PROGRAM FOR THE 24TH ANNUAL CRITICS’ CHOICE AWARDS\n\nA VERY ENGLISH SCANDAL (AMAZON) – 1 Best Supporting Actor in a Limited Series or Movie Made for Television – Ben Whishaw\n\nTHE AMERICANS (FX NETWORKS) – 3 Best Drama Series Best Actor in a Drama Series – Matthew Rhys Best Supporting Actor in a Drama Series – Noah Emmerich\n\nTHE ASSASSINATION OF GIANNI VERSACE: AMERICAN CRIME STORY (FX NETWORKS) – 2 Best Limited Series Best Actor in a Limited Series or Movie Made for Television – Darren Criss\n\nBARRY (HBO) – 2 Best Actor in a Comedy Series – Bill Hader Best Supporting Actor in a Comedy Series – Henry Winkler\n\nBOJACK HORSEMAN (NETFLIX) – 1 Best Animated Series\n\nESCAPE AT DANNEMORA (SHOWTIME) – 1 Best Actress in a Limited Series or Movie Made for Television (TIE) – Patricia Arquette\n\nJESUS CHRIST SUPERSTAR LIVE IN CONCERT (NBC) – 1 Best Movie Made for Television\n\nKILLING EVE (BBC AMERICA) – 1 Best Actress in a Drama Series – Sandra Oh\n\nTHE MARVELOUS MRS. MAISEL (AMAZON) – 3 Best Comedy Series Best Actress in a Comedy Series – Rachel Brosnahan Best Supporting Actress in a Comedy Series – Alex Borstein\n\nSHARP OBJECTS (HBO) – 2 Best Actress in a Limited Series or Movie Made for Television (TIE) – Amy Adams Best Supporting Actress in a Limited Series or Movie Made for Television – Patricia Clarkson\n\nWESTWORLD (HBO) – 1 Best Supporting Actress in a Drama Series – Thandie Newton\n\nCRITICS’ CHOICE AWARDS ANNOUNCE MULTI-YEAR PARTNERSHIP WITH SWISS WATCH\n\nMAISON FRAN ÇOIS BORGEL\n\n(Los Angeles, CA – January 10, 2019) – The Broadcast Film Critics Association (BFCA) and the Broadcast Television Journalists Association (BTJA) announced today a multi-year partnership with Swiss Watch Maison François Borgel Genève. This year, François Borgel Genève will provide customized watches to Critics’ Choice Awards nominees in the following categories: Best Director; Best Actor; Best Actress; Best Supporting Actor; Best Supporting Actress; and Best Cinematography.\n\n“We are thrilled to partner with the BFCA and BTJA for the prestigious Critics’ Choice Awards and look forward to building a long-lasting relationship. François Borgel Genève hopes to bring value by expanding our partnership with the Critics’ Choice Awards in the future,” said Dimitri Vorontsov, President & CEO of François Borgel Genève.\n\n“What an honor it is to be working alongside such a distinguished and innovative brand! We are so excited to build this relationship over the coming years, and to be able to give our nominees a beautiful, and timeless, gift,” said BFCA President Joey Berlin.\n\nThe Critics’ Choice Awards will be broadcast live on The CW Network on Sunday, January 13th, from 7 – 10 p.m. ET (delayed PT).\n\n“Critics’ Choice Awards” are bestowed annually by the BFCA and BTJA to honor the finest in cinematic and television achievement. The BFCA is the largest film critics organization in the United States and Canada, representing more than 300 television, radio and online critics. BFCA members are the primary source of information for today’s film-going public. BTJA is the collective voice of journalists who regularly cover television for TV viewers, radio listeners and online audiences. Historically, the “Critics’ Choice Awards” are the most accurate predictor of the Academy Award nominations.\n\nThe 24th annual Critics’ Choice Awards show will be produced by Bob Bain Productions and Berlin Entertainment. The BFCA and BTJA are represented by Dan Black of Greenberg Traurig and WME.\n\nABOUT FRAN ÇOIS BORGEL\n\nFrançois Borgel – Maison d’Horlogerie de Genève Depuis 1887.\n\nFrançois Borgel – The ultimate in superior watchmaking since 1887.\n\nFrançois Borgel is a leader and innovator among the Swiss manufacturers and the creator of the first waterproof watch during the late 1800s, with adopters such as Longines and IWC.\n\nA true pioneer who fused fashion of the day with new radical designs, François Borgel launched the emergence of a classic showcase, a walk through time. With immense heritage, there is a lasting legacy through the founder’s daughter Louisa Borgel. The tradition continued, supplying famous manufacturers including the illustrious Patek Philippe and Vacheron Constantin.\n\nNow, François Borgel stands true to its heritage and delivers only the finest quality Swiss Made watches in the modern era.\n\nFrançois Borgel – Precision in Excellence.\n\nMANUFACTURING\n\nFrom inception to finish, all François Borgel watches are built to original design concepts and exacting standards. After a successful design review the watch evolves through a series of processes involving part selection, assembly, quality assurance and final packaging.\n\nThese processes are all carried out using traditional skills coupled with today’s modernized working tools. Highest quality touch and feel are at the core of the company’s products, with attention to details being completed by hand.\n\nIn their completed form, François Borgel watches are subject to an extensive quality assurance process to maintain the company’s high exacting standards.\n\nThe result is a modern superior high precision product that is descended from traditional roots. All of the company’s products are infused with the passion and dedication of its staff, which is the hallmark of François Borgel.\n\nIn this constant pursuit of excellence François Borgel is proud to certify that its watches comply with the official regulations set by the Swiss Federal Council, the highest standards of watchmaking.\n\nUS OFFICE\n\nFrançois Borgel Genève\n\nWells Fargo Building\n\n433 North Camden Drive, Level 6, Suite 600\n\nBeverly Hills, CA 90210\n\nPh: 1.310.554.8984 / 1.833.FBORGEL\n\nSWISS OFFICE\n\n10 rue de l’Arquebuse, 1st floor\n\n1204, Genève, Switzerland\n\nPh: 41.22.518.0878\n\n[email protected]\n\nwww.francoisborgel.com\n\nWATCH COMMERCIAL\n\nhttps://www.youtube.com/watch? v=FMJOFEZy2P8\n\nAbout BFCA/BTJA\n\nThe Broadcast Film Critics Association (BFCA) is the largest film critics organization in the United States and Canada, representing more than 300 television, radio and online critics. The Broadcast Television Journalists Association (BTJA) is a partner organization to the BFCA and includes TV, radio and Internet journalists who cover television on a regular basis. For more information, visit: www.CriticsChoice.com .\n\nFollow the 24th annual Critics’ Choice Awards on Twitter and Instagram @CriticsChoice and on Facebook/CriticsChoiceAwards.\n\nAbout The CW:\n\nTHE CW TELEVISION NETWORK launched in 2006 as America’s fifth broadcast network, with programming targeting younger viewers, a demographic highly sought after by advertisers. The CW, a joint venture between Warner Bros. Entertainment and CBS Corporation, broadcasts a six-night, 12-hour primetime lineup, Sunday through Friday. The CW’s primetime programming is also available to stream for free, without authentication, on the ad-supported cwtv.com and The CW app, now available on every major OTT platform. In daytime, The CW broadcasts a Monday through Friday afternoon block, and a three-hour Saturday morning kids block. The CW’s digital network, CW Seed, launched in 2013, and offers original short-form digital content as well as past seasons of fan-favorite television series. For more information about the network and its programming, visit www.cwtvpr.com.\n\nCONTACTS:\n\nAndy Gelb/Elyse Weissman\n\nSLATE PR\n\n310-461-0111\n\n[email protected] / [email protected] slate-pr.com\n\nJodi Karp\n\nThe CW\n\n818-977-2609\n\n[email protected]\n\nVIOLA DAVIS AND THE CAST OF THE BIG BANG THEORY TO PRESENT SPECIAL AWARDS AT\n\nTHE 24 TH ANNUAL CRITICS’ CHOICE AWARDS\n\nAWKWAFINA, ANGELA BASSETT, KRISTEN BELL, TED DANSON, AMERICA FERRERA, STEPHAN JAMES, NICOLE KIDMAN, KIKI LAYNE, EUGENE LEVY, RICKY MARTIN, CHRISSY METZ, MANDY MOORE, SARAH SILVERMAN,\n\nBEN STILLER, AND MORE ALSO JOIN THE BROADCAST\n\nGALA EVENT, HOSTED BY TAYE DIGGS, WILL AIR LIVE ON THE CW NETWORK SUNDAY, JANUARY 13, 2019 FROM THE BARKER HANGAR IN SANTA MONICA\n\n(Los Angeles, CA – January 9, 2019) – The Broadcast Film Critics Association (BFCA) and the Broadcast Television Journalists Association (BTJA) announced today the star-studded line up of presenters who will take the stage during the 24th Annual Critics’ Choice Awards. Previous #SeeHer Award recipient Viola Davis will present this year’s honoree, Claire Foy, with her #SeeHer Award. The cast of “The Big Bang Theory,” including Mayim Bialik, Kaley Cuoco, Johnny Galecki, Simon Helberg, Kunal Nayyar, Jim Parsons, and Melissa Rauch will be on hand to recognize show creator Chuck Lorre with the Critics’ Choice Creative Achievement Award, just in time to celebrate the show’s final season. Additional stars from some of this year’s favorite films and television shows who will present throughout the evening include Awkwafina, Angela Bassett, Kristen Bell, Ted Danson, Nina Dobrev, Winston Duke, America Ferrera, Sara Gilbert, Josh Hutcherson, Stephan James, Jameela Jamil, Nicole Kidman, Joel Kinnaman, KiKi Layne, Eugene Levy, Justina Machado, Ricky Martin, Jeanine Mason, Chrissy Metz, Mandy Moore, Olivia Munn, Catherine O’Hara, Edgar Ramirez, Haley Lu Richardson, Sarah Silverman, Cole Sprouse, Ben Stiller, and Bradley Whitford. They all join previously announced host Taye Diggs.\n\nThe Critics’ Choice Awards will be broadcast live on The CW Network on Sunday, January 13th, from 7 – 10 p.m. ET (delayed PT).\n\n“Critics’ Choice Awards” are bestowed annually by the BFCA and BTJA to honor the finest in cinematic and television achievement. The BFCA is the largest film critics organization in the United States and Canada, representing more than 300 television, radio and online critics. BFCA members are the primary source of information for today’s film-going public. BTJA is the collective voice of journalists who regularly cover television for TV viewers, radio listeners and online audiences. Historically, the “Critics’ Choice Awards” are the most accurate predictor of the Academy Award nominations.\n\nThe 24th annual Critics’ Choice Awards show will be produced by Bob Bain Productions and Berlin Entertainment. The BFCA and BTJA are represented by Dan Black of Greenberg Traurig and WME.\n\nAbout BFCA/BTJA\n\nThe Broadcast Film Critics Association (BFCA) is the largest film critics organization in the United States and Canada, representing more than 300 television, radio and online critics. The Broadcast Television Journalists Association (BTJA) is a partner organization to the BFCA and includes TV, radio and Internet journalists who cover television on a regular basis. For more information, visit: www.CriticsChoice.com.\n\nFollow the 24th annual Critics’ Choice Awards on Twitter and Instagram @CriticsChoice and on Facebook/CriticsChoiceAwards.\n\nAbout The CW:\n\nTHE CW TELEVISION NETWORK launched in 2006 as America’s fifth broadcast network, with programming targeting younger viewers, a demographic highly sought after by advertisers. The CW, a joint venture between Warner Bros. Entertainment and CBS Corporation, broadcasts a six-night, 12-hour primetime lineup, Sunday through Friday. The CW’s primetime programming is also available to stream for free, without authentication, on the ad-supported cwtv.com and The CW app, now available on every major OTT platform. In daytime, The CW broadcasts a Monday through Friday afternoon block, and a three-hour Saturday morning kids block. The CW’s digital network, CW Seed, launched in 2013, and offers original short-form digital content as well as past seasons of fan-favorite television series. For more information about the network and its programming, visit www.cwtvpr.com.\n\nCONTACTS:\n\nAndy Gelb/Elyse Weissman\n\nSLATE PR\n\n310-461-0111\n\n[email protected] / [email protected]\n\nJodi Karp\n\nThe CW\n\n818-977-2609\n\n[email protected]\n\nTAYE DIGGS TO HOST 24TH ANNUAL\n\nCRITICS’ CHOICE AWARDS\n\nGALA EVENT WILL AIR LIVE ON THE CW NETWORK SUNDAY, JANUARY 13, 2019\n\nFROM THE BARKER HANGAR IN SANTA MONICA\n\n(Los Angeles, CA – January 3, 2019) – Acclaimed film, television, and stage star Taye Diggs will host the 24th annual Critics’ Choice Awards, the Broadcast Film Critics Association (BFCA) and the Broadcast Television Journalists Association (BTJA) announced today. Diggs is currently starring in The CW drama “All American” and was recently seen in the romantic comedy “Set It Up.”\n\nAs previously announced, Best Supporting Actress nominee Claire Foy will accept the #SeeHer Award, while Chuck Lorre, creator of such acclaimed TV comedies as “The Big Bang Theory,” “Mom,” “Young Sheldon” and “The Kominsky Method” (which all received Critics’ Choice Award nominations last month), will receive the Critics’ Choice Creative Achievement Award.\n\nThe star-studded Critics’ Choice Awards will be broadcast live on The CW Network on Sunday, January 13th, from 7 – 10 p.m. ET (delayed PT).\n\n“I am truly honored and ridiculously excited to be hosting the 24th Annual Critics’ Choice Awards, especially since, as an actor, I recognize what a vital role the critics play in the entertainment industry today,” said Diggs. “We are all looking forward to a big night celebrating the best of the best in TV and film!”\n\n“We are thrilled to have Taye hosting this year’s ceremony,” said BFCA President Joey Berlin. “Taye is a star of both film and television, plus his illustrious stage career makes him especially qualified to lead our show. He promises to infuse the Critics’ Choice Awards with his infectious charm and humor, and enrich what already promises to be a memorable night!”\n\nIn The CW’s new drama “All American,” Taye Diggs plays Billy Baker, the head coach of Beverly High’s football team, who can’t let go of his glory days in the NFL. He recruits Spencer (Daniel Ezra) from South Crenshaw, maybe because he sees himself in Spencer, maybe because he wants to win, or maybe a bit of both.\n\nDiggs recently starred in the romantic comedy “Set It Up” opposite Zoey Deutch and Lucy Liu. He also completed the independent film “River Runs Red,” featuring John Cusack and George Lopez.\n\nHe was most recently seen on season four of “Empire” as Angelo Dubois. Diggs starred in three seasons of “Murder in the First,” alongside Kathleen Robertson. For his role in the series, Diggs earned a 2014 NAACP Image Award nomination in the category of “Outstanding Male Actor in a Drama Series.”\n\nHis television credits include “Private Practice” (NAACP Image Award for Outstanding Supporting Actor), “Rosewood,” “The Good Wife,” “Daybreak,” “Kevin Hill” (NAACP Image Award for Best Actor– Television), “Ally McBeal,” “Will & Grace,” “Ed,” “The West Wing,” “New York Undercover” and “Law & Order.”\n\nEarlier this year, Diggs and collaborator Shane Evans released their third children’s book, “I Love You More Than.” This book is a follow up to his first two children’s books, “Chocolate Me” and “Mixed Me!,” through Macmillan Publishers.\n\nAn acclaimed stage actor, Diggs was the first African American to star as the title role on Broadway in “Hedwig and the Angry Inch.” Additional theatre credits include “A Soldier’s Play” (Second Stage Theatre), “Wicked,” “Chicago,” “The Wild Party” (Manhattan Theatre Club), “Rent” and “Carousel.”\n\nDiggs’ film credits include “The Best Man Holiday,” “Baggage Claim,” “Rent,” “Chicago,” “Brown Sugar,” “Equilibrium,” “Basic,” “The Way of the Gun,” “The Best Man,” “Just a Kiss,” “The House on Haunted Hill,” “Go,” “Drum,” “Cake” and “Malibu’s Most Wanted.”\n\n“Critics’ Choice Awards” are bestowed annually by the BFCA and BTJA to honor the finest in cinematic and television achievement. The BFCA is the largest film critics organization in the United States and Canada, representing more than 300 television, radio and online critics. BFCA members are the primary source of information for today’s film-going public. BTJA is the collective voice of journalists who regularly cover television for TV viewers, radio listeners and online audiences. Historically, the “Critics’ Choice Awards” are the most accurate predictor of the Academy Award nominations.\n\nThe 24th annual Critics’ Choice Awards show will be produced by Bob Bain Productions and Berlin Entertainment. The BFCA and BTJA are represented by Dan Black of Greenberg Traurig and WME.\n\nTo apply for PRESS credentials for this event, interested outlets can visit:\n\nPRESS CREDENTIAL – 24th Annual Critics’ Choice Awards\n\nDEADLINE: THURSDAY, JANUARY 3, 2019\n\nTo apply for PUBLICIST credentials for this event, interested publicists can visit:\n\nPUBLICIST CREDENTIAL – 24th Annual Critics’ Choice Awards\n\nDEADLINE: FRIDAY, JANUARY 4, 2019\n\nAbout BFCA/BTJA\n\nThe Broadcast Film Critics Association (BFCA) is the largest film critics organization in the United States and Canada, representing more than 300 television, radio and online critics. The Broadcast Television Journalists Association (BTJA) is a partner organization to the BFCA and includes TV, radio and Internet journalists who cover television on a regular basis. For more information, visit: www.CriticsChoice.com .\n\nFollow the 24th annual Critics’ Choice Awards on Twitter and Instagram @CriticsChoice and on Facebook/CriticsChoiceAwards.\n\nAbout The CW:\n\nTHE CW TELEVISION NETWORK launched in 2006 as America’s fifth broadcast network, with programming targeting younger viewers, a demographic highly sought after by advertisers. The CW, a joint venture between Warner Bros. Entertainment and CBS Corporation, broadcasts a six-night, 12-hour primetime lineup, Sunday through Friday. The CW’s primetime programming is also available to stream for free, without authentication, on the ad-supported cwtv.com and The CW app, now available on every major OTT platform. In daytime, The CW broadcasts a Monday through Friday afternoon block, and a three-hour Saturday morning kids block. The CW’s digital network, CW Seed, launched in 2013, and offers original short-form digital content as well as past seasons of fan-favorite television series. For more information about the network and its programming, visit www.cwtvpr.com.\n\nCONTACTS:\n\nAndy Gelb/Elyse Weissman\n\nSLATE PR\n\n310-461-0111\n\n[email protected] / [email protected]\n\nJodi Karp\n\nThe CW\n\n818-977-2609\n\n[email protected]\n\nCLAIRE FOY AND CHUCK LORRE TO RECEIVE SPECIAL HONORS\n\nAT THE 24 TH ANNUAL CRITICS’ CHOICE AWARDS\n\nFOY WILL BE RECOGNIZED WITH THIS YEAR’S #SEEHER AWARD,\n\nLORRE WILL RECEIVE THE CRITICS’ CHOICE CREATIVE ACHIEVEMENT AWARD\n\nGALA EVENT WILL AIR LIVE ON THE CW NETWORK SUNDAY, JANUARY 13, 2019\n\nFROM THE BARKER HANGAR IN SANTA MONICA\n\n\n\n(Los Angeles, CA – December 14, 2018) – Actress Claire Foy and producer Chuck Lorre will receive very special honors at the 24th annual Critics’ Choice Awards gala, the Broadcast Film Critics Association (BFCA) and the Broadcast Television Journalists Association (BTJA) announced today.\n\nAlso a Critics’ Choice Awards nominee for Best Supporting Actress in “First Man,” Foy will accept the #SeeHer Award. The creator of such acclaimed TV comedies as “The Big Bang Theory,” “Mom,” “Young Sheldon” and “The Kominsky Method” (which all received Critics’ Choice Award nominations earlier this week), Lorre will receive the Critics’ Choice Creative Achievement Award.\n\nThe star-studded Critics’ Choice Awards will be broadcast live on The CW Network on Sunday, January 13th, from 7 – 10 p.m. ET (delayed PT).\n\nThe #SeeHer Award recognizes a woman who embodies the values set forth by the #SeeHer movement — to push boundaries on changing stereotypes and recognize the importance of authentic portrayals of women across the entertainment landscape. #SeeHer is spearheaded by the ANA (Association of National Advertisers), the largest marketing and advertising association in the United States. The mission of #SeeHer is to accurately portray all women and girls in media so that by 2020, the 100th anniversary of women gaining the right to vote, they see themselves reflected as they truly are. Previous award recipients are Viola Davis and Gal Gadot.\n\n“We are very honored to recognize this acclaimed actress with our third annual #SeeHer Award,” said ANA CEO Bob Liodice. “Claire has delivered many powerful, compelling performances on TV and film, including The Crown, The Girl in the Spider’s Web and First Man. Her portrayals of such strong female characters is an inspiration for our movement.”\n\n“It’s wonderful to see Claire Foy receive this award,” said Fiona Carter, chief brand officer, AT&T Communications. “When we shine a light on stories that ring true for all women, and celebrate the creators bringing them to life, we come a step closer to a world in which women are authentically portrayed in media and popular culture. It’s why AT&T, as one of the largest advertisers in the country, is proud to support the #SeeHer movement.”\n\nThe Critics’ Choice Creative Achievement Award recognizes a body of work that stands out for its sustained excellence over a period of decades on programs that have delighted huge audiences with tremendous laughter and clever insights into the human condition. Chuck Lorre’s creative achievements rank with greatest television producers of all time with an incredible string of hit sitcoms dating back to “Grace Under Fire,” “Roseanne,” “Dharma & Greg,” “Mike & Molly,” and “Two and a Half Men” that shows no sign of letting up.\n\n“`The Big Bang Theory’ has been called the most successful television comedy ever, so it seems like the perfect time to honor Chuck as that show gets ready to ride off into the sunset,” said BFCA President Joey Berlin. “Thankfully, we still have ‘Mom,’ ‘Young Sheldon,’ and his latest gift to comedy lovers, `The Kominsky Method’ going strong to help us get over the loss. For a quarter of a century Chuck has been keeping us in stitches with comedies of remarkable hilarity and consistency, delighting viewers and critics alike.”\n\nClaire Foy has a diverse and exceptional range of work across television, film and theater. In addition to “First Man,” last fall Foy starred as Lisbeth Salander in Sony Pictures Entertainment’s “The Girl in the Spider’s Web.” Foy was recently seen in Steven Soderbergh’s psychological horror film “Unsane” as Sawyer Valentini. The entire film was shot on an iPhone 7, and received critical acclaim for both Foy’s performance and for Soderbergh’s fresh vision.\n\nPrior to this, Foy was seen in season two of Netflix’s critically acclaimed series “The Crown” about Britain’s Royal Family. Starring in the much-coveted role of Queen Elizabeth II, her performance won her a Golden Globe Award, an Emmy and two Screen Actors Guild Awards, along with two British Academy of Film and Television Arts (BAFTA) Television Award nominations. Foy was also seen in “Breathe” alongside Andrew Garfield in October 2017, directed by Andy Serkis and written by William Nicholson – a remarkable story of Robin and Diana Cavendish, who navigate life after he is struck down with paralyzing polio.\n\nAlso well known for her incredible television roles, Foy has been on our small screens since she made a name for herself in the titular role of the critically acclaimed BBC adaptation “Little Dorrit.” The drama won Outstanding Miniseries at the Primetime Emmy Awards in 2009, and was nominated for a Golden Globe Award for Best Miniseries or Motion Picture Made for Television. That same year, Foy’s performance earned her a nomination for Best Actor (Female) at the Royal Television Society Awards.\n\nChuck Lorre co-created and serves as executive producer of the blockbuster comedy “The Big Bang Theory,” the critically acclaimed comedy “Mom” and the acclaimed hit comedy “Young Sheldon,” all for CBS, and he created/executive produces the new Netflix comedy “The Kominsky Method,” which stars Michael Douglas and Alan Arkin. Lorre also co-created/executive produced the Netflix comedy “Disjointed,” starring Academy Award® and Emmy® winner Kathy Bates. He previously was executive producer of the hit sitcom “Mike & Molly” and co-created/executive produced the long-running hit comedy “Two and a Half Men.” Before that, he created hits such as “Cybill,” “Dharma & Greg” and “Grace Under Fire,” and also served as co-executive producer on “Roseanne.” In 2009, Lorre received the NATPE Brandon Tartikoff Legacy Award, was named Television Showman of the Year at the 46th Annual ICG Publicists Awards Ceremony and was honored with a star on the Hollywood Walk of Fame. In 2012, he was inducted into the Television Academy Hall of Fame, and in 2016, he was inducted into the NAB (National Association of Broadcasters) Hall of Fame.\n\nIn 2015, The Chuck Lorre Family Foundation (TCLFF) established “The Big Bang Theory” Scholarship Endowment at UCLA to support undergraduate students in need of financial aid who are pursuing their higher education in the fields of Science, Technology, Engineering and Mathematics (STEM). And in 2018, continuing its commitment to fund innovative efforts in STEM education, TCLFF announced the creation of a new grant program — THE YOUNG SHELDON STEM INITIATIVE — inspired by the hit comedy series “Young Sheldon.” The program was created to foster excitement for learning in STEM fields, specifically in support of our nation’s public schools, teachers and students.\n\n“Critics’ Choice Awards” are bestowed annually by the BFCA and BTJA to honor the finest in cinematic and television achievement. The BFCA is the largest film critics organization in the United States and Canada, representing more than 300 television, radio and online critics. BFCA members are the primary source of information for today’s film-going public. BTJA is the collective voice of journalists who regularly cover television for TV viewers, radio listeners and online audiences. Historically, the “Critics’ Choice Awards” are the most accurate predictor of the Academy Award nominations.\n\nThe 24th annual Critics’ Choice Awards show will be produced by Bob Bain Productions and Berlin Entertainment. The BFCA and BTJA are represented by Dan Black of Greenberg Traurig and WME.\n\nTo apply for PRESS credentials for this event, interested outlets can visit:\n\nPRESS CREDENTIAL – 24th Annual Critics’ Choice Awards\n\nDEADLINE: THURSDAY, JANUARY 3, 2019\n\nTo apply for PUBLICIST credentials for this event, interested publicists can visit:\n\nPUBLICIST CREDENTIAL – 24th Annual Critics’ Choice Awards\n\nDEADLINE: FRIDAY, JANUARY 4, 2019\n\nAbout BFCA/BTJA\n\nThe Broadcast Film Critics Association (BFCA) is the largest film critics organization in the United States and Canada, representing more than 300 television, radio and online critics. The Broadcast Television Journalists Association (BTJA) is a partner organization to the BFCA and includes TV, radio and Internet journalists who cover television on a regular basis. For more information, visit: www.CriticsChoice.com.\n\nFollow the 24th annual Critics’ Choice Awards on Twitter and Instagram @CriticsChoice and on Facebook/CriticsChoiceAwards.\n\nAbout The CW:\n\nTHE CW TELEVISION NETWORK launched in 2006 as America’s fifth broadcast network, with programming targeting younger viewers, a demographic highly sought after by advertisers. The CW, a joint venture between Warner Bros. Entertainment and CBS Corporation, broadcasts a six-night, 12-hour primetime lineup, Sunday through Friday. The CW’s primetime programming is also available to stream for free, without authentication, on the ad-supported cwtv.com and The CW app, now available on every major OTT platform. In daytime, The CW broadcasts a Monday through Friday afternoon block, and a three-hour Saturday morning kids block. The CW’s digital network, CW Seed, launched in 2013, and offers original short-form digital content as well as past seasons of fan-favorite television series. For more information about the network and its programming, visit www.cwtvpr.com.\n\nAbout the #SeeHer Movement\n\nDespite the strides made to accurately portray women and girls in media, an unconscious bias persists against women and girls in advertising, media, and programming. The Association of National Advertisers (ANA) launched the #SeeHer initiative in June 2016 in a partnership with The Female Quotient (TFQ) at the United State of Women. SeeHer’s mission is to increase the accurate portrayals of women and girls in media 20 percent by 2020, the 100th anniversary of women winning the right to vote in the U.S. The group developed a Gender Equality Measure (GEM™) to track progress and the marketing effect of removing unconscious bias from ads and programming. High GEM™ scores directly correlate to improved ROI. GEM™ won the 2017 ESOMAR Research Effectiveness Award. The methodology became the industry standard in the U.S., which led to a global rollout in 2018. For more information, visit www.SeeHer.com, and follow us on Facebook, Instagram, and Twitter.\n\nAbout the Association of National Advertisers (ANA)\n\nThe ANA (Association of National Advertisers) makes a difference for individuals, brands, and the industry by driving growth, advancing the interests of marketers, and promoting and protecting the well-being of the marketing community. Founded in 1910, the ANA provides leadership that advances marketing excellence and shapes the future of the industry. The ANA’s membership includes more than 1,700 companies with 25,000 brands that engage almost 150,000 industry professionals and collectively spend or support more than $400 billion in marketing and advertising annually. The membership is comprised of more than 1,000 clientside marketers and more than 700 marketing solutions provider members, which include leading marketing data science and technology suppliers, ad agencies, law firms, consultants, and vendors. Further enriching the ecosystem is the work of the nonprofit ANA Educational Foundation (AEF), which has the mission of enhancing the understanding of advertising and marketing within the academic and marketing communities.\n\nCONTACTS:\n\nAndy Gelb/Elyse Weissman\n\nSLATE PR\n\n310-461-0111\n\n[email protected] / [email protected]\n\nJodi Karp\n\nThe CW\n\n818-977-2609\n\n[email protected]\n\n“THE FAVOURITE” LEADS FILM NOMINATIONS FOR\n\nTHE 24 TH ANNUAL CRITICS’ CHOICE AWARDS\n\n“THE AMERICANS,” “ESCAPE AT DANNEMORA,” AND\n\n“THE ASSASSINATION OF GIANNI VERSACE: AMERICAN CRIME STORY”\n\nLEAD TELEVISION RACE WITH FIVE NOMINATIONS EACH\n\n\n\nHBO AND NETFLIX TIE WITH 20 NOMINATIONS EACH\n\nGALA EVENT WILL AIR LIVE ON THE CW NETWORK SUNDAY, JANUARY 13, 2019\n\nFROM THE BARKER HANGAR IN SANTA MONICA\n\n(Los Angeles, CA – December 10, 2018) – The Broadcast Film Critics Association (BFCA) and the Broadcast Television Journalists Association (BTJA) announced today the nominees for the 24th Annual Critics’ Choice Awards. The winners will be revealed at the star-studded Critics’ Choice Awards gala, broadcast live on The CW Network on Sunday, January 13, 2019 from 7:00 – 10:00 pm ET (delayed PT).\n\n“The Favourite” leads all films this year with 14 nominations including Best Picture, Olivia Colman for Best Actress and Best Actress in a Comedy, Emma Stone and Rachel Weisz both for Best Supporting Actress, Best Acting Ensemble, Yorgos Lanthimos for Best Director and Best Editing, Deborah Davis and Tony McNamara for Best Original Screenplay, Robbie Ryan for Best Cinematography, Fiona Crombie and Alice Felton for Best Production Design, Sandy Powell for Best Costume Design, Best Hair and Makeup, and Best Comedy.\n\n“Black Panther” impressed with 12 nominations, followed by “First Man” with ten, and “Mary Poppins Returns,” “A Star Is Born,” and “Vice” with nine nominations each. “Roma” earned eight nominations, while “Green Book” has seven.\n\nThere are a number of multiple award nominees, led by Alfonso Cuarón who could take home four awards for his work on “Roma” including Best Director, Best Original Screenplay, Best Cinematography and Best Editing. Bradley Cooper is nominated for his first turn as director for “A Star Is Born” along with nods for Best Actor and Best Adapted Screenplay. In the latter two categories, Cooper is up against Spike Lee for “BlacKkKlansman.” Adam McKay’s work on “Vice” earned him nominations for both Best Director and Best Original Screenplay. Several actors have been recognized in multiple categories this year including Christian Bale for “Vice,” Emily Blunt for “Mary Poppins Returns,” Olivia Colman for “The Favourite,” and newcomer Elsie Fisher for “Eighth Grade.” Costume Designer Sandy Powell is nominated for her creations for “The Favourite” and “Mary Poppins Returns.”\n\nIn the television field, Julia Garner is nominated for her roles in both “Dirty John” and “Ozark.”\n\nAmy Adams stands out as a nominee in both film and television for her roles in “Vice” and “Sharp Objects,” respectively.\n\nHBO and Netflix lead the networks with 20 nominations each, followed by FX with 17, Amazon with 12, and NBC with 11. Topping the list of nominated series are The Americans (FX), The Assassination Of Gianni Versace: American Crime Story (FX), and Escape at Dannemora (Showtime) with five each. The Marvelous Mrs. Maisel (Amazon) and Sharp Objects (HBO) follow close behind with four nominations. A Very English Scandal (Amazon), Atlanta (FX), Barry (HBO), Better Call Saul (AMC), Genius: Picasso (National Geographic), The Good Place (NBC), Homecoming (Amazon), Jesus Christ Superstar Live in Concert (NBC), Killing Eve (BBC America), One Day at a Time (Netflix), and The Tale (HBO) all received three nominations. Other multi-nominated series include Dirty John (Bravo), The Good Doctor (ABC), The Handmaid’s Tale (Hulu), The Kominsky Method (Netflix), Notes from the Field (HBO), Pose (FX), Succession (HBO), This Is Us (NBC), Will & Grace (NBC), and Young Sheldon (CBS) each with two nominations.\n\n“The films of 2018 have been some of the most culturally impactful in recent history,” said BFCA President Joey Berlin. “They’ve portrayed stories from every walk of life, from all different perspectives, and have touched audiences and inspired conversations that we will continue to have for years to come. We are so excited to have the opportunity to celebrate all of them, and the people who made them, on January 13 on The CW!”\n\n“The extraordinary wealth of talent and growing number of platforms makes narrowing down each television category an unenviable task,” said BTJA President Ed Martin. “Despite that, we are thrilled with this year’s nominees and look forward to recognizing their outstanding achievements.”\n\n“Critics’ Choice Awards” are bestowed annually by the BFCA and BTJA to honor the finest in cinematic and television achievement. The BFCA is the largest film critics organization in the United States and Canada, representing more than 300 television, radio and online critics. BFCA members are the primary source of information for today’s film-going public. BTJA is the collective voice of journalists who regularly cover television for TV viewers, radio listeners and online audiences. Historically, the “Critics’ Choice Awards” are the most accurate predictor of the Academy Award nominations.\n\nThe 24th annual Critics’ Choice Awards show will be produced by Bob Bain Productions and Berlin Entertainment. The BFCA and BTJA are represented by Dan Black of Greenberg Traurig and WME.\n\nTo apply for PRESS credentials for this event, interested outlets can visit:\n\nPRESS CREDENTIAL – 24th Annual Critics’ Choice Awards\n\nDEADLINE: THURSDAY, JANUARY 3, 2019\n\nTo apply for PUBLICIST credentials for this event, interested publicists can visit:\n\nPUBLICIST CREDENTIAL – 24th Annual Critics’ Choice Awards\n\nDEADLINE: FRIDAY, JANUARY 4, 2019\n\nAbout BFCA/BTJA\n\nThe Broadcast Film Critics Association (BFCA) is the largest film critics organization in the United States and Canada, representing more than 300 television, radio and online critics. The Broadcast Television Journalists Association (BTJA) is a partner organization to the BFCA and includes TV, radio and Internet journalists who cover television on a regular basis. For more information, visit: www.CriticsChoice.com.\n\nAbout The CW:\n\nTHE CW TELEVISION NETWORK launched in 2006 as America’s fifth broadcast network, with programming targeting younger viewers, a demographic highly sought after by advertisers. The CW, a joint venture between Warner Bros. Entertainment and CBS Corporation, broadcasts a six-night, 12-hour primetime lineup, Sunday through Friday. The CW’s primetime programming is also available to stream for free, without authentication, on the ad-supported cwtv.com and The CW app, now available on every major OTT platform. In daytime, The CW broadcasts a Monday through Friday afternoon block, and a three-hour Saturday morning kids block. The CW’s digital network, CW Seed, launched in 2013, and offers original short-form digital content as well as past seasons of fan-favorite television series. For more information about the network and its programming, visit www.cwtvpr.com.\n\nFollow the 24th annual Critics’ Choice Awards on Twitter and Instagram @CriticsChoice and on Facebook/CriticsChoiceAwards.\n\nCONTACTS:\n\nAndy Gelb/Elyse Weissman\n\nSLATE PR\n\n310-461-0111\n\n[email protected] / [email protected]\n\nJodi Karp\n\nThe CW\n\n818-977-2609\n\n[email protected]\n\n# # #\n\nFILM NOMINATIONS FOR THE 24TH ANNUAL CRITICS’ CHOICE AWARDS\n\nBEST PICTURE\n\nBlack Panther\n\nBlacKkKlansman\n\nThe Favourite\n\nFirst Man\n\nGreen Book\n\nIf Beale Street Could Talk\n\nMary Poppins Returns\n\nRoma\n\nA Star Is Born\n\nVice\n\nBEST ACTOR\n\nChristian Bale – Vice\n\nBradley Cooper – A Star Is Born\n\nWillem Dafoe – At Eternity’s Gate\n\nRyan Gosling – First Man\n\nEthan Hawke – First Reformed\n\nRami Malek – Bohemian Rhapsody\n\nViggo Mortensen – Green Book\n\nBEST ACTRESS\n\nYalitza Aparicio – Roma\n\nEmily Blunt – Mary Poppins Returns\n\nGlenn Close – The Wife\n\nToni Collette – Hereditary\n\nOlivia Colman – The Favourite\n\nLady Gaga – A Star Is Born\n\nMelissa McCarthy – Can You Ever Forgive Me?\n\nBEST SUPPORTING ACTOR\n\nMahershala Ali – Green Book\n\nTimothée Chalamet – Beautiful Boy\n\nAdam Driver – BlacKkKlansman\n\nSam Elliott – A Star Is Born\n\nRichard E. Grant – Can You Ever Forgive Me?\n\nMichael B. Jordan – Black Panther\n\nBEST SUPPORTING ACTRESS\n\nAmy Adams – Vice\n\nClaire Foy – First Man\n\nNicole Kidman – Boy Erased\n\nRegina King – If Beale Street Could Talk\n\nEmma Stone – The Favourite\n\nRachel Weisz – The Favourite\n\nBEST YOUNG ACTOR/ACTRESS\n\nElsie Fisher – Eighth Grade\n\nThomasin McKenzie – Leave No Trace\n\nEd Oxenbould – Wildlife\n\nMillicent Simmonds – A Quiet Place\n\nAmandla Stenberg – The Hate U Give\n\nSunny Suljic – Mid90s\n\nBEST ACTING ENSEMBLE\n\nBlack Panther\n\nCrazy Rich Asians\n\nThe Favourite\n\nVice\n\nWidows\n\nBEST DIRECTOR\n\nDamien Chazelle – First Man\n\nBradley Cooper – A Star Is Born\n\nAlfonso Cuarón – Roma\n\nPeter Farrelly – Green Book\n\nYorgos Lanthimos – The Favourite\n\nSpike Lee – BlacKkKlansman\n\nAdam McKay – Vice\n\nBEST ORIGINAL SCREENPLAY\n\nBo Burnham – Eighth Grade\n\nAlfonso Cuarón – Roma\n\nDeborah Davis and Tony McNamara – The Favourite\n\nAdam McKay – Vice\n\nPaul Schrader – First Reformed\n\nNick Vallelonga, Brian Hayes Currie, Peter Farrelly – Green Book\n\nBryan Woods, Scott Beck, John Krasinski – A Quiet Place\n\nBEST ADAPTED SCREENPLAY\n\nRyan Coogler, Joe Robert Cole – Black Panther\n\nNicole Holofcener, Jeff Whitty – Can You Ever Forgive Me?\n\nBarry Jenkins – If Beale Street Could Talk\n\nEric Roth and Bradley Cooper & Will Fetters – A Star Is Born\n\nJosh Singer – First Man\n\nCharlie Wachtel & David Rabinowitz and Kevin Willmott & Spike Lee – BlacKkKlansman\n\nBEST CINEMATOGRAPHY\n\nAlfonso Cuarón – Roma\n\nJames Laxton – If Beale Street Could Talk\n\nMatthew Libatique – A Star Is Born\n\nRachel Morrison – Black Panther\n\nRobbie Ryan – The Favourite\n\nLinus Sandgren – First Man\n\nBEST PRODUCTION DESIGN\n\nHannah Beachler, Jay Hart – Black Panther\n\nEugenio Caballero, Barbara Enriquez – Roma\n\nNelson Coates, Andrew Baseman – Crazy Rich Asians\n\nFiona Crombie, Alice Felton – The Favourite\n\nNathan Crowley, Kathy Lucas – First Man\n\nJohn Myhre, Gordon Sim – Mary Poppins Returns\n\nBEST EDITING\n\nJay Cassidy – A Star Is Born\n\nHank Corwin – Vice\n\nTom Cross – First Man\n\nAlfonso Cuarón, Adam Gough – Roma\n\nYorgos Mavropsaridis – The Favourite\n\nJoe Walker – Widows\n\nBEST COSTUME DESIGN\n\nAlexandra Byrne – Mary Queen of Scots\n\nRuth Carter – Black Panther\n\nJulian Day – Bohemian Rhapsody\n\nSandy Powell – The Favourite\n\nSandy Powell – Mary Poppins Returns\n\nBEST HAIR AND MAKEUP\n\nBlack Panther\n\nBohemian Rhapsody\n\nThe Favourite\n\nMary Queen of Scots\n\nSuspiria\n\nVice\n\nBEST VISUAL EFFECTS\n\nAvengers: Infinity War\n\nBlack Panther\n\nFirst Man\n\nMary Poppins Returns\n\nMission: Impossible – Fallout\n\nReady Player One\n\nBEST ANIMATED FEATURE\n\nThe Grinch\n\nIncredibles 2\n\nIsle of Dogs\n\nMirai\n\nRalph Breaks the Internet\n\nSpider-Man: Into the Spider-Verse\n\nBEST ACTION MOVIE\n\nAvengers: Infinity War\n\nBlack Panther\n\nDeadpool 2\n\nMission: Impossible – Fallout\n\nReady Player One\n\nWidows\n\nBEST COMEDY\n\nCrazy Rich Asians\n\nDeadpool 2\n\nThe Death of Stalin\n\nThe Favourite\n\nGame Night\n\nSorry to Bother You\n\nBEST ACTOR IN A COMEDY\n\nChristian Bale – Vice\n\nJason Bateman – Game Night\n\nViggo Mortensen – Green Book\n\nJohn C. Reilly – Stan & Ollie\n\nRyan Reynolds – Deadpool 2\n\nLakeith Stanfield – Sorry to Bother You\n\nBEST ACTRESS IN A COMEDY\n\nEmily Blunt – Mary Poppins Returns\n\nOlivia Colman – The Favourite\n\nElsie Fisher – Eighth Grade\n\nRachel McAdams – Game Night\n\nCharlize Theron – Tully\n\nConstance Wu – Crazy Rich Asians\n\nBEST SCI-FI OR HORROR MOVIE\n\nAnnihilation\n\nHalloween\n\nHereditary\n\nA Quiet Place\n\nSuspiria\n\nBEST FOREIGN LANGUAGE FILM\n\nBurning\n\nCapernaum\n\nCold War\n\nRoma\n\nShoplifters\n\nBEST SONG\n\nAll the Stars – Black Panther\n\nGirl in the Movies – Dumplin’\n\nI’ll Fight – RBG\n\nThe Place Where Lost Things Go – Mary Poppins Returns\n\nShallow – A Star Is Born\n\nTrip a Little Light Fantastic – Mary Poppins Returns\n\nBEST SCORE\n\nKris Bowers – Green Book\n\nNicholas Britell – If Beale Street Could Talk\n\nAlexandre Desplat – Isle of Dogs\n\nLudwig Göransson – Black Panther\n\nJustin Hurwitz – First Man\n\nMarc Shaiman – Mary Poppins Returns\n\n\n\nNOMINEES BY FILM FOR THE 24TH ANNUAL CRITICS’ CHOICE AWARDS\n\nANNIHILATION – 1\n\nBest Sci-Fi or Horror Movie\n\nAT ETERNITY’S GATE – 1\n\nBest Actor – Willem Dafoe\n\nAVENGERS: INFINITY WAR – 2\n\nBest Visual Effects\n\nBest Action Movie\n\nBEAUTIFUL BOY – 1\n\nBest Supporting Actor – Timothée Chalamet\n\nBLACK PANTHER – 12\n\nBest Picture\n\nBest Supporting Actor – Michael B. Jordan\n\nBest Acting Ensemble\n\nBest Adapted Screenplay – Ryan Coogler, Joe Robert Cole\n\nBest Cinematography – Rachel Morrison\n\nBest Production Design – Hannah Beachler, Jay Hart\n\nBest Costume Design – Ruth Carter\n\nBest Hair and Makeup\n\nBest Visual Effects\n\nBest Action Movie\n\nBest Song – All the Stars\n\nBest Score – Ludwig Göransson\n\nBLACKKKLANSMAN – 4\n\nBest Picture\n\nBest Supporting Actor – Adam Driver\n\nBest Director – Spike Lee\n\nBest Adapted Screenplay – Charlie Wachtel & David Rabinowitz and Kevin Willmott & Spike Lee\n\nBOHEMIAN RHAPSODY – 3\n\nBest Actor – Rami Malek\n\nBest Costume Design – Julian Day\n\nBest Hair and Makeup\n\nBOY ERASED – 1\n\nBest Supporting Actress – Nicole Kidman\n\nBURNING – 1\n\nBest Foreign Language Film\n\nCAN YOU EVER FORGIVE ME? – 3\n\nBest Actress – Melissa McCarthy\n\nBest Supporting Actor – Richard E. Grant\n\nBest Adapted Screenplay – Nicole Holofcener, Jeff Whitty\n\nCAPERNAUM – 1\n\nBest Foreign Language Film\n\nCOLD WAR – 1\n\nBest Foreign Language Film\n\nCRAZY RICH ASIANS – 4\n\nBest Acting Ensemble\n\nBest Production Design – Nelson Coates, Andrew Baseman\n\nBest Comedy\n\nBest Actress in a Comedy – Constance Wu\n\nDEADPOOL 2 – 3\n\nBest Action Movie\n\nBest Comedy\n\nBest Actor in a Comedy – Ryan Reynolds\n\nTHE DEATH OF STALIN – 1\n\nBest Comedy\n\nDUMPLIN’ – 1\n\nBest Song – Girl in the Movies\n\nEIGHTH GRADE – 3\n\nBest Young Actor/Actress – Elsie Fisher\n\nBest Original Screenplay – Bo Burnham\n\nBest Actress in a Comedy – Elsie Fisher\n\nTHE FAVOURITE – 14\n\nBest Picture\n\nBest Actress – Olivia Colman\n\nBest Supporting Actress – Emma Stone\n\nBest Supporting Actress – Rachel Weisz\n\nBest Acting Ensemble\n\nBest Director – Yorgos Lanthimos\n\nBest Original Sceenplay – Deborah Davis and Tony McNamara\n\nBest Cinematography – Robbie Ryan\n\nBest Production Design – Fiona Crombie, Alice Felton\n\nBest Editing – Yorgos Lanthimos\n\nBest Costume Design – Sandy Powell\n\nBest Hair and Makeup\n\nBest Comedy\n\nBest Actress in a Comedy – Olivia Colman\n\nFIRST MAN – 10\n\nBest Picture\n\nBest Actor – Ryan Gosling\n\nBest Supporting Actress – Claire Foy\n\nBest Director – Damien Chazelle\n\nBest Adapted Screenplay – Josh Singer\n\nBest Cinematography – Linus Sandgren\n\nBest Production Design – Nathan Crowley, Kathy Lucas\n\nBest Editing – Tom Cross\n\nBest Visual Effects\n\nBest Score – Justin Hurwitz\n\nFIRST REFORMED – 2\n\nBest Actor – Ethan Hawke\n\nBest Original Screenplay – Paul Schrader\n\nGAME NIGHT – 3\n\nBest Comedy\n\nBest Actor in a Comedy – Jason Bateman\n\nBest Actress in a Comedy – Rachel McAdams\n\nGREEN BOOK – 7\n\nBest Picture\n\nBest Actor – Viggo Mortensen\n\nBest Supporting Actor – Mahershala Ali\n\nBest Director – Peter Farrelly\n\nBest Original Screenplay – Nick Vallelonga, Brian Hayes Currie, Peter Farrelly\n\nBest Actor in a Comedy – Viggo Mortensen\n\nBest Score – Kris Bowers\n\nTHE GRINCH – 1\n\nBest Animated Feature\n\nHALLOWEEN – 1\n\nBest Sci-Fi or Horror Movie\n\nTHE HATE U GIVE – 1\n\nBest Young Actor/Actress – Amandla Stenberg\n\nHEREDITARY – 2\n\nBest Actress – Toni Collette\n\nBest Sci-Fi or Horror Movie\n\nIF BEALE STREET COULD TALK – 5\n\nBest Picture\n\nBest Supporting Actress – Regina King\n\nBest Adapted Screenplay – Barry Jenkins\n\nBest Cinematography – James Laxton\n\nBest Score – Nicholas Britell\n\nINCREDIBLES 2 – 1\n\nBest Animated Feature\n\nISLE OF DOGS – 2\n\nBest Animated Feature\n\nBest Score – Alexandre Desplat\n\nLEAVE NO TRACE – 1\n\nBest Young Actor/Actress – Thomasin McKenzie\n\nMARY POPPINS RETURNS – 9\n\nBest Picture\n\nBest Actress – Emily Blunt\n\nBest Production Design – John Myhre, Gordon Sim\n\nBest Costume Design – Sandy Powell\n\nBest Visual Effects\n\nBest Actress in a Comedy – Emily Blunt\n\nBest Song – The Place Where Lost Things Go\n\nBest Song – Trip a Little Light Fantastic\n\nBest Score – Marc Shaiman\n\nMARY QUEEN OF SCOTS – 2\n\nBest Costume Design – Alexandra Byrne\n\nBest Hair and Makeup\n\nMID90S – 1\n\nBest Young Actor/Actress – Sunny Suljic\n\nMIRAI – 1\n\nBest Animated Feature\n\nMISSION: IMPOSSIBLE – FALLOUT – 2\n\nBest Visual Effects\n\nBest Action Movie\n\nA QUIET PLACE – 3\n\nBest Young Actor/Actress – Millicent Simmonds\n\nBest Original Screenplay – Bryan Woods, Scott Beck, John Krasinski\n\nBest Sci-Fi or Horror Movie\n\nRALPH BREAKS THE INTERNET – 1\n\nBest Animated Feature\n\nRBG – 1\n\nBest Song – I’ll Fight\n\nREADY PLAYER ONE – 2\n\nBest Visual Effects\n\nBest Action Movie\n\nROMA – 8\n\nBest Picture\n\nBest Actress – Yalitza Aparicio\n\nBest Director – Alfonso Cuarón\n\nBest Original Screenplay – Alfonso Cuarón\n\nBest Cinematography – Alfonso Cuarón\n\nBest Production Design – Eugenio Caballero, Barbara Enriquez\n\nBest Editing – Alfonso Cuarón, Adam Gough\n\nBest Foreign Language Film\n\nSHOPLIFTERS – 1\n\nBest Foreign Language Film\n\nSORRY TO BOTHER YOU – 2\n\nBest Comedy\n\nBest Actor in a Comedy – Lakeith Stanfield\n\nSPIDER-MAN: INTO THE SPIDER-VERSE – 1\n\nBest Animated Feature\n\nSTAN & OLLIE – 1\n\nBest Actor in a Comedy – John C. Reilly\n\nA STAR IS BORN – 9\n\nBest Picture\n\nBest Actor – Bradley Cooper\n\nBest Actress – Lady Gaga\n\nBest Supporting Actor – Sam Elliott\n\nBest Director – Bradley Cooper\n\nBest Adapted Screenplay – Eric Roth and Bradley Cooper & Will Fetters\n\nBest Cinematography – Matthew Libatique\n\nBest Editing – Jay Cassidy\n\nBest Song – Shallow\n\nSUSPIRIA – 2\n\nBest Hair and Makeup\n\nBest Sci-Fi or Horror Movie\n\nTULLY – 1\n\nBest Actress in a Comedy – Charlize Theron\n\nVICE – 9\n\nBest Picture\n\nBest Actor – Christian Bale\n\nBest Supporting Actress – Amy Adams\n\nBest Acting Ensemble\n\nBest Director – Adam McKay\n\nBest Original Screenplay – Adam McKay\n\nBest Editing – Hank Corwin\n\nBest Hair and Makeup\n\nBest Actor in a Comedy – Christian Bale\n\nWIDOWS – 3\n\nBest Acting Ensemble\n\nBest Editing – Joe Walker\n\nBest Action Movie\n\nTHE WIFE – 1\n\nBest Actress – Glenn Close\n\nWILDLIFE – 1\n\nBest Young Actor/Actress – Ed Oxenbould\n\n\n\nTELEVISION NOMINATIONS FOR THE 24TH ANNUAL CRITICS’ CHOICE AWARDS\n\nBEST DRAMA SERIES\n\nThe Americans (FX)\n\nBetter Call Saul (AMC)\n\nThe Good Fight (CBS All Access)\n\nHomecoming (Amazon)\n\nKilling Eve (BBC America)\n\nMy Brilliant Friend (HBO)\n\nPose (FX)\n\nSuccession (HBO)\n\nBEST ACTOR IN A DRAMA SERIES\n\nFreddie Highmore – The Good Doctor (ABC)\n\nDiego Luna – Narcos: Mexico (Netflix)\n\nRichard Madden – Bodyguard (Netflix)\n\nBob Odenkirk – Better Call Saul (AMC)\n\nBilly Porter – Pose (FX)\n\nMatthew Rhys – The Americans (FX)\n\nMilo Ventimiglia – This Is Us (NBC)\n\nBEST ACTRESS IN A DRAMA SERIES\n\nJodie Comer – Killing Eve (BBC America)\n\nMaggie Gyllenhaal – The Deuce (HBO)\n\nElisabeth Moss – The Handmaid’s Tale (Hulu)\n\nSandra Oh – Killing Eve (BBC America)\n\nElizabeth Olsen – Sorry For Your Loss (Facebook Watch)\n\nJulia Roberts – Homecoming (Amazon)\n\nKeri Russell – The Americans (FX)\n\nBEST SUPPORTING ACTOR IN A DRAMA SERIES\n\nRichard Cabral – Mayans M.C. (FX)\n\nAsia Kate Dillon – Billions (Showtime)\n\nNoah Emmerich – The Americans (FX)\n\nJustin Hartley – This Is Us (NBC)\n\nMatthew Macfadyen – Succession (HBO)\n\nRichard Schiff – The Good Doctor (ABC)\n\nShea Whigham – Homecoming (Amazon)\n\nBEST SUPPORTING ACTRESS IN A DRAMA SERIES\n\nDina Shihabi – Jack Ryan (Amazon)\n\nJulia Garner – Ozark (Netflix)\n\nThandie Newton – Westworld (HBO)\n\nRhea Seehorn – Better Call Saul (AMC)\n\nYvonne Strahovski – The Handmaid’s Tale (Hulu)\n\nHolly Taylor – The Americans (FX)\n\nBEST COMEDY SERIES\n\nAtlanta (FX)\n\nBarry (HBO)\n\nThe Good Place (NBC)\n\nThe Kominsky Method (Netflix)\n\nThe Marvelous Mrs. Maisel (Amazon)\n\nThe Middle (ABC)\n\nOne Day at a Time (Netflix)\n\nSchitt’s Creek (Pop)\n\nBEST ACTOR IN A COMEDY SERIES\n\nHank Azaria – Brockmire (IFC)\n\nTed Danson – The Good Place (NBC)\n\nMichael Douglas – The Kominsky Method (Netflix)\n\nDonald Glover – Atlanta (FX)\n\nBill Hader – Barry (HBO)\n\nJim Parsons – The Big Bang Theory (CBS)\n\nAndy Samberg – Brooklyn Nine-Nine (Fox)\n\nBEST ACTRESS IN A COMEDY SERIES\n\nRachel Bloom – Crazy Ex-Girlfriend (The CW)\n\nRachel Brosnahan – The Marvelous Mrs. Maisel (Amazon)\n\nAllison Janney – Mom (CBS)\n\nJustina Machado – One Day at a Time (Netflix)\n\nDebra Messing – Will & Grace (NBC)\n\nIssa Rae – Insecure (HBO)\n\nBEST SUPPORTING ACTOR IN A COMEDY SERIES\n\nWilliam Jackson Harper – The Good Place (NBC)\n\nSean Hayes – Will & Grace (NBC)\n\nBrian Tyree Henry – Atlanta (FX)\n\nNico Santos – Superstore (NBC)\n\nTony Shalhoub – The Marvelous Mrs. Maisel (Amazon)\n\nHenry Winkler – Barry (HBO)\n\nBEST SUPPORTING ACTRESS IN A COMEDY SERIES\n\nAlex Borstein – The Marvelous Mrs. Maisel (Amazon)\n\nBetty Gilpin – GLOW (Netflix)\n\nLaurie Metcalf – The Conners (ABC)\n\nRita Moreno – One Day at a Time (Netflix)\n\nZoe Perry – Young Sheldon (CBS)\n\nAnnie Potts – Young Sheldon (CBS)\n\nMiriam Shor – Younger (TV Land)\n\nBEST LIMITED SERIES\n\nA Very English Scandal (Amazon)\n\nAmerican Vandal (Netflix)\n\nThe Assassination of Gianni Versace: American Crime Story (FX)\n\nEscape at Dannemora (Showtime)\n\nGenius: Picasso (National Geographic)\n\nSharp Objects (HBO)\n\nBEST MOVIE MADE FOR TELEVISION\n\nIcebox (HBO)\n\nJesus Christ Superstar Live in Concert (NBC)\n\nKing Lear (Amazon)\n\nMy Dinner with Hervé (HBO)\n\nNotes from the Field (HBO)\n\nThe Tale (HBO)\n\nBEST ACTOR IN A LIMITED SERIES OR MOVIE MADE FOR TELEVISION\n\nAntonio Banderas – Genius: Picasso (National Geographic)\n\nDarren Criss – The Assassination of Gianni Versace: American Crime Story (FX)\n\nPaul Dano – Escape at Dannemora (Showtime)\n\nBenicio Del Toro – Escape at Dannemora (Showtime)\n\nHugh Grant – A Very English Scandal (Amazon)\n\nJohn Legend – Jesus Christ Superstar Live in Concert (NBC)\n\nBEST ACTRESS IN A LIMITED SERIES OR MOVIE MADE FOR TELEVISION\n\nAmy Adams – Sharp Objects (HBO)\n\nPatricia Arquette – Escape at Dannemora (Showtime)\n\nConnie Britton – Dirty John (Bravo)\n\nCarrie Coon – The Sinner (USA Network)\n\nLaura Dern – The Tale (HBO)\n\nAnna Deavere Smith – Notes From the Field (HBO)\n\nBEST SUPPORTING ACTOR IN A LIMITED SERIES OR MOVIE MADE FOR TELEVISION\n\nBrandon Victor Dixon – Jesus Christ Superstar Live in Concert (NBC)\n\nEric Lange – Escape at Dannemora (Showtime)\n\nAlex Rich – Genius: Picasso (National Geographic)\n\nPeter Sarsgaard – The Looming Tower (Hulu)\n\nFinn Wittrock – The Assassination of Gianni Versace: American Crime Story (FX)\n\nBen Whishaw – A Very English Scandal (Amazon)\n\nBEST SUPPORTING ACTRESS IN A LIMITED SERIES OR MOVIE MADE FOR TELEVISION\n\nEllen Burstyn – The Tale (HBO)\n\nPatricia Clarkson – Sharp Objects (HBO)\n\nPenelope Cruz – The Assassination of Gianni Versace: American Crime Story (FX)\n\nJulia Garner – Dirty John (Bravo)\n\nJudith Light – The Assassination of Gianni Versace: American Crime Story (FX)\n\nElizabeth Perkins – Sharp Objects (HBO)\n\nBEST ANIMATED SERIES\n\nAdventure Time (Cartoon Network)\n\nArcher (FXX)\n\nBob’s Burgers (Fox)\n\nBoJack Horseman (Netflix)\n\nThe Simpsons (Fox)\n\nSouth Park (Comedy Central)\n\n\n\nNOMINEES BY PROGRAM FOR THE 24TH ANNUAL CRITICS’ CHOICE AWARDS\n\nA VERY ENGLISH SCANDAL (Amazon) – 3\n\nBest Limited Series\n\nBest Actor in a Limited Series or Movie Made for Television – Hugh Grant\n\nBest Supporting Actor in a Limited Series or Movie Made for Television – Ben Whishaw\n\nADVENTURE TIME (Cartoon Network) – 1\n\nBest Animated Series\n\nAMERICAN VANDAL (Netflix) – 1\n\nBest Limited Series\n\nTHE AMERICANS (FX) – 5\n\nBest Drama Series\n\nBest Actor in a Drama Series – Matthew Rhys\n\nBest Actress in a Drama Series – Keri Russell\n\nBest Supporting Actor in a Drama Series – Noah Emmerich\n\nBest Supporting Actress in a Drama Series – Holly Taylor\n\nARCHER (FXX) – 1\n\nBest Animated Series\n\nTHE ASSASSINATION OF GIANNI VERSACE: AMERICAN CRIME STORY (FX) – 5\n\nBest Limited Series\n\nBest Actor in a Limited Series or Movie Made for Television – Darren Criss\n\nBest Supporting Actor in a Limited Series or Movie Made for Television – Finn Wittrock\n\nBest Supporting Actress in a Limited Series or Movie Made for Television – Penelope Cruz\n\nBest Supporting Actress in a Limited Series or Movie Made for Television – Judith Light\n\nATLANTA (FX) – 3\n\nBest Comedy Series\n\nBest Actor in a Comedy Series – Donald Glover\n\nBest Supporting Actor in a Drama Series – Brian Tyree Henry\n\nBARRY (HBO) – 3\n\nBest Comedy Series\n\nBest Actor in a Comedy Series – Bill Hader\n\nBest Supporting Actor in a Comedy Series – Henry Winkler\n\nBETTER CALL SAUL (AMC) – 3\n\nBest Drama Series\n\nBest Actor in a Drama Series – Bob Odenkirk\n\nBest Supporting Actress in a Drama Series – Rhea Seehorn\n\nTHE BIG BANG THEORY (CBS) – 1\n\nBest Actor in a Comedy Series – Jim Parsons\n\nBILLIONS (Showtime) – 1\n\nBest Supporting Actor in a Drama Series – Asia Kate Dillon\n\nBOB’S BURGERS (Fox) – 1\n\nBest Animated Series\n\nBODYGUARD (Netflix) – 1\n\nBest Actor in a Drama Series – Richard Madden\n\nBOJACK HORSEMAN (Netflix) – 1\n\nBest Animated Series\n\nBROCKMIRE (IFC) – 1\n\nBest Actor in a Comedy Series – Hank Azaria\n\nBROOKLYN NINE-NINE (Fox) – 1\n\nBest Actor in a Comedy Series – Andy Samberg\n\nTHE CONNERS (ABC) – 1\n\nBest Supporting Actress in a Comedy Series – Laurie Metcalf\n\nCRAZY EX-GIRLFRIEND (The CW) – 1\n\nBest Actress in a Comedy Series – Rachel Bloom\n\nTHE DEUCE (HBO) – 1\n\nBest Actress in a Drama Series – Maggie Gyllenhaal\n\nDIRTY JOHN (Bravo) – 2\n\nBest Actress in a Limited Series or Movie Made for Television – Connie Britton\n\nBest Supporting Actress in a Limited Series or Movie Made for Television – Julia Garner\n\nESCAPE AT DANNEMORA (Showtime) – 5\n\nBest Limited Series\n\nBest Actor in a Limited Series or Movie Made for Television – Paul Dano\n\nBest Actor in a Limited Series or Movie Made for Television – Benicio Del Toro\n\nBest Actress in a Limited Series or Movie Made for Television – Patricia Arquette\n\nBest Supporting Actor in a Limited Series or Movie Made for Television – Eric Lange\n\nGENIUS: PICASSO (National Geographic) – 3\n\nBest Limited Series\n\nBest Actor in a Limited Series or Movie Made for Television – Antonio Banderas\n\nBest Supporting Actor in a Limited Series or Movie Made for Television – Alex Rich\n\nGLOW (Netflix) – 1\n\nBest Supporting Actress in a Comedy Series – Betty Gilpin\n\nTHE GOOD DOCTOR (ABC) – 2\n\nBest Actor in a Drama Series – Freddie Highmore\n\nBest Supporting Actor in a Drama Series – Richard Schiff\n\nTHE GOOD FIGHT (CBS All Access) – 1\n\nBest Drama Series\n\nTHE GOOD PLACE (NBC) – 3\n\nBest Comedy Series\n\nBest Actor in a Comedy Series – Ted Danson\n\nBest Supporting Actor in a Comedy Series – William Jackson Harper\n\nTHE HANDMAID’S TALE (Hulu) – 2\n\nBest Actress in a Drama Series – Elisabeth Moss\n\nBest Supporting Actress in a Drama Series – Yvonne Strahovski\n\nHOMECOMING (Amazon) – 3\n\nBest Drama Series\n\nBest Actress in a Drama Series – Julia Roberts\n\nBest Supporting Actor in a Drama Series – Shea Whigham\n\nICEBOX (HBO) – 1\n\nBest Movie Made for Television\n\nINSECURE (HBO) – 1\n\nBest Actress in a Comedy Series – Issa Rae\n\nJACK RYAN (AMAZON) – 1\n\nBest Supporting Actress in a Drama Series – Dina Shihabi\n\nJESUS CHRIST SUPERSTAR LIVE IN CONCERT (NBC) – 3\n\nBest Movie Made for Television\n\nBest Actor in a Limited Series or Movie Made for Television – John Legend\n\nBest Supporting Actor in a Limited Series or Movie Made for Television – Brandon Victor Dixon\n\nKILLING EVE (BBC America) – 3\n\nBest Drama Series\n\nBest Actress in a Drama Series – Jodie Comer\n\nBest Actress in a Drama Series – Sandra Oh\n\nKING LEAR (Amazon) – 1\n\nBest Movie Made for Television\n\nTHE KOMINSKY METHOD (Netflix) – 2\n\nBest Comedy Series\n\nBest Actor in a Comedy Series – Michael Douglas\n\nTHE LOOMING TOWER (Hulu) – 1\n\nBest Supporting Actor in a Limited Series or Movie Made for Television – Peter Sarsgaard\n\nTHE MARVELOUS MRS. MAISEL (Amazon) – 4\n\nBest Comedy Series\n\nBest Actress in a Comedy Series – Rachel Brosnahan\n\nBest Supporting Actor in a Comedy Series – Tony Shalhoub\n\nBest Supporting Actress in a Comedy Series – Alex Borstein\n\nMAYANS M.C. (FX) – 1\n\nBest Supporting Actor in a Drama Series – Richard Cabral\n\nTHE MIDDLE (ABC) – 1\n\nBest Comedy Series\n\nMOM (CBS) – 1\n\nBest Actress in a Comedy Series – Allison Janney\n\nMY BRILLIANT FRIEND (HBO) – 1\n\nBest Drama Series\n\nMY DINNER WITH HERVÉ (HBO) – 1\n\nBest Movie Made for Television\n\nNARCOS: MEXICO (Netflix) – 1\n\nBest Actor in a Drama Series – Diego Luna\n\nNOTES FROM THE FIELD (HBO) – 2\n\nBest Movie Made for Television\n\nBest Actress in a Limited Series or Movie Made for Television – Anna Deavere Smith\n\nONE DAY AT A TIME (Netflix) – 3\n\nBest Comedy Series\n\nBest Actress in a Comedy Series – Justina Machado\n\nBest Supporting Actress in a Comedy Series – Rita Moreno\n\nOZARK (Netflix) – 1\n\nBest Supporting Actress in a Drama Series – Julia Garner\n\nPOSE (FX) – 2\n\nBest Drama Series\n\nBest Actor in a Drama Series – Billy Porter\n\nSCHITT’S CREEK (Pop) – 1\n\nBest Comedy Series\n\nSHARP OBJECTS (HBO) – 4\n\nBest Limited Series\n\nBest Actress in a Limited Series or Movie Made for Television – Amy Adams\n\nBest Supporting Actress in a Limited Series or Movie Made for Television – Patricia Clarkson\n\nBest Supporting Actress in a Limited Series or Movie Made for Television – Elizabeth Perkins\n\nTHE SIMPSONS (Fox) – 1\n\nBest Animated Series\n\nTHE SINNER (USA Network) – 1\n\nBest Actress in a Limited Series or Movie Made for Television – Carrie Coon\n\nSORRY FOR YOUR LOSS (Facebook Watch) – 1\n\nBest Actress in a Drama Series – Elizabeth Olsen\n\nSOUTH PARK (Comedy Central) – 1\n\nBest Animated Series\n\nSUCCESSION (HBO) – 2\n\nBest Drama Series\n\nBest Supporting Actor in a Drama Series – Matthew Macfadyen\n\nSUPERSTORE (NBC) – 1\n\nBest Supporting Actor in a Comedy Series – Nico Santos\n\nTHE TALE (HBO) – 3\n\nBest Movie Made for Television\n\nBest Actress in a Limited Series or Movie Made for Television – Laura Dern\n\nBest Supporting Actress in a Limited Series or Movie Made for Television – Ellen Burstyn\n\nTHIS IS US (NBC) – 2\n\nBest Actor in a Drama Series – Milo Ventimiglia\n\nBest Supporting Actor in a Drama Series – Justin Hartley\n\nWESTWORLD (HBO) – 1\n\nBest Supporting Actress in a Drama Series – Thandie Newton\n\nWILL & GRACE (NBC) – 2\n\nBest Actress in a Comedy Series – Debra Messing\n\nBest Supporting Actor in a Comedy Series – Sean Hayes\n\n\n\nYOUNG SHELDON (CBS) – 2\n\nBest Supporting Actress in a Comedy Series – Zoe Perry\n\nBest Supporting Actress in a Comedy Series – Annie Potts\n\n\n\nYOUNGER (TV Land) – 1\n\nBest Supporting Actress in a Comedy Series – Miriam Shor\n\nNOMINEES BY NETWORK FOR THE 24TH ANNUAL CRITICS’ CHOICE AWARDS\n\nHBO – 20\n\nNetflix – 20\n\nFX – 16\n\nAmazon – 12\n\nNBC – 11\n\nShowtime – 6\n\nABC – 4\n\nCBS – 4\n\nAMC – 3\n\nBBC America – 3\n\nFox – 3\n\nHulu – 3\n\nNational Geographic – 3\n\nBravo – 2\n\nCartoon Network – 1\n\nCBS All Access – 1\n\nComedy Central – 1\n\nFacebook Watch – 1\n\nFXX – 1\n\nIFC – 1\n\nPop – 1\n\nThe CW – 1\n\nTV Land – 1\n\nUSA Network – 1", "images": ["http://www.criticschoice.com/wp-content/themes/criticschoice/img/btja-logo.gif", "http://www.criticschoice.com/wp-content/themes/criticschoice/img/bfca-logo.gif", "http://www.criticschoice.com/wp-content/uploads/2016/08/logo-main.png"], "top_img": "", "keywords": [], "authors": [], "canonical_link": "http://www.criticschoice.com/critics-choice-awards/", "title": "Critics' Choice Awards - Critics' Choice Awards", "meta_data": {"og": {"locale": "en_US", "type": "article", "title": "Critics' Choice Awards - Critics' Choice Awards", "description": "“ROMA” NAMED BEST PICTURE, TAKES FOUR AWARDS AT 24TH ANNUAL CRITICS’ CHOICE AWARDS “BLACK PANTHER” AND “VICE” EACH EARN THREE AWARDS “THE AMERICANS” AND “THE MARVELOUS MRS. MAISEL” LEAD TELEVISION RECIPIENTS WITH THREE AWARDS (Los Angeles, CA – January 13, 2019) – The Broadcast Film Critics Association (BFCA) and Broadcast Television Journalists Association (BTJA) announced …", "url": "http://www.criticschoice.com/critics-choice-awards/", "site_name": "Critics' Choice Awards"}, "twitter": {"card": "summary", "description": "“ROMA” NAMED BEST PICTURE, TAKES FOUR AWARDS AT 24TH ANNUAL CRITICS’ CHOICE AWARDS “BLACK PANTHER” AND “VICE” EACH EARN THREE AWARDS “THE AMERICANS” AND “THE MARVELOUS MRS. MAISEL” LEAD TELEVISION RECIPIENTS WITH THREE AWARDS (Los Angeles, CA – January 13, 2019) – The Broadcast Film Critics Association (BFCA) and Broadcast Television Journalists Association (BTJA) announced […]", "title": "Critics' Choice Awards - Critics' Choice Awards"}}, "movies": [], "publish_date": null, "source": "http://www.criticschoice.com", "summary": ""}