{"url": "www.cinemablend.com/television/1602681/how-much-alec-baldwin-makes-per-episode-for-portraying-trump-on-snl", "text": "How Much Alec Baldwin Makes Per Episode For Portraying Trump On SNL Random Article Blend By Jessica Rawden Saturday Night Live has seen some major gains in the ratings this season, and it could be argued that some of the gains, at least, have something to do with Alec Baldwin's well-known and widely seen impersonation of Donald Trump. In a recent profile, Baldwin revealed that while he doesn't write the Trump-based sketches, he is paid a pretty nice fee for popping up for just a few minutes on NBC's late night sketch comedy series. In fact, he's paid $1,400 per episode. Facebook\n\n\n\n\n\ncinemablend\n\n\n\nEmail As of this past weekend's Casey Affleck and Chance the Rapper-led episode, Alec Baldwin has appeared in six credited episodes of SNL playing Donald Trump and two uncredited episodes. Let's say he's been paid for six episodes. While $8,400 isn't a hefty sum for an acting gig---and is probably a very low sum compared to the money Baldwin makes for other TV gigs, not to mention commercials---it's still good money for a very limited amount of work. In fact, Alec Baldwin told the NY Times, that there's really only one key to playing the Presidential incumbate, and it's not a wild-looking wig. It's actually just pausing at the right times to look for a word. I see a guy who seems to pause and dig for the more precise and better language he wants to use, and never finds it. It's the same dish --- it's a grilled-cheese sandwich rhetorically over and over again. Alec Baldwin's Donald Trump portrayal has certainly been popular with some factions and not with others, but it's safe to say that is should live on as an example of a classic Saturday Night Live character for some time to come. So, even though Alec Baldwin is only making $1,400 bucks to show up to practice and plan for each new Trump-based sketch, plus to perform during that inconvenient late night airing on Saturday night, he's certainly earning brownie points in other places. We're still talking about Tina Fey's Sarah Palin impression years and years later. Anticipate the same thing will happen for Alec Baldwin and Trump--especially if he continues the impression during the duration of Donald Trump's new gig. Regardless of what Alec Baldwin has been getting paid for his Trump impression, we still anticipate that the former 30 Rock actor will be popping up in Studio 8H after the days of his Presidential impression are long over. Baldwin has been a friend of Saturday Night Live for a long time, and hosted the series well before Lorne Michaels decided he would be a good fit for this particular role. Expect him to be around in the future. Currently Saturday Night Live is on winter hiatus on NBC. Enjoy the holidays in the meantime, and you can catch new episodes starting on Saturday, January 14 on NBC. To find out who is coming up as the host on Saturday Night Live head here. To find out when your favorite shows are returning to the schedule, check out our midseason TV premiere schedule. Why Brooklyn Nine-Nine's Rosa Tackled the #MeToo Movement Blended From Around The Web\n\nBack to top", "images": ["data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR4nGNaOxMAAfwBSW8IE8UAAAAASUVORK5CYII=", "https://ct.pinterest.com/v3/?tid=YourTagID&noscript=1", "https://i.imgur.com/EmLcl1s.gif", "https://img.cinemablend.com/quill/f/7/8/f/d/6/f78fd6b12741164f98d01d52cb5f68e596823969.jpg", "https://sp.analytics.yahoo.com/spp.pl?a=1000772689113&.yp=431002", "https://sb.scorecardresearch.com/p?c1=2&c2=21229662&cv=2.0&cj=1"], "top_img": "https://img.cinemablend.com/quill/f/7/8/f/d/6/f78fd6b12741164f98d01d52cb5f68e596823969.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.cinemablend.com/television/1602681/how-much-alec-baldwin-makes-per-episode-for-portraying-trump-on-snl", "title": "How Much Alec Baldwin Makes Per Episode For Portraying Trump On SNL", "meta_data": {"msapplication-TileColor": "#f5aa06", "msapplication-config": "/static/browserconfig.xml", "theme-color": "#ffffff", "article": {"tag": "Saturday Night Live", "publisher": "https://www.cinemablend.com/", "published_time": "2016-12-21T16:10:13+00:00", "modified_time": "2018-10-08T21:17:20+00:00", "section": "television"}, "CinemaBlend": 10043, "page": "story", "description": "Saturday Night Live has seen some major gains in the ratings this season, and it could be argued that some of the gains, at least, have something to do with Alec Baldwin's well-known and widely seen impersonation of Donald Trump.", "robots": "all", "msvalidate.01": "9AA1A3C35B6D716AE80C1B615C6E8FE8", "fb": {"pages": 90893081682, "app_id": 956050344476201, "admins": 585420252}, "og": {"title": "How Much Alec Baldwin Makes Per Episode For Portraying Trump On SNL", "url": "https://www.cinemablend.com/television/1602681/how-much-alec-baldwin-makes-per-episode-for-portraying-trump-on-snl", "image": {"identifier": "https://img.cinemablend.com/quill/f/7/8/f/d/6/f78fd6b12741164f98d01d52cb5f68e596823969.jpg", "width": 600, "height": 300}, "description": "Saturday Night Live has seen some major gains in the ratings this season, and it could be argued that some of the gains, at least, have something to do with Alec Baldwin's well-known and widely seen impersonation of Donald Trump.", "type": "article", "site_name": "CINEMABLEND"}, "twitter": {"title": "How Much Alec Baldwin Makes Per Episode For Portraying Trump On SNL", "description": "Saturday Night Live has seen some major gains in the ratings this season, and it could be argued that some of the gains, at least, have something to do with Alec Baldwin's well-known and widely seen impersonation of Donald Trump.", "image": "https://img.cinemablend.com/quill/f/7/8/f/d/6/f78fd6b12741164f98d01d52cb5f68e596823969.jpg", "card": "summary_large_image", "site": "@cinemablend", "url": "https://www.cinemablend.com/television/1602681/how-much-alec-baldwin-makes-per-episode-for-portraying-trump-on-snl"}}, "movies": [], "publish_date": 1482336613.0, "source": "http://www.cinemablend.com", "summary": ""}