{"url": "https://variety.com/2017/tv/news/the-flash-tom-cavanagh-directing-barry-allen-savitar-1202395034/", "text": "“The Flash” returns this week after a month-long hiatus with Barry (Grant Gustin) making a dangerous play to learn the identity of Savitar.\n\nAfter an encounter with future villain Abra Kadabra (David Dastmalchian) — who not only knew a future version of Flash, but also who Savitar was — Barry decides the best way to learn more about the God of Speed is to head to the future himself. On top of all that, Caitlin (Danielle Panabaker) has succumbed to her Killer Frost persona and is on the run. All of this is juggled by first-time “Flash” director, and series’ star, Tom Cavanagh.\n\nVariety spoke with Cavanagh — who has played three separate versions of the same character across the show’s three seasons; currently H.R. Wells, and previously Harry Wells and Harrison Wells — about directing different versions of the main characters, how being behind the camera this time differed from his previous directing gigs, and more.\n\nHow did directing an episode come about? Was it something you wanted to do or did they approach you about it?\n\nGenerally, when I am signing a contract for a television series, we have a handshake deal in there about directing. This is my third show for Greg Berlanti, and they sort of know I like to direct. In the past the stuff that I’ve done seems to have been well-enough received that it allowed me to forge forth.\n\nDid you know when you said you’d direct that it would be this big Barry-heads-to-the-future episode?\n\nThey do a ridiculous amount of episodes of “Flash” every year. “The Flash” is one of the most prepared television shows I’ve ever been on, and for the amount of work that comes through the pipeline they are incredibly on top of it. As a director — I’ve been on shows where the director gets the script on the first day of shooting — they will get a script for the entire length of the prep. It gives you a fighting chance.\n\nIn terms of what the actual story is going to be, they’ve got a story arc when they start the season but you don’t really know where your story is going to fall. I feel very fortunate to deal with Barry … dealing with Barry. That’s two versions of Grant Gustin, which is phenomenal. I was grateful to have this storyline.\n\nYou’re no stranger of playing multiple versions of the same character, or acting opposite yourself. Was it fun directing altered, future versions of the other characters?\n\nThat’s part of the aspect of this episode that I really, really liked. We see a whole different world. We got to mess some stuff up. I’ve played five or six or seven different versions of myself since the show started but most of the cast has just played one or two versions of their character. In this one, I think it was great for them to pull out of the hat another version of themselves. I think both Grant and Carlos Valdes in particular were exceptional in this episode. They’re very talented to begin with, but then you add these different layers you kind of marvel at their abilities.\n\nHow is it to direct yourself?\n\nI always find it’s really good. If you write something and you have the visual of that in your head, I don’t have to convince the actor — or even explain to the actor — what the visual is. So I can accommodate however I want. One thing I will say, though, if anyone is going to get short-changed when I’m directing it’s not going to be the other actors; it’s going to be me. You become much less self-indulgent.\n\n“The Flash” airs on the CW on Tuesdays at 8 p.m.", "images": ["https://pmcvariety.files.wordpress.com/2019/07/rexfeatures_10330533ap.jpg?w=700&h=393&crop=1", "https://pmcvariety.files.wordpress.com/2019/06/hbo-chernobyl.jpg?w=700&h=393&crop=1", "https://pmcvariety.files.wordpress.com/2019/07/rexfeatures_10331334cg-1.jpg?w=700&h=393&crop=1", "https://pmcvariety.files.wordpress.com/2019/07/9245539a-cropped-e1562834428290.jpg?w=250&h=140&crop=1", "https://pmcvariety.files.wordpress.com/2019/06/schitts-creek-1.jpg?w=700&h=393&crop=1", "https://pmcvariety.files.wordpress.com/2019/04/big-little-lies-season-2-2.jpg?w=450&h=253&crop=1", "https://pmcvariety.files.wordpress.com/2017/05/chloe-dan-2nd-photo.jpg?w=640&h=393&crop=1", "https://i0.wp.com/www.indiewire.com/wp-content/uploads/2017/06/tobey-maguire-as-spider-man-in-spider-man-2-66-960x639-115424-1280x0.jpg?resize=230%2C135&ssl=1", "https://pmcvariety.files.wordpress.com/2019/04/big-little-lies-season-2-2.jpg?w=250&h=140&crop=1", "https://pmcvariety.files.wordpress.com/2017/04/the-flash-3x19.jpg?w=700&h=393&crop=1", "https://pmcvariety.files.wordpress.com/2019/07/nicholsfabian.jpg?w=450&h=253&crop=1", "https://pmcvariety.files.wordpress.com/2019/07/oscar-jaenada-shooting-hernan.jpg?crop=0px%2C283px%2C5472px%2C3084px&resize=450%2C253", "https://pmcvariety.files.wordpress.com/2019/07/stranger-things.jpg?w=700&h=393&crop=1", "https://pmcwwd.files.wordpress.com/2019/07/influencer-drama-2019-james-charles-olivia-jade-something-navy.jpg?resize=230%2C135", "http://b.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pmcvariety.files.wordpress.com/2019/07/st3.jpeg?w=700&h=393&crop=1", "https://pmcvariety.files.wordpress.com/2019/07/marc-guggenheim.jpg?w=450&h=253&crop=1", "https://pmcspy.files.wordpress.com/2019/07/91jwqitgssl._ux679_.jpg?resize=230%2C135", "https://pmcvariety.files.wordpress.com/2019/06/jakeg.jpg?w=700&h=393&crop=1", "https://pmcvariety.files.wordpress.com/2019/07/big-little-lies-season-2-episode-6.jpg?w=450&h=253&crop=1", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://pmcvariety.files.wordpress.com/2015/08/j-bryant.jpg", "https://pmcvariety.files.wordpress.com/2019/06/2037-_toy-story-4_-cast-explains-why-forky-isne28099t-named-sporky-youtube-f09f948a.jpg?w=700&h=393&crop=1", "https://pmcvariety.files.wordpress.com/2019/07/big-little-lies-season-2-episode-6.jpg?w=250&h=140&crop=1", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2017%2Ftv%2Fnews%2Fthe-flash-tom-cavanagh-directing-barry-allen-savitar-1202395034%2F&ct=article&lob=pmc-core&loc=us&env=desktop&post_id=1202395034", "https://pmcvariety.files.wordpress.com/2019/06/jacob-and-zach.jpg?w=700&h=393&crop=1", "https://pmcvariety.files.wordpress.com/2019/06/rexfeatures_10314204hj-e1561059816154.jpg?w=700&h=393&crop=1", "https://pmchollywoodlife.files.wordpress.com/2019/07/serena-williams-lose-wimbledon-ftr.jpg?resize=230%2C135", "https://pmcvariety.files.wordpress.com/2019/06/lion-king.jpg?w=700&h=393&crop=1", "https://boygeniusreport.files.wordpress.com/2017/11/sony-noise-cancelling-headphones.jpg?quality=98&strip=all&resize=230%2C135", "https://pixel.quantserve.com/pixel/p-31f3D02tYU8zY.gif", "https://pmcvariety.files.wordpress.com/2017/04/the-flash-3x19.jpg?w=1000&h=563&crop=1", "https://pmcvariety.files.wordpress.com/2017/01/bethany-hamilton-unstoppable-lieber-films.jpg?w=250&h=140&crop=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pmcvariety.files.wordpress.com/2019/07/shutterstock_editorial_10332596bb.jpg?w=450&h=253&crop=1", "https://pmcvariety.files.wordpress.com/2019/06/theylive1.jpg?w=700&h=393&crop=1"], "top_img": "https://pmcvariety.files.wordpress.com/2017/04/the-flash-3x19.jpg?w=700&h=393&crop=1", "keywords": [], "authors": ["Jacob Bryant", "Jacob'S Most Recent Stories", "View All"], "canonical_link": "https://variety.com/2017/tv/news/the-flash-tom-cavanagh-directing-barry-allen-savitar-1202395034/", "title": "‘The Flash’ Star Tom Cavanagh Talks Directing This Week’s Episode", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0", "description": "\"The Flash\" star Tom Cavanagh talks about his first time directing an episode of the show.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199, "pages": 12616252196}, "news_keywords": "The Flash, Tom Cavanagh", "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "‘The Flash’ Star Tom Cavanagh Talks Directing This Week’s Episode", "url": "https://variety.com/2017/tv/news/the-flash-tom-cavanagh-directing-barry-allen-savitar-1202395034/", "description": "“The Flash” returns this week after a month-long hiatus with Barry (Grant Gustin) making a dangerous play to learn the identity of Savitar. After an encounter with future villain Abra K…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/04/the-flash-3x19.jpg?w=700&h=393&crop=1", "width": 1000, "height": 563, "alt": "The Flash"}, "locale": "en_US"}, "article": {"published_time": "2017-04-25T18:36:11+00:00", "modified_time": "2017-04-25T18:36:11+00:00"}, "twitter": {"creator": "@Jacobb41", "site": "@variety", "text": {"title": "‘The Flash’ Star Tom Cavanagh Talks Directing This Week’s Episode"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/04/the-flash-3x19.jpg", "alt": "The Flash"}, "card": "summary_large_image", "title": "‘The Flash’ Star Tom Cavanagh Talks Directing This Week’s Episode", "description": "\"The Flash\" star Tom Cavanagh talks about his first time directing an episode of the show."}, "author": "Jacob Bryant", "content_type": "Article", "title": "'The Flash' Star Tom Cavanagh Talks Directing This Week's Episode", "published_at": "2017-04-25 11:36:11", "image": "https://pmcvariety.files.wordpress.com/2017/04/the-flash-3x19.jpg?w=1000", "comment_count": 0, "tags": "Tom Cavanagh", "topics": "News", "appeared_in_print": "No", "body": "\"The Flash\" returns this week after a month-long hiatus with Barry (Grant Gustin) making a dangerous play to learn the identity of Savitar.\r\n\r\nAfter an encounter with future villain Abra Kadabra (David Dastmalchian) -- who not only knew a future version of Flash, but also who Savitar was -- Barry decides the best way to learn more about the God of Speed is to head to the future himself. On top of all that, Caitlin (Danielle Panabaker) has succumbed to her Killer Frost persona and is on the run. All of this is juggled by first-time \"Flash\" director, and series' star, Tom Cavanagh.\r\n\r\nVariety spoke with Cavanagh -- who has played three separate versions of the same character across the show's three seasons; currently H.R. Wells, and previously Harry Wells and Harrison Wells -- about directing different versions of the main characters, how being behind the camera this time differed from his previous directing gigs, and more.\r\n\r\nHow did directing an episode come about? Was it something you wanted to do or did they approach you about it?\r\nGenerally, when I am signing a contract for a television series, we have a handshake deal in there about directing. This is my third show for Greg Berlanti, and they sort of know I like to direct. In the past the stuff that I've done seems to have been well-enough received that it allowed me to forge forth.\r\n\r\nDid you know when you said you'd direct that it would be this big Barry-heads-to-the-future episode?\r\nThey do a ridiculous amount of episodes of \"Flash\" every year. \"The Flash\" is one of the most prepared television shows I've ever been on, and for the amount of work that comes through the pipeline they are incredibly on top of it. As a director -- I've been on shows where the director gets the script on the first day of shooting -- they will get a script for the entire length of the prep. It gives you a fighting chance.\r\n\r\nIn terms of what the actual story is going to be, they've got a story arc when they start the season but you don't really know where your story is going to fall. I feel very fortunate to deal with Barry ... dealing with Barry. That's two versions of Grant Gustin, which is phenomenal. I was grateful to have this storyline.\r\n\r\nYou're no stranger of playing multiple versions of the same character, or acting opposite yourself. Was it fun directing altered, future versions of the other characters?\r\nThat's part of the aspect of this episode that I really, really liked. We see a whole different world. We got to mess some stuff up. I've played five or six or seven different versions of myself since the show started but most of the cast has just played one or two versions of their character. In this one, I think it was great for them to pull out of the hat another version of themselves. I think both Grant and Carlos Valdes in particular were exceptional in this episode. They're very talented to begin with, but then you add these different layers you kind of marvel at their abilities.\r\n\r\nHow is it to direct yourself?\r\nI always find it's really good. If you write something and you have the visual of that in your head, I don't have to convince the actor -- or even explain to the actor -- what the visual is. So I can accommodate however I want. One thing I will say, though, if anyone is going to get short-changed when I'm directing it's not going to be the other actors; it's going to be me. You become much less self-indulgent.\r\n\r\n\"The Flash\" airs on the CW on Tuesdays at 8 p.m.", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "fragment": "!", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128"}, "movies": [], "publish_date": 1493145371.0, "source": "https://variety.com", "summary": ""}