{"url": "https://en.wikipedia.org/wiki/The_Dating_Game", "text": "American television series\n\nThis article is about the television show. For the video game genre, see Dating sim\n\nThe Dating Game is an ABC television show. It first aired on December 20, 1965 and was the first of many shows created and packaged by Chuck Barris from the 1960s through the 1980s. ABC dropped the show on July 6, 1973, but it continued in syndication for another year (1973–1974) as The New Dating Game. The program was revived three additional times in syndication afterwards. The first revival premiered in 1978 and ran until 1980, the second ran from 1986 until 1989, and the last ran from 1996 until 1999 with a season of reruns following.\n\nJim Lange hosted The Dating Game for its entire ABC network run and the 1973 and 1978 syndicated editions. The 1986 revival was hosted by Elaine Joyce for its first season and Jeff MacGregor for its remaining two seasons. When the show was revived with a different format in 1996, Brad Sherwood was named as its host. Chuck Woolery took over in 1997 after he left The Home and Family Show when the original format was reinstated and hosted for the last two seasons.\n\nBeginning in 1966, The Dating Game was often paired with The Newlywed Game. This was especially true when the two shows entered syndication; in fact, in 1996 the revivals of both The Dating Game and The Newlywed Game were sold as a package called \"The Dating-Newlywed Hour\".\n\nThe program was originally broadcast in black-and-white, but when a prime-time version began in October 1966, both it and the daytime version were broadcast in color; the daytime version thus became the first ABC daytime series to be broadcast in color on a regular basis.\n\nFormat [ edit ]\n\nTypically, a bachelorette would question three bachelors, who were hidden from her view; at the end of the questioning period, she would choose one to go out with on a date paid for by the show. Occasionally, the roles would be reversed with a man questioning three ladies; other times, a celebrity would question three players for a date for themselves or for a co-worker or a relative of theirs.\n\nBefore becoming famous, Farrah Fawcett, Suzanne Somers, Yvonne Craig, Lindsay Wagner, Leif Garrett, Tom Selleck and Lee Majors appeared as contestants on the show in the 1960s and early 1970s. Other contestants who appeared before becoming famous included The Carpenters, Jackson Bostwick, Michael Richards, Joanna Cameron, Andy Kaufman (who went under the pseudonym Baji Kimran), Steve Martin, Burt Reynolds, John Ritter, Phil Hartman, Jennifer Granholm (Governor of Michigan from 2003–2010), Arnold Schwarzenegger, and Alex Kozinski.[1] Serial killer Rodney Alcala's episodes were shown during his murder spree and after he had been convicted of assault in California.\n\nSome contestants appeared even after they were fairly well known, including a young Michael Jackson, Dusty Springfield, Ron Howard, Maureen McCormick, Barry Williams, Sally Field, Richard Dawson, Jay North, and Paul Lynde.\n\nOne standard trademark was that at the end of each episode, the host and winning contestants would blow a kiss to the viewers.\n\nGame play [ edit ]\n\nOriginal version [ edit ]\n\nGenerally the bachelorette would ask questions written in advance on cards to each of the three hidden bachelors. The same question could be asked to multiple bachelors. This continued until time ran out. The bachelorette would make her choice based solely on the answers to her questions. Occasionally, the contestant was a bachelor who would ask questions to three bachelorettes. Certain kinds of questions were \"off-limits\", such as name, age, occupation, and income.\n\nWhen the original format returned to the syndicated revival in 1997, these rules were readopted but there was more of a variety between bachelors and bachelorettes.\n\n1996–97 season [ edit ]\n\nFor the first season of the 1996 revival, The Dating Game used a different format. A notable change was that the prospective bachelor/bachelorette knew what the first names of his or her potential dates were at all times.\n\nInstead of asking questions of their potential date, the bachelor/bachelorette was presented with two pun-laden statements, each pertaining to one of the potential dates. When chosen, a new statement replaced the old statement and the potential date explained the reason why that fact pertained to them. Play continued until time expired, after which the bachelor/bachelorette gave their choice.\n\nIn several weeks of episodes that aired at various times throughout the season, another format was used. This format saw the players choose a potential date based on how good they looked and another based on personality. To determine the \"looks\" portion, the bachelor/bachelorette observed their potential dates (another change not seen on any Dating Game series beforehand) for several seconds; the three players wore noise-cancelling headphones so they could not hear what the bachelor/bachelorette was saying about them and they identified by numbers. The statement round was used to determine the \"personality\" portion. After the game ended the bachelor/bachelorette chose one panelist based on looks and one based on personality, then was prompted to choose either of the two. In the case the bachelor/bachelorette chose the same person for both looks and personality, they won a cash prize of $500.\n\nEpisode status [ edit ]\n\nVarious episodes from the ABC daytime run have been aired on GSN in the past.\n\nThe remaining versions of the show, which were made for ABC prime-time and for syndication, are assumed to exist in their entirety.\n\nAfter the syndicated finale in 1980, repeats of the 1978–1980 version were seen on KHJ-TV (now KCAL-TV) in Los Angeles from September 26, 1983 to September 12, 1986, as well as some other cities. In another variation of the final year in reruns, there were some episodes from ABC daytime, ABC primetime and syndicated weekly.\n\nGuests [ edit ]\n\nSome of the celebrities that appeared on The Dating Game appeared as a bachelor or bachelorette before becoming famous or as a special guest star include:\n\nTheme music and cues [ edit ]\n\nThe show used many contemporary tunes, from Tijuana Brass's music from the 1960s, to pop music used for celebrity guest and band appearances. For the first few episodes at the beginning of the ABC run, live music was provided by The Regents, a house band from Jack Martin's A.M-P.M. on La Cienega Blvd.[10] (unrelated to the 1959 band, The Regents, famous for their song \"Barbara Ann\"). Starting in 1966, the show used recorded music, with the main theme provided by The Mariachi Brass, featuring trumpeter Chet Baker. The show also had music covers made by Skip Battin & The Group (1967, Aurora 159), & The Challengers (196?, Triumph 64).\n\nThe series used several songs by Herb Alpert and the Tijuana Brass as cues for the show, including:\n\nOther tunes were used after the interview portion, when guests were choosing a date, including:\n\nMusic used for guest appearances of celebrities choosing a date for themselves (or their daughter), or band appearances include:\n\n\"Live\" (The Merry-Go-Round)\n\n\"Close To You\" (Karen Carpenter)\n\n\"Midnight Confessions\" (The Grassroots)\n\n\"I Want To Be Where You Are\" (Michael Jackson)\n\n\"I Want You Back\" (Michael Jackson, during the prize description)\n\n\"Cheyenne\" (Barry Williams)\n\n\"Goin' Out of My Head\" (Little Anthony)\n\n\"What's It Gonna Be\" (Dusty Springfield)\n\nOther music cues used on the show include:\n\n\"Fantail\" by Count Basie (when host Jim Lange introduces the three potential dates to the audience)\n\n\"Love Sickness\" by The Trumpets Ole (a brief cue used when time for the interview portion is through)\n\n\"Boston Bust-Out\" by Jimmy McGriff (before the date is introduced to their prize)\n\nIn 1972, the show added a closing theme called \"Little Rosie\" to the daytime version of The Dating Game. This and some of the show's other cues were 1973 album Themes From TV Game Shows,[11] produced by Chuck Barris. The show continued to use the 1966 opening theme until 1978, when the show went to all in-house music. The 1978 opening theme is found on the album's first track, and is credited to Chuck Barris & David Mook.\n\nThe 1980s reboot of the show used music composed by Milton DeLugg, while later editions featured a rerecording of the original theme by Steve Kaplan.\n\nInternational versions [ edit ]\n\nCurrently airing franchise An upcoming season Franchise no longer in production\n\nLegacy [ edit ]\n\nIn his first autobiography, Confessions of a Dangerous Mind (1988), Barris claimed that The Dating Game was a cover for his CIA activities, and was promoted by the CIA. However, his second memoir, The Game Show King: A Confession (1993), makes no mention of the CIA—or, for that matter, his previous book;[12] and a CIA spokesman has categorically denied that Barris ever worked for them in any capacity.[13]\n\nThe show's popularity in the 1960s was the inspiration for an ice cream flavor by Baskin-Robbins called Dating Game. It was a pink ice cream with diced dates and butter toasted pecans.[14]\n\nThe Dating Game was parodied by Steve Jobs during a 1983 Macintosh pre-launch event. The three \"contestants\" were Mitch Kapor of Lotus Software, Fred Gibbons of Software Publishing Corporation, and Bill Gates of Microsoft.[15]\n\nLicensed merchandise [ edit ]\n\nHasbro released three home games based on the original 1965 version from 1967 to 1968,[16] while Pressman Toy Corporation released a home game based on the late 80s version in 1987.[17]\n\nIn 1968, a 33⅓ rpm party record called The Dating Game Party Pak narrated by Jim Lange himself, packed together with postcard invitations, name tags and scorecards for six people to play.[18]\n\nIn 1980, Laverne and Shirley had an episode where Lenny and Squiggy were two of the bachelors on The Dating Game.\n\nIn the late 1990s, Sony's website released an online version of The Dating Game.\n\nA video slot machine based on the original 1965 version with an animated Jim Lange was released by IGT in 2004 in both nickel[19] and quarter[20] versions.[21]\n\nIn March 2011, a new virtual version of The Dating Game was launched on Facebook, Twitter and other social media network sites. The game was developed by 3G Studios,[22] under license from Sony Pictures Entertainment.[23]\n\nA recurring parody on the current version of Let's Make a Deal called The Dealing Game features Wayne Brady and Jonathan Mangum (both as a different character in each appearance) but rather than a date, each of them represents a curtain and both of them try to get the contestant to pick their curtain. The model Tiffany Coyne plays the role of the \"hostess\".\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/b/ba/Flag_of_Germany.svg/23px-Flag_of_Germany.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Flag_of_Israel.svg/21px-Flag_of_Israel.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/Flag_of_Colombia.svg/23px-Flag_of_Colombia.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/Flag_of_Turkey.svg/23px-Flag_of_Turkey.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8f/Flag_of_Estonia.svg/23px-Flag_of_Estonia.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Flag_of_Finland.svg/23px-Flag_of_Finland.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f0/Flag_of_Slovenia.svg/23px-Flag_of_Slovenia.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/0/05/Flag_of_Brazil.svg/22px-Flag_of_Brazil.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/Flag_of_Bulgaria.svg/23px-Flag_of_Bulgaria.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1f/The_Dating_Game_Pat_Paulsen_1968.JPG/150px-The_Dating_Game_Pat_Paulsen_1968.JPG", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/Flag_of_Mexico.svg/23px-Flag_of_Mexico.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/6/61/The_Dating_Game.jpg/250px-The_Dating_Game.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/23px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/0/03/Flag_of_Italy.svg/23px-Flag_of_Italy.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9c/Flag_of_Denmark.svg/20px-Flag_of_Denmark.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/ae/Flag_of_the_United_Kingdom.svg/23px-Flag_of_the_United_Kingdom.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/92/Flag_of_Belgium_%28civil%29.svg/23px-Flag_of_Belgium_%28civil%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/Flag_of_Croatia.svg/23px-Flag_of_Croatia.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/Flag_of_the_Czech_Republic.svg/23px-Flag_of_the_Czech_Republic.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/84/Flag_of_Latvia.svg/23px-Flag_of_Latvia.svg.png", "https://upload.wikimedia.org/wikipedia/en/6/61/The_Dating_Game.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/c/c3/Flag_of_France.svg/23px-Flag_of_France.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/Flag_of_Australia_%28converted%29.svg/23px-Flag_of_Australia_%28converted%29.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f2/Edit-clear.svg/40px-Edit-clear.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c1/Flag_of_Hungary.svg/23px-Flag_of_Hungary.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/9a/Flag_of_Spain.svg/23px-Flag_of_Spain.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Flag_of_Austria.svg/23px-Flag_of_Austria.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/45/Flag_of_Ireland.svg/23px-Flag_of_Ireland.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/12/Flag_of_Poland.svg/23px-Flag_of_Poland.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/6/61/The_Dating_Game.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/The_Dating_Game", "title": "The Dating Game", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.13", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/6/61/The_Dating_Game.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}