{"url": "https://screenrant.com/razzies-2018-winners-mummy-emoji-movie/", "text": "122 Shares Share Tweet Email Copy Link Copied\n\nThe Emjoi Movie has claimed top dishonors at the 38th Annual Golden Raspberry Awards. This year's Razzies also awarded The Mummy, Fifty Shades Darker, and Baywatch, among other critically-maligned movies.\n\nTraditionally held the day before the Oscars, the Golden Raspberry Awards is attempting to become as much of a Hollywood institution as the Academy Awards themselves, but it might take some time before they achieve that level of prominence (if they do at all). As much as the Oscars are meant to honor the best that Hollywood has to offer, the Razzies do the opposite and disrespect to the worst of the worst. The Razzies are notable in that they traditionally target blockbusters that flopped at the box office and arthouse films that perhaps didn't strike a chord with general audiences, as well as particularly any movie that might place special effects, spectacle, and stars over its storytelling.\n\nRelated: Bad Movies Worse Than The Razzie 2018 Nominations\n\nThe 38th Annual Razzie Awards winners were announced this morning on YouTube, which can be viewed in the section above. While several movies took home awards this year, The Emjoi Movie won the most Razzies. It picked up four wins in total: Worst Picture, Worst Director, Worst Screenplay, and Worst Screen Duo for \"any two obnoxious emojis.\"\n\nTom Cruise, who previously earned a Razzie as one-half of Worst Screen Duo with Brad Pitt for Interview With The Vampire, finally won a Razzie as a solo act after many nominations. For his performance as Nick Morton in The Mummy, Cruise was named the Worst Actor of 2018. Tyler Perry was likewise named Worst Actress for his performance as Mabel \"Madea\" Simmons in Boo 2! A Madea Halloween. The Barry L. Bumstead Award - traditionally given to the worst film of the year that was not eligible to be nominated - was given to CHIPS. The Razzies also presented a special award, in conjunction with review-aggregate website Rotten Tomatoes, to Baywatch as the Razzie Nominee So Rotten You Loved It.\n\nSatirical as ever, the Razzies gave a nod to the #MeToo and #TimesUp movements with an In Memoriam segment devoted to the careers of the many producers, directors, and actors whose careers ended following allegations of harassment and misconduct. The musical montage of photos concludes with the words, \"Very Sorry, But We Won't Be Missing You - Or Your Kind.\" The Razzies also gave this year's Razzie Redeemer Award (a special award for previous Razzie winners who have made up for their previous bad work) to Hollywood itself, for attempting to create \"a Safe Hollywood-Haven where talent is protected, nourished and allowed to flourish with proper compensation.\"\n\nMore: 27 Worst Movies Ever Made (According To The Razzies)\n\nSource: The Razzie Awards\n\nSonic the Hedgehog Producer Says Fans Will Be Pleased With Redesign", "images": ["https://screenrant.com/public/build/images/tg-logo-full-white.fc9e742a.svg", "https://screenrant.com/public/build/images/sr-logo-full-white.b0cc2b44.svg", "https://q.quora.com/_/ad/91f52889f6a04390a65ad2591c59986e/pixel?tag=ViewContent&noscript=1", "https://screenrant.com/public/build/images/th-logo-full-white.7684e614.svg", "https://screenrant.com/public/build/images/hc-logo-full-white.5f66cfe4.svg", "https://screenrant.com/public/build/images/tr-logo-full-white.090c581a.svg", "https://screenrant.com/public/build/images/mm-logo-full-white.fe72c74c.svg", "https://screenrant.com/public/build/images/tv-logo-full-white.642d3d01.svg", "https://static1.srcdn.com/wordpress/wp-content/uploads/2018/03/The-Razzie-Awards-Golden-Raspberry-Awards-Mascot-Gasmask.jpg", "https://screenrant.com/public/build/images/tt-logo-full-white.04a6f0d4.svg", "https://screenrant.com/public/build/images/cb-logo-full-white.afca2e29.svg", "https://screenrant.com/public/build/images/bg-logo-full-white.8242bbb9.svg", "https://screenrant.com/public/build/images/tq-logo-full-white.7436bde3.svg", "https://www.facebook.com/tr?id=297467373958238&ev=PageView&noscript=1", "https://screenrant.com/public/build/images/ts-logo-full-white.54beb4cf.svg", "http://b.scorecardresearch.com/p?c1=2&c2=21868715&cv=2.0&cj=1"], "top_img": "https://static1.srcdn.com/wordpress/wp-content/uploads/2018/03/The-Razzie-Awards-Golden-Raspberry-Awards-Mascot-Gasmask.jpg", "keywords": [], "authors": ["Ana Dumaraog", "Eric Trigg", "Mike Jones", "Michael Kennedy"], "canonical_link": "https://screenrant.com/razzies-2018-winners-mummy-emoji-movie/", "title": "Razzies 2018 Winners Include The Mummy & The Emoji Movie", "meta_data": {"viewport": "user-scalable=yes, initial-scale=1.0, width=device-width", "description": "The Emoji Movie won the most awards at the 38th Annual Golden Raspberry Awards, taking home four Razzies, including Worst Picture.", "og": {"title": "Razzies 2018 Winners Include The Mummy & The Emoji Movie", "type": "article", "image": {"identifier": "https://static1.srcdn.com/wordpress/wp-content/uploads/2018/03/The-Razzie-Awards-Golden-Raspberry-Awards-Mascot-Gasmask.jpg", "width": 1500, "height": 750}, "url": "https://screenrant.com/razzies-2018-winners-mummy-emoji-movie/", "locale": "en_US", "description": "The 38th Annual Razzie Awards have been announced.", "site_name": "ScreenRant"}, "article": {"published_time": "2018-03-03T09:03:59Z", "section": "Movie News"}, "fb": {"app_id": 822150531210883, "pages": 10765693196}}, "movies": [], "publish_date": 1520067839.0, "source": "https://screenrant.com", "summary": ""}