{"url": "www.brides.com/story/prince-harry-kate-middleton-seal-of-approval-before-proposing", "text": "Before Prince Harry proposed to Meghan Markle last year, he first asked for permission to do so from his grandmother, Queen Elizabeth II, who was also required to give her formal consent before Meghan and Harry could get married this past May. But, according to royal expert Katie Nicholl, there's another very important royal in Harry's life to whom he turned for advice before popping the question: his sister-in-law, Kate Middleton . \"Harry and Kate are very close, she's been like a mentor to him and he wanted her seal of approval,\" a source told Nicholl in Grazia U.K. this week.\n\nBeyond merely giving her approval to Harry's marriage, the Duchess of Cambridge has reportedly also made an effort to take Meghan under her wing since her and Harry's relationship turned serious. \"Kate is different to Meghan in many ways, but she has made great strides to help Meghan settle in,\" the source told Nicholl. \"It's a friendship that is still slowly blossoming. Kate has gone out of her way to be friendly to Meghan, and Meghan has been very grateful for that.\"\n\nNicholl reports that Kate has shown Meghan \"the royal ropes ,\" introduced her to several of her favorite designers , and told the newly titled Duchess of Sussex that she's \"always welcome\" in Apartment 1A of Kensington Palace, where Kate and Prince William live with their children . \"Kate has her hands full with the children and baby, but ensures she makes time to touch base with Meghan,\" the source said.\n\nSee more: Prince Harry and Meghan Markle May Be Moving Into This Insta-Worthy Windsor Cottage\n\nPrince Harry and Kate Middleton have long shared a special bond. Last year, in a profile of Harry, Newsweek 's Angela Levin noted that his sister-in-law had helped to \"fill some of that gap\" left by his mother Princess Diana's death. \"When she and William got engaged, Harry called her the big sister he never had. He often pops into their apartment at Kensington Palace, where she cooks him a meal—roast chicken is reportedly a particular favorite,\" Levin wrote.", "images": ["https://media.brides.com/photos/5d04fe1222c1387bbebaf990/1:1/w_125/GettyImages-1154594166.jpg", "https://media.brides.com/photos/5b59d5793ce270308cddcdd0/1:1/w_767/GettyImages-898506398.jpg", "https://media.brides.com/photos/5d20c878af7ec90008027dab/1:1/w_125/GettyImages-1154094900.jpg", "http://www.brides.com/images/brides-logo.svg", "https://media.brides.com/photos/5b59d5793ce270308cddcdd0/master/pass/GettyImages-898506398.jpg", "https://media.brides.com/photos/5d20c500af7ec90008027da9/1:1/w_125/GettyImages-1142167988%2520(1).jpg"], "top_img": "https://media.brides.com/photos/5b59d5793ce270308cddcdd0/master/pass/GettyImages-898506398.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.brides.com/story/prince-harry-kate-middleton-seal-of-approval-before-proposing", "title": "Prince Harry Reportedly Sought Kate Middleton's \"Seal of Approval\" Before Proposing to Meghan Markle", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=no, width=device-width, initial-scale=1, maximum-scale=1", "description": "Royal sources say that before proposing to Meghan Markle, Prince Harry reportedly turned to his \"mentor\" Kate Middleton for advice and her approval.", "og": {"description": "Harry treats Kate like a \"mentor.\"", "image": "https://media.brides.com/photos/5b59d5793ce270308cddcdd0/master/pass/GettyImages-898506398.jpg", "title": "Prince Harry Reportedly Got Kate Middleton's \"Seal of Approval\" Before Proposing", "url": "https://www.brides.com/story/prince-harry-kate-middleton-seal-of-approval-before-proposing", "site_name": "brides", "type": "article"}, "twitter": {"description": "Harry treats Kate like a \"mentor.\"", "image": "https://media.brides.com/photos/5b59d5793ce270308cddcdd0/master/pass/GettyImages-898506398.jpg?mbid=social_retweet", "title": "Prince Harry Reportedly Got Kate Middleton's \"Seal of Approval\" Before Proposing", "url": "https://www.brides.com/story/prince-harry-kate-middleton-seal-of-approval-before-proposing", "card": "summary_large_image", "creator": "@brides", "site": "brides"}, "fb": {"page_id": 50416192591, "admins": "648235154,789168297,688620285"}, "keywords": "Prince Harry,Kate Middleton,Meghan Markle,snd,News", "news_keywords": "News & Advice,News & Celebrity,Prince Harry,Kate Middleton,Meghan Markle,snd,News"}, "movies": [], "publish_date": null, "source": "http://www.brides.com", "summary": ""}