{"url": "https://www.care.com/c/stories/5992/how-to-get-poop-out-of-everything/", "text": "You've got baby or dog poop on your favorite couch, shirt, rug -- anything and everything. Is it ruined? No. Here's your poop cleaning guide.\n\nThis is one of those things you never expected to Google: \"How to remove poop from ____[fill in the blank]___.\" That's because when you imagined having a baby or a pet in your life, you probably didn't envision the very real presence of bodily functions and their propensity to, um, stain things .\n\n\n\nBut, as any parent or babysitter or dog sitter can attest, diapers have a way of leaking and pets have a way of having accidents. So it's not far fetched to suppose that you may someday be confronted by the need to clean poop out of carpeting or off of your favorite work shirt. And you need to know how to clean these things properly. (Hence the frantic Googling.)\n\n\n\nGetting rid of poop isn't fun, but it's not hard, either. (Unless the poop isn't hard ... then it's hard. Breastfed-baby poop, anyone?)\n\n\n\nHere's what to do:\n\n\n\nStart With the Basics\n\nRemoving poop usually involves a two-step process:\n\n\n\n1. Cleaning\n\n2. Sanitizing or disinfecting\n\n\n\nCleaning comes first because it's hard to disinfect something that hasn't been cleaned properly. This means getting rid of the bulk of the poop -- whatever you can scrape off or otherwise remove -- and washing the item or surface so that you can begin disinfecting (killing the germs).\n\n\n\nBut, should you wash the item with warm water or cold water? Depends. If it's a fabric that could potentially be stained, initially wash with cold water to avoid setting the stain. Warm water can be used if you're not worried about a permanent stain.\n\n\n\nTo quickly clean your basic fabric items (like a stained onesie that has those tell-tale yellow leaks streaking from the seams of the diaper area) follow these steps:\n\n\n\nRemove as much of the poop as you can (and work as quickly as possible; cleaning immediately can minimize the potential for staining)\n\nRinse or soak with cold water (blotting helps)\n\nWash in the washing machine using hot water, an enzyme-based cleaner (if suitable for the fabric), and bleach or vinegar (if suitable for the fabric).\n\n\n\nBut What If It's Not Just a Stained Onesie?\n\nBaby and pet poop can affect any manner of objects from upholstery and carpeting to bedding, silk items, wool sweaters, your baby's toys, your dog's bed and on and on and on...The precise methods of cleaning will depend on the object that's involved, so try these tricks for specific materials:\n\nCotton\n\nRemember that onesie you washed in cold water and then laundered? Maybe it's still stained. (In fact, it probably is. That's just part of life.) But don't worry! You have one of the world's best stain-removing tools at your disposal: the sun. Never underestimate the power of sunshine. While its disinfectant properties are not as effective as bleach or other disinfectant products, sunshine does have an amazing ability to effectively remove poop stains from clothing or bedding. (Bleach is an EPA-recognized disinfectant but must be properly diluted and used according to instructions.)\n\n\n\nRemember that onesie you washed in cold water and then laundered? Maybe it's still stained. (In fact, it probably is. That's just part of life.) But don't worry! You have one of the world's best stain-removing tools at your disposal: the sun. Never underestimate the power of sunshine. While its disinfectant properties are not as effective as bleach or other disinfectant products, sunshine does have an amazing ability to effectively remove poop stains from clothing or bedding. (Bleach is an EPA-recognized disinfectant but must be properly diluted and used according to instructions.) Hands\n\nYou've washed your hands repeatedly, but they STILL smell like poop. (It's okay, we've all been there.) Washing your hands with liquid dish soap may help, or trying wiping your hands with rubbing alochol swabs.\n\n\n\nYou've washed your hands repeatedly, but they STILL smell like poop. (It's okay, we've all been there.) Washing your hands with liquid dish soap may help, or trying wiping your hands with rubbing alochol swabs. Plastic\n\nFor baby toys and other plastic items, start with hot, soapy water and wash the affected item. Follow-up by sanitizing or disinfecting (the Environmental Protection Agency offers a helpful PDF that explains proper procedure for sanitizing and disinfecting children's toys).\n\n\n\nFor baby toys and other plastic items, start with hot, soapy water and wash the affected item. Follow-up by sanitizing or disinfecting (the Environmental Protection Agency offers a helpful PDF that explains proper procedure for sanitizing and disinfecting children's toys). Rugs and Carpeting\n\nFor your basic baby-poop-on-the-carpet event, clean with a combination of liquid dish soap, warm water, and lots of blotting. Vinegar may prove helpful for stain-fighting. For a more complicated dog-poop-on-the-carpet event, a product called Nature's Miracle (an enzyme-based cleaner) may be effective at removing stains and odors.\n\n\n\nFor your basic baby-poop-on-the-carpet event, clean with a combination of liquid dish soap, warm water, and lots of blotting. Vinegar may prove helpful for stain-fighting. For a more complicated dog-poop-on-the-carpet event, a product called Nature's Miracle (an enzyme-based cleaner) may be effective at removing stains and odors. Silk\n\nThe process of cleaning silk is similar to that of cleaning cotton, except that you'll want to avoid enzyme-based cleaners. Sunshine is also recommended for stain removal on silk items.\n\n\n\nThe process of cleaning silk is similar to that of cleaning cotton, except that you'll want to avoid enzyme-based cleaners. Sunshine is also recommended for stain removal on silk items. Upholstery\n\nCleaning upholstery can be similar to cleaning carpeting, although initially treating with cold water is preferable to warm water if you want to avoid setting stains. For machine-washable sofa covers, follow up by laundering. Nature's Miracle may also be effective in the case of pet poop on your furniture.\n\n\n\nCleaning upholstery can be similar to cleaning carpeting, although initially treating with cold water is preferable to warm water if you want to avoid setting stains. For machine-washable sofa covers, follow up by laundering. Nature's Miracle may also be effective in the case of pet poop on your furniture. Wool\n\nA cold-water soak is recommended for wool items, then follow up with a thorough washing (avoid enzyme-based cleaners for wool products). Sunshine can be a good choice for removing stains from wool items.\n\n\n\nKeep These Items on Hand\n\nPaper Towels\n\nPerfect for cleaning and disinfecting -- paper towels are a lifesaver.\n\n\n\nPerfect for cleaning and disinfecting -- paper towels are a lifesaver. Rubber Gloves\n\nEspecially helpful when cleaning dog poop. Plastic gloves eliminate the chance of getting poop on your hands , which is aways a plus!\n\n\n\nEspecially helpful when cleaning dog poop. Plastic gloves eliminate the chance of getting poop on your hands , which is aways a plus! Patience\n\nRemoving stains takes time, don't rush the process.\n\n\n\nRemoving stains takes time, don't rush the process. A Garbage Can\n\nFor items that are too gross to save. Not recommended for the disposal of sofas.\n\n\n\nFor items that are too gross to save. Not recommended for the disposal of sofas. A Sense of Humor\n\nRemember, this will be funny someday!\n\n\n\nBonus Cheat-Sheet of Poop-Cleaning Tips\n\nAvoid rubbing a stain on carpeting. Instead: blot. Then rinse, blot, and rinse some more.\n\nWhen cleaning any object, test an inconspicuous part first to make sure that your stain-removing or cleaning remedy does not harm the object.\n\nNever mix cleaning products, especially those that contain bleach.\n\nAlways keep all products out of the reach of children and pets, and be sure to keep children and pets away from the area or object that you're cleaning.\n\nAlways follow product directions completely.\n\nTake a look at some other techniques for cleaning bad stains and messes.\n\n\n\nWhat's the craziest thing YOU'VE ever cleaned poop off of? Share your thoughts in the comments section or on Facebook or Twitter .", "images": ["https://cdn.kinsights.com/static/images/nav/childcare/providers/the-professional-guide-for-nannies.png", "https://cdn.kinsights.com/static/images/nav/seniors/seekers/the-complete-guide-to-seniorcareplanning.png", "https://cdn.kinsights.com/static/images/nav/senior-care-job-guide.jpg", "https://cdn.kinsights.com/static/images/nav/seniors/seekers/the-complete-guide-to-endoflifecare.png", "https://cdn.kinsights.com/static/images/nav/childcare/providers/the-professional-guide-for-childcareproviders.png", "https://cdn.kinsights.com/cache/33/18/33180116c888c3236286a34e519a7503.jpg", "https://cdn.kinsights.com/static/images/nav/seniors/seekers/the-complete-guide-to-aginginplace.png", "https://cdn.kinsights.com/static/images/nav/pet-care-guide.jpg", "https://cdn.kinsights.com/static/images/nav/starting-your-own-pet-care-business.jpg", "https://cdn.kinsights.com/static/images/nav/seniors/seekers/the-complete-guide-to-seniorlivingfacilities.png", "https://cdn.kinsights.com/static/images/nav/seniors/seekers/the-complete-guide-to-alzheimersanddementia.png", "https://ct.pinterest.com/?tid=sdF0CMQjJj0", "https://cdn.kinsights.com/static/images/nav/childcare/seekers/the-complete-guide-to-babysitters.png", "https://cdn.kinsights.com/static/images/nav/housekeeping-job-guide.jpg", "https://cdn.kinsights.com/cache/5a/51/5a51ec33c60d9eeaaf52e16fc9bf0ad0.jpg", "https://cdn.kinsights.com/static/images/nav/housekeeping-guide.jpg", "https://cdn.kinsights.com/static/images/nav/childcare/seekers/the-complete-guide-to-nannies.png", "https://cdn.kinsights.com/static/images/nav/childcare/providers/the-professional-guide-for-babysitters.png", "https://cdn.kinsights.com/static/images/nav/childcare/providers/the-professional-guide-for-nannyshares.png", "https://cdn.kinsights.com/static/images/nav/childcare/seekers/the-complete-guide-to-childcare.png", "https://cdn.kinsights.com/static/images/nav/seniors/seekers/the-complete-guide-to-seniorcare.png", "https://cdn.kinsights.com/static/images/nav/childcare/seekers/the-complete-guide-to-nannyshares.png", "https://cdn.kinsights.com/cache/2a/21/2a21d7f0e7e084d5c637dfbd25d64dd5.jpg", "https://cdn.kinsights.com/cache/a3/6e/a36e48498978d37d67ea84176251b4b7.jpg", "https://cdn.kinsights.com/static/images/nav/seniors/seekers/the-complete-guide-to-inhomecare.png"], "top_img": "https://cdn.kinsights.com/cache/5a/51/5a51ec33c60d9eeaaf52e16fc9bf0ad0.jpg", "keywords": [], "authors": ["Care.Com"], "canonical_link": "https://www.care.com/c/stories/5992/how-to-get-poop-out-of-everything/", "title": "How to Get Poop Out of Everything", "meta_data": {"author": "Care.com, Inc.", "description": "You've got baby or dog poop on your favorite couch, shirt, rug -- anything and everything. Is it ruined? No. Here's your poop cleaning guide. This is one of those things you never expected to Google: \"How to remove poop from ____[fill in the blank]___.\" That's because when you imagined ...", "keywords": "House cleaning & maintenance tips, Cleaning supplies & products", "viewport": "width=device-width,initial-scale=1", "twitter": {"card": "summary", "site": "@caredotcom"}, "og": {"title": "How To Get Poop Out Of Everything", "description": "You've got baby or dog poop on your favorite couch, shirt, rug -- anything and everything. Is it ruined? No. Here's your poop cleaning guide. This is one of those things you never expected to Google: \"How to remove poop from ____[fill in the blank]___.\" That's because when you imagined ...", "url": "https://www.care.com/c/stories/5992/how-to-get-poop-out-of-everything/", "type": "care.com:note", "image": "https://cdn.kinsights.com/cache/5a/51/5a51ec33c60d9eeaaf52e16fc9bf0ad0.jpg", "site_name": "Care.com"}, "msapplication-config": "https://cdn.kinsights.com/static/images/favicons/browserconfig.xml"}, "movies": [], "publish_date": null, "source": "https://www.care.com", "summary": ""}