{"url": "https://www.bbc.com/news/uk-39802636", "text": "Media playback is unsupported on your device Media caption Prince Philip joked with a guest during an engagement, shortly after his retirement was announced\n\nThe Duke of Edinburgh is retiring from royal duties this autumn, Buckingham Palace has announced.\n\nPrince Philip, who turns 96 in June, made the decision himself and the Queen supported him, a spokesman said.\n\n\"I'm sorry to hear you're standing down\", one man told him at a royal lunch on Thursday. \"Well, I can't stand up much,\" the duke quipped.\n\nThe duke will attend already scheduled engagements between now and August but will not accept new invitations.\n\nThe Queen \"will continue to carry out a full programme of official engagements\", the palace said.\n\nThe duke carried out 110 days of engagements in 2016, making him the fifth busiest member of the royal family, according to Court Circular listings.\n\nHe is patron, president or a member of more than 780 organisations and will continue to be associated with them, but \"will no longer play an active role by attending engagements\", Buckingham Palace said.\n\nIn the statement, the spokesman said the duke \"may still choose to attend certain public events from time to time\".\n\nHours after the announcement, Prince Philip was at his 26th public engagement of 2017: a service and lunch for members of the Order of Merit at St James's Palace.\n\nAt the reception, the duke quipped to mathematician Sir Michael Atiyah that he \"can't stand up much\".\n\nAnalysis\n\nImage copyright PA\n\nBy Peter Hunt, BBC royal correspondent\n\nThis is Prince Philip acting on his own advice, nearly six years later.\n\nWhen he turned 90 he told the BBC it was \"better to get out before you reach your sell-by date\".\n\nFrom the autumn, he will follow a path into retirement which is trod by many non-royals once they are in their sixties.\n\nToday's announcement is a significant moment in the recent history of the British Royal Family.\n\nA prince of Greece - with Danish, German and Russian blood - he has served the ancient institution, very publicly, for seven decades.\n\nAs an outsider - who was viewed with suspicion by the aristocracy - he struggled at first.\n\nTo his critics, he is a gaffe-prone prince.\n\nHis many supporters argue that this nonagenarian senior royal has played a crucial role sustaining the monarchy.\n\nIt's little wonder then that the Queen once called him her strength and stay.\n\nRead more from Peter Hunt\n\nBroadcaster and writer Gyles Brandreth, a friend of the duke, told the BBC he had seen Prince Philip on Tuesday and could confirm his retirement was not on health grounds.\n\n\"I think he is retiring now in order to have a few years of retirement and I think the timing is thought through,\" he said.\n\n\"It's 70 years this autumn since he became the consort of Princess Elizabeth and then the Queen - so, after 70 years, I think he feels probably he has done his stuff.\"\n\nBBC royal correspondent Nicholas Witchell said the duke - the longest-serving consort in British history - \"clearly feels he now wishes to curtail\" his \"familiar role\" in support of his wife.\n\nMedia playback is unsupported on your device Media caption Prince Philip feeds Donna the elephant at the opening of the Centre for Elephant Care at Whipsnade Zoo\n\nThe duke attended Lord's Cricket Ground to open a new stand on Wednesday and was heard joking at the event that he is the \"world's most experienced plaque unveiler\".\n\nHe is famed for off-the-cuff remarks he has made at royal engagements over the years.\n\nPrime Minister Theresa May said she offered the country's \"deepest gratitude and good wishes\" to the duke and praised his \"steadfast support\" for the Queen.\n\nLabour leader Jeremy Corbyn wished the duke \"all the best in his well-earned retirement\", saying: \"His Duke of Edinburgh's Award scheme has inspired young people for more than 60 years in over 140 nations.\"\n\nPrince Philip set up the awards in 1956 and they have become one of the UK's best-known youth programmes, with young people carrying out challenges to earn bronze, silver or gold awards.\n\nThe Duke of Edinburgh 96 years old 70 years as Queen's companion 22,219 solo engagements since 1952\n\n5,496 speeches given\n\n785 organisations have him as patron, president or member\n\n4 million people have taken part in Duke of Edinburgh Awards Getty Images\n\nLiberal Democrat leader Tim Farron said it was a moment to \"celebrate and take stock\" of the duke's \"enormous achievements\".\n\nScotland's First Minister Nicola Sturgeon said the \"steadfast support\" the duke had given the Queen was \"hugely admirable\".\n\nStill on the diary\n\nImage copyright AFP/Getty Image caption The Queen and Duke of Edinburgh celebrate their 70th wedding anniversary later this year\n\nBuckingham Palace publishes details of official engagements up to eight weeks in advance. For the Duke of Edinburgh, these include:\n\nVisiting Pangbourne College, Berkshire, for its centenary - 9 May\n\nPresenting prizes at the Royal Windsor Horse Show - 14 May\n\nAttending a dinner marking the 70th anniversary of the founding of Pakistan - 18 May\n\nVisiting the Chelsea Flower Show - 22 May\n\nHolding receptions for young people who have achieved a gold Duke of Edinburgh award - 24 May\n\nAttending evensong to celebrate the centenary of the Companions of Honour - 13 June\n\nPresenting the Prince Philip Award at ZSL London Zoo - 27 June\n\nHosting King Felipe of Spain during his state visit - from 12 July\n\nUS President Donald Trump is also due to make a state visit to the UK later this year, but no date has been announced for his trip.\n\nThe duke and the Queen celebrate their platinum wedding anniversary - their 70th - in November.\n\nThey have called a halt to long-haul travel in recent years, with younger royals carrying out those duties.\n\nRoyal commentator Dickie Arbiter said the duke is in \"robust health\", adding: \"He is not giving up on life, just stepping [down] from full-time public engagements\".\n\nTo date, the duke has:\n\nCarried out 22,191 solo engagements\n\nTaken part in 637 solo overseas visits\n\nGiven 5,493 speeches\n\nAuthored 14 books\n\nImage copyright Getty Images Image caption The Duke of Edinburgh and the Queen waved as they made their way to an engagement on Thursday\n\nFormer royal butler Grant Harrold said: \"I love his wit and I think people will miss seeing that on a day-to-day basis. But I don't think it's him disappearing, I think it's just him being very sensible, he's 95 years old.\n\n\"He's slowing down and I'm sure we will still hear and see of him from time to time.\"", "images": ["https://ichef.bbci.co.uk/images/ic/720x405/p04zrkn2.jpg", "https://ichef.bbci.co.uk/images/ic/1024x576/p051yl9s.jpg", "https://ssc.api.bbc.com/?c1=2&c2=19293874&ns_site=bbc&name=", "https://ichef.bbci.co.uk/images/ic/720x405/p051yl9s.jpg", "https://a1.api.bbc.co.uk/hit.xiti?&col=1&from=p&ptag=js&s=598253&p=uk::news.uk.story.39802636.page&x1=[urn:bbc:cps:2faa5d5b-de2b-e841-a7cf-f17a6b3052a2]&x2=[responsive]&x3=[bbc_website]&x4=[en]&x7=[article]&x8=[reverb-0.9.1-nojs]&x10=[NEWS_GNL]&x11=[NEWS]"], "top_img": "https://ichef.bbci.co.uk/images/ic/1024x576/p051yl9s.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bbc.com/news/uk-39802636", "title": "Prince Philip to step down from carrying out royal engagements", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "The 95-year-old royal is to stop public engagements, quipping that \"I can't stand up much\".", "x-country": "us", "x-audience": "US", "CPS_AUDIENCE": "US", "CPS_CHANGEQUEUEID": 119914485, "og": {"title": "Prince Philip to step down from duties", "type": "article", "description": "The 95-year-old royal is to stop public engagements, quipping that \"I can't stand up much\".", "site_name": "BBC News", "locale": "en_GB", "url": "https://www.bbc.com/news/uk-39802636", "image": {"identifier": "https://ichef.bbci.co.uk/images/ic/1024x576/p051yl9s.jpg", "alt": "BBC News. Prince Philip"}}, "article": {"author": "https://www.facebook.com/bbcnews", "section": "UK"}, "fb": {"pages": "1143803202301544,317278538359186,1392506827668140,742734325867560,185246968166196,156060587793370,137920769558355,193435954068976,21263239760,156400551056385,929399697073756,154344434967,228735667216,80758950658,260212261199,294662213128,1086451581439054,283348121682053,295830058648,239931389545417,304314573046,310719525611571,647687225371774,1159932557403143,286567251709437,1731770190373618,125309456546,163571453661989,285361880228,512423982152360,238003846549831,176663550714,260967092113,118450564909230,100978706649892,15286229625,122103087870579,120655094632228,102814153147070,124715648647,153132638110668,150467675018739", "app_id": 1609039196070050, "admins": 100004154058350}, "twitter": {"card": "summary_large_image", "site": "@BBCWorld", "title": "Prince Philip to step down from duties", "description": "The 95-year-old royal is to stop public engagements, quipping that \"I can't stand up much\".", "creator": "@BBCWorld", "image": {"src": "https://ichef.bbci.co.uk/images/ic/1024x576/p051yl9s.jpg", "alt": "Prince Philip"}, "domain": "www.bbc.com"}, "apple-itunes-app": "app-id=364147881, app-argument=https://www.bbc.com/news/uk-39802636?utm_medium=banner&utm_content=apple-itunes-app", "apple-mobile-web-app-title": "BBC News", "application-name": "BBC News", "msapplication-TileImage": "BBC News", "msapplication-TileColor": "#bb1919", "mobile-web-app-capable": "yes", "robots": "NOODP,NOYDIR", "theme-color": "#bb1919"}, "movies": [], "publish_date": null, "source": "https://www.bbc.com", "summary": ""}