{"url": "https://www.washingtonpost.com/news/early-lead/wp/2018/01/18/i-thought-i-was-going-to-die-in-statement-mckayla-maroney-recalls-sexual-abuse-by-larry-nassar/", "text": "\n\nMcKayla Maroney says Larry Nassar began abusing her when she was 13.\n\n(Photo by Katherine Frey/The Washington Post)\n\nMore than 100 women and girls are expected to speak this week at the sentencing hearing for Larry Nassar, the former USA Gymnastics team doctor who in November pleaded guilty to seven counts of first-degree criminal sexual contact with underage girls in Michigan. That testimony continued Thursday. McKayla Maroney, the 2012 Olympic gold medalist who accused Nassar of sexually abusing her starting when she was 13 years old, was not physically present, but assistant attorney general Angela Povilaitis read a statement on her behalf.\n\nProsecutors are reading off a statement from USA gold-medalist McKayla Maroney on the third day of #LarryNassar sentencing. @detroitnews pic.twitter.com/1tVvgNb0qG — Sarah Rahal (@SarahRahal_) January 18, 2018\n\n[At Larry Nassar sentencing hearing, a parade of horror and catharsis]\n\n“I had flown all day and night with the team to get to Tokyo,” Maroney said in her statement, describing a trip to an international competition. “He had given me a sleeping pill for the flight and the next thing I know I was all alone with him in his hotel room getting a ‘treatment.’ I thought I was going to die that night. Because the national team training camps did not allow parents to be present, my mom and dad were unable to observe what Nassar was doing, and this has imposed a terrible and undeserved burden of guilt on my loving family. Larry Nassar deserves to spend the rest of his life in prison, not only because of what he did to me, my teammates and so many other little girls; he needs to be behind bars so he will never prey upon another child. I urge you to impose the maximum sentence upon him. Ever since I went public with my story I’ve been inspired and uplifted by the love and support of my former teammates, fans and many other good people. People should know that sexual abuse of children is not just happening in Hollywood, in the media and the halls of Congress. This is happening everywhere. Wherever there’s a position of power, there seems to be a potential for abuse. I had a dream to go to the Olympics, and the things that I had to endure to get there were unnecessary and disgusting.”\n\nMaroney first described her ordeal in October, saying Nassar abused her until she left the sport (she last competed at the 2013 world championships). She said Nassar molested her at the 2012 London Olympics, where she won a team gold medal as part of the Fierce Five as well as a silver in the vault. In December, Maroney filed a lawsuit against USA Gymnastics, alleging the organization sought to buy her silence over Nassar with a confidential settlement agreement last year and that USA Gymnastics, the U.S. Olympic Committee and Michigan State University — which employed him as a full-time athletic trainer — failed to respond to warning signs, permitting Nassar to abuse Maroney and others.\n\nEarlier this week, USA Gymnastics denied reports that it would seek a $100,000 fine from Maroney if she spoke out against Nassar at his sentencing hearing, saying in a statement that it “has not sought and will not seek any money from McKayla Maroney for her brave statements made in describing her victimization and abuse by Larry Nassar, nor for any victim impact statements she wants to make to Larry Nassar at this hearing or at any subsequent hearings related to his sentencing.”\n\nNassar faces at least 25 years in prison as a result of the plea deal he worked out with local prosecutors in Michigan and also faces a 60-year federal prison sentence after he pleaded guilty to earlier child-pornography charges. On Thursday, Judge Rosemarie Aquilina released a letter Nassar had written accusing the judge of grandstanding and conducting a “media circus” by allowing the parade of victim testimony, which he said was negatively affecting his mental health.\n\nThe judge did not hold back in her response.\n\n“You may find it harsh that you are here listening,” Aquilina told him while he sat in the witness box. “But nothing is as harsh as what your victims endured for thousands of hours at your hands.”\n\nRead more coverage:\n\nAn athlete accused her coach of sex abuse. Olympic officials stayed on the sideline.\n\nAbuse survivor confronts gymnastics doctor: ‘I have been coming for you for a long time’\n\nMcKayla Maroney sues USA Gymnastics, saying it tried to buy her silence on abuse\n\nDocuments: USOC alerted to sex abuse problems long before taking action", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=3005617&cv=2.0&cj=1", "https://www.washingtonpost.com/resizer/B3fh0X7cz60aor388iFzG7g7nT0=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/DQ72UFLYPYZ35HONQNZSGMXNZU.jpg", "https://www.washingtonpost.com/resizer/yAFxThroW-CI5t-yu8Q6FsF7kHI=/1x1/www.washingtonpost.com/pb/resources/img/spacer.gif", "https://me.effectivemeasure.net/em_image", "https://www.washingtonpost.com/resizer/dzcRX1a0BvyXPe5L0Bj1bcU6MCI=/960x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/DQ72UFLYPYZ35HONQNZSGMXNZU.jpg"], "top_img": "https://www.washingtonpost.com/resizer/B3fh0X7cz60aor388iFzG7g7nT0=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/DQ72UFLYPYZ35HONQNZSGMXNZU.jpg", "keywords": [], "authors": ["Matt Bonesteel", "Reporter For The Early Lead", "January", "Matt Bonesteel Spent The First Years Of His Washington Post Career Writing", "Editing. In", "Bonesteel Pivoted The Newspaper To Online", "Now He Blogs For The Early Lead", "Other Web-Based Products Owned The Post."], "canonical_link": "https://www.washingtonpost.com/news/early-lead/wp/2018/01/18/i-thought-i-was-going-to-die-in-statement-mckayla-maroney-recalls-sexual-abuse-by-larry-nassar/", "title": "‘I thought I was going to die’: In statement, McKayla Maroney recalls sexual abuse by Larry Nassar", "meta_data": {"object-hash": 1556532596, "viewport": "width=device-width, initial-scale=1.0, user-scalable=yes, minimum-scale=0.5, maximum-scale=2.0", "referrer": "unsafe-url", "keywords": "olympics, gymnastics, usa gymnastics, gymnastics sexual abuse, larry nassar, larry nassar sexual abuse, gymnastics sexual abuse, mckayla maroney", "news_keywords": "olympics, gymnastics, usa gymnastics, gymnastics sexual abuse, larry nassar, larry nassar sexual abuse, gymnastics sexual abuse, mckayla maroney", "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "creator": "@MattBonesteel"}, "og": {"type": "article", "site_name": "Washington Post", "url": "https://www.washingtonpost.com/news/early-lead/wp/2018/01/18/i-thought-i-was-going-to-die-in-statement-mckayla-maroney-recalls-sexual-abuse-by-larry-nassar/", "image": "https://www.washingtonpost.com/resizer/B3fh0X7cz60aor388iFzG7g7nT0=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/DQ72UFLYPYZ35HONQNZSGMXNZU.jpg", "title": "‘I thought I was going to die’: In statement, McKayla Maroney recalls sexual abuse by Larry Nassar", "description": "The 2012 Olympic gold medalist says Nassar began abusing her at the age of 13."}, "article": {"publisher": "https://www.facebook.com/washingtonpost", "content_tier": "metered"}, "fb": {"app_id": 41245586762, "admins": 500835072}, "zeusAds": "true", "description": "The 2012 Olympic gold medalist says Nassar began abusing her at the age of 13.", "robots": "index,follow", "theme": "normal"}, "movies": [], "publish_date": 1516251600.0, "source": "https://www.washingtonpost.com", "summary": ""}