{"url": "https://www.elle.com/culture/celebrities/a25654362/taylor-swift-joe-alwyn-relationship-timeline/", "text": "Taylor Swift has never spoken about Joe Alwyn publicly, but they’re apparently a couple — and they’ve been together for anywhere from one to two years.\n\nSwift has been uncharacteristically quiet about her relationship with Alwyn. The paparazzi photo ops of her Hiddleswift days and the couply Instagram pics she’d post with Calvin Harris are nowhere to be found. In fact, Swift rarely uses her social media for anything other than promoting her tours and performances these days.\n\nStill, we’ve managed to eke out a few details of Swift and Alwyn’s relationship. Here’s a timeline of their coupledom.\n\nMay 2, 2016: They meet at the Met Gala (probably).\n\nNobody knows for sure when Taylor and Joe first met. But sleuths have determined that the song “Dress” on her 2017 album Reputation might refer to their first meeting.\n\nThe lyrics in question: “Flashback to when you met me, your buzzed cut and my hair bleached.” Swift’s hair was, indeed, bleached at the Met Gala, and Alwyn’s hair was buzzed.\n\nNeilson Barnard Getty Images\n\nSwift was still dating Calvin Harris. This Met Gala is also the night she met Tom Hiddleston and danced goofily with him in a video that went viral, and later sparked the rebound heard ‘round the world . It was an eventful night for Tay.\n\nOct. 12, 2016: Swift and Alwyn attend the same Kings of Leon concert.\n\nA month after breaking up with Hiddleston, Swift went to a Kings of Leon show with her friends. Online sleuths have since determined that Alwyn was at the show, too.\n\nNov. 12, 2016: Swift attends Alwyn’s movie screening.\n\nSwift and a gaggle of squad members went to the premiere of Alwyn’s film, “Billy Lynn’s Long Halftime Walk.” If she and Alwyn were dating at this point, it was so under the radar that press coverage of the premiere didn’t even mention his name. It’s not clear if he was in attendance.\n\nAlwyn at the photo call for Billy Lynn’s Long Halftime Walk. Kris Connor Getty Images\n\nMay 16, 2017: Reports emerge that they’re dating.\n\nA source close to the pair told The Sun that Swift and Alwyn’s romance had been together for a few months, and that their friends and families were in on it:\n\n“This isn’t a new couple alert or a secret relationship - the only people this has been a secret to is the media because all of us, Taylor and Joe’s closest friends and their families, were aware they have been together for several months and have known each other for a longtime.\n\n“After her 1989 tour and all the attention Taylor received, she learned she had to be more protective of her personal life and she and Joe decided early on to keep their private life private.”\n\nJune 5, 2017: They’re caught by the paparazzi in Nashville.\n\nThe paparazzi finally caught the couple in action : sitting on a balcony in Nashville, where Alwyn was allegedly meeting Swift’s parents for the first time.\n\nJuly 25, 2017: They’re caught again, this time in New York.\n\nHoodies pulled tight over their faces, the couple were caught leaving Swift’s apartment.\n\nSwift and Alwyn seemed desperate to go incognito in these pics .\n\nOct. 20, 2017: Swift tells fans her new single “Gorgeous” is about Alwyn.\n\nSwift hosted a “secret” listening session for her new album, Reputation. She allegedly told fans the single “Gorgeous” is about Alwyn.\n\n\"Basically Taylor made us all promise that if anyone made any accusations of who this song is about, we tell them it is 100 percent about her angel boyfriend of one year,” a fan wrote on Tumblr. “This isn't a secret. She wanted us to tell people.\"\n\nOct. 27, 2017: Ed Sheeran spills the beans on Alwyn.\n\nOn the heels of Swift’s revelation that “Gorgeous” is about Alwyn, her bestie Ed Sheeran was asked about Alwyn on a British radio show.\n\n\"He's really nice\", he said . \"Really, really friendly, really good dude.\"\n\nDec. 11, 2017: The couple is spotted *gasp* snuggling during an Ed Sheeran performance.\n\nMomentarily letting their guard down, Swift and Alwyn engaged in some honest-to-god PDA while Ed Sheeran performed at iHeartRadio’s Jingle Bell Ball in New York City.\n\n“THEY LITERALLY SLOW DANCED TO ALL EDS SONGS WITH THEIR ARMS AROUND ONE ANOTHER AND JUST KEPT LOOKING AT EACH OTHER AND KISSING,” a fan tweeted, according to EW .\n\nMay 8, 2018: They post coordinating cactus photos to Instagram.\n\nBoth Alwyn and Swift posted photos of themselves, solo, standing next to the same cactus.\n\nAlwyn later said they didn’t even realize the photos coordinated.\n\n\"I didn't even think of that until I was in New York and someone else mentioned it,\" he said, according to ET . \"It wasn't purposeful at all!\"\n\nThis is the closest we’ve come to an “Instagram-official” moment for the couple.\n\nSept. 19, 2018: Alwyn talks about Swift for the first time — but only to say he doesn’t want to talk about her.\n\n“I’m aware people want to know about that side of things,” he said to British Vogue. “I think we have been successfully very private and that has now sunk in for people…but I really prefer to talk about work.”\n\nOct. 18, 2018: Alwyn speaks very, very briefly about Swift’s newfound political activism.\n\nIn early October, Swift finally waded into the political world to endorse two Tennessee congressional candidates, after a career-long silence.\n\nA few days later, an interviewer asked Alwyn how he felt about Swift’s post.\n\n“I think it’s great, and I think it’s important,” he said, before uncomfortably shuffling away.\n\nNov. 23, 2018: Swift acknowledges Alwyn’s existence on social media.\n\nAfter two years of knowing him, Swift finally posted something about Alwyn — or at least, his work — on Instagram.\n\nIt was a clipped trailer for his new movie, The Favourite, with a caption calling the film “phenomenal” and imploring her followers to go see it. She tagged the movie’s account, plus Alwyn’s and Nicholas Hoult’s.\n\nNov. 25, 2018: Alwyn reiterates that he’d like to keep his private life private.\n\nIn an interview with GQ , he skirts around the topic of Taylor, saying, “Someone’s private life is, by definition, private. No one is obliged to share their personal life.”\n\nHe also declined to name a favorite Swift song. “I’m just not even going to go into that side of the world,” he said .\n\nDec. 7, 2018: Alwyn opens up a teeny bit about their relationship.\n\nJust to mix things up, Alwyn provided a tiny kernel of information about his relationship with Swift, before saying he didn’t want to talk about it.\n\nEsquire asked him if he sought out any guidance from friends when he started dating Swift.\n\n“I didn’t seek out advice on that,” he said. “Because I know what I feel about it. I think there’s a very clear line as to what somebody should share, or feel like they have to share, and what they don’t want to and shouldn’t have to.”\n\nDec. 11, 2018: Swift attends Alwyn’s movie premiere in London.\n\nSwift popped up at the Cineworld Leicester premiere of “Mary, Queen of Scots” as well as an after-party.\n\nOther than that, the couple has stayed mum — but with awards season coming up and Alwyn appearing in two Oscar-bait films (The Favorite and Mary, Queen of Scots), they might just make their red carpet debut any minute.", "images": ["https://hips.hearstapps.com/ell.h-cdn.co/assets/17/20/1600x800/landscape-1494974194-taylor-joe.jpg?resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/20/1600x800/landscape-1494974194-taylor-joe.jpg?resize=1200:*", "keywords": [], "authors": ["Molly Mulshine", "Molly Mulshine Is A Writer", "Performer Living In New York City Way Of The Jersey Shore."], "canonical_link": "https://www.elle.com/culture/celebrities/a25654362/taylor-swift-joe-alwyn-relationship-timeline/", "title": "A Complete Timeline of Taylor Swift and Joe Alwyn's Relationship", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "ELLE", "title": "A Complete Timeline of Taylor Swift and Joe Alwyn's Relationship", "description": "Swift has been uncharacteristically quiet about her relationship with Alwyn, but we've eked out a few details.", "url": "https://www.elle.com/culture/celebrities/a25654362/taylor-swift-joe-alwyn-relationship-timeline/", "image": {"identifier": "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/20/1600x800/landscape-1494974194-taylor-joe.jpg?resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 364664413547847, "pages": 31911516300}, "article": {"publisher": "https://www.facebook.com/ellemagazine", "modified_time": "2018-12-22 04:12:25", "published_time": "2018-12-21 05:00:00", "section": "Celebrity News 2019"}, "twitter": {"site": "@ELLEmagazine", "card": "summary_large_image", "image": "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/20/1600x800/landscape-1494974194-taylor-joe.jpg?resize=640:*"}, "google-site-verification": "W6SOBCzCmb2sA5l3z9YK1yO7I7bPYArVQCP09_e2zck", "title": "Taylor Swift and Joe Alwyn's Relationship Complete Timeline", "description": "Taylor Swift has never spoken about Joe Alwyn publicly, but they’re apparently a couple — and they’ve been together for anywhere from one to two years. Here’s a timeline of their coupledom.", "keywords": "Joe Alwyn, Taylor Swift, Taylor joe, taylor swift and joe alwyn, taylor swift joe alwyn relationship", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/20/980x980/square-1494974194-taylor-joe.jpg?resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Culture,culture,celebrities,taylor swift and joe alwyn,Taylor joe,joe alwyn,Taylor Swift", "sailthru.date": "2018-12-21T17:00:00Z", "sailthru.image.full": "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/20/1600x800/landscape-1494974194-taylor-joe.jpg", "sailthru.image.thumb": "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/20/980x980/square-1494974194-taylor-joe.jpg", "sailthru.socialtitle": "A Complete Timeline of Taylor Swift and Joe Alwyn's Relationship", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1545386400.0, "source": "https://www.elle.com", "summary": ""}