{"url": "https://abc7news.com/society/social-media-reacts-to-the-death-of-former-pres-george-hw-bush/4803079/", "text": "Nothing gave my Gampy more joy than service to others, especially supporting and caring for those who risk making the ultimate sacrifice everyday. His leadership taught us to be kinder and gentler, to love each other. We will miss him dearly. pic.twitter.com/i2iR5U3ikc — Jeb Bush, Jr. (@JebBushJr) December 1, 2018\n\nStatement from President Donald J. Trump and First Lady Melania Trump on the Passing of Former President George H.W. Bush pic.twitter.com/qxPsp4Ggs7 — Donald J. Trump (@realDonaldTrump) December 1, 2018\n\nRest In Peace, President George H.W. Bush. President Bush committed his life to service, bravely fighting in World War II, serving in Congress, leading the @cia, serving as Ambassador to the United Nations, and being Vice-President all before leading our nation. He’ll be missed. — Rep. Eric Swalwell (@RepSwalwell) December 1, 2018\n\nAmerica has lost a patriot and humble servant in George Herbert Walker Bush. While our hearts are heavy today, they are also filled with gratitude. Our thoughts are with the entire Bush family tonight – and all who were inspired by George and Barbara’s example. pic.twitter.com/g9OUPu2pjY — Barack Obama (@BarackObama) December 1, 2018\n\nHearts are heavy as we bid farewell to President George H.W. Bush. He was a faithful servant to his country whose legacy of leadership & love of homeland became a family tradition, earned him the admiration of Americans & secured him a special place in the memory of every Texan. — Senator Ted Cruz (@SenTedCruz) December 1, 2018\n\nToday, George and his beloved Barbara are together, enjoying a well-deserved rest from their labors.\n\n\n\nToday, his spirit joins a thousand points of light with his Creator, by whose brilliance may all our works be illuminated and inspired. — Senator Ted Cruz (@SenTedCruz) December 1, 2018\n\nGeorge H W Bush died at 94.\n\nShirley Chisholm would have turned 94.\n\n\n\nThey both believed in service. Public service. Serving their nation and believing in the goodness of ppl. President Obama went to see #Bush41 this week. #Honorable#Humility#Hope#Honesty\n\n\n\nAmerican values. — Donna Brazile (@donnabrazile) December 1, 2018\n\nRIP Daddy Bush - enjoyed fishin' and huntin' with you. Enjoyed campaigning in 1988 with you as well. Say hello to Barbara for me - she sure looked out for me during your inaugural parade :-) — Chuck Yeager (@GenChuckYeager) December 1, 2018\n\nHe was more than a great man; he was a good man. His courage was matched by his compassion; and his dedication to country was equaled only by his devotion to his family. Gampy, we love you and we will miss you. But we will never forget you. pic.twitter.com/n7uFwO6xxw — George P. Bush (@georgepbush) December 1, 2018\n\nStatement by President George W. Bush on the death of his father, President George H.W. Bush https://t.co/wDD0vnlN8U pic.twitter.com/t7UsDYSKY8 — George W. Bush Presidential Center (@TheBushCenter) December 1, 2018\n\nStatement by Chancellor Sharp on the Passing of President George H.W. Bush\n\n\n\n“Not only was George H.W. Bush one of the greatest presidents in our nation’s history, he also was one of the finest men to serve our country in so many ways...\"\n\nFull statement: https://t.co/aWmaA1aprt pic.twitter.com/SleAF7dqwQ — Texas A&M System (@tamusystem) December 1, 2018\n\nWe have lost a great Houstonian. https://t.co/6sXMbBcbaf — City of Houston (@HoustonTX) December 1, 2018\n\nA friend of the world, nation & all in Texas: #GeorgeHWBush was a #pointoflife until death & we'll miss him for his firm, determined leadership & his unceasing love for God, country and family - My deepest sympathies to his family - May he rest in peace.https://t.co/HRCCAoKZuK — Sheila Jackson Lee (@JacksonLeeTX18) December 1, 2018\n\nHillary and I mourn the passing of President George H. W. Bush, and give thanks for his great long life of service, love and friendship. I am grateful for every minute I spent with him and will always hold our friendship as one of my life’s greatest gifts. https://t.co/1CYdrIeKmz — Bill Clinton (@BillClinton) December 1, 2018\n\nRIP President H.W. Bush. Thank you for a lifetime of dedicated service to our nation. Your thoughtful leadership and humility will be missed. Fair winds and following seas, Mr. President. #RIPGHWB pic.twitter.com/XnhfCnqBAu — Scott Kelly (@StationCDRKelly) December 1, 2018\n\nRest in peace, Mr. President. Barbara is waiting for you! Thank you for truly caring about our country and its people! #GeorgeHWBush pic.twitter.com/Dzo0cy3T7Y — Perez (@ThePerezHilton) December 1, 2018\n\nGeorge H.W. Bush was the embodiment of service over self. America has lost a great and honorable man. Rest in peace, Mr. President. — Larry King (@kingsthings) December 1, 2018\n\nI will never forget George H.W. Bush and President Clinton meeting me in my old hometown of New Orleans to show support and raise money after Hurricane Katrina. I send my love to his family tonight. — Ellen DeGeneres (@TheEllenShow) December 1, 2018\n\nRest in Peace\n\n\n\n41st President, George H.W. Bush and WWII veteran, passed at 94, Nov. 30.\n\n\n\nHis time and legacy in office and to our country will not be forgotten. Our deepest condolences to the Bush Family. https://t.co/3HZRkPFspC — U.S. Army (@USArmy) December 1, 2018\n\nStatement from @TilmanJFertitta and family on the passing of former President George H.W. Bush. pic.twitter.com/sfi5V6JIxQ — Houston Rockets (@HoustonRockets) December 1, 2018\n\nNaval Aviation mourns the passing of our 41st President, George H.W. Bush, a Naval Aviator, statesman, and humble public servant. His legacy lives on in those who don the cloth of our great nation and in the mighty warship which bears his name, @CVN77_GHWB. May he Rest In Peace. pic.twitter.com/0COuk6veDV — flynavy (@flynavy) December 1, 2018\n\nRest In Peace, President George H.W. Bush. President Bush committed his life to service, bravely fighting in World War II, serving in Congress, leading the @cia, serving as Ambassador to the United Nations, and being Vice-President all before leading our nation. He’ll be missed. — Rep. Eric Swalwell (@RepSwalwell) December 1, 2018\n\nGeorge H.W. Bush will be missed and long remembered for his leadership, his decency & his essential kindness. Served his country in so many ways. Made public service about country, and America’s responsibility in the world, less about party. Our thoughts are with the Bush family. — Beto O'Rourke (@BetoORourke) December 1, 2018\n\nBeautiful thread.\n\nSending you a hug, Dearest P. https://t.co/xIBIXLBKWY — Ana Navarro (@ananavarro) December 1, 2018\n\nHe represented our team, city, state and country with pride.\n\n\n\nThank you, Mr. President. 🇺🇸 pic.twitter.com/3AHGNOE9Nt — TORO 🐃 (@TexansTORO1) December 1, 2018\n\nWhat a life... full of love of family... strong faith... nothing’s more important. God bless the Bush family at this sad time. — Sarah Palin (@SarahPalinUSA) December 1, 2018\n\nGeorge H.W. Bush: patriot, public servant, and President of the United States.\n\n\n\nRest in Peace, 41. pic.twitter.com/lU0I3MXR6V — GOP (@GOP) December 1, 2018\n\nRest In Peace, President George H.W. Bush. President Bush committed his life to service, bravely fighting in World War II, serving in Congress, leading the @cia, serving as Ambassador to the United Nations, and being Vice-President all before leading our nation. He’ll be missed. — Rep. Eric Swalwell (@RepSwalwell) December 1, 2018\n\nI am saddened to hear of the loss of President George H W Bush. He was a hero in battle and a champion of American values. A true patriot of the highest caliber. My thoughts and prayers with the Bush family. God bless. — Secretary Ryan Zinke (@SecretaryZinke) December 1, 2018\n\n“He was a man of the highest character and the best dad a son or daughter could ask for.\"\n\n\n\nWe mourn the passing of the 41st President of the United States- George H.W. Bush pic.twitter.com/CW2aRHCT9v — Yale Baseball (@YaleBaseball) December 1, 2018\n\nEMBED >More News Videos If you need evidence that true love exists, look no further than George H.W. and Barbara Bush.\n\nEMBED >More News Videos Barbara Bush: A Move to Houston\n\nEMBED >More News Videos The 44th president visited with former President George H.W. Bush at his home just three days before he died.\n\nOn Friday, a family spokesperson announced that former George H.W. Bush passed away at the age of 94.Immediately after, an outpouring of condolences started popping up all over social media.\"It was with sadness that I learned of the death of President George H W Bush last night. President Bush was a great friend and ally of the United Kingdom. He was also a patriot, serving his country with honour and distinction in Office and during the Second World War.Prince Philip and I remember our days in Texas in 1991 with great fondness. My thoughts and prayers are with President Bush's family and the American people.\" - Elizabeth R.", "images": ["https://cdn.abcotvs.net/abcotv/static/kgo/logos/kgo_logo_2x.png", "https://cdn.abcotvs.com/dip/images/4803147_hold-long-bush41-ghwb-obit-180422-image.jpg?w=1600", "https://www.facebook.com/tr?id=443456229787972&ev=PageView&noscript=1", "https://cdn.abcotvs.com/dip/images/5392744_071219-kgo-ice-rally-palo-alto-img_Image_23-04-30,15.jpg?w=630&r=16%3A9", "https://cdn.abcotvs.com/dip/images/5392704_071219-kgo-elf-home-depot-img_Image_00-00-16,26.jpg?w=630&r=16%3A9", "https://cdn.abcotvs.com/dip/images/5392625_071219-kgo-six-flags-wheelchair-img_Image_17-08-06,23.jpg?w=630&r=16%3A9"], "top_img": "https://cdn.abcotvs.com/dip/images/4803147_hold-long-bush41-ghwb-obit-180422-image.jpg?w=1600", "keywords": [], "authors": [], "canonical_link": "https://abc7news.com/society/social-media-reacts-to-the-death-of-former-pres-george-hw-bush/4803079/", "title": "Social media reacts to the death of former President George H.W. Bush", "meta_data": {"description": "An outpouring of condolences and memories flooded social media after the passing of George H.W. Bush was announced by a family spokesperson.", "keywords": "Search terms I'm seeing right now: george hw bush death, george hw bush died, george bush died, george hw bush dead, bush dead, barbara bush, president George hw bush, president, George bush died, george hw bush news", "apple-itunes-app": "app-id=407314068, affiliate-data=ct=kgo-smart-banner&pt=302756, app-argument=https://abc7news.com/story/4803079", "fb": {"app_id": 479764485457445, "pages": 57427307078}, "og": {"site_name": "ABC7 San Francisco", "url": "https://abc7news.com/4803079/", "title": "Social media reacts to the death of former President George H.W. Bush", "description": "An outpouring of condolences and memories flooded social media after the passing of George H.W. Bush was announced late Friday.", "image": "https://cdn.abcotvs.com/dip/images/4803147_hold-long-bush41-ghwb-obit-180422-image.jpg?w=1600", "type": "article", "locale": "en_US"}, "twitter": {"site": "@abc7newsbayarea", "creator": "@abc7newsbayarea", "url": "https://abc7news.com/4803079/", "title": "Social media reacts to the death of former President George H.W. Bush", "description": "An outpouring of condolences and memories flooded social media after the passing of George H.W. Bush was announced late Friday.", "card": "summary_large_image", "image": "https://cdn.abcotvs.com/dip/images/4803147_hold-long-bush41-ghwb-obit-180422-image.jpg?w=1600", "app": {"name": {"iphone": "kgo", "googleplay": "kgo"}, "id": {"iphone": 407314068, "googleplay": "com.abclocal.kgo.news"}}}, "article": {"published_time": "2018-12-01T20:57:45.000Z", "modified_time": "2018-12-01T20:57:45.000Z", "section": "society"}, "title": "Social media reacts to the death of former President George H.W. Bush", "medium": "website", "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "robots": "NOODP,NOYDIR"}, "movies": [], "publish_date": 1543697865.0, "source": "https://abc7news.com", "summary": ""}