{"url": "https://www.thebalancecareers.com/kate-gosselin-s-net-worth-and-income-sources-3515076", "text": "Kate Gosselin, a mother of twins and sextuplets who rose to fame as a reality star on TLC’s “Jon and Kate Plus 8,” has not confirmed her exact earnings or net worth, but some sources have made educated guesses and speculated on figures. According to Celebrity Net Worth, Gosselin had a net worth of $200,000 as of August 2018.\n\nHer income stream is fed from various sources, including her salary as a star in reality shows “Jon and Kate Plus 8” and “Kate Plus 8,” payment for guest appearances on other TV shows, paid speaking engagements, and royalites from books she has published. And in April 2018, TLC announced a new series documenting Kate Gosselin’s dating life, called “Kate Plus Date.”\n\nEarnings from \"Jon and Kate Plus 8\"\n\nLaunched in 2007, the reality show “Jon and Kate Plus 8” documented the lives of husband and wife Jon and Kate Gosselin and the eight children they had as a result of treatments for infertility. More than 4 million viewers tuned into TLC each week to follow Jon, Kate, their twins Cara Nichole and Madelyn Kate, born Oct. 8, 2000, and their sextuplets, born May 20, 2004: Alexis Faith, Hannah Joy, Aaden Jonathan, Collin Thomas, Leah Hope, and Joel Kevin. However, marital problems brought the show to a halt.\n\nThe final episode of “Jon and Kate Plus 8” aired in November 2009, a few months after the couple announced that they had filed for divorce. The show returned to TLC in June 2010 without Jon and with a new name: “Kate Plus 8.”\n\nA controversial book, “Kate Gosselin: How She Fooled the World,” claims that Gosselin earned at least $2.5 million total from “Jon and Kate Plus 8,” with per-episode payments starting at $2,000 and growing to $22,500 in the final season.\n\nThe International Business Times also reported that the family was making $22,500 per episode of “Jon and Kate Plus 8” by the time the last one aired. The same report stated that for “Kate Plus 8,” Gosselin nearly doubled that salary, making more than $40,000 per episode. In addition, the trips the family took during the filming of both shows were paid-for perks, and the family reportedly received tens of thousands of dollars in free products.\n\nGuest Appearances\n\nThroughout the years, Gosselin has made guest appearances on other TV shows. In 2010, she appeared on celebrity dance competition “Dancing with the Stars” with dance partner Tony Dolovani. In 2013, she was on an episode of “Celebrity Wife Swap,” in which she swapped lives for a week with former “Girls Next Door” star Kendra Wilkinson. Gosselin appeared on season 14 of the reality game show “Celebrity Apprentice” in 2015—Donald Trump’s final season as host. She reportedly made $500,000 for these appearances.\n\nGosselin has also traveled the country for interviews and speaking engagements for which she received varying compensation.\n\nBooks Published\n\nAs of August 2018, Kate Gosselin has published four books. The first, “Multiple Blessings,” was co-authored by her now ex-husband and Beth Carson, and was released by Christian publisher Zondervan in November 2008. The book details the ups and downs of the couple's life, from facing infertility to the conception and birth of twins and sextuplets. It quickly became a hit, making the New York Times best-seller list one week after being released.\n\nHer second book, “Eight Little Faces,” was released by Zondervan in April 2009. It offers a more intimate look at the family's life, including photos and insight into Gosselin’s Christian faith. The book debuted at No. 5 on the New York Times bestseller list.\n\nGosselin’s third and fourth books did not sell nearly as well as her previous books.\n\n“I Just Want You to Know: Letters to My Kids on Love, Faith, and Family” was released in March 2010 by Zondervan. The book covers a period of three years when the family was living in their home in Elizabethtown, Pennsylvania. Gosselin writes about the challenges and joys of raising her eight children, as well as her beliefs.\n\nThe fourth book, a cookbook aimed at home cooks, was published in September 2014 by HCI. “Love Is in the Mix” features Gosselin's “family-friendly” recipes, tips, and traditions.\n\nBefore Fame", "images": ["https://www.thebalancecareers.com/thmb/6cmuPv9lGEKU7mA7QC-unOk0EiQ=/1024x722/filters:fill(auto,1)/KateandJonGosselinOMGPictures-56e8a2ca3df78c5ba057a65f.jpg", "https://www.thebalancecareers.com/thmb/ncFt3I_dpWMp34o4ubwDRzuqGcM=/300x200/filters:saturation(0.2):brightness(10):contrast(5):no_upscale()/KateandJonGosselinOMGPictures-56e8a2ca3df78c5ba057a65f.jpg", "https://:0"], "top_img": "https://www.thebalancecareers.com/thmb/6cmuPv9lGEKU7mA7QC-unOk0EiQ=/1024x722/filters:fill(auto,1)/KateandJonGosselinOMGPictures-56e8a2ca3df78c5ba057a65f.jpg", "keywords": [], "authors": ["Lahle Wolfe"], "canonical_link": "https://www.thebalancecareers.com/kate-gosselin-s-net-worth-and-income-sources-3515076", "title": "Kate Gosselin's Net Worth and Income", "meta_data": {"robots": "NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "Kate Gosselin, who rose to fame on TLC’s “Jon and Kate Plus 8,” has not confirmed her exact earnings or net worth, but some sources make educated guesses.", "sailthru.tags": "thebalancecareers,succeeding-at-work,women-in-business,successful-women-in-business", "article": {"section": "The Balance", "author": "https://www.facebook.com/thebalancecom"}, "fb": {"app_id": 157552701605251}, "og": {"type": "article", "site_name": "The Balance Careers", "url": "https://www.thebalancecareers.com/kate-gosselin-s-net-worth-and-income-sources-3515076", "title": "How Much Money Kate Gosselin Makes", "description": "Kate Gosselin, who rose to fame on TLC’s “Jon and Kate Plus 8,” has not confirmed her exact earnings or net worth, but some sources make educated guesses.", "image": "https://www.thebalancecareers.com/thmb/6cmuPv9lGEKU7mA7QC-unOk0EiQ=/1024x722/filters:fill(auto,1)/KateandJonGosselinOMGPictures-56e8a2ca3df78c5ba057a65f.jpg"}, "twitter": {"card": "summary", "site": "@thebalance", "title": "How Much Money Kate Gosselin Makes", "description": "Kate Gosselin, who rose to fame on TLC’s “Jon and Kate Plus 8,” has not confirmed her exact earnings or net worth, but some sources make educated guesses.", "image": "https://www.thebalancecareers.com/thmb/6cmuPv9lGEKU7mA7QC-unOk0EiQ=/1024x722/filters:fill(auto,1)/KateandJonGosselinOMGPictures-56e8a2ca3df78c5ba057a65f.jpg"}, "lotame": {"tax3": "balcar_successful-women-in-business", "tax2": "balcar_women-in-business", "tax1": "balcar_succeeding-at-work", "tax0": "bal"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/3.52.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/3.52.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/3.52.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/3.52.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/3.52.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://www.thebalancecareers.com", "summary": ""}