{"url": "http://toofab.com/2017/04/28/kendra-wilkinson-farrah-abrahams-mom-i-was-so-pissed-exclusive/", "text": "It was all about the mama drama filming \"Marriage Boot Camp Reality Stars Family Edition\" for Kendra Wilkinson -- and her own mom wasn't the only one giving her grief.\n\nAfter doing \"MBC\" with husband Hank Baskett in 2015, the \"Kendra on Top\" star signed on for more therapy with mother Patti Wilkinson. The two join the families of Farrah Abraham, Mike \"The Situation\" Sorrentino and Chad \"Ochocinco\" Johnson on the new season, where Kendra and her mother finally speak to each other for the first time since their televised blowout two years ago.\n\nThe volatile relationship between them reached an all-time low at the time after Kendra accused her mother of selling stories about her marriage with Hank to the tabloids.\n\nIn an interview with TooFab, Wilkinson candidly explained why she decided to give her mom another chance on television, how her kids reacted to the news and teased something Abraham's mom did that left her \"very pissed off.\"\n\nWhat made you want to do this show again with your mother?\n\nKendra: I did \"Marriage Boot Camp\" with Hank and surprisingly it worked, it really really worked. When I got approached to do \"Family Boot Camp,\" I knew how it worked for me and Hank and went, you know what, if I have another opportunity to speak to my mom again and understand her side of everything, then I'm going to take this opportunity. It was a very hard decision to make, because I really did shut the door and I created my own world around me without my mom and I was OK living like that.\n\nA lot of people are judging me saying you're doing this for the money, you need the money, and I'm like, yeah. Yeah, I am doing this for the money, but at the end of the day, I'm not going to fake this. This is a real process. I'm going to give it all I got. I'm putting my heart, my soul, my blood, my tears, everything into this because this is an opportunity of a lifetime that I can't refuse. If I have a chance to get my mother back in my life and the kids have their grandma, I'm gonna do what it takes.\n\nWhat was the hardest hurdle to cross?\n\nKendra: The hardest hurdle was simply just talking. The other families were yelling, fighting, communicating. at least they were communicating. My mom and I, we stayed on opposite sides of the house for a very long time, and it was very awkward because I've done it before and I understand the process, I trust it. The hurdle was for her to believe that this was real and not just a TV show.\n\nWas it difficult with your kids, were they asking 'Where's grandma?'\n\nKendra: My son he's of age, he's 7, so he's starting to ask a lot of questions and I'm honest with him. There's no reason why I shouldn't be. It's your job to prepare them for what they're about to see and learn and be a part of. I was honest with my son, like look, I'm talking to your grandma and he was really happy about that. He was scared, but he was very happy because he misses her.\n\nLooking back, do you think it was a good decision to do the show?\n\nKendra: Two weeks doesn't cure two years away from each other. It's going to take a lot longer than that because a lot of damage has been done. It's not just mine and my mom's relationship that needs repairing. Now it's gonna have to be hank and my mom, my friends, a lot of trust issues are there and a lot has to work out for it to work out.\n\nWill we see your issues with your mother continue into 'Kendra on Top'?\n\nKendra: \"Family Boot Camp\" goes right into my show. \"Marriage Boot Camp Reality Stars Family Edition,\" we're thrown into therapy ... they're taking my hand, my mom's hand, 'What do you have to say to her now?', like a baby. Now, after we get out, what now? There's no enabling, no therapy, so that's what we're showing right out of boot camp on \"Kendra on Top.\"\n\nYou're thrown into this house with a lot of strong personalities and everyone wants to know about Farrah ...\n\nKendra: People keep messaging me. I'm one of those people, I don't watch TV. It's like your job, so I don't watch it. I'm on social media, so I do see some things and a lot of negative comments about Farrah, it probably sucks, but whatever. I like to start clean, I'm not a judgmental person at all. I like to know people for who they really are, not how people paint them, labels. At first she was very nice. I wasn't in it for friendship and I didn't care about her, I cared about focusing in what I was there for. You're going to see some drama unfold.\n\nWe heard there's an incident with between you and her mother?\n\nKendra: I was so pissed, very pissed and you're gonna see why and I have every reason to be pissed at that situation. Yeah. At that point, I was just, a lot was happening with that family and I was unsure how I felt at that point. At first, they were very nice. Throughout the stay it became a little different at times, it was weird.\n\nDo you question motivation? Not just Farrah's but ...\n\nKendra: I respect every family that was in there and giving it their all, but then I started sensing things were a little bit off and I didn't want to be part of it. Other issues were more severe than the other. You'll sense that. It was hard living with them for two weeks.\n\nWho surprised you the most?\n\nKendra: My mom! I would have to say my mom.\n\nActually, you know what's funny, there was a really hot therapist in the house. Oh my god. You guys. I got so hot. I was so happy right there, because I'm thinking, I'm looking around, I have nobody to flirt with. All of a sudden the therapist walks in and I'm like, 'Oh yeah, thank the lord! Thank god we have someone to take my mind off the troubles here!'\"\n\n\"Marriage Boot Camp Reality Stars Family Edition\" premieres Friday 9 pm ET/PT on WE tv.", "images": ["http://secure-us.imrworldwide.com/cgi-bin/m?ci=us-404979h&cg=0&cc=1&ts=noscript", "https://assets.toofab.com/toofab.com/main/default/img/skeleton.svg", "https://toofab.akamaized.net/2018/12/19/newsletter-logo-v2-1.png", "https://ssl-cdn-media.tmz.com/2013/04/26/partner-rss-fox-b-w.png", "https://toofab.akamaized.net/2017/04/28/marraige-boot-camp-kendra-1200x630.jpg", "https://ssl-cdn-media.tmz.com/2013/04/26/partner-rss-thestir-logo-cut-v2-1.png", "https://toofab.akamaized.net/2019/04/06/cdl-260x30-for-tmz3-1.png", "https://ll-media.tmz.com/2013/04/26/partner-rsss-justjared-logo-cut-v2.gif", "https://ssl-cdn-assets.tmz.com/www.tmz.com/main/default/cache/images/feedlogo2.v2014_05_09_134122.gif", "http://warnerbros.112.2o7.net/b/ss/wbrostoofab/1/JS-1.5.1--NS/s1563035765?AQB=1&ce=UTF-8&ns=warnerbros&pageName=articles%3Aarticle%3A%3Akendra-wilkinson-teases-mama-drama-with-farrah-abrahams-mom-i-was-so-pissed-exclusive&c1=Toofab.us&v1=Toofab.us&c2=article&v2=article&c3=articles&v3=articles&events=event6&AQE=1", "https://toofab.akamaized.net/2017/05/24/tmz-tour-300x250-r01-1.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=3000013&cv=2.0&cj=1", "https://toofab.akamaized.net/2019/04/06/elite-daily-logo-1.png", "https://assets.toofab.com/toofab.com/main/default/img/toofab-logo-white.svg"], "top_img": "https://toofab.akamaized.net/2017/04/28/marraige-boot-camp-kendra-1200x630.jpg", "keywords": [], "authors": ["Toofab Staff"], "canonical_link": "https://toofab.com/2017/04/28/kendra-wilkinson-farrah-abrahams-mom-i-was-so-pissed-exclusive/", "title": "Kendra Wilkinson Teases Mama Drama with Farrah Abraham's Mom: 'I Was So Pissed!' (Exclusive)", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "twitter": {"toofab": 116547240, "card": "summary_large_image", "site": "@toofab", "title": "Kendra Wilkinson Teases Mama Drama with Farrah Abraham's Mom: 'I Was So Pissed!' (Exclusive)", "description": "In an interview with TooFab, Wilkinson breaks down her issues with her own mom, Farrah Abraham and her mama too!", "image": "https://toofab.akamaized.net/2017/04/28/marraige-boot-camp-kendra-1200x630.jpg"}, "verify-v1": "Wtpd0N6FufoE2XqopQJoTjWV6Co/Mny9BTaswPJbPPA=", "msvalidate.01": "AFEB17971BCF30779AEA662782EF26F4", "y_key": "14cb04e4656b0c58", "description": "In an interview with TooFab, Wilkinson breaks down her issues with her own mom, Farrah Abraham and her mama too!", "robots": "index,follow", "referrer": "unsafe-url", "og": {"url": "https://toofab.com/2017/04/28/kendra-wilkinson-farrah-abrahams-mom-i-was-so-pissed-exclusive/", "site_name": "toofab", "type": "article", "title": "Kendra Wilkinson Teases Mama Drama with Farrah Abraham's Mom: 'I Was So Pissed!' (Exclusive)", "description": "In an interview with TooFab, Wilkinson breaks down her issues with her own mom, Farrah Abraham and her mama too!", "image": "https://toofab.akamaized.net/2017/04/28/marraige-boot-camp-kendra-480x360.jpg"}, "fb": {"app_id": 116046798441464, "pages": 324392354652}, "article": {"publisher": "https://www.facebook.com/TooFab"}}, "movies": [], "publish_date": 1493352000.0, "source": "http://toofab.com", "summary": ""}