{"url": "https://web.archive.org/web/20170422075941/http://www.prnewswire.com:80/news-releases/paula-abdul-rowan-blanchard-sabrina-carpenter-laverne-cox-jessie-j-and-more-announced-to-join-lineup-of-world-renowned-speakers-and-performers-at-we-day-california-300441674.html", "text": "\"I am so thrilled to join We Day again. It is always such an honor to appear in solidarity with teens, and to be able to share a stage with so many incredible voices united,\" said actress and activist, Rowan Blanchard.\n\nThe full list of speakers, performers and presenters announced to date is available on the WE Day California event page. Newly announced names include:\n\nPaula Abdul (@PaulaAbdul) – American singer-songwriter, dancer, choreographer, actress and television personality\n\n(@PaulaAbdul) – American singer-songwriter, dancer, choreographer, actress and television personality Justin Baldoni (@justinbaldoni) – Actor, director and entrepreneur\n\n(@justinbaldoni) – Actor, director and entrepreneur Chelsea Briggs (@Chelsea_Briggs) – YouTube creator, host\n\n(@Chelsea_Briggs) – YouTube creator, host Rowan Blanchard (@RowanBlanchard) – Actress and activist\n\n(@RowanBlanchard) – Actress and activist Sabrina Carpenter (@SabrinaAnnLynn) – Singer, songwriter and actress\n\n(@SabrinaAnnLynn) – Singer, songwriter and actress Laverne Cox (@Lavernecox) – Emmy nominated actress and Emmy winning producer\n\n(@Lavernecox) – Emmy nominated actress and Emmy winning producer CyreneQ (@cyreneq) – Snapchat artist\n\n(@cyreneq) – Snapchat artist Daveed Diggs (@DaveedDiggs) – Tony and Grammy winning actor, rapper and producer\n\n(@DaveedDiggs) – Tony and Grammy winning actor, rapper and producer Daniel Fernandez (@Danfer22) – YouTube creator, magician\n\n(@Danfer22) – YouTube creator, magician Fozzie Bear – World's funniest stand-up comic bear\n\n– World's funniest stand-up comic bear Giacomo Gianniotti (@GiacomoKG) – Actor, musician, writer, director and philanthropist\n\n(@GiacomoKG) – Actor, musician, writer, director and philanthropist Evan Goldberg – Screenwriter, producer and director\n\n– Screenwriter, producer and director Jessie J (@JessieJ) – Award-winning singer and songwriter\n\n(@JessieJ) – Award-winning singer and songwriter Shonduras (@Shonduras) – Social media artist\n\n(@Shonduras) – Social media artist Statler and Waldorf – Professional hecklers\n\n– Professional hecklers The Tenors (@TenorsMusic) – Multi-platinum, Juno award winning recording artists\n\n(@TenorsMusic) – Multi-platinum, Juno award winning recording artists Grace VanderWaal (@GraceVanderWaal) – Singer, songwriter and winner of America's Got Talent\n\n(@GraceVanderWaal) – Singer, songwriter and winner of Casey Veggies (@CaseyVeggies) – Rapper and songwriter\n\n(@CaseyVeggies) – Rapper and songwriter Xzibit (@xzibit) – Multi–platinum rapper, actor, and record producer\n\nMore than a one-day event, WE Day is connected to the free, yearlong educational program WE Schools, providing schools and community groups with curriculum, educational resources and action campaigns. The program is designed to enhance a school's existing social initiatives or spark new ones. WE Schools encourages students to further their curricular learning, develop life skills for success beyond the classroom and become change-makers in their communities.\n\nIn the 2015/2016 school year, students and teachers from across California participated in remarkable social change. Over 875,000 youth were inspired to take steps to improve the world through WE Schools, raising more than $825,500 in support of local and global organizations.\n\nYou can't buy a ticket to WE Day—students earn their way by taking action on one local and one global cause of their choice. WE Day is free of charge to students and teachers, thanks to the generous support of National Co-Title Sponsors The Allstate Foundation and Unilever. The Allstate Foundation believes good starts young, and is committed to empowering America's youth with the strength, confidence and leadership skills to step us as leaders and achieve success in their lives. Unilever is committed to creating a bright future for tomorrow's leaders by encouraging everyone to take small steps toward making sustainable living commonplace.\n\nWE Day is supported by Co-Chairs Stephanie Argyros, President and CEO, Argyros Group; Stephanie Swedlove and Jeff Skoll, Founder and Chairman, Participant Media and Chairman of the Skoll Foundation; Mike Cahill, Executive Vice President, General Counsel, City National Bank; and Earvin \"Magic\" Johnson, President of Basketball Operations, Los Angeles Lakers.\n\nAnyone can find their place with WE and commit to making a change in the world. The first step is to take the WE Pledge at WE.org. By taking the pledge, participants are joining the WE Community and making a commitment to live WE every day. For every pledge taken on WE.org, $10 will be donated to local and global programs.\n\nStay connected on the latest news and updates on WE Day:\n\n#WEDay\n\nFacebook @WEMovement\n\nTwitter @WEMovement\n\nInstagram @WEMovement\n\nVisit our Media Center\n\nAbout WE Day\n\nWE Day is part of WE—an organization that brings people together and gives them the tools to change the world. A unique family of organizations, WE is made up of WE Charity, empowering change with resources that create sustainable impact, and ME to WE, a social enterprise that creates socially conscious products and experiences that allow people to do good through their everyday choices. The celebration of that change happens at WE Day—inspiring stadium-sized life-changing events that take place around the world. You can't buy a ticket to WE Day—young people earn their entry by taking action on one local and one global cause. WE Day unites world-renowned speakers, presenters and award-winning performers with thousands of young people and families to celebrate and inspire another year of incredible change. This year alone over 200,000 young people will come together in 16 stadium gatherings across the U.S., Canada, and U.K. to take part in this unprecedented educational initiative.\n\nA movement of 3.4 million young people supporting 2,500+ local and global causes, we've provided more than 1 million people with clean water and built 1,000 schools and schoolrooms overseas, giving more than 200,000 children access to education. WE was founded more than 20 years ago by humanitarians, activists and social entrepreneurs, brothers Craig and Marc Kielburger. Join the WE movement today at www.we.org.\n\nAbout The Allstate Foundation\n\nwww.allstatefoundation.org/GoodStartsYoung\n\nAbout Unilever\n\nwww.unileverusa.com\n\nFor more information on WE Day or to request an interview, please contact:\n\nCamila Ossa\n\nAssociate Director, Public Relations, WE Day\n\n+1-416-885-5522\n\ncamila.ossa@we.org\n\nFor WE Day California, please contact:\n\nSunshine Sachs\n\nMichael Samonte/Alyssa Furnari\n\n1-323-822-9300\n\nWEDay@SunshineSachs.com\n\nClick to Tweet: .@WEMovement announces new additions to #WEDay #California lineup incl. @PaulaAbdul @RowanBlanchard @SabrinaAnnLynn @Lavernecox @JessieJ\n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/paula-abdul-rowan-blanchard-sabrina-carpenter-laverne-cox-jessie-j-and-more-announced-to-join-lineup-of-world-renowned-speakers-and-performers-at-we-day-california-300441674.html\n\nSOURCE WE Day\n\nRelated Links\n\nhttp://www.WE.org\n\n", "images": ["https://web.archive.org/web/20170422075941im_/http://content.prnewswire.com/designimages/logo_prn_mobile_no_pad.png", "https://web.archive.org/web/20170422075941im_/http://www.prnewswire.com/news-releases/paula-abdul-rowan-blanchard-sabrina-carpenter-laverne-cox-jessie-j-and-more-announced-to-join-lineup-of-world-renowned-speakers-and-performers-at-we-day-california-300441674.html", "https://web.archive.org/web/20170422075941im_/http://prnewswirecom2.122.2o7.net/b/ss/prnewswirecom2/1/H.20.3--NS/0", "https://web.archive.org/web/20170422075941im_/http://content.prnewswire.com/images/prn_facebook_sharing_logo.jpg", "https://web.archive.org/web/20170422075941im_/http://s.clickability.com/s?19=990&14=0&6=419820563&7=506122&25=0&18=0.9937748426862633", "https://web.archive.org/web/20170422075941im_/http://content.prnewswire.com/designimages/logo_prn_trans.png"], "top_img": "https://web.archive.org/web/20170422075941im_/http://content.prnewswire.com/images/prn_facebook_sharing_logo.jpg", "keywords": [], "authors": ["We Day"], "canonical_link": "https://web.archive.org/web/20170422075941/http://www.prnewswire.com/news-releases/paula-abdul-rowan-blanchard-sabrina-carpenter-laverne-cox-jessie-j-and-more-announced-to-join-lineup-of-world-renowned-speakers-and-performers-at-we-day-california-300441674.html", "title": "Paula Abdul, Rowan Blanchard, Sabrina Carpenter, Laverne Cox, Jessie J, and More Announced to Join Lineup of World-Renowned Speakers and Performers at WE Day California", "meta_data": {"msvalidate.01": "9D28F7743C790DD88F2D9C7375EF7ED5", "twitter": {"card": "summary", "title": "$twitterTitle", "description": "Paula Abdul, Rowan Blanchard, Sabrina Carpenter, Laverne Cox, Jessie J, and More Announced to Join", "site": "@PRNewswire", "image": "https://web.archive.org/web/20170422075941im_/http://content.prnewswire.com/designimages/logo_prn_trans.png"}, "viewport": "width=device-width, initial-scale=1", "og": {"title": "Paula Abdul, Rowan Blanchard, Sabrina Carpenter, Laverne Cox, Jessie J, and More Announced to Join Lineup of World-Renowned Speakers and Performers at WE Day California", "type": "website", "description": "INGLEWOOD, Calif., April 19, 2017 /PRNewswire/ -- Announced today, Paula Abdul, Rowan Blanchard, Sabrina Carpenter,...", "image": "https://web.archive.org/web/20170422075941im_/http://content.prnewswire.com/images/prn_facebook_sharing_logo.jpg", "url": "https://web.archive.org/web/20170422075941/http://www.prnewswire.com/news-releases/paula-abdul-rowan-blanchard-sabrina-carpenter-laverne-cox-jessie-j-and-more-announced-to-join-lineup-of-world-renowned-speakers-and-performers-at-we-day-california-300441674.html"}, "p": {"domain_verify": "7d052ac42aa9e7505635404745861994"}, "robots": "index, follow", "author": "WE Day", "keywords": "WE Day, california, , Entertainment, Music, Education, Education, Environmental Products & Services", "description": "INGLEWOOD, Calif., April 19, 2017 /PRNewswire/ -- Paula Abdul, Rowan Blanchard, Sabrina Carpenter, Laverne Cox, Jessie J, and More Announced to Join...", "cf_entity_title": "Paula Abdul, Rowan Blanchard, Sabrina Carpenter, Laverne Cox, Jessie J, and More Announced to Join Lineup of World-Renowned Speakers and Performers at WE Day California", "cf_entity_thumbnail_url": "http://content.prnewswire.com/designimages/logo-prn-01_PRN.gif", "date": "2017-04-19T08:00:00Z", "Publisher": "PR Newswire", "geo.placename": "INGLEWOOD, Calif., April 19", "geo.region": "california"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}