{"url": "https://www.slashfilm.com/paul-mccartney-in-pirates-of-the-caribbean/", "text": "We’ve known since last year that Pirates of the Caribbean was bringing another legendary rock star into the high seas franchise after having Rolling Stones guitarist Keith Richards play Jack Sparrow’s father previously. This time, it was the British imported band The Beatles having one of their members turned into a pirate, and now we get to see what he looks like.\n\nPaul McCartney took to Twitter this weekend to reveal a first look at his character in the form of a character poster for Pirates of the Caribbean: Dead Men Tell No Tales. If you were looking forward to Paul McCartney wearing eyeliner, you will not be disappointed.\n\nCheck out the photo of Paul McCartney in Pirates of the Caribbean after the jump.\n\nHere’s the poster that Paul McCartney shared on Twitter:\n\nHonestly, if I wasn’t told that this was Paul McCartney and his name wasn’t plastered in the middle of this poster, I’m not sure I would have recognized the guy. His eyes are undoubtedly recognizable, but the rest of the pirate gear, especially the scraggly beard, make it difficult to tell. Of course, McCartney’s voice is unmistakable, so once he speaks he would likely be easily recognizable.\n\nNotice that Paul McCartney is holding a hand of cards, which makes me think that he may be quite skilled at whatever game pirates like to play. However, we still don’t know what his character’s name is, or how he fits into the overall story of this particular sequel. But we won’t have to wait much longer, because the film arrives later this month.\n\nJohnny Depp returns to the big screen as the iconic, swashbuckling anti-hero Jack Sparrow in Pirates of the Caribbean: Dead Men Tell No Tales. The rip-roaring adventure finds down-on-his-luck Captain Jack feeling the winds of ill-fortune blowing strongly his way when deadly ghost sailors, led by the terrifying Captain Salazar (Javier Bardem), escape from the Devil’s Triangle bent on killing every pirate at sea – notably Jack. Jack’s only hope of survival lies in the legendary Trident of Poseidon, but to find it he must forge an uneasy alliance with Carina Smyth (Kaya Scodelario), a brilliant and beautiful astronomer, and Henry (Brenton Thwaites), a headstrong young sailor in the Royal Navy. At the helm of the Dying Gull, his pitifull small and shabby ship, Captain Jack seeks not only to reverse his recent spate of ill fortune, but to save his very life from the most formidable and malicious foe he has never faced.\n\nPirates of the Caribbean: Dead Men Tell No Tales arrives on May 26.", "images": ["https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/piratesofthecaribbean5-paulmccartney-poster-700x1037.jpg", "https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/piratesofthecaribbean5-paulmccartney-poster-cropped-700x310.jpg", "https://sstatic1.histats.com/0.gif?1648144&101", "https://www.slashfilm.com/siteimages/pm-comments.jpg", "https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/piratesofthecaribbean5-paulmccartney-poster-cropped.jpg", "https://d13ezvd6yrslxm.cloudfront.net/authors/35.jpg"], "top_img": "https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/piratesofthecaribbean5-paulmccartney-poster-cropped.jpg", "keywords": [], "authors": ["Ethan Anderton"], "canonical_link": "https://www.slashfilm.com/paul-mccartney-in-pirates-of-the-caribbean/", "title": "Get a First Look at Paul McCartney in Pirates of the Caribbean: Dead Men Tell No Tales", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "fb": {"app_id": 254451208349115}, "description": "The man who found fame with The Beatles is hitting the high seas, and a new poster finally reveals Paul McCartney in Pirates of the Caribbean.", "news_keywords": "paul mccartney, pirates of the caribbean 5, pirates of the caribbean: dead men tell no tales, pirates-of-the-caribbean, movies, film, tv", "original-source": "https://www.slashfilm.com/paul-mccartney-in-pirates-of-the-caribbean/", "og": {"locale": "en_US", "type": "article", "title": "Get a First Look at Paul McCartney in Pirates of the Caribbean: Dead Men Tell No Tales", "description": "The man who found fame with The Beatles is hitting the high seas, and a new poster finally reveals Paul McCartney in Pirates of the Caribbean.", "url": "https://www.slashfilm.com/paul-mccartney-in-pirates-of-the-caribbean/", "site_name": "/Film", "updated_time": "2017-05-14T09:57:49-07:00", "image": {"identifier": "https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/piratesofthecaribbean5-paulmccartney-poster-cropped.jpg", "secure_url": "https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/piratesofthecaribbean5-paulmccartney-poster-cropped.jpg", "width": 810, "height": 359, "alt": "Paul McCartney in Pirates of the Caribbean"}}, "article": {"publisher": "https://www.facebook.com/slashfilm", "tag": "Pirates-of-the-Caribbean", "section": "Disney/Pixar", "published_time": "2017-05-14T10:00:08-07:00", "modified_time": "2017-05-14T09:57:49-07:00"}, "twitter": {"card": "summary_large_image", "description": "The man who found fame with The Beatles is hitting the high seas, and a new poster finally reveals Paul McCartney in Pirates of the Caribbean.", "title": "Get a First Look at Paul McCartney in Pirates of the Caribbean: Dead Men Tell No Tales", "site": "@slashfilm", "image": "https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/piratesofthecaribbean5-paulmccartney-poster-cropped.jpg", "creator": "@slashfilm"}, "msapplication-TileImage": "https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/cropped-ZZ46A5EC75-270x270.jpg"}, "movies": [], "publish_date": 1494781208.0, "source": "https://www.slashfilm.com", "summary": ""}