{"url": "https://www.thesun.co.uk/fabulous/2296725/pippa-middleton-pregnant-husband-james-matthews-net-worth-old/", "text": "PIPPA Middleton was thrust into the public eye after her bum became the star of the show at her sister Kate's wedding to Prince William back in 2011.\n\nAnd she recently married hedge fund manager James Matthews - whose brother is ex Made In Chelsea star Spencer. Here's what we know about the mum of one...\n\n8 Pippa is a socialite and sister to Catherine, Duchess of Cambridge Credit: Reuters\n\nWho is Pippa Middleton and what is her net worth?\n\nPhilippa Middleton, known to most as Pippa, is the middle child of the three Middleton children - Catherine, Duchess of Cambridge, and James William Middleton, an entrepreneur whose company sells cake-making kits for birthdays.\n\nThe 35-year-old socialite graduated from the University of Edinburgh with a degree in English literature, something she later put to use by releasing her own non-fiction book, Celebrate, in 2012.\n\nPrior to her wedding, she was once voted the Number 1 Society Singleton by Tatler magazine.\n\nAccording to some estimates, Pippa is worth approximately £750,000.\n\nHowever, she is most known for almost stealing the spotlight from her sister's marriage by wearing a bridesmaid's dress that turned her bum into a national talking point.\n\nSince then she has been seen at a number of high-class social events and remains close to her sister, but ran into trouble when a data thief hacked into her iCloud and stole thousands of personal pictures.\n\n8 Pippa has one child with husband James Matthews Credit: Getty - Contributor\n\nOn October 15, heavily pregnant Pippa Middleton reportedly arrived at the £7,500-a-night Lindo Wing maternity unit - just days after Prince Eugenie's royal wedding.\n\nThe younger sister of the Duchess of Cambridge is said to have been joined at the private hospital with her financier husband James Matthews.\n\nJames was pictured carrying two overnight bags as they entered the wing - a £78 Cam Cam Copenhagen baby changing bag and another holdall.\n\nEyewitnesses say Pippa, 35, was seen smiling as she entered the Lindo Wing, where her nephews Prince George and Prince Louis and niece Princess Charlotte were born.\n\nThat afternoon, Pippa gave birth to the couple's son weighing 8lb 9oz at the Lindo Wing.\n\nIt's said the family are delighted with the new arrival and mother and baby are doing well.\n\nThe Sun on Sunday revealed back in April the Duchess of Cambridge’s younger sister, 35, and financier husband James Matthews, 43, had announced the news to their friends and family after a 12-week scan.\n\nThe Duchess of Cambridge \"could not have been more delighted\" on learning little sister Pippa was pregnant, a friend revealed.\n\nKate, who gave birth to her third child on April 23, was the first person after Pippa’s husband James to hear the good news.\n\n8 Pippa Middleton holds a bouquet of lilies, peonies and sweet peas from the same London florist as her sister Credit: AP:Associated Press\n\nHow did Pippa announce her pregnancy?\n\nAfter months of reports and rumours surrounding her suspected pregnancy, Pippa Middleton finally confirmed that she is expecting her first child.\n\nTaking to her Waitrose magazine food column to announce the happy news, Pippa wrote: \"I was lucky to pass the 12 week scan without suffering from morning sickness.\"\n\nUnlike older sister Kate who has experienced hyperemesis gravidarum with each of her three pregnancies, Pippa has been fortunate enough to avoid the rate morning sickness condition that led to the Duchess of Cambridge being hospitalised for dehydration.\n\nA fitness buff and marathon runner, Pippa also revealed she has also \"stopped running\" only because she \"rather liked the idea\" of giving herself and the baby \"a rest from pavement pounding.\"\n\nRumoured to be due in October 2018, the petite Middleton sister gave a glimpse of her growing baby bump at the French Open in June 2018.\n\nShe then gave the world a full view of her blossoming bump at the nuptials of Princess Eugenie and James Brooksbank, dressing a gorgeous emerald green midi dress.\n\n8 Pippa showed off her growing baby bump at the 2018 French Open - the 35-year-old is a keen tennis fan Credit: Getty - Contributor\n\nWhat did Pippa name her first child?\n\nPippa and James named their firstborn Arthur Michael William Matthews.\n\nThe second name is of significance as not only is it Pippa's father's name but it also belonged to James' younger brother who died in a tragic mountaineering accident on Everest in 1999, just after becoming the youngest British man to climb to its peak.\n\n8 James proposed to Pippa in July 2016 Credit: PA:Press Association\n\nWho is Pippa married to?\n\nJames Matthews, 42, is a hedge fund manager and is also the older brother of former Made in Chelsea star Spencer Matthews.\n\nHe caught her off-guard by popping the question to her in July 2016, less than a year into their relationship.\n\nJames proposed with the hefty octagonal diamond ring, which comes with a central 4-carat Asscher-cut diamond stone, and a price tag to rival sister Kate’s own luxury ring.\n\nWith an estimated cost of £200,000, the pricey band also boasts a halo of flawless diamonds around the centre - although it’s unclear exactly who designed it.\n\n8 Pippa is married to millionaire James Matthews Credit: EPA\n\nWhen did Pippa Middleton and James Matthews get married?\n\nPippa Middleton became Mrs Pippa Matthews on May 20, 2017.\n\nThe pair enjoyed a relaxed but lavish intimate ceremony at her local church, St Mark’s Church in Englefield.\n\nWe showcased pictures of the stunning venue, which is just six miles from where the Middletons grew up.\n\nThe party was held at her parents’ £5million home in nearby Bucklebury, Berks.\n\nA £100,000 marquee was erected at the Grade II Listed location, as the bride-to-be was determined to keep the rain off her guests.\n\nIt was also revealed that guests were treated to a Spitfire fly-by.\n\nIt is estimated the society ceremony of the year cost £250,000 – ten times the UK average - and that the ceremony took place in front of 350 guests.\n\nWho was invited to James and Pippa's wedding?\n\nPippa's big sister Kate was there along with the Duke of Cambridge and Prince Harry, who she has struck up a friendship with.\n\nPippa's niece and nephew Prince George and Princess Charlotte had starring roles in the nuptials.\n\nGeorge was a pageboy while Charlotte was one of her auntie's bridesmaids.\n\nPrior to the big day Kate revealed her nerves at how her two children would behave.\n\nPippa’s younger brother James was also at the nuptials and so was his on-off girlfriend, the TV presenter and actress, Donna Air.\n\nAll of James' family attended with his former reality TV star brother Spencer on best man duties.\n\n8 Prince William and Kate Middleton's children played a part in the wedding Credit: Getty Images\n\nWhat does Pippa Middleton do for a living?\n\nPippa's book Celebrate - which focused on social etiquette and party organising - was a widely ridiculed flop, due to Pippa’s obvious observations such as: “There is something very British about tea” and “put a pitcher of water and glasses on a nearby table or side table.”\n\nLast year Pippa filmed a series of reports for US talk programme Today.\n\nBut despite being offered £400,000 by the NBC channel, she decided against working full time in the States.\n\n8 Pippa's cookbook contains more than 100 healthy meals Credit: PA:Press Association\n\nmore royal news DANCING DUCHESS Meghan had Idris Elba play ‘bare tunes’ like Whitney Houston at her wedding Comment JANE MOORE Prince Harry and Meghan Markle aren't celebrities — celebs pay their own bills COURT SECRET Archie makes first appearance in the royal diary but without godparents' names Exclusive HEIR OF THE DOG Meghan Markle planning to adopt a rescue dog for Archie to grow up with AISLE BE DAMNED A guide to Meghan Markle's exes, including the man she was married to SUITS YOU Meghan Markle ISN'T her real name - it's the same as her Suits character\n\nWhat else has Pippa Middleton written?\n\nPippa released a cookbook in September, her first book since Celebrate was released.\n\nIn it, she said a home cooked meal was the way to a man's heart.\n\nThe recipe book, called Heartfelt, was produced to raise money for the British Heart Foundation and features more than 100 healthy recipes.\n\nBut Pippa has previously admitted she hasn't cooked all the recipes herself, despite penning the book.", "images": ["https://www.thesun.co.uk/wp-content/uploads/2018/10/NINTCHDBPICT000420161650-e1545322297530.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "https://www.facebook.com/tr?id=752905198150451&ev=PageView&noscript=1", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.3 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.6 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.7 1\"%3E%3C/svg%3E", "https://www.thesun.co.uk/wp-content/uploads/2019/04/sunmasthead_mobile_site_of_the_year.png", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.5 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 2.7 1\"%3E%3C/svg%3E", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.2 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.1 1\"%3E%3C/svg%3E", "https://www.thesun.co.uk/wp-content/uploads/2019/04/sunmasthead_desktop_0404.jpg", "https://go.onelink.me/qfBl?pid=appfromfab&c=appfromfab"], "top_img": "https://www.thesun.co.uk/wp-content/uploads/2018/10/NINTCHDBPICT000420161650-e1545322297530.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "keywords": [], "authors": ["Tilly Pearce", "Mared Parry"], "canonical_link": "https://www.thesun.co.uk/fabulous/2296725/pippa-middleton-pregnant-husband-james-matthews-net-worth-old/", "title": "How old is Pippa Middleton, when did she marry husband James Matthews and what’s her net worth?", "meta_data": {"viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no, width=device-width", "apple-itunes-app": "app-id=737721107, affiliate-data=ct=Smart%20App%20Banner&pt=263124", "google-site-verification": "a576LGe3E0YA5QjAMY268jcuKWwPLIORxwlTMrjnfnE", "msvalidate.01": "E4359034FA254151A3AB2EFAC6D20D80", "p": {"domain_verify": "c061a8052bd9e93315b7f01447fa4124"}, "og": {"type": "article", "title": "How old is Pippa Middleton, what's her net worth and when did she marry husband James Matthews?", "url": "https://www.thesun.co.uk/fabulous/2296725/pippa-middleton-pregnant-husband-james-matthews-net-worth-old/", "description": "PIPPA Middleton was thrust into the public eye after her bum became the star of the show at her sister Kate’s wedding to Prince William back in 2011. And she recently married hedge fund manag…", "site_name": "The Sun", "image": {"identifier": "https://www.thesun.co.uk/wp-content/uploads/2018/10/NINTCHDBPICT000420161650-e1545322297530.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "width": 1200, "height": 800}, "locale": "en_GB"}, "article": {"published_time": "2018-12-20T16:00:24+00:00", "modified_time": "2018-12-20T16:15:21+00:00", "publisher": 161385360554578, "tag": "Pippa Middleton, Explainers, Pippa Middleton's wedding, Princess Eugenie and Jack Brooksbank royal wedding, Royal Family", "author": "https://www.facebook.com/Fabulous/"}, "fb": {"app_id": 144647118961553, "pages": 8401947179}, "description": "Pippa Middleton married millionaire James Matthews in May, 2017, in an eagerly-awaited society wedding and now they are expecting a baby", "keywords": "PIPPA MIDDLETON, KATE MIDDLETON, ROYAL FAMILY", "news_keywords": "PIPPA MIDDLETON, KATE MIDDLETON, ROYAL FAMILY", "twitter": {"text": {"title": "How old is Pippa Middleton, when did she marry husband James Matthews and what’s her net worth?"}, "card": "summary_large_image", "site": "@thesun"}, "robots": "noarchive,noodp", "taboola": {"kicker": "PIP PIP HOORAY", "headline": "How old is Pippa Middleton and when did she marry James Matthews?", "image": {"medium": "https://www.thesun.co.uk/wp-content/uploads/2018/10/NINTCHDBPICT000420161650-e1545322297530.jpg?strip=all&quality=100&w=300&h=192&crop=1", "large": "https://www.thesun.co.uk/wp-content/uploads/2018/10/NINTCHDBPICT000420161650-e1545322297530.jpg?strip=all&quality=100&w=620&h=413&crop=1"}}, "parsely-post-id": 2296725, "msapplication-TileImage": "https://www.thesun.co.uk/wp-content/uploads/2016/04/icon-e1459786005667.png?strip=all&w=270"}, "movies": [], "publish_date": 1545321624.0, "source": "https://www.thesun.co.uk", "summary": ""}