{"url": "https://ew.com/tv/2018/10/30/this-is-us-season-3-review/", "text": "Image zoom NBC\n\nFall TV This Is Us B type TV Show Network NBC Genre Drama\n\nFamily, amirite? Everyone knows that the people we love the most are the ones who can — and usually do — drive us crazier than anyone else on earth. It’s inexplicable and irrational, but it’s one of life’s many cosmic truths. With all this said, I have a confession to make: Lately, This is Us is working my last nerve.\n\nBefore you start gathering your pitchforks and torches, hear me out. This is Us is a very good show, and it deserves to be the hit that it is. The brilliance of its structure — telling the story of the Pearson family over past, present, and future timelines — allows the writers to illustrate our changing perspectives about family in a uniquely affecting way. Like so many of us, the surly, anxious Pearson kids grow up to be contemplative adults who realize — sometimes far too late — that their parents were not dictators sent to torment them, but actual people dealing with the same fears, hopes, and dashed dreams we all do.\n\nBut when a show does something really well — and there’s no series on TV now that delivers “all the feels” more effectively than This is Us — it sometimes leads to a creative stasis, a reluctance to do anything other than what it’s known for. Now that we’re about one-third of the way through season 3, I fear that This is Us has evolved (devolved?) from a multi-layered serial drama into something else, a genre entirely of its own making: The emotional procedural.\n\nJust as we watch Criminal Minds to see the BAU team hunt down psycho-of-the-week, or Law & Order: SVU to witness Olivia Benson sending pervs to prison, we can tune into This is Us certain in the fact that there will be one moment every episode that will, no matter what, fill our tear ducts to the brim. It’s predictable. It’s comfortable. And man, is it starting to get boring. Procedurals absolutely have their place in the TV landscape, but This is Us became a sensation from the very beginning for all the ways it surprised us. Now, the show that proved broadcast TV is still capable of innovation and magic seems willing to settle for rote sentimentality over a full spectrum of storytelling.\n\nOf course, This is Us is a tale built on sadness: How could anyone who lost Jack (Milo Ventimiglia) — simultaneously the World’s Greatest Dad and World’s Most Romantic Husband — ever be happy again? But 41 episodes in, it’s time to let the Pearsons (and key Pearson-adjacent characters) be defined by something other than just loss. “Nothing ever works out for us,” scowled Middle Kate (Hannah Zeile) during that egg-retrieval dream sequence in “Katie Girls” (October 9). Two weeks later, in “Toby,” Grown-Up Kate (Chrissy Metz) reiterated her origin story of sorts to a stranger by the elevator: “When sad things happen to me, I tend to shut music out of my life. A lot of sad things have happened to me.”\n\nThe stranger’s response — “Well, I hope things stay happy!” — was accidentally laughable, because in order for things to stay happy for Kate, they’d have to get happy first. For every good development (hooray, she’s pregnant!), there’s a “black cloud” counterpart (boo, Toby’s depression is back!) — and this doesn’t just happen to Kate. Rebecca (Mandy Moore) and Jack had a Great Love back in the day, but with the mystery of his death solved, the writers seem more interested in showing us Rebecca as the grieving widow whose kids resent her, or the well-meaning but tactless mother whose grown daughter resents her. Kevin’s (Justin Hartley) big-time war movie, meanwhile, turned out to be a Ron Howard masterpiece… but Kevin couldn’t enjoy it because Terry Gross immediately bummed him out (unintentionally) by asking him a bunch of questions about Jack’s time in Vietnam that he couldn’t answer. Now he’s neck-deep in guilt research, tracking down Jack’s old war buddies and, possibly, the mystery woman who was wearing Jack’s necklace in the photo. (I can only imagine all the hand-wringing and melodramatic tears when Jack’s secret Vietnam War love child turns the Big Three into the Big Three-Point-Five.) Even NBC’s poster for the show this season (below, far right) seems more depressed than ever.\n\nImage zoom NBC (3)\n\nTo be fair, the Vietnam story line did inspire this season’s most experimental episode, a reverse-chronological look at the life of Jack’s dead brother Nicky (Michael Angarano). There was a lot to admire about “Vietnam” — like the focus on Nicky’s date of birth, a subtle callback to the Big Three’s 36th-birthday turning points in the pilot. If only the writers trusted themselves — and viewers — enough to avoid hand-holding us through the Big Cry moment: As Jack’s friend and fellow soldier Robinson (Mo McRae) lay wounded on the ground, he reached up and cradled Jack’s face with both hands. “Jack,” he said, staring his sergeant in the eye. “Breathe.” Every single This is Us fan knew the importance of this gesture — but rather than giving us the space to feel this emotion on our own, the show felt the need to insert a mid-scene flashback of Jack cradling young Randall’s (Niles Fitch) face the same way, turning what could have been a genuinely tear-inducing sequence into a flashing-neon “Cry Now!” command.\n\nIt’s frustrating to see This is Us resort to such ham-handed maneuvers, especially when it can be — and sometimes still is — so outstanding. The second episode this season, “The Philadelphia Story,” featured a masterful juxtaposition of timelines: Young Kate, plowing through Fudge Stripe cookies on the couch, tells her mother, a hint of defiance in her voice, “I gained 25 pounds.” Rebecca’s hesitant reply — “Don’t be so hard on yourself” — dovetailed beautifully with the modern-day story line, as she offered to administer Kate’s hormone shot in the bathroom at Kevin’s movie premiere. “I should have done more when you really started gaining the weight,” Rebecca admits sadly. It was a delicate and earned moment of emotion.\n\nIt is not a coincidence that the most likable characters on This is Us are the ones that are consistently allowed to have feelings other than sadness, loss, and regret: Randall (Sterling K. Brown) and Beth (Susan Kelechi Watson). Of course, Randall is earnest to a fault and prone to well up at the slightest hint of sentiment — but he’s also an adorably dorky father and husband who generally enjoys his life (even when he can’t convince all his daughters to join him for “celebratory fro-yo”). And every time Randall gets a little too maudlin for his own good, Beth is there to set things right with humor and I’m-over-it clarity. Take this exchange, from last week’s episode:\n\nBeth: “You’re an emotional man, Randall. You talk about fathers, you cry. You talk about daughters, you cry. You talk about the little round boy on the corner who tried to sell lemonade in the winter…”\n\nRandall: “All his lemonade froze, Beth.”\n\nAnd now we’re going to have to watch poor Beth struggle with depression after losing her job? “For the past few weeks, I have been pretending that I’m fine,” she tells Randall in previews for tonight’s episode. “I’m not fine.” Who has two hands and does not want to watch the most grounded and entertaining character on This is Us get sucked in to a vortex of schmaltz? This girl, right here. Of course, a charismatic and highly accomplished superwoman like Beth is allowed to get the blues sometimes — but my fear is that her angst won’t lead to actual character development, and instead will wind up being another emotional procedural moment. Tears? Check. On to next week.\n\nStill, I’m sticking with This is Us — fandom, like family, is built on forgiveness, after all. My only hope is that the writers will take the upcoming winter break to remember something Kevin said in season 1: “Life is full of color.” And not all of it is gray. Grade: B", "images": ["https://ewedit.files.wordpress.com/2018/11/nup_184225_2559.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630", "https://ewedit.files.wordpress.com/2019/02/big-little-lies2.jpg?crop=0px%2C113px%2C2700px%2C1419px&resize=1200%2C630", "https://ewedit.files.wordpress.com/2019/07/all-that-ally-brooke-1.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630", "https://ewedit.files.wordpress.com/2019/05/the-loudest-voice.jpg", "https://ewedit.files.wordpress.com/2017/09/nup_179168_47451.jpg?crop=150px%2C55px%2C909px%2C908px&resize=150%2C150", "https://ewedit.files.wordpress.com/2019/06/oliver.jpg?crop=0px%2C0px%2C3000px%2C1575px&resize=1200%2C630", "https://secure.gravatar.com/avatar/2cb724cdf103d14d9bdfd321abb3cc2f?s=300&d=blank&r=g", "https://ewedit.files.wordpress.com/2019/06/1568-angel_1200x6282.jpg", "https://ewedit.files.wordpress.com/2017/09/lennykravitz.jpg?w=768", "https://ewedit.files.wordpress.com/2018/03/screen-shot-2018-03-14-at-4-02-40-pm-2.jpg", "https://ewedit.files.wordpress.com/2019/06/the-hills-1-2000.jpg?crop=0px%2C61px%2C2000px%2C1050px&resize=1200%2C630", "https://ew.com/img/icons/generic-image.svg", "https://ewedit.files.wordpress.com/2018/10/celebrity-binge.jpg?w=768", "https://ewedit.files.wordpress.com/2018/10/this-is-us.jpg", "https://ewedit.files.wordpress.com/2019/06/remini.jpg?crop=0px%2C0px%2C3000px%2C1575px&resize=1200%2C630", "https://ewedit.files.wordpress.com/2017/11/rolestout.jpg?w=768", "https://ew.com/img/streaming/hulu.png", "https://ewedit.files.wordpress.com/2019/06/tht_303_ed-_0879rt_f.jpg", "https://ewedit.files.wordpress.com/2019/07/black-lady-sketch-comedy.jpg?crop=0px%2C282px%2C2700px%2C1419px&resize=1200%2C630", "https://ewedit.files.wordpress.com/2019/07/b002_c013_1107fg_001.1675300r.jpg", "https://ewedit.files.wordpress.com/2019/07/m52_promo_stills_022519.0059_r.jpg?crop=0px%2C0px%2C3000px%2C1575px&resize=1200%2C630", "https://ewedit.files.wordpress.com/2019/06/euphoria-2.jpg", "https://ewedit.files.wordpress.com/2018/03/screen-shot-2018-03-14-at-4-02-40-pm-2.jpg?crop=0px%2C0px%2C3300px%2C1732.5px&resize=1200%2C630", "https://ewedit.files.wordpress.com/2019/07/2000x1320_2862_ewk_strangerthings.jpg", "https://ewedit.files.wordpress.com/2019/05/rw_s3_lizzymoss-profile.jpg?crop=334px%2C170px%2C2505px%2C1315px&resize=1200%2C630", "https://ewedit.files.wordpress.com/2019/06/bll-1.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630", "https://ewedit.files.wordpress.com/2019/07/sn2-1680r-1.jpg?crop=0px%2C316px%2C2700px%2C1419px&resize=1200%2C630", "https://ewedit.files.wordpress.com/2019/07/finn-noah.jpg?crop=156px%2C0px%2C1678px%2C881px&resize=1200%2C630", "https://ewedit.files.wordpress.com/2019/06/this-is-us3.jpg"], "top_img": "https://ewedit.files.wordpress.com/2018/03/screen-shot-2018-03-14-at-4-02-40-pm-2.jpg?crop=0px%2C0px%2C3300px%2C1732.5px&resize=1200%2C630", "keywords": [], "authors": ["Kristen Baldwin"], "canonical_link": "https://ew.com/tv/2018/10/30/this-is-us-season-3-review/", "title": "This is Us season 3 needs to stop trying so hard to make us cry: EW review", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "Fall TV", "news_keywords": "Fall TV", "description": "\"I fear that This is Us has evolved (devolved?) from a multi-layered serial drama into something else, a genre entirely of its own making: The emotional procedural,\" writes EW critic Kristen Baldwin", "og": {"title": "'This is Us' season 3 needs to stop trying so hard to make us cry: EW review", "type": "article", "site_name": "EW.com", "url": "https://ew.com/tv/2018/10/30/this-is-us-season-3-review/", "description": "Family, amirite? Everyone knows that the people we love the most are the ones who can — and usually do…", "image": {"identifier": "https://ewedit.files.wordpress.com/2018/03/screen-shot-2018-03-14-at-4-02-40-pm-2.jpg?crop=0px%2C0px%2C3300px%2C1732.5px&resize=1200%2C630", "width": 1200, "height": 630}}, "pinterest": {"url": "https://ew.com/tv/2018/10/30/this-is-us-season-3-review/", "description": "\"I fear that This is Us has evolved (devolved?) from a multi-layered serial drama into something else, a genre entirely of its own making: The emotional procedural,\" writes EW critic Kristen Baldwin", "media": "https://ewedit.files.wordpress.com/2018/03/screen-shot-2018-03-14-at-4-02-40-pm-2.jpg?crop=0px%2C0px%2C3300px%2C1732.5px&resize=1200%2C630"}, "twitter": {"card": "summary_large_image", "url": "https://ew.com/tv/2018/10/30/this-is-us-season-3-review/", "title": "'This is Us' season 3 needs to stop trying so hard to make us cry: EW review", "description": "\"I fear that This is Us has evolved (devolved?) from a multi-layered serial drama into something else, a genre entirely of its own making: The emotional procedural,\" writes EW critic Kristen Baldwin", "site": "@ew", "image": "https://ewedit.files.wordpress.com/2018/03/screen-shot-2018-03-14-at-4-02-40-pm-2.jpg?crop=0px%2C0px%2C3300px%2C1732.5px&resize=1200%2C630"}, "fb": {"pages": 52150999700}}, "movies": [], "publish_date": 1540872000.0, "source": "https://ew.com", "summary": ""}