{"url": "https://en.wikipedia.org/wiki/Jessica_Simpson", "text": "Jessica Ann Johnson (née Simpson; born July 10, 1980)[3] is an American singer, actress, and fashion designer. Simpson signed a recording contract with Columbia Records when she was sixteen, and released her debut studio album Sweet Kisses in 1999. It sold over four million copies worldwide, and spawned the top three song \"I Wanna Love You Forever\" (1999). Hoping to achieve further success with her second album, Simpson adopted a more mature image for the release of Irresistible (2001). The album's title track, which served as the lead single, became her second top twenty entry on the Billboard Hot 100. The album itself earned a gold certification from the Recording Industry Association of America (RIAA). Simpson married singer Nick Lachey on October 26, 2002 after four years of dating. The couple starred in the reality television series Newlyweds: Nick and Jessica (2003–2005) on MTV, chronicling their marriage and careers. The show became a pop culture phenomenon and made Simpson and her husband household names. The marriage did not last, however, and by November 2005 Simpson and Lachey confirmed they were separating; Simpson filed for divorce the following month citing irreconcilable differences.\n\nHer third studio album, In This Skin (2003), became her most successful album to date and sold three million units in the United States.[4] The album was aided in part due to the success of the single \"With You\" (2003), which topped the Mainstream Top 40 chart. She later released a Christmas themed album, ReJoyce: The Christmas Album (2004), which earned a gold certification from the RIAA. She made her film debut as Daisy Duke in the film adaption of The Dukes of Hazzard (2005); it was commercially successful, though received a negative critical reaction. She also recorded the song \"These Boots Are Made for Walkin'\" (2005) for the film, which went on to become her fourth top twenty song on the Billboard Hot 100.\n\nAside from her musical pursuits, she launched The Jessica Simpson Collection in 2005, a fashion line of clothing and other items. The brand has gone on to earn over $1 billion in revenue, and is regarded as one of the most successful celebrity founded brands ever.[5] Her fifth studio album, A Public Affair (2006), saw a decline in sales for Simpson. She later starred in the romantic comedy Employee of the Month (2006). With the release of her sixth studio album Do You Know, Simpson moved into the country music genre. While the project was met harshly by critics, it debuted at Number One on the Top Country Albums chart. Simpson went on to star in the reality television series The Price of Beauty (2010), and was a judge on two seasons of Fashion Star (2012–2013). She is married to Eric Johnson and the couple have three children.\n\nLife and career [ edit ]\n\n1980–1998: Childhood and career beginnings [ edit ]\n\nJessica Ann Simpson was born in Abilene, Texas.[6] She is the first child of Tina Ann Simpson (née Drew), a homemaker,[7] and Joseph \"Joe\" Simpson, a psychologist and Baptist youth minister.[8] Simpson's parents married in 1978; they divorced in 2013.[9][10][11][12] Simpson has stated that she grew up in Dallas and Waco, but her parents now live in McGregor, Texas.[13] Simpson is the first child of the couple; she has a younger sister, Ashlee Simpson.[14] In her preteens she briefly attended Amelia Middle School when living in the midwest while her father did outreach in Cincinnati, Ohio. After moving back to Texas 20 months later, she attended J. J. Pearce High School in her teenage years, though she had to drop out in 1997 as her career began to take off; a year later she later earned her GED via distance learning through Texas Tech High School.[15][16][17] Being a daughter of a minister, Simpson was raised with a strong Christian faith. She was given a purity ring by her father when she was twelve years old.[18] Jessica and her family moved frequently due to her father's job, though they remained in Texas for the most part, they did live in the midwest for a few years.[19] Her father would often take in unwed mothers for periods of time to provide them shelter.[19]\n\nShe began singing in the church choir as a child. When she was eleven, she realized she hoped to achieve success as a singer while at a church retreat.[19] Simpson auditioned for The Mickey Mouse Club at the age of twelve, auditioning with a performance of \"Amazing Grace\" and dancing to \"Ice Ice Baby\" (1990).[19] She advanced through multiple rounds, eventually being a semi-finalist for the show alongside artists such as Britney Spears, Christina Aguilera, and Justin Timberlake.[19] Simpson claimed that she became nervous about her final audition after seeing Aguilera perform, and she ultimately was not selected for the show.[19] Simpson resumed performing in her church choir, eventually being discovered by the head of a Christian music label.[19] He initially asked her for an audition, and immediately signed her after she performed \"I Will Always Love You\" (1973) by Dolly Parton.[19] She began working on her debut album with Proclaim Records, and began touring to promote the project.[19] Jessica's father later claimed that she had to quit touring as the size of her breasts led to her being deemed too \"sexual\" for the genre.[19]\n\nHer debut album, Jessica, remained unreleased after Proclaim Records went bankrupt; despite this, her grandmother did personally fund a limited pressing of the album.[20][21] Shortly after this, Simpson landed several auditions as Jessica was sent to numerous labels and producers.[19] She ultimately caught the attention of Tommy Mottola, then-husband of Mariah Carey and the head of Columbia Records.[19] He went on to sign her to the label, claiming \"She had a great little look and a great attitude, a fresh new face, and something a bit different than Britney and all of them; she could actually sing.\"[19] Simpson began working on her debut album in Orlando, Florida.[19] Mottola hoped to market Simpson as a contrast to Spears and Aguilera, both of whom had launched successful careers focused on dancing and sexuality.[19] While working on her musical debut, Simpson enlisted her father Joe as her manager; her mother became her stylist.[22] While at a Christmas party in 1998, Simpson met 98 Degrees singer Nick Lachey, and the two began a romantic relationship; Lachey claimed that he left the party and proclaimed to his mother that he would marry Simpson some day.[19]\n\n1999–2001: Breakthrough with early musical releases [ edit ]\n\nSimpson in January 2001.\n\nSimpson began working on her debut studio album in 1998. Mottola wanted Simpson to embrace an \"anti-sex appeal\" image while promoting the record, as a contrast to highly successful artists Britney Spears and Christina Aguilera.[23] He believed the image would make Simpson more \"relatable\" to listeners, therefore aiding in sales.[23] Simpson went on to announce her plans to remain abstinent until marriage as a result of Mottola's decision.[24] Her debut single, \"I Wanna Love You Forever\" (1999), was released on September 28.[25][26] The single became a success in numerous territories, most notably reaching number three on the Billboard Hot 100 chart in the United States.[27] The song earned a platinum certification from the Recording Industry Association of America (RIAA) for sales exceeding one million copies in the country.[28] The album had some success in other territories as well, most notably in several European countries.[29][30]\n\nSimpson's debut studio album, Sweet Kisses (1999), was released on November 23.[31] The album sold 65,000 copies in its first week of release, debuting at number sixty-five on the Billboard 200 chart in the United States.[32] To promote the record, \"Where You Are\" (2000) was released as the second single from the album; Simpson's boyfriend Nick Lachey was featured on the track.[33] \"I Think I'm in Love with You\" (2000) served as the album's third and final single, and achieved success in territories such as the United States.[34] With the success of the album's third single, Sweet Kisses rose to a new peak of number twenty-five on the Billboard 200 in August 2000.[34] The album sold over two million copies in the United States, earning a double platinum certification from the RIAA; it has sold over four million copies worldwide.[35] Simpson embarked on the Heat It Up Tour with her boyfriend's band, 98 Degrees, as their opening act to promote Sweet Kisses throughout 2000.[36]\n\nWork on her second album began in 2000, opting to record more \"radio-friendly\" and upbeat songs for the record.[37] During the recording of the album, Simpson adopted a more mature public image, a decision made by both Simpson and her record label in hopes to achieve the success of artists such as Spears.[37] While working on the record, Simpson ended her relationship with Lachey to focus on furthering her career; the two would later reconcile in September.[36] In a July 2001 interview with Coventry Newspapers, Simpson explained \"I recorded [Sweet Kisses] when I was seventeen years old and I'm twenty-one [this month] so there is four years of growth involved.\"[38] Simpson released the record's title track, \"Irresistible\" (2001) as the lead single from the project in April.[39] The single received a generally mixed reaction from critics due to its sexual themes,[40] though went on to become her second top twenty hit on the Billboard Hot 100 chart.[41][42]\n\nSimpson released her second studio album, Irresistible (2001) in May.[43] The album sold 127,000 copies in the United States during its first week of release, debuting at number six on the Billboard 200 chart.[44] Though the album's first week sales were nearly double that of her previous effort, Irresistible failed to match the success of her debut album; the record earned a gold certification from the RIAA for sales of 500,000 copies.[35] \"A Little Bit\" (2001), the album's second and final single, failed to achieve much success. To promote the record, Simpson embarked as a co-headliner on the Total Request Live Tour (2001) alongside artists such as Destiny's Child and Nelly.[45][46] She later left the tour to launch her own DreamChaser Tour (2001), for which Simpson added choreography and backup dancers to her performances; the tour was cancelled following the September 11 attacks.[47]\n\n2002–2005: Marriage to Nick Lachey and heightened success [ edit ]\n\nSimpson announced her engagement to Nick Lachey in February 2002,[48] with the two holding their wedding ceremony on October 26 in Austin, Texas.[49] Simpson began working on her third studio album in 2002. The album's lead single, \"Sweetest Sin\" (2003), lyrically dealt with the topic of Simpson losing her virginity to Lachey.[50] The song failed to achieve commercial success. Simpson's father pitched an idea to MTV about a reality show starring the couple, resulting in the creation of Newlyweds: Nick and Jessica.[51] The series initially focused on the marriage between Michael Jackson and Lisa Marie Presley, though the two backed out, thus allowing Simpson and Lachey to replace them.[52] The show, which primarily focused on the couple's marriage and the recording of Simpson's third studio album, premiered on August 19, 2003.[53][54] The show instantly became a pop culture phenomenon, with Simpson's perceived \"dumb blonde\" antics on the show helping to make the couple a household name.[55][56] The series was a ratings success for MTV, and would air for three seasons until 2005.[56]\n\nSimpson's third studio album, In This Skin (2003), was released the day that Newlyweds: Nick and Jessica premiered, with the show serving as a promotional tool for the record. In This Skin debuted at number ten on the Billboard 200, selling 64,000 copies in its first week of release.[57] The album's opening numbers served as the lowest of Simpson's career at the time. In This Skin quickly declined the chart, and by January 2004 had sold just over 565,000 copies in the United States.[57] Simpson released \"With You\" (2003) as the second single from the album in October.[58] The single became a hit, reaching the top twenty of the Billboard Hot 100 and topping the Mainstream Top 40 chart based on radio airplay.[34] Simpson performed during the halftime show of the Super Bowl XXXVIII. She recorded new material for a re-release of In This Skin, which was released in March 2004.[59][60][61] The re-release dramatically aided in album sales; In This Skin went on to sell over four million copies in the United States.[62] Both \"Take My Breath Away\" (2004) and \"Angels\" (2004) were released as singles from the re-release.[63]\n\nSimpson and Lachey starred in the ABC special The Nick and Jessica Variety Hour in April, which featured guest appearances by celebrities such as Jewel and Mr. T, among others.[64] That same month, she launched her Jessica Simpson Desserts by Jessica Simpson cosmetics line along with Randi Shinder; all of the products in the line were edible.[65] Simpson embarked on her Reality Tour (2004) throughout North America beginning in June; the tour was a financial success, and ended in October.[66] During this time, Simpson and her husband began making guest appearances on The Ashlee Simpson Show, chronicling the start of Jessica's sister's music career.[67] Simpson's fourth studio album, a collection of Christmas themed songs titled ReJoyce: The Christmas Album (2004), was released on November 23.[68] The album reached a peak of number fourteen on the Billboard 200, and was certified gold by the RIAA for sales exceeding 500,000 copies.[69] In February 2005, Simpson and Shinder launched the Dessert Treats edible cosmetics line, similar to their prior line but targeted towards a younger audience. Both lines were cancelled following a string of lawsuits.[70]\n\nSimpson performed \"The Star-Spangled Banner\" at the Indy 500 in 2005.[71] Simpson launched The Jessica Simpson Collection in 2005, initially partnering with Tarrant Apparel Group to release the Princy and JS by Jessica Simpson clothing lines.[72] The company has continued to grow throughout the years, and in 2014 was reported to earn $1 billion in annual sales.[73] Simpson made her film debut as Daisy Duke in the film adaption of The Dukes of Hazzard (2005).[74] The film was met with generally negative reviews from film critics, though went on to gross over $111 million worldwide.[75] Simpson recorded the song \"These Boots Are Made For Walkin'\" (2005) to promote the film; it both samples and shares the title of a Nancy Sinatra song.[76] The song entered the top twenty of the Billboard Hot 100, becoming one Simpson's most successful singles to date.[77] The music video, which featured Simpson in character as Daisy Duke, was controversial for featuring Simpson in \"revealing\" outfits and washing the General Lee car in her bikini.[78] The controversy resulted in the music video being banned in some countries.[79] In November 2005, Simpson and Lachey announced they were separating.[80] Simpson filed for divorce in December 2005, citing \"irreconcilable differences.\"[81] Their divorce was publicized worldwide and was finalized on June 30, 2006.[82] She reportedly had to pay Lachey $12 million in their divorce as she didn't sign a pre-nup before they wed.[83] In a 2015 interview, Simpson called her marriage to Lachey her \"biggest financial mistake\".[83]\n\n2006–2009: A Public Affair, movies and Do You Know [ edit ]\n\nSimpson dated singer-songwriter John Mayer on and off for almost a year from August 2006, nine months after she split from her then husband Nick Lachey.[84] Simpson began working on her fifth studio album in 2005. It was confirmed in March 2006 that she had parted ways with Columbia Records, whom she had been with since the launch of her career, and had signed a new recording contract with Epic Records.[85] Simpson and stylist Ken Pavés launched a line of hair and beauty products on the Home Shopping Network in 2006.[86] Simpson released her new single, \"A Public Affair\" (2006) on June 29.[87] The song entered the top twenty of the Billboard Hot 100, and earned a gold certification from the RIAA for sales exceeding 500,000 copies in the United States.[35] The single, an upbeat breakup song, was released the day before her divorce from Lachey was finalized.[87] The song most notably entered the top ten of the iTunes Store at the same time as her sister's single \"Invisible\" (2006), marking the first time that two siblings had appeared simultaneously in the store's top ten.[88]\n\nMaxim with herself on the cover Simpson holding the July 2006 issue ofwith herself on the cover\n\nHer fifth studio album, A Public Affair (2006), debuted at number five on the Billboard 200 with first-week sales of 101,000 copies.[34] The album failed to match the success of In This Skin (2003), selling just over 500,000 copies in the United States.[35] The empowerment anthem \"I Belong to Me\" (2006), which served as the album's second and final single, failed to achieve commercial success.[89] Simpson starred alongside Dane Cook and Dax Shepard in the comedy film Employee of the Month (2006), released that October.[90] The film was met with a negative critical reaction, and failed to have commercial success.[91] Simpson performed a cover of the Dolly Parton song \"9 to 5\" (1980) as a tribute to the artist at the Kennedy Center Awards in December 2006. The performance was met with harsh criticism after Simpson forgot the lyrics to the song; she was given a chance to redo the song for the cameras, though her performance was ultimately cut from the broadcast.[92][93] The underperformance of both Simpson's fifth studio album and her second film was noted by critics, as her sister Ashlee experienced a similar decline in success.[94]\n\nIn November 2007, Simpson began dating Dallas Cowboys quarterback Tony Romo. The relationship was controversial among fans of the Cowboys, who blamed Simpson for Romo's poor performance in games after the pair got together. Some fans dubbed Simpson \"Yoko Romo,\" a reference to Yoko Ono who is widely believed to have been the cause of the split of The Beatles.[95] Then-president George W. Bush even commented on the pair's relationship, implying that Simpson was to blame for Romo's lackluster performances.[96] Simpson and Romo were reported to have ended their relationship in July 2009.[97] Simpson appeared alongside Luke Wilson in the film Blonde Ambition (2007); it had a limited release in Texas before being released on home media.[98] She also starred in the direct-to-video film Private Valentine: Blonde & Dangerous (2008), portraying an actress that later joins the military. The film was met with an overwhelmingly negative reaction upon its release.[99] Simpson teamed up with Parlux Fragrances to launch her first scent, Fancy, in 2008. The fragrance was met with a positive commercial reaction.[100]\n\nSimpson began working on her sixth studio album in 2007, with her father claiming that she was experimenting with country music for the record.[101] Simpson claimed to have grown up around country music, and wanted to \"give something back.\"[102] She released \"Come On Over\" (2008) as the project's lead single on June 20.[103] The song debuted at number forty-one on the Billboard Hot Country Songs chart, making it the highest debut for an artist's first entry on that chart.[104] Do You Know (2008) was released on September 9.[105] The project sold 65,000 copies in its first week of release, debuting at number four on the Billboard 200 chart.[106] The album was deemed a commercial flop, only appearing for nine weeks on the Billboard 200 and selling just over 200,000 copies in the United States as of 2012.[107] Simpson opened for country music group Rascal Flatts on their Bob That Head Tour (2009) from January to March 2009.[108] Simpson's attempt to transition into country music was met with a negative reaction. Most notably, Simpson was booed by the crowd following a performance at the Country Thunder Festival in Wisconsin.[109]\n\n2010–present: Motherhood, second marriage, and focus on business ventures [ edit ]\n\nSimpson in October 2010.\n\nSimpson's VH1 documentary series, The Price of Beauty, began airing in March 2010. The series followed Simpson around the world, introducing viewers to the different perceptions of beauty in different cultures.[110][111][112] The premiere episode attracted one million viewers,[113][114] but Simpson revealed that the series would return in 2011 with a format change; these plans never came to fruition.[115] Simpson initially had plans to record her seventh studio album as her final release through Epic Records, though ultimately released the compilation album Playlist: The Very Best of Jessica Simpson (2010).[116] The album was released with no promotion and had little success. She later signed a new recording contract with eleveneleven and Primary Wave Music and began working on her Christmas themed seventh studio album.[117] Happy Christmas (2010) was released on November 22; it briefly appeared on the lower half of the Billboard 200 before falling off the chart.[118] Simpson began dating retired NFL tight end Eric Johnson in May 2010; the couple announced their engagement in November 2010.[119]\n\nSimpson appeared alongside Nicole Richie as a mentor on the NBC reality television series Fashion Star.[120] The series revolved around a group of designers who competed each week to create clothing; each week, one contestant was eliminated.[121] The series aired the second season in 2013, though was canceled afterward.[122] Following months of speculation, Simpson confirmed on Halloween of 2011 that she was pregnant with her first child.[123] Simpson signed a multimillion-dollar deal with Weight Watchers in 2012, vowing to use their diet plan to shed the weight gained during her pregnancy.[124][125] Simpson filmed television commercials for the company, with the first airing in September 2012.[126][127] Simpson gave birth to a daughter, Maxwell Drew Johnson, on May 1, 2012.[128][129][130] Simpson launched a maternity clothing line in 2012.[131] She later released a perfume, Vintage Bloom, which was inspired by motherhood.[132] Simpson confirmed in December 2012 that she was expecting a second child with Johnson.[133] Following the announcement, Weight Watchers announced that she would discontinue following the company's diet plan during her pregnancy.[134] Simpson gave birth to her son, Ace Knute Johnson, on June 30, 2013.[135] She launched a bedroom decor line including bedding and draperies offered in a romantic bohemian style, with floral patterns.[136] In August 2014, a signature fragrance was added.[137] Simpson and Johnson married in July 2014 in Montecito, California.[138]\n\nSimpson confirmed in 2015 that she would begin working on her album, as her contract with Primary Wave had officially ended.[139][140] Simpson is working with Linda Perry on the project, which she revealed in 2016.[141] In August 2015, Simpson was a host on the HSN channel while promoting her products. The sales were a success.[142] Simpson launched her Warm Up brand of workout clothing, available at retailers in the United States.[143] The brand was expanded in August 2016 to include trainers, with Simpson commenting that the line would become more of a focus for her in the future.[143]\n\nIn September 2018, Simpson announced she was pregnant with her third child, a daughter.[144] She gave birth to their daughter, Birdie Mae Johnson, on March 19, 2019.[145]\n\nMusical style [ edit ]\n\nSimpson has listed Mariah Carey, Aretha Franklin, Sade, and Whitney Houston as influences on her music.[146] She attempted to launch her career as a Christian music singer, and at one point completed a self-titled album of Christian music.[19] When she signed with Columbia Records in 1998, she began working on an album of pop music.[19] Simpson has recorded songs with Christian themes in later years, including \"Pray Out Loud\" (2008).[147] The music found on her debut album primarily consisted of pop ballads, with the intention of showcasing Simpson's vocals.[148] Most notably, the album featured the power ballad \"I Wanna Love You Forever\" (1999).[149] The music found on her debut drew comparisons to Mariah Carey.[36] With the release of Irresistible (2001), Simpson recorded more upbeat songs, likening herself to artists such as Britney Spears.[150][151] Songs such as \"Irresistible\" and \"A Little Bit\" had more provocative lyrics in comparison to her previous release, with Simpson citing the age difference between the recording of the two albums as the main reason.[37] During the Total Request Live Tour (2001) and her DreamChaser Tour (2001), Simpson incorporated more choreography and backup dancers into her live performances.[152]\n\nSimpson initially began working on her third studio album in 2002, which was set to primarily be produced by rapper Missy Elliott.[153] The record later took on a new direction, which her then-husband Nick Lachey described as \"organic\" in comparison to her prior two albums.[154] Simpson also began co-writing her own songs for the record, something she had been nervous to do in the past.[154] The result was In This Skin (2003), a record that AllMusic said \"stay[ed] within the contemporary dance-pop realm while inching toward the middle-of-the-road diva that she's always yearned to be.\"[36] Simpson worked with elements of country music with the release of \"These Boots Are Made For Walkin'\" (2005), recorded for Simpson's feature film debut The Dukes of Hazzard (2005).[155] She continued to experiment with the genre on the song \"Push Your Tush\" (2006). Numerous songs on her fifth studio album feature elements of dance and disco music, most notably \"A Public Affair\" and her cover of \"You Spin Me Round (Like a Record)\".[156][157] Inspired by artists such as Faith Hill, Shania Twain and Martina McBride, Simpson recorded a country music album titled Do You Know (2008).[158] Throughout her career, Simpson has delved into other genres as well, releasing two Christmas-themed albums in 2004 and 2010.[159]\n\nPublic image [ edit ]\n\nSimpson in May 2010.\n\nWith the release of Sweet Kisses (1999), Simpson and her team marketed Simpson as \"anti-sex appeal\", as a contrast to artists such as Britney Spears and Christina Aguilera who had recently achieved success with their respective debut albums. The music found on her debut album mostly spoke on topics such as love, and Simpson announced that she would remain abstinent until marriage. Though the album sold four million copies worldwide, it failed to meet the expectations of Columbia Records; as a result, the label hoped to see Jessica mature her image for the release of her second album. Her image changed drastically for the record, with Simpson singing more promiscuous music and wearing provocative clothing. The change in her image garnered a negative reaction from critics, some of which felt that Simpson had \"sold out\" in an attempt to emulate the success of Spears.[160]\n\nUpon Simpson's rise to stardom with the success of Newlyweds: Nick and Jessica in 2003, Simpson was seen as a \"ditzy blonde\" based on her antics and comments on the show.[161][162][163] The show also revealed that Simpson had, in fact, waited until marriage to have sex; she recorded the song \"Sweetest Sin\" (2003) about losing her virginity to Lachey.[57] While Simpson continued to achieve further success, she became known as a sex symbol by the media.[164][165] Simpson was ranked at number fifty-three on the Maxim Hot 100 list in 2001.[166] She topped the list in 2004, ranked at the \"hottest\" female of the year.[167] Simpson was quoted as stating \"It's nice to get the stamp of approval from the boys [...] it's way better than being number 101!\"[168] The following year, she ranked in at number nine on the list.[169] In 2006, she appeared on the list at number eighteen.[170] Simpson was on the cover of the magazine that year as well.[171] Simpson's portrayal of Daisy Duke furthered her sex symbol image, most notably when she portrayed the character in her highly controversial \"These Boots Are Made For Walkin\" music video. Simpson appeared as the character in several television commercials for Pizza Hut airing during the Super Bowl in 2006 and 2007.[172] She also portrayed the character in adverts for DirecTV.\n\nSimpson's weight fluctuation continued to be covered by the media in the years following her portrayal of Daisy Duke, with discussion of how food allergies, new meal plans and fitness routines were having an impact on her physique.[173][174] Though the criticism carried into 2008 throughout her transition into country music,[175][176] it reached a peak in 2009.[177] Specifically, one particular outfit that consisted of jeans, a belt, and a sleeveless top was criticized by the media and deemed \"unflattering\" to Simpson's figure.[178][179] Simpson defended her weight gain, as did her sister, and claimed that she still felt \"confident\" in her skin.[180] The weight criticism continued following the birth of her two children, though Simpson has gained a large amount of weight recently in 2018.[181] Simpson is also a registered Republican.[182] She endorsed George W. Bush during his presidential campaign in 2004,[183] though cancelled an appearance at a 2006 Republican fundraiser as she felt it was not \"appropriate\".[184] Though a Republican, Simpson has praised former First Lady Michelle Obama during her time in office, stating, \"She's such an incredible woman, and she's with such a powerful man...Everything she does she exudes confidence.\"[185]\n\nPhilanthropy [ edit ]\n\nIn April 2004, Simpson performed during the VH1's benefit concert Divas Live 2004 alongside Ashanti, Cyndi Lauper, Gladys Knight, Joss Stone and Patti LaBelle, in support of the Save the Music Foundation.[186] In May 2004, Simpson did a benefit concert to help the Skin Care Foundation.[187] In March 2007, Simpson donated a new Chrysler minivan to the Elim orphanage in Nuevo Laredo. Simpson won a Chrysler Crossfire sports car at the 2006 MTV Video Music Awards, but exchanged the $50,000 luxury car for a minivan so she could help the orphanage.[188] Simpson is Soles4Souls's Ambassador where she participated in autographing shoes to donate the money from communities across the United States.[189] Simpson also works with Make A Wish Foundation.[190]\n\nFilmography [ edit ]\n\nFilms [ edit ]\n\nTelevision [ edit ]\n\nDiscography [ edit ]\n\nTours [ edit ]\n\nSee also [ edit ]\n\nReferences [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c9/Jessica_Simpson_54th_Presidential_Inaugural_Opening_Celebration_2_cropped.jpeg/180px-Jessica_Simpson_54th_Presidential_Inaugural_Opening_Celebration_2_cropped.jpeg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/31/Jessica_Simpson_2004.jpg/220px-Jessica_Simpson_2004.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Signed_Maxim_magazine_jessica_simpson.jpg/220px-Signed_Maxim_magazine_jessica_simpson.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/JessicaSimpsonMay10.jpg/180px-JessicaSimpsonMay10.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/f/f2/Jessica_Simpson_Joining_Forces_with_the_Rockies_April_2011_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/44/US_Navy_101001-N-3793B-071_Jessica_Simpson_autographs_a_photo_for_a_Sailor_during_a_USO_and_Navy_Entertainment_sponsored_visit_aboard_USS_Harry_S.jpg/240px-US_Navy_101001-N-3793B-071_Jessica_Simpson_autographs_a_photo_for_a_Sailor_during_a_USO_and_Navy_Entertainment_sponsored_visit_aboard_USS_Harry_S.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/Jessica_Simpson_Joining_Forces_with_the_Rockies_April_2011_%28cropped%29.jpg/220px-Jessica_Simpson_Joining_Forces_with_the_Rockies_April_2011_%28cropped%29.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/f/f2/Jessica_Simpson_Joining_Forces_with_the_Rockies_April_2011_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Jessica_Simpson", "title": "Jessica Simpson", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.13", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/f/f2/Jessica_Simpson_Joining_Forces_with_the_Rockies_April_2011_%28cropped%29.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}