{"url": "www.quora.com/Can-a-blind-person-see-again-through-an-eye-surgery", "text": "Doctors hope for blindness cure after restoring patients' sight\n\nTreatment for common cause of blindness could be available within five years, scientists say\n\nA treatment for the commonest cause of blindness could be available within five years, scientists believe, after revealing the first two patients given a revolutionary stem cell therapy have regained enough vision to be able to read.\n\nThe two patients have advanced AMD – age-related macular degeneration – which destroys the central vision. Both were losing their sight. They were, said their surgeon, unable to see a book, let alone the printed letters.\n\nBut an implanted “patch” of stem cells over the damage at the back of the eye has restored the central vision enough not only for reading but to see faces that used to be a grey blur.\n\nIn the future, the scientists behind the breakthrough anticipate the procedure could be as common as cataract surgery, helping large numbers of the 600,000 to 700,000 people in the UK who are losing their sight because of AMD.\n\nThe breakthrough comes from the London Project to Cure Blindness, a collaboration between Prof Pete Coffey of University College London and Prof Lyndon da Cruz, a retinal surgeon at Moorfields Eye Hospital.\n\nThey aimed to treat 10 people who had the “wet” form of AMD, caused by sudden leakage from blood vessels in the eye that can destroy the macula, a key part of the retina. The retinal pigment epithelial (RPE) cells in the macula are crucial to the functioning of the light sensitive photoreceptor cells, which die without RPE support.\n\nThe two patients, a woman in her 60s and man in his 80s, are the first in the UK to have the treatment, and were chosen because of their advanced disease – they would have gone blind within six weeks of the blood vessel leakage. Each had one eye implanted with the patch, which consisted of a membrane covered with human embryonic stem cells engineered to differentiate into RPE cells. The results are published in the journal Nature Biotechnology.", "images": ["https://qsf.fs.quoracdn.net/-3-images.favicon.ico-26-ae77b637b1e7ed2c.ico", "https://qph.fs.quoracdn.net/main-thumb-1325-100-yulrktvuoxawtlesqjzeqxuxffigkpbc.jpeg", "https://qph.fs.quoracdn.net/main-thumb-847152258-100-ijdvmdyvrkbgmclfwjpgsxpckifbwkii.jpeg"], "top_img": "https://qsf.fs.quoracdn.net/-3-images.favicon.ico-26-ae77b637b1e7ed2c.ico", "keywords": [], "authors": [], "canonical_link": "https://www.quora.com/Can-a-blind-person-see-again-through-an-eye-surgery", "title": "Can a blind person see again through an eye surgery?", "meta_data": {"robots": "noarchive"}, "movies": [], "publish_date": null, "source": "http://www.quora.com", "summary": ""}