{"url": "https://dailynews.news/tyler-henry039s-most-omg-moments-on-hollywood-medium/", "text": "Check out the gallery below to see all of his most OMG moments!\n\nTyler Henry always finds a way to surprise the people he reads. Whether they come in as true believers or major skeptics, they leave with more than a few shocking stories to tell. Over the course of the past two seasons of Hollywood Medium With Tyler Henry, Tyler has had his fair share of crazy reads.\n\nYou never know what you’re going to get!\n\nGetty Images; E! Alan Thicke’s Heart Problems Alan Thicke died in Dec. 2016 from a “ruptured aorta” and a “stanford type A aortic dissection,” but only a few short months prior, Tyler accurately predicted his health problems. “If you yourself notice blood pressure or a heart murmur, just see a doctor. But I feel almost like we have to really take this into consideration,” Tyler warned Alan.\n\nE! Robert Kardashian at Peace Tyler shocked Khloe Kardashian when he revealed a message to her from her father Robert Kardashian who passed away in 2003. “There’s a feeling of like, ‘I don’t want you to be there when I’m actually passing away,'” Tyler tells Khloe. “It’s like, ‘For your sake I want you to just not have that in your memory.'” As it turns out, Khloe and her siblings were in fact not there when he died. A fact that only Khloe and her close family were aware of. Even her sister Kylie Jenner who was watching from the other room was stunned by the revelation.\n\nE! Julie Chrisley Connects to Her Brother The Chrisleys had a pretty shocking reading when they sat down with Tyler as well. He was able to share some news about a previous miscarriage that there is no way he could have known about. “There’s a situation of either like a miscarriage, a stillborn or a child that passed,” Tyler explained. “No one knew about the miscarriage except Julie and myself,” Todd shared in total shock. “No one knew about that except Julie and I. We’ve never told that to this day!” Todd may have walked in the room a skeptic, but he walked out a total believer.\n\nArticle continues below\n\nE! Amber Rose’s Love Life Reveal Amber Rose revealed to Tyler that she was worried about finding love again after her breakup with Wiz Khalifa, and he confirmed that she may be meeting someone special soon. “Hmm, keep in mind a man with a ‘T’ name,” Tyler shared. “That’s all I’ll say. I believe that over the course of the next—well I’m seeing spring—I see an opportunity for two relationships. There’s a ‘T’ initial.” Soon after their reading, Amber announced she was dating NBA player Terrence Ross. “@tyhenrymedium I may have found my ‘T,'” she tweeted. The two have since gone their separate ways, but Tyler was spot on.\n\nRichard Young/startraksphoto.com Whitney Houston Comforts Bobbi Kristina Brown Bobby Brown sat down with Tyler and was connected with both the spirits of his ex-wife Whitney Houston and daughter Bobbi Kristina Brown. Both women passed away tragically within three years of each other. “She’s coming through and giving me this feeling of, I was there to hold her hand when she made her transition, when she left,” Tyler told Bobby. “People would’ve felt her mother around when she passed away.” Bobby was also given the shocking closure he needed from his daughter. “I don’t know why this is coming across, but she loves her mom and she loves her dad so much. And she understands you both were in extraordinarily unique situations, but she comes across basically saying, ‘I understand they did what they had to do to get by from their perspective.'”\n\nE! Brie Bella Baby Prediction Tyler made a prediction to Nikki Bella and her sister Brie Bella that came true way sooner than he thought. He accurately predicted that one of the twins would give birth soon. “But what’s interesting, this child will be born over the course of the next two years. I don’t know who it’s for, but it’s coming through,” Tyler assured them. Brie informed him that she was already trying to have a baby with husband Daniel Bryan. Just a few short months later, the couple announced they were expecting, and Brie gave birth in May 2017.\n\nArticle continues below\n\nE! Morgan Stewart Wedding change Tyler sat down with reality star Morgan Stewart to tell her to prepare for some minor changes when it came to her wedding. “It’s a minor technicality, but it is a change,” Tyler assured her. “It does involve like where exactly it happens. It’s not bad, it’s not a huge change like we have to move, but there’s like a little bit of a shift in where we do it. Like do the actual ceremony…I’m picking up a bit of a shift, and I promise it’s not bad.” Well, flash forward to more than five months later and Tyler was totally right! “Ummmm @tyhenrymedium can we just discuss how right you were with your prediction of a slight location change at my wedding?!” Morgan tweeted. Turns out a slight chance of rain forced a small adjustment to be made.\n\nE! Roselyn Sanchez More Babies When Roselyn Sanchez was on the show, Tyler gave her some good news from her late grandmother. He revealed that her grandmother beleives she’ll have at least two more babies. “I hope because I’m old!” she told Tyler. “We really want it, and it’s been so hard. It’s a very sensitive topic for me because I think women my age, you have this incredible desire and to be able to not get what you really want…it’s devastating.” In Nov. 2017, Roselyn and husband Eric Winter welcomed their second child together. Grandmas always know best!\n\nTheo Wargo/Getty Images Tom Arnold Having More Kids Tom Arnold had a reading with Tyler and was eager to know if he would have more children in the future. Tyler confirmed that he and wife Ashley Groussman would in fact have another child, despite the actor’s fertility issues. Tom later tweeted at Tyler when he found out his wife was expecting baby number two! “@tyhenrymedium buddy you were right about EVERYTHING. We are having a girl this fall,” he wrote.", "images": ["https://dailynews.news/wp-content/uploads/2018/02/rs_1024x759-180201124808-Amber-Rose_HM.jpg", "https://dailynews.news/wp-content/uploads/2019/06/a57l4qljuentertainmentny-lena-headey-disappointed-with-game-of-thrones-death-20190616-acn3oepqfnhz5imqja57l4qlju-story.html_-150x150.jpg", "https://dailynews.news/wp-content/uploads/2018/02/rs_1024x759-170331130722-1024-alan-thick-tyler-henry-medium.jpg", "https://dailynews.news/wp-content/uploads/2019/06/4pttjszyyentertainmentny-tiffany-haddish-cancels-show-abortion-20190616-afcngick6jglto7ni4pttjszyy-story.html_-150x150.jpg", "https://dailynews.news/wp-content/uploads/2018/02/rs_1024x683-160727133152-TH3.jpg", "https://dailynews.news/wp-content/uploads/2018/02/rs_500x281-160913134138-500-HM-205-ROSELYN-SANCHEZ.jpg", "https://dailynews.news/wp-content/uploads/2019/06/2kuxe5mamentertainmentmusicny-ginger-spice-apologizes-for-quitting-spice-girls-in-1998-20190617-7rg3ympurjfsrccvw2kuxe5mam-story.html_-150x150.jpg", "https://dailynews.news/wp-content/uploads/2019/06/duu764vpyentertainmentny-courteney-cox-birthday-friends-reunion-20190616-wuqrmiqzs5betp6mfduu764vpy-story.html_-150x150.jpg", "https://dailynews.news/wp-content/uploads/2018/02/rs_1024x759-170511113845-Bobby-Brown-whitney-tyler-henry.jpg", "https://dailynews.news/wp-content/uploads/2018/02/rs_1024x759-180201130802-Brie-Bella.jpg", "https://dailynews.news/wp-content/uploads/2018/10/LogoDailyNewsnew-1.jpg", "https://dailynews.news/wp-content/uploads/2018/02/rs_1024x759-180201125631-Tyler-Henry-Morgan-Stewart.jpg", "https://dailynews.news/wp-content/uploads/2019/06/2to6n23iuentertainmentny-box-office-weekend-men-in-black-shaft-secret-life-of-pets-20190617-vko7eni4xjc65hj3o2to6n23iu-story.html_-150x150.jpg", "https://dailynews.news/wp-content/uploads/2018/02/rs_1024x601-170714133212-tod.jpg", "https://dailynews.news/wp-content/plugins/a3-lazy-load/assets/images/lazy_placeholder.gif", "https://dailynews.news/wp-content/uploads/2018/02/rs_560x415-150608133732-1024.tom-arnold.cm_.6815.jpg", "https://dailynews.news/wp-content/uploads/2019/06/ljsg6ntbeentertainmentmoviesny-aubrey-plaza-childs-play-chucky-20190617-qj2oo2lxtrfw3odinljsg6ntbe-story.html_-150x150.jpg"], "top_img": "https://dailynews.news/wp-content/uploads/2018/02/rs_1024x759-170331130722-1024-alan-thick-tyler-henry-medium.jpg", "keywords": [], "authors": [], "canonical_link": "https://dailynews.news/tyler-henry039s-most-omg-moments-on-hollywood-medium/", "title": "Tyler Henry’s Most OMG Moments on Hollywood Medium", "meta_data": {"viewport": "width=device-width, initial-scale=1", "google-site-verification": "ykN9TQGoBjNYHLAd5e2J8quHVQi_qlBQZBXpQIJ04no", "description": "✅ You never know what you're going to get!  Tyler Henry always finds a way to surprise the people he reads. Whether they come in as true believers or ma", "og": {"locale": "en_US", "type": "article", "title": "Tyler Henry's Most OMG Moments on Hollywood Medium - NY DailyNews", "description": "✅ You never know what you're going to get!  Tyler Henry always finds a way to surprise the people he reads. Whether they come in as true believers or ma", "url": "https://dailynews.news/tyler-henry039s-most-omg-moments-on-hollywood-medium/", "site_name": "dailynews", "updated_time": "2018-02-15T13:32:17+00:00", "image": {"identifier": "https://dailynews.news/wp-content/uploads/2018/02/rs_1024x759-170331130722-1024-alan-thick-tyler-henry-medium.jpg", "secure_url": "https://dailynews.news/wp-content/uploads/2018/02/rs_1024x759-170331130722-1024-alan-thick-tyler-henry-medium.jpg", "width": 876, "height": 650}}, "article": {"publisher": "https://www.facebook.com/New-York-DailyNews-768306206703123/", "section": "Entertainment", "published_time": "2018-02-15T12:31:09+00:00", "modified_time": "2018-02-15T13:32:17+00:00"}, "fb": {"app_id": 169837910311043}, "twitter": {"card": "summary_large_image", "description": "✅ You never know what you're going to get!  Tyler Henry always finds a way to surprise the people he reads. Whether they come in as true believers or ma", "title": "Tyler Henry's Most OMG Moments on Hollywood Medium - NY DailyNews", "image": "https://dailynews.news/wp-content/uploads/2018/02/rs_1024x759-170331130722-1024-alan-thick-tyler-henry-medium.jpg"}, "generator": "Feed to Post 3.7.4", "onesignal": "wordpress-plugin", "msapplication-TileImage": "https://dailynews.news/wp-content/uploads/cache/2018/01/cropped-dailynewsfabi/2528668416.png"}, "movies": [], "publish_date": 1518697869.0, "source": "https://dailynews.news", "summary": ""}