{"url": "https://www.fnp.com/gifts/valentines-day", "text": "Facts About the Origin of Valentine's Day\n\nThe story of Valentine’s Day like any good movie is quite dramatic. Well, once upon a time, around 3rd Century there was a tyrannical ruler of Rome named Claudius II and a Christian martyr named Saint Valentine. The theory of Valentine’s Day being the day dedicated to love has got a lot to do with history. Many folklore's emerge out of the history pages to support this day. One such story says that Claudius was against Christianity while Valentine was for it and Claudius imprisoned him and in this imprisonment, he fell in love with the blind girl of the jailer. Before his death he wrote a letter to this girl and signed it as “from your Valentine” and that’s how till today lovers address each other as Valentine. The day next to his death on 14th February Julia, the girl of the jailer planted an almond tree near his grave and till today almond tree is a sign of love and friendship. And people across the world celebrate love and affection.\n\nAnother myth says that Claudius was against marriage of young men as he believed unmarried men prove to be better soldiers. The hero named Valentine helped these young men to flee and marry and that’s how he became the undying symbol of love.\n\nUntil 14th Century Valentine was not associated with love and romance and it was Chaucer who started this association through his poetry in Parliament of Foules. One famous line is: “For this was on St. Valentine's Day when every bird cometh there to choose his mate”. Valentine’s feast day has been illustriously celebrated as a lovers’ holiday and a day of romance since the 14th century. The feast of Saint Valentine was established by Pope Gelasius I in the year 496. Some holds the view that Valentine’s feast day is celebrated in February because the church wanted to Christianize an ancient Roman pagan festival called Lupercalia that focused around fecundity and sanitization, and also took place in February.\n\nBest Gift Ideas for Your Honey – Search for One on Ferns N Petals\n\nValentine’s Day means a get together of lovers. They come together to celebrate the essence of love and romance with some beautiful gifts for each other which surely keeps their spirits at an all-time high.Being the number one choice of all customers worldwide, we are also not lagging behind in presenting some of the great gifting ideas to woo the heart of your lovers. For your sweet and cute girlfriend, you can get the latest sky lantern that is our specialty this year. You would get that in many beautiful colors and designs in this lantern. Apart from that the usual flower bouquets, chocolate boxes, and teddy bears are also there ready for you.\n\nWoo your boyfriend with valentine week gifts for boyfriend this year by getting him a basket filled with goodies like tea bags and energy drinks. You may also have a look at the Personalised key chain for him or the tie and cuff set that would make him handsome.\n\nValentine’s Day hold more meaning to married couples because they have moved a notch higher in their love graph by tying the knot of eternity with each other. You may surprise your hubby with a Personalised lampshade. You wife may get thrilled with the bouquet of chocolates along with the Personalised cushion.\n\nWhen you have to wish your lover seated miles away from you, just log in to our website and make your long distance relationship a beautiful journey of love and emotions. Get a notebook consisting 1000 reasons to love him/her as the Valentine gift this year and strengthen the bond.\n\nValentines Day Gifts Ideas – Ferns N Petals\n\nRecipient Gift Types Other Gifts Valentine's Gifts for Husband Personalised Gifts Cushion, Mugs, Photo Frame Valentine's Gifts for Wife Valentine's Flowers Flower Bouquet, Forever Roses, Roses, Lillies Valentine's Gifts for Boyfriend Accessories Belts, Wallets, Perfumes, Bracelet Valentine's Gifts for Girlfriend Jewellery Earrings, Handbags, Soft Toys\n\nKeep the Romance Alive in the Air with Romantic Gifts for Boyfriend and Girlfriend\n\nRomance is like the lubricant to the engine of life. Without romance, every other thing may seem boring. So, never let this romance ooze out of your life. You would know the definition of romance once you log in to our website. As a romantic valentine day gifts for girlfriend, you can pick up the heart-shaped succulent plants or Jewellery exclusively under valentine day online shopping offers. This one is a new addition to our long list of Valentine romantic gifts. These heart-shaped succulent plants would really be a thing to look out for.\n\nSurprise your boyfriend with a romantic gift like a Personalised coffee mug, photo frame, and a diary. He would be more than happy. This year you may treat the way he treats you by showering a heart shape arrangement of red roses which would be really cute and path-breaking.\n\nOnline Valentine Gifts 2019 for him and her that will Melt your Special Someone’s Heart\n\nIt is time to swirl in the mood of love and spice up with valentine week gifts for girlfriend. With Valentine’s Day just around the corner it becomes challenging for love birds to manifest feelings for their significant other in a way which is both unique and innovative. To bail them out from the situation, Ferns N Petals brings to you and extensive collection of valentine day gifts for girlfriend in 2019\n\nValentine Gift Ideas in 2019 which will be a Big Hit Amongst your Significant Other\n\nGive a romantic start to your day with valentine day gift ideas, gift her a simple bouquet of fresh red roses or jewellery which is any day the best love gift. As the day proceeds you can surprise her with a love note consisting of 100 reasons to love her. Later in the evening, a heart shaped red velvet cake would sound absolutely romantic to sizzle her up. You can also add a Personalised touch to the day by adding a love note for your sweetheart. Make your pick from an array of valentine romantic gifts which has been selectively laid down by experts. Each gift will have a perfect love story to tell, be it a bouquet of roses or chocolate hampers or Personalised products and other innovative gift items, we have them all. All our gifts are beautifully arranged in an attractive packaging which makes them a perfect pick for the occasion. If you want to express your monumental love for your wife, trust the experts who have come up with elegant blooms, Personalised coffee mugs and love notes which are perfect valentine week gifts for wife.\n\nRomantic Valentine Gifts for Girlfriend and Boyfriend for this Love Season in 2019\n\nAlthough men don’t complain out aloud but they too are looking for some love. For all these men who are quite tricky to shop for, we have come up with gifts for them too. Chocolate hampers, perfumes, grooming sets and Personalised gift items will be an ideal valentine gift for him. Our Personalised gifts have always been a big hit which allows you to print your favourite photograph as a memoir of the love that exists between the two of you.You can send valentine gifts for her which are symbolic of forever togetherness again. Some expensive perfumes, Personalised coffee mugs, spa set would also be a useful gift on Valentine’s Day. For the dessert table, order authentic chocolate cake which would leave him spellbound undoubtedly. So for a girlfriend, a box of chocolate on this love day would work like an icing on the cake as valentine gifts for her. So, do not forget these delicious chocolates to mark your day with more love.\n\nShop and Send the Best Valentine Gifts at Competitive Prices from Ferns N Petals\n\nLend a soft touch to your sweetheart with our perfect bunch of blooms. Create a perfect ‘wow’ moment with a bunch of fresh flowers for your girlfriend. Raise a toast to romance with our flirty flower arrangements. You can choose from our widest collection of Valentine day flowers that features red and pink bunch of Valentine Roses, or you can also go for sophisticated lilies and colourful Gerberas. Our flirty floral arrangement are hand gathered by our renowned florists makes special valentine gifts for husband too.A gourmet of chocolates will leave your love salivating. We have come up with some international branded chocolates such as Toblerone, Lindt, Ferrero Rocher and Snickers amongst others. To make the occasion even more special, we have even come up with heart shaped chocolates which can make great gift for Valentine Chocolate Day.On Valentine’s Day, Ferns N Petals boasts of widest range of valentine’s gifts for boyfriend and girlfriend online with several valentine offers too. It is a reputed brand name in the industry and has been serving its customers for more than 20 years. We have covered almost 350+ destinations in India and all major countries till date and are counting for more, now you can send valentine gifts to USA, UK, Australia, UAE, Singapore, Germany, Canada and many more countries. without any hassle. A strong differentiating factor which sets us apart from the other players in the market is the flexible delivery options including midnight delivery, fixed time delivery and same day delivery of your valentine gifts. Timely delivery of all our gifts and that too in the most pristine conditions is appreciated beyond limits by all our 4 million satisfied customers.\n\nAn Assortment of Valentine’s Day Offerings for All the Loved Birds Flocking Out There\n\nThe occasion of Valentine's Day is nothing short of being a festival that celebrates the notion of love. Like every momentous occasion, that graces our life, Valentine's Day ceases to attain fulfillment without the exchange of offerings. Hence, whether you are already drowned in love, or are half way in it, gifts for Valentine's Day bear the reputation of always coming in handy.\n\nWhen it comes to relationships, the company of Ferns N Petals has always adhered by the motif of either strengthening them or sparking them anew. With the aid of offerings, that are nothing beyond being tokens of love, care, and admiration, our company has always been your faithful accomplice, when it comes to transcending the word of love, into the world of your dear ones. Hence, providing its patrons and followers with the privilege to access an assortment of Valentine's Day gifts online in India, our company wishes to do utmost justice to the sentiment of true love, that envelopes the aura in its entirety, during such an occasion. Whether a singleton is concerned or whether a couple graces our perspective, when it comes to shopping for the most unique and best Valentine gifts online 2019, our online platform harbors a congregation of Romantic of the likes of Valentine Flowers and Valentine's Day Cakes, that shall satisfy the crave of all the love-struck hearts.\n\nAlready Submerged in The Essence of Love?\n\nIf you are a couple and life is blossoming alive for you at the moment, then surely your Valentine's Day celebration shall be scrawled upon with the occurrence of the event of Dating. For when it comes to a form of romance that is already on the course of blooming, as if a flower, spreading its fragrance in your life, there exists a constant need to keep the flame burning by rejuvenating your love life every now and then. The Valentine Day gift Ideas for such a couple should be embarking on celebrations that pay an ode to the good old memories of theirs, thereby looking forth to a future that summons them into infinitesimal moments of togetherness.\n\nIf you form the better half of the couple in question and are rummaging your mind for the apt Valentine's Day gift idea for him, then don't bother to stress yourself over it. For owing to the lifestyle of the present time, we are flooded with innumerable gift ideas that shall entice your Darling to the very core. Hence, during the procession of the date, you have the privilege to take him by surprise, by delighting him with offerings of the likes of Personalised Gifts that comprise of amiable presents such as Personalised Photo Cushion, Personalised Couple mug et al, that boast of being a cherishable memento, as they bear the essence of your memories. Entice your beloved with our collection of 'Valentine's Day Serenades', that shall mark each day of the adorable Valentine Week that begins with Rose Day, with Serenades of the likes of 'Love At First Sight', 'Sentimental Love', 'Valentine's Saga' et al, that shall spread a heavenly smile of love and gratitude upon his face.\n\nLove Relationship Gifts for Girlfriends\n\nCakes have forever come in handy during the celebrations of special occasions, and the girl you love shall greatly be touched by the involvement of a delicacy into your celebrations, for the like of a Red Velvet Heart Cake, that bears the shape of a 'love heart', shall tend to win her heart all over again, and perhaps make her fall in love with you, over and over again. Mementos and memorabilia of the likes of 'Kissing Booth', 'Soft Toys' et al as valentine’s gifts for girlfriend shall account for a treasure of memories that shall be treasured throughout. If you want to grace your special girl with something special, then gifts of the likes of 'Straight From The Heart' that comprise of an assortment of chocolates arranged to don the form of a bouquet, are an apt choice as a to delight her with the warmth of an innovative offering.\n\nSingle And Just About Ready To Mingle?\n\nIf you are single, then don't you worry! Our company never forgets you, for we understand your insatiable crave to mingle and we shall forever be the best of your friends when it comes to impressing your girl, for we will, forever provide you with thoughtful 'Homemade Valentine's gifts for him, her' of the likes of handmade congregations of Roses and other floral beauties, handmade deluxe chocolates et al, thereby privileging you to pour your emotions out in front of the girl/boy, during the procession of Valentine Week, winning them over, to be by your side, till the course of time that is measured in the terms of being infinite.\n\nEntrust Us with Your Happiness\n\nHence, whether you are in a dire need of Valentine week gifts for husband or her to impress your crush, or whether you are a couple in love searching for ideas that shall fuel your love induced celebrations, the epitome of gifting culture in India, shall serve it all, for an expertise of over twenty years, not only speaks for itself, but also holds a thorough understanding when it comes to love and relationships.\n\nCelebrate Valentine Week (7th-14th Feb)\n\nThe day that celebrates the notion of love, that is, Valentine's Day, is not just a singular day. Very much like love, it too takes time to build itself up, time to occur in its entirety. Hence, leading to the love infused occasion of Valentine's Day, there are seven days that hold a prominent significance for the main occasion.\n\nRose Day (Thursday, 7th Feb, 2019)\n\nOn Rose Day, lovers present their partners with an offering of red roses, since a rose is considered to be the floral entity of love. Roses, in beautiful congregations, are available online platforms, in fresh forms, that may come handy during this very day.\n\nPropose Day (Friday, 8th Feb, 2019)\n\nThe second day in the procession, it is the day when a lover proposes his/her partner, in the most romantic manners possible. One can always go for a few memorable Propose Day Gifts that might be of assistance to such an endeavor such as flowers, mementos et al.\n\nChocolate Day (Saturday, 9th Feb, 2019)\n\nOn the third day, an offering of chocolate is considered to be apt, for the symbolic representation of sweetness that comes along with it, thereby referring to the sweetness that shall be the crux of one's love life. An assortment of delectable chocolates for Chocolate Day is available at your disposal via online platforms.\n\nTeddy Day (Sunday, 10th Feb, 2019)\n\nSince girls find Teddy bears absolutely adorable, hence the fourth day, finds it significance in making your girl happy with the gift of a 'Valentine Teddy Bears'. With cute and cuddly sort of such toys available online, we believe it's not going to be a long search for you.\n\nPromise Day (Monday, 11th Feb, 2019)\n\nOn the fifth day, promises that involve a life of love, faithfulness, and togetherness are conjured between lovers, with the showering of Promise Day Gifts upon one another.\n\nHug Day (Tuesday, 12th Feb, 2019)\n\nOn the sixth day, lovers embrace each other, a union that is the nod towards unison of two souls who are embarking on a beautiful journey together. Online portals are blooming with innumerable mementos that shall enable you to keep this memory afresh.\n\nKiss Day (Wednesday, 13th Feb, 2019)\n\nOn the seventh day, a kiss, that is considered to be the purest representation of love, is exchanged between lovers. One can always make gifts out of chocolates, flowers et al on such a memorable occasion.\n\nValentine's Day (Thursday, 14th Feb, 2019)\n\nFinally, on the Fourteenth of February, Valentine's Day is celebrated, during the transpiration of which lovers celebrate their love and the aspects that the future holds for them. Beautiful Valentine's Day gifts of the likes of delectable cakes, soft toys, chocolates, mementos et al can be purchased online.\n\nShop During Valentine’s Day at Ferns N Petals with Lucrative Discount\n\nValentine’s Day in the month of February is the most romantic time of the year. Gifts form a large part of Valentine’s Day celebration and Ferns N Petals has the just the perfect gifts to make your special day a beautiful memory. Flowers, cakes, chocolates, dry fruits, sweets, Personalised items, cosmetics, sunglasses, watches, soft toys, plants, statues, etc. are some of our best-selling products. The great news is that Valentine gift offers are available in most of these romantic gifts that you can send anywhere in India or abroad using our trustworthy delivery services. Red rose’s bouquet, an arrangement of lilies and carnations, heart-shaped chocolate truffle or red velvet cake, Personalised lamp, hamper of chocolates and teddy bears are those things that would seal the valentine moment with extreme happiness. There is flat 10% off on gifts and thus you must hurry up and start placing orders to impress your sweetheart.\n\nFrequently Asked Questions about Valentine's Day Gifts\n\nQ.1 What Are The Best Valentine's Day Gifts?\n\nAns.- Red roses in lovely bouquets, chocolates in thrilling arrangements, personalized cushions or mugs, cakes with a delicious taste – are some of the best Valentine's Day gifts.\n\nQ.2 How many day (s) it takes to deliver a personalized Valentine's Day gifts?\n\nAns.- It would take 2-3 days from the day of your order placement to deliver the personalized Valentine's Day gifts.\n\nQ.3 Does Ferns N Petals Provide same-day, midnight delivery of Valentine's Day gifts?\n\nAns.- Yes, Ferns N Petals provides same-day and midnight delivery of Valentine's Day gifts.\n\nQ.4 Can I send Valentine's Day gifts to other countries?\n\nAns.- Yes, you can send Valentine's Day gifts to other countries via Ferns N Petals. Our international delivery services are available in more than 150 countries worldwide and that includes places like the USA, UK, UAE, Singapore, Malaysia, Australia, etc.\n\nQ.5 Does Ferns N Petals Provide Valentine's Day gifts delivery to my city?\n\nAns.- Ferns N Petals has a PAN India presence and currently delivers Valentine’s Day gifts to more than 400 Indian cities. So, you may be seated in North, West, East, or South, our strong & swift delivery services would reach your city right on time. We cover all the big metro cities, small towns and cities, and remote villages too.\n\nInteresting Facts about Valentine's Day 2019:\n\nThanks to St. Valentines, the whole world gets to celebrate the month of Love! We bring to you some interesting facts about this day that can amaze you.\n\n• Passing out Valentines is a 600-year-old tradition\n\n• Esther Howland is the first manufacturer of Valentines\n\n• There are enough candy hearts made each year to stretch from Valentine, Arizona to Rome, Italy, and back again. The number of these candy hearts produced is approximately 8 billion.\n\n• The first Valentine`s Day candy box was invented by Richard Cadbury in the late 19th century.\n\n• On Valentine`s Day, 1876, Alexander Graham Bell applied for his telephone patent.\n\n• Cupid is the son of Venus. Venus was the god of beauty and love.\n\n• In 1537, King Henry the Eighth declared that February 14th was a holiday. King Henry the Eighth had most of his wives executed because they did not give birth to a son.\n\n• In the middle ages, superstition said that if you were single, you would end up marrying the first single person of the opposite sex that you met on Valentine`s Day.\n\n• Penicillin was introduced on February 14th in 1929.\n\nGreet Your Lover With Lovely Valentine’s Day Messages\n\n14th February- Valentine’s Day is the day of love & romance is here. You must have lovely plans to spend the whole day with your sweetheart. Or you may be away from your darling and all you can do is schedule a wonderful online valentine gift delivery to her doorstep. But you simply cannot miss greeting your lover with a sweet, simple, nice, and romantic Valentine’s Day wish. So, go through these lovely Valentine’s Day wishes and pick up the best lines for your sweetheart and make him/her feel special. Love is a special and the most wonderful feeling in this world and thus many eminent personalities also have expressed their feelings on love. We have collected some heart-warming Valentine’s Day quotes on love too which you can send across your friends and loved ones!\n\nInteresting Reads on Valentine (from FNP Blog)", "images": ["https://i7.fnp.com/images/pr/l/lovely-red-roses-basket_1.jpg", "https://i9.fnp.com/images/ban/l/28-06-Anniversary.jpg", "https://i8.fnp.com/images/pr/l/vivid-10-red-roses-bouquet_1.jpg", "https://i7.fnp.com/images/ban/l/28-06-Gifts-Hampers.jpg", "https://i9.fnp.com/images/ban/l/28-06-More-Gifts.jpg", "https://i7.fnp.com/images/pr/l/red-sensation_1.jpg", "https://i7.fnp.com/images/pr/l/personalized-rotating-lamp-mini_1.jpg", "https://i8.fnp.com/images/pr/l/you-are-perfect-engraved-wooden-photo-frame_1.jpg", "https://i9.fnp.com/images/pr/l/enigmatic-8-red-roses-bouquet_1.jpg", "https://i8.fnp.com/assets/images/custom/nav-banners/rakhi-nav-occasion-banner-9-july-2019.jpg", "https://i7.fnp.com/images/pr/l/endearing-8-pink-roses-bouquet_1.jpg", "https://i7.fnp.com/assets/images/custom/nav-banners/rakhis-plants-12-july-2019.jpg", "https://i7.fnp.com/images/pr/l/choco-cheers_1.jpg", "https://i8.fnp.com/images/ban/l/28-06-Personalised.jpg", "https://i9.fnp.com/images/pr/l/valentine-special-syngonium-plant_1.jpg", "https://i7.fnp.com/images/pr/l/romantic-20-red-roses-bouquet_1.jpg", "https://i9.fnp.com/images/cat/l/gifts-valentinesday.jpg", "https://i8.fnp.com/images/pr/l/cuddly-affair_1.jpg", "https://i8.fnp.com/images/pr/l/butterscotch-cake-half-kg_1.jpg", "https://i9.fnp.com/images/pr/l/personalized-valentine-keyring_1.jpg", "https://i7.fnp.com/images/pr/l/fantastic-jade-terrarium_1.jpg", "https://i8.fnp.com/images/pr/l/love-plant_1.jpg", "https://i9.fnp.com/images/pr/l/red-velvet-heart-cake-1kg_1.jpg", "https://i9.fnp.com/images/pr/l/wrapped-in-romance_1.jpg", "https://i7.fnp.com/images/pr/l/chocolate-truffle-cream-cake-half-kg_1.jpg", "https://i7.fnp.com/images/pr/l/50-red-roses-teddy-combo_1.jpg", "https://i7.fnp.com/images/pr/l/chocolate-cream-cake-half-kg-eggless_1.jpg", "https://i7.fnp.com/images/pr/l/love-ferrero-chocolates_1.jpg", "https://i9.fnp.com/images/pr/l/classic-heart-shaped-chocolate-cake-half-kg_1.jpg", "https://i8.fnp.com/images/pr/l/personalized-magic-mug_1.jpg", "https://i9.fnp.com/images/pr/l/sweet-chocolate-hamper_1.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://i9.fnp.com/images/pr/l/black-forest-and-flowers-standard_1.jpg", "https://i9.fnp.com/assets/images/new-fnplogo.png", "https://i9.fnp.com/images/pr/l/blingy-heart-personalised-led-cushion_1.jpg", "https://i9.fnp.com/assets/images/image_placeholder-bb.png", "https://i8.fnp.com/images/pr/l/expressive-red-flowers_1.jpg", "https://i8.fnp.com/images/ban/l/28-06-Birthday.jpg", "https://i9.fnp.com/images/ban/l/28-06-Flowerbanner_updated.jpg", "https://i8.fnp.com/images/pr/l/rocher-choco-bouquet_1.jpg", "https://i9.fnp.com/images/pr/l/special-surprise-arrangement_1.jpg", "https://i8.fnp.com/images/pr/l/red-roses-with-cake-standard_1.jpg", "https://i7.fnp.com/images/pr/l/bouquet-n-greeting-card_1.jpg", "https://i9.fnp.com/images/pr/l/two-layer-lucky-bamboo-with-heart-shaped-tag_1.jpg", "https://i7.fnp.com/images/pr/l/potted-rose-plant_1.jpg", "https://i9.fnp.com/images/pr/l/love-and-love_1.jpg", "https://i8.fnp.com/images/pr/l/authentic-love-100-roses_1.jpg", "https://i9.fnp.com/images/pr/l/twin-heart-arrangement_1.jpg", "https://i7.fnp.com/assets/images/custom/nav-banners/11July.jpg", "https://i8.fnp.com/images/pr/l/mixed-roses-romantic-bunch_1.jpg", "https://i8.fnp.com/images/pr/l/dairy-milk-chocolate-collection_1.jpg"], "top_img": "https://i9.fnp.com/images/cat/l/gifts-valentinesday.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.fnp.com/gifts/valentines-day", "title": "Valentine's Day Gift Ideas - Ferns N Petals", "meta_data": {"googlebot": "noodp", "og": {"site_name": "Ferns N Petals", "image": "https://i9.fnp.com/images/cat/l/gifts-valentinesday.jpg", "title": "Valentine&#x27;s Day Gifts", "type": "article", "description": "<p>Love is in the air and it is time to celebrate it with gifts. You can shop for Valentine's Day gifts the showcase your heart filled emotions for Valentine's Day. Our gifts are wrapped with love and delivered at the destination of your choice. Cakes, flowers and gifts are just some of the options that we have at our online portal</p>", "url": "https://www.fnp.com/gifts/valentines-day"}, "fb": {"app_id": 1665069133747888}, "description": "Valentines Day Gifts Online 2020 - Send ❤ Valentine Gifts ❤ from Ferns N Petals through Midnight & Same Day Home Delivery with Free & Express Shipping.", "twitter": {"card": "summary", "image": "https://i9.fnp.com/images/cat/l/gifts-valentinesday.jpg", "title": "Valentine&#x27;s Day Gifts", "description": "<p>Love is in the air and it is time to celebrate it with gifts. You can shop for Valentine's Day gifts the showcase your heart filled emotions for Valentine's Day. Our gifts are wrapped with love and delivered at the destination of your choice. Cakes, flowers and gifts are just some of the options that we have at our online portal</p>", "url": "https://www.fnp.com/gifts/valentines-day"}, "viewport": "width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.fnp.com", "summary": ""}