{"url": "https://www.metacritic.com/feature/tv-premiere-dates?page=1", "text": "Past dates are listed below in reverse chronological order.\n\n< Current/Future Premieres | 2018 Premieres >\n\nTHU / January 31\n\n30 for 30: Deion's Double Play Documentary/Sports ESPN, 9p ET\n\nFamous Fortune Fights Reality Reelz, 9p ET\n\nSwamp People Reality History, 9p\n\nWill & Grace Comedy 9:30p\n\nReturns from a brief hiatus in a new timeslot.\n\nWED / January 30\n\nUndeniable with Dan Patrick Sports/Talk AT&T/DirecTV, 8p\n\nTUE / January 29\n\nGabriel \"Fluffy\" Iglesias: One Show Fits All Comedy special\n\nSuper Bowl Greatest Commercials 2019 Special 8p\n\nMON / January 28\n\nAgatha Raisin and the Curious Curate Drama/Comedy Acorn TV\n\nThe Best Thing I Ever Ate Reality Cooking, 9p\n\nFatal Attraction Reality TV One, 9p\n\nFor My Man Reality TV One, 10p\n\nDirector Patty Jenkins reunites with one of her Wonder Woman stars, Chris Pine, for a six-episode period crime drama that follows a white teenage girl (India Eisley) who was given away at birth to a black restroom attendant in a Nevada casino in 1949 and now finds herself drawn into an increasingly sinister mystery involving her birth mother, an infamous Hollywood gynecologist, and—possibly—the Black Dahlia murder. Pine plays a reporter investigating the case. It's not as fanciful as it sounds; the story is based on Fauna Hodel's autobiography.\n\nSUN / January 27\n\n25th Annual Screen Actors Guild Awards Live event TBS/TNT, 8p ET\n\nBusy Tonight Talk E!, 11p\n\nMystery 101 Drama HMM, 9p\n\n▣ Rent Musical/Live event 7p\n\nThree-hour live production of the mutliple-award-winning musical stars Kiersey Clemons, Tinashe, Brandon Victor Dixon, and Vanessa Hudgens.\n\nSAT / January 26\n\nAmanda Seales: I Be Knowin' Trailer Comedy special 10p\n\nDestination France: The Birthplace of Luxury Reality Ovation, 10p ET\n\nLove You to Death Trailer Drama Lifetime, 8p\n\nSlenderman Stabbing: The Untold Story Reality Reelz, 8p ET\n\nSnowcoming Drama Hallmark, 8p\n\nFRI / January 25\n\nÁnimas Foreign/Horror\n\nEight-episode British thriller about the prosecution of an African warlord in the International Criminal Court comes from The Honourable Woman creator Hugo Blick and stars John Goodman and Michaela Coel.\n\nClub de Cuervos (Club of Crows) Trailer Foreign/Comedy\n\nDoubt from Minnesota Opera Music 9p\n\nFour More Shots Please! Foreign/Drama Prime Video\n\nI Lived With a Killer Reality Reelz, 8p ET\n\nKingdom Trailer Trailer2 Foreign/Drama/Horror\n\nKorean zombie thriller (which has already been renewed for a second season) is set during medieval times.\n\nMedici: The Magnificent Foreign/Drama\n\nSeason 2 of the Italian historial drama series that began with \"Medici: Masters of Florence.\"\n\nThis Netflix feature adaptation of the Dark Horse graphic novel by Victor Santos stars Mads Mikkelsen and Vanessa Hudgens.\n\nRoy Wood Jr.: No One Loves You Comedy special 11p\n\nSoft Focus With Jena Friedman 2 Trailer Comedy Adult Swim, midnight\n\n▣ Strike Back Trailer Drama Cinemax, 10p\n\nSydney to the Max Comedy/Family Disney, 8:30p\n\nUnbreakable Kimmy Schmidt Trailer Comedy\n\nThe final six episodes of the Tina Fey-created comedy series stream today.\n\nTHU / January 24\n\n▣ Broad City Trailer Comedy 10p\n\nKindred Spirits Reality Travel, 10p\n\nLegacies Drama 9p\n\nFormer SNL writers Chris Kelly and Sarah Schneider are the creators of this new scripted series about an aspiring actor (Drew Tarver) who struggles to land anything other than a bit role—and his adult sister (Heléne York), who struggles to find any meaningful career path—as their 13-year-old brother (Case Walker) achieves instant, massive internet stardom. Molly Shannon and Ken Marino also star.\n\n▣ Siren Trailer Drama Freeform, tbd\n\nWED / January 23\n\nDrop the Mic Game show TNT, 10p\n\nMoves to TNT from TBS.\n\nKnight Fight Reality History, 10p\n\n▣ The Magicians Trailer Drama Syfy, 9p\n\n▣ Pure Drama WGN, 10p\n\nSnoop Dogg Presents The Joker's Wild Game show TNT, 10:30p\n\nMoves to TNT from TBS.\n\nSuits Drama USA, 10p\n\nTUE / January 22\n\nCelebrity Big Brother After Dark Reality Pop, midnight\n\n▣ Conan Talk/Comedy TBS, 11p\n\nConan O'Brien's nightly talk show returns after a multi-month hiatus in its new half-hour format, which (among other changes) jettisons the in-house band and places a greater emphasis on comedy.\n\nFood Truck Nation Reality Cooking, 9p ET\n\nMany Sides of Jane Trailer Reality A&E, 10p\n\nSiesta Key Reality MTV, 9p\n\nMON / January 21\n\nArrow Drama 8p\n\nBixler High Private Eye Family/Comedy Nickelodeon, 7p\n\nBlack Lightning Drama 9p\n\nMoves to a new timeslot.\n\nCelebrity Big Brother Reality 8p\n\nHousemates include Kato Kaelin, Ryan Lochte, Dina Lohan, Joey Lawrence, and Anthony Scaramucci.\n\nDating #NoFilter Reality E!, 10:30p\n\nJustice Foreign/Drama\n\nPawn Stars Reality History, 10p\n\nRobert Durst: An ID Murder Mystery Reality ID, 9p\n\nSUN / January 20\n\nDon Cheadle heads the cast of a comedy set in Wall Street during the 1987 stock market crash, which comes from writer/producers David Caspe (Happy Endings) and Jordan Cahan (My Best Friend's Girl). Regina Hall, Paul Scheer, and Andrew Rannells also star. Tonight's opener is directed by Seth Rogen and Evan Goldberg.\n\nCharmed Drama 9p\n\n▣ Crashing Trailer Comedy 10p\n\nDeadly Match Drama Lifetime, 8p\n\nMark of a Killer Reality Oxygen, 7p\n\nRuby Herring Mysteries: Silent Witness Drama HMM, 9p\n\nSeeking Sister Wife Reality TLC, 10p\n\nShameless Drama/Comedy 9p\n\nSister Wives Reality TLC, 8p\n\n▣ SMILF Trailer Comedy 10:30p\n\nSupergirl Drama 8p\n\nSAT / January 19\n\n▣ Brexit Trailer Drama 9p\n\nBenedict Cumberbatch stars in a HBO/BBC feature that centers on key members of the \"Leave\" and \"Remain\" campaigns in the lead-up to the Brexit vote in 2016.\n\n▣ Dynasties Documentary/Nature BBC America, 9p\n\nThe network's latest David Attenborough-narrated nature miniseries follows five different species of endangered animals around the globe.\n\nSaturday Night Fever: The Ultimate Disco Movie Documentary/Music Reelz, 9p ET\n\nSmiley Face Killers: The Hunt for Justice Reality Oxygen, 7p\n\nWinter Love Story Drama Hallmark, 8p\n\nFRI / January 18\n\n▣ Butterfly Drama Hulu\n\nSeparated parents must come to an agreement over how to approach their youngest child—who was born a boy but now identifies as a girl—in this British drama series that stars Anna Friel and Emmett J. Scanlon.\n\nGina Rodriguez voices the title character in this reboot of the animated series, which will focus on Carmen's origin story.\n\nChris Distefano: Size 38 Waist Comedy special 11p\n\nNoomi Rapace stars as a top counter-terrorism expert charged with protecting a young heiress.\n\nDynasty Drama 8p\n\nThis Vice-produced documentary from director Chris Smith (Jim & Andy: The Great Beyond) looks at the infamous failed music festival.\n\n▣ The Grand Tour Trailer Reality Prime Video\n\nHowie Mandel Presents Howie Mandel at the Howie Mandel Comedy Club Trailer Comedy special 10p\n\nA teenage girl (Margaret Qualley) must decide whether to evacuate a dying Earth on the last shuttle off the planet—or remain behind, alone, in an attempt to find a solution that will save Earth.\n\nOrphée et Euridyce from Lyric Opera of Chicago Music 9p\n\nReal Time With Bill Maher Talk 10p\n\nSoni Foreign/Drama\n\nTrigger Warning With Killer Mike Trailer Reality/Comedy\n\nTrolls: The Beat Goes On! Animation/Family\n\nA Winter Princess Drama Hallmark, 8p\n\nThe World's Most Extraordinary Homes Reality\n\nYummy Mummies Reality\n\nTHU / January 17\n\nBackyard Envy Reality Bravo, 10p\n\nBring It Reality Lifetime, 9p\n\n▣ A Discovery of Witches Drama/Fantasy Shudder/Sundance Now\n\nThis adaptation of the novel by Deborah Harkness stars Matthew Goode, Alex Kingston, and Teresa Palmer. The entire season is available to watch today on both streaming services.\n\nGrey's Anatomy Drama 8p\n\nHow to Get Away With Murder Drama 10p\n\nLip Sync Battle Game show Paramount, 9p\n\nA Million Little Things Drama 9p\n\nMoves to a new day and time.\n\n▣ Star Trek: Discovery Trailer Sci-fi/Drama CBS All Access, 8p ET\n\nThe second season of the streaming Star Trek prequel series features a young version of Spock, played by Ethan Peck, while Anson Mount will play USS Enterprise captain Christopher Pike. Rebecca Romijn also joins the cast. New episodes stream weekly on Thursdays.\n\nSupernatural Drama 8p\n\nWED / January 16\n\nAll American Drama 9p\n\nThis Russo brothers-produced adaptation of the Image Comics graphic novel (about a homeless teen boy who is recruited into an elite private academy for assassins, populated by the offspring of the world's top crime families) stars Benjamin Wadsworth, Benedict Wong, and Lana Condor.\n\nIn Pursuit With John Walsh Reality ID, 10p\n\nRiverdale Drama 8p\n\n▣ Schitt's Creek Comedy Pop, 10p\n\n▣ Wayne Trailer Drama YouTube\n\nMark McKenna, Ciara Bravo, Joshua J. Williams, and Dean Winters star in a YouTube original series from the writers of Zombieland and Deadpool, centering on a teenage dirt biker who sets off on a quest to find his late father's stolen Trans Am. All episodes stream today.\n\nTUE / January 15\n\nAmerican Experience Documentary 9p\n\nBird vs. Plane: Miracle on the Hudson Documentary Smithsonian, 9p\n\n▣ Corporate Trailer Comedy 10:30p\n\n▣ Drunk History Trailer Comedy 10p\n\nThe Flash Drama 8p\n\nRevenger Foreign/Action\n\n▣ Roswell, New Mexico Drama 9p\n\nIt's a semi-reboot of Roswell, the cult series which ran for three seasons on both The WB and UPN at the turn of the century. Like the prior show, it's an adaptation of the Roswell High novels by Melinda Metz. In the new series, which centers on slightly older characters this time, the daughter of undocumented immigrants (Jeanine Mason, Grey's Anatomy) relocates to her hometown, where she discovers that her one-time crush (Nathan Parsons, The Originals) is secretly an alien of another sort. (The space kind.) And he's not the only one. This new adaptation comes from Carina MacKenzie, a writer on The Originals.\n\nSebastian Maniscalco: Stay Hungry Trailer Comedy special\n\nTeachers Comedy TV Land, 10p\n\nReboot of the former Fox reality series returns the original host, Mark Walberg (no, not that one).\n\nThis Is Us Drama 9p\n\nMON / January 14\n\nDirty John, The Dirty Truth Documentary Oxygen, 8p\n\nDonna Summer: Disco Queen Documentary/Music Reelz, 9p ET\n\n▣ Fyre Fraud Trailer Documentary Hulu\n\nThe Good Doctor Drama 10p\n\nHome Town Reality HGTV, 9p\n\nLost Gold Reality Travel, 10p\n\nMade in Staten Island Reality MTV, 10p\n\n▣ The Passage Trailer Drama 9p\n\nProduced by Ridley Scott and Matt Reeves, The Passage is based on Justin Cronin's genre-blending vampire(-ish) book trilogy of the same name (though will seemingly focus on just the first part of the story). Mark-Paul Gosselaar stars as federal agent Brad Wolgast, who finds himself serving as a surrogate father to a 10-year-old girl who is a test subject for a secret government medical experiment that has the potential to eliminate all disease—or wipe out the human race. Emmanuelle Chriqui and Vincent Piazza also star. The adaptation comes from Liz Heldens (Deception, Mercy).\n\nSidelined Reality Lifetime, 10p\n\nStreet Outlaws: No Prep Kings Reality Discovery, 9p\n\nThose Who Can't Trailer Comedy truTV, 10p\n\nSUN / January 13\n\n24th Annual Critics' Choice Awards Live event 7p\n\nAmerican Style Documentary CNN, 9p\n\nBest Friend's Betrayal Drama Lifetime, 8p\n\nDisasters at Sea Reality Smithsonian, 9p\n\nThree's Complicated Rom-com TV One, 7p\n\nTigtone Trailer Comedy/Animation Adult Swim, midnight\n\nTotal Bellas Reality E!, 9p\n\n▣ True Detective Trailer Drama 9p\n\nHBO's up-and-down anthology series returns a bit late for its third season, which is written in its entirety by series creator Nic Pizzolatto (save for one David Milch-penned episode, which arrives in three weeks). Pizzolatto also makes his debut as a director, sharing those duties with Jeremy Saulnier (Green Room) and, in a last-minute substitution after Saulnier departed early due to creative differences, Daniel Sackheim. The new story is set in the Ozarks across three separate time periods and stars Mahershala Ali (Moonlight), Stephen Dorff, Carmen Ejogo, Scoot McNairy, Ray Fisher, and Mamie Gummer.\n\n▣ Valley of the Boom Drama/Documentary Nat Geo, 9p\n\nBlending documentary and scripted drama, this six-part series chronicles the 1990s tech bubble in Silicon Valley. Bradley Whitford, Steve Zahn, and Lamorne Morris star.\n\n▣ Victoria Trailer Drama 9p\n\nVictoria & Albert: The Wedding Drama/Documentary 10p\n\nSAT / January 12\n\nIyanla: Fix My Life Reality OWN, 9p\n\nLove & Marriage: Huntsville Reality OWN, 10p\n\nMy Mother's Split Personalities Drama Lifetime, 8p\n\nOne Winter Proposal Drama Hallmark, 8p\n\nFRI / January 11\n\nBack With the Ex Reality\n\nThe Cleveland Orchestra Centennial Celebration Music 9p\n\nCrazy Ex-Girlfriend Comedy/Musical 9p\n\nHanging With the Hendersons Reality Animal Planet, 9p\n\n▣ Informer Trailer Drama Prime Video\n\nSix-part British terrorism thriller stars Nabhaan Rizwan, Paddy Considine, and Bel Powley.\n\nJames Davis: Live From the Town Comedy special 11p\n\nChevy Chase, Richard Dreyfuss, Andie MacDowell, and Kate Micucci star in a Netflix original film about a retired, aging comedian who reluctantly agrees to go on one last stand-up tour.\n\nThis coming-of-age dramedy set in an English high school stars Asa Butterfield and Gillian Anderson. The latter plays a sex therapist, while Butterfield is her socially awkward son, who teams with a classmate (newcomer Emma Mackey) to start an \"underground sex therapy clinic\" at his school to assist their fellow students with their problems. All eight one-hour episodes stream today.\n\nSolo Foreign/Adventure/Drama\n\nTHU / January 10\n\nThe former Fox series moves to NBC for its sixth season. It will air in front of The Good Place, which shifts to 9:30p for its remaining episodes this month. Regular Chelsea Peretti will depart 9-9 this season, though she will appear in several episodes to wrap up her story.\n\n▣ Fam Comedy 9:30p\n\nBefore they get married, a woman (Nina Dobrev of The Vampire Diaries) hopes to get in the good graces of her fiancé’s (Tone Bell) seemingly perfect family. But her chance to make a good impression is ruined when her out-of-control, teenage half-sister comes to live with her. The multi-camera comedy comes from writer Corinne Kingsbury (The Newsroom).\n\nThe First 48 Reality A&E, 8p\n\nThe First 48 Presents: Homicide Squad Atlanta Trailer Reality A&E, 9p\n\nGrowing Up Hip Hop Reality WE, 9p\n\nMarriage Boot Camp: Hip Hop Edition Trailer Reality WE, 10p\n\nThe Rap Game Reality competition/Music Lifetime, 9p\n\nRoswell: Mysteries Decoded Reality 9p\n\nTruth and Lies: Monica News 9p\n\nWhen Heroes Fly Foreign/Drama\n\nWED / January 9\n\nThe Dictator's Playbook Trailer Documentary 10p\n\nGodzilla: The Planet Eater Sci-fi/Anime\n\nAndrea Savage's excellent Curb Your Enthusiasm-style comedy series finally returns for a 2nd season that features guest appearances from Adam Scott, Scott Aukerman, Lennon Parham, June Diane Raphael, Rob Hubel, and Kurt Braunohler.\n\nJon Glaser Loves Gear Trailer Reality truTV, 10:30p\n\nMatch Game Game show 10p\n\nNature: Attenborough and the Sea Dragon Trailer Documentary/Nature 8p\n\n▣ Schooled Trailer Comedy 8:30p\n\nA spinoff from The Goldbergs set in the '90s at a private school in Philadelphia, Schooled stars Tim Meadows, Bryan Callen, Brett Dier, and AJ Michalka.\n\nTUE / January 8\n\nEA Sports Madden NFL 19 Classic Special 9p\n\nEllen's Game of Games Game show 8p\n\nFinding Your Roots With Henry Louis Gates, Jr. Reality 8p\n\nGarage Rehab Reality Discovery, 8p\n\n▣ Good Trouble Trailer Drama Freeform, tbd\n\nMaia Mitchell and Cierra Ramirez star in a spinoff of The Fosters. Tonight's opener is directed by Jon M. Chu (Crazy Rich Asians).\n\nThe Haves and Have Nots Drama OWN, 9p\n\nHow the Universe Works Reality Science, 10p\n\nLegend Hunter Reality Travel, 10p\n\nHistory's new scripted series is based on what amounts to a real-life X-Files: a series of secret investigations into UFO sightings conducted by the Air Force in the 1950s and '60s. The drama comes from producer Robert Zemeckis and stars Aiden Gillen, Neal McDonough, and Michael Malarkey.\n\nUSS Indianapolis: The Final Chapter Documentary 10p\n\nWhat on Earth? Reality Science, 9p\n\nMON / January 7\n\n▣ America's Got Talent: The Champions Live event 8p\n\nTerry Crews hosts a special edition of the competition series that brings in top acts from past seasons of the various international versions of America's Got Talent.\n\nAntiques Roadshow Reality 8p\n\nThe Bachelor Reality competition 8p\n\nSpecial three-hour live premiere.\n\nCartel Crew Reality VH1, 9p\n\nKids Baking Championship Reality competition Food, 9p\n\nLast Call Comedy Bounce, 9p\n\nNo Offence Trailer Comedy Acorn TV\n\nSEMA: Battle of the Builders Reality MotorTrend, 10p\n\nWinner Cake All Reality competition Food, 10p\n\nSUN / January 6\n\n76th Annual Golden Globe Awards Live event tbd\n\nAndy Samberg and Sandra Oh co-host the broadcast.\n\nEvil Lives Here Reality ID, 9p\n\nHoudini's Last Secrets Reality Science, 10p\n\nUFO Cover-Ups: Secrets Revealed Reality History, 9p\n\nWorst Cooks in America Reality Food, 9p\n\nSAT / January 5\n\nCousins for Life Comedy/Family Nickelodeon, 8:30p\n\nSay Yes to the Dress Reality TLC, 8p\n\nVanished Reality History, 9p\n\nWinter Castle Drama Hallmark, 8p\n\nFRI / January 4\n\nAnd Breathe Normally Foreign/Drama\n\nCall My Agent! Foreign/Comedy\n\nEl Potro: Unstoppable Foreign/Drama\n\nGold Rush: White Water Reality Discovery, 10p\n\nGrown & Sexy Talk/Comedy VH1, 9:30p\n\nThe Hollywood Walk of Fame Honors Special 9p\n\nLionheart Foreign/Drama/Comedy\n\nMy Lottery Dream Home Reality HGTV, 9p\n\nRon Funches: Giggle Fit Comedy special 11p\n\nSaving My Baby Drama LMN, 8p\n\nThe nascent streaming service's second scripted original is actually a continuation of the Young Justice animated series that aired on Cartoon Network from 2010-2013. One new episode streams each Friday until January 25th, when four new episodes stream. (The series will then go on hiatus until June.)\n\n\n\nTHU / January 3\n\n60 Days In Trailer Reality A&E, 10p\n\n▣ The Blacklist Trailer Drama 10p\n\nFollowing tonight's premiere, the show will air at 9p weekly on its new night, Fridays (beginning tomorrow, Jan. 4).\n\nBringing Up Bates Reality UP, 9p\n\nDr. Pimple Popper Reality TLC, 9p\n\nFlip or Flop Nashville Reality HGTV, 9p\n\n▣ Gotham Drama 8p\n\nHitler's Secret Tunnels Documentary History, 9p\n\nImpossible Engineering Reality Science, 9p\n\nThe Last Days of JFK Jr. Documentary 9p\n\nMillion Dollar Listing Los Angeles Reality Bravo, 9p\n\nMusic City Trailer Reality CMT, 10p\n\nMy Daughter's Ransom Drama LMN, 8p\n\nRacing Wives Trailer Reality CMT, 9p\n\nSurvivng R. Kelly Trailer Documentary Lifetime, 9p\n\n▣ The Titan Games Trailer Reality competition 8p\n\nPhysical competition series is produced by Dwayne Johnson, who also hosts. Note that Superstore (formerly in this timeslot) will go on hiatus until March.\n\nTravel Man Reality Ovation, 10p ET\n\nActor/director Richard Ayoade (IT Crowd) hosts a travel series, which is making its U.S. broadcast debut. (Ovation will air four seasons in total.)\n\nWED / January 2\n\nAmerican Beauty Star Reality competition Lifetime, 10p\n\nBlack Ink Crew: Chicago Reality VH1, 9p\n\nDecoding Watson Trailer Documentary 10p\n\nFamily by the Ton Reality TLC, 10p\n\nGordon Ramsay's 24 Hours to Hell and Back Reality 8p\n\n▣ grown-ish Comedy Freeform, tbd\n\nHomestead Rescue Reality Discovery, 10p\n\nLove & Hip Hop: Miami Reality VH1, 8p\n\nMan's Greatest Food Reality Cooking, 9p\n\n▣ The Masked Singer Trailer Game show 9p\n\nThis U.S. adaptation of an international format asks contestants to guess the identity of a celebrity who performs a song in front of them—but disguised head to toe in an elaborate costume.\n\nMoonshiners Reality Discovery, 9p\n\nMy 600-lb Life Reality TLC, 8p\n\nMythBusters Jr. Reality Science, 9p\n\nMythBusters spinoff features six young regulars (aged 12-15) alongside returning host Adam Savage.\n\nNova Documentary/Nature 9p\n\nProject Runway All Stars Trailer Reality competition Lifetime, 9p\n\nPsycho Mother-in-Law Drama LMN, 8p\n\nTrue Life/Now Reality MTV, 10p", "images": ["https://static.metacritic.com/images/features/main/gq2015_wiiu-28.jpg", "https://static.metacritic.com/images/features/networks/showtime20.png", "https://static.metacritic.com/images/features/media/graphics/new.gif", "https://static.metacritic.com/images/features/main/netflix201907-50.jpg", "https://static.metacritic.com/images/features/main/tvpremieredates-180.jpg", "https://static.metacritic.com/images/features/main/hbo201907-50.jpg", "https://static.metacritic.com/images/features/main/starz201907-50.jpg", "https://static.metacritic.com/images/features/networks/cbs20.png", "https://static.metacritic.com/images/features/main/hulu201907-50.jpg", "https://static.metacritic.com/images/features/networks/netflixnew50.jpg", "https://static.metacritic.com/images/features/_graphics/movie.gif", "http://static.metacritic.com/images/features/networks/fx20.png", "https://static.metacritic.com/images/features/networks/nbc20.png", "https://static.metacritic.com/images/features/main/midyear2019tv-180.jpg", "https://static.metacritic.com/images/features/main/amazon201907-28.jpg", "https://static.metacritic.com/images/features/main/201920tvseasonscorecard-28.jpg", "https://static.metacritic.com/images/features/_graphics/special.gif", "https://static.metacritic.com/images/features/main/_THUMBNAILscorsesegallery-180.jpg", "https://static.metacritic.com/images/features/networks/fox20.png", "https://static.metacritic.com/images/features/networks/fxx25.png", "https://static.metacritic.com/images/features/main/dvd_2019_07-28.jpg", "https://static.metacritic.com/images/features/networks/hbo20.png", "https://static.metacritic.com/images/features/_graphics/miniseries.gif", "https://static.metacritic.com/images/features/main/midyear2019music-180.jpg", "https://static.metacritic.com/images/features/main/2017best_games_zeldabreathofthewild-28.png", "https://static.metacritic.com/images/features/main/midyear2019tv-50.jpg", "https://static.metacritic.com/images/features/networks/abc20.png", "https://static.metacritic.com/images/features/networks/amc20.png", "https://static.metacritic.com/images/features/main/gamescorecard_2019_summer-180.jpg", "https://static.metacritic.com/images/features/main/tvpremieredates-28.jpg", "https://www.metacritic.com/images/icons/dark_logo.png", "https://static.metacritic.com/images/features/main/dvd_2019_07-50.jpg", "https://www.metacritic.com/media/networks/pbs25.png", "https://static.metacritic.com/images/features/main/tvpreview201907-50.jpg", "https://www.metacritic.com/media/networks/cw20.png", "https://static.metacritic.com/images/features/main/amazon201907-50.jpg", "https://static.metacritic.com/images/features/main/bestof_2019_05-28.jpg", "https://www.metacritic.com/images/icons/search_inactive.png", "https://static.metacritic.com/images/features/main/music2019summerpreview-28.jpg", "https://www.metacritic.com/images/icons/search_active.png", "https://static.metacritic.com/images/features/main/moviepreview2019_07-28.jpg", "https://static.metacritic.com/images/features/networks/comedycentralnew20.png"], "top_img": "https://static.metacritic.com/images/features/main/tvpremieredates-180.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.metacritic.com/feature/tv-premiere-dates", "title": "2019 Summer/Fall TV Premiere Calendar", "meta_data": {"description": "Find a calendar of premiere dates for all upcoming new and returning television shows, plus TV movies and specials. - Page 2", "viewport": "width=1024", "application-name": "Metacritic", "msapplication-TileColor": "#000000", "msapplication-TileImage": "/images/win8tile/76bf1426-2886-4b87-ae1c-06424b6bb8a2.png", "og": {"title": "2019 Summer/Fall TV Premiere Calendar", "type": "article", "url": "https://www.metacritic.com/feature/tv-premiere-dates", "image": "https://static.metacritic.com/images/features/main/tvpremieredates-180.jpg", "site_name": "Metacritic", "description": "Find a calendar of premiere dates for all upcoming new and returning television shows, plus TV movies and specials."}, "fb": {"app_id": 123113677890173}, "twitter": {"site": "@metacritic", "creator": "@metacritic", "card": "https://static.metacritic.com/images/features/main/tvpremieredates-180.jpg"}}, "movies": [], "publish_date": null, "source": "https://www.metacritic.com", "summary": ""}