{"url": "https://swoon.theodysseyonline.com/honeymoon-phase-end", "text": "Dear you,\n\nI hope you're doing well. I once thought I was too. I once thought that if he would just change, for me, everything would work. However, my sweet girl, you should not have to change people, you should not have to push people to be better, for you. You cannot help anyone, that does not want to help themselves.\n\nIn the movies, we learn to love a bad boy that needs changing. However, it isn't always your job to be boys saving grace. However, his shaming and emotional abuse is not just something you should put up with so that you can love him. That is not loving.\n\nLove is not a constant competition of who could belittle the other one first. Love is not asking for a hug and being told no. Love does not make you feel stupid for bringing up things that hurt your feelings.\n\nLove does not grow angry because you talk to your mom about your feelings. Love does not body shame. Love does not constantly change the passcode to their phone.\n\nLove does not laugh when you find out they're unfaithful. Love does not tell you that you are not smart enough to accomplish anything. Love does not force their hand up your thigh when the words \"no\" slip out of your mouth.\n\n\n\nLove is the warmth of a hand on your cheek when you get anxious. Love is getting your backpack out the car for you. Love is turning around when you need them. Love compromises.\n\nLove is encouraging. Love is proud. Love is forgiving. Love sees you for who you are. Love knows you are worthy.\n\nGod is your Father and you are His daughter, so do not believe for one second that this abuse is the love you think you deserve.\n\nLove will not always be easy. Love will be challenging and a constant prayer to not anger so quickly.\n\nHowever, do not mix up challenging with the abuse. If you are losing the good pieces of yourself, then it isn't love. I know that you put a lot of time and effort into this relationship, but it is no good, you are holding on to someone whose heart is not in the right place to love you.\n\nI connected with a poem from R. H. Sin, once I left my toxic relationship which reads, \"it took letting go to realize that I was holding onto nothing.\"\n\nDarling girl, you are so loved by so many people, do not let this relationship hold you back or make you feel less worthy than you are. I have always been the girl with her nose stuck up in the air smelling for smoke, to follow the trail to a burning house to find a boy that needed saving, but it is more than likely a boy that lit the fire in the first place and needs changing.\n\nSo, do not be me, be better. Be the girl that lights her own world on fire, for her work, for her family, for God. You are you and you are amazing, so do not fear being without him.\n\nYou will feel as if you have come up for air after drowning in an ocean that you had no idea you were swimming in.\n\nThe emotional abuse that this boy has put you through and maybe even physical abuse will leave you building walls around your heart. It will make other relationships hard, but you are so so strong.\n\nYou will meet someone that makes you so happy and feel so easy to love, you will never understand how you stuck around with the one that hurt you for so long.\n\nYou deserve to grow from this, and I promise you will.\n\nLet go.\n\nxoxo,\n\nThe girl who learned from a toxic relationship", "images": ["https://d5nxst8fruw4z.cloudfront.net/atrk.gif?account=6GrUm1a4KM+2Io", "https://odysseyswoon-img.rbl.ms/simage/https%3A%2F%2Fassets.rbl.ms%2F17321535%2F980x.jpg/2000%2C2000/7Pi21jjqoP8wZktr/img.jpg"], "top_img": "https://odysseyswoon-img.rbl.ms/simage/https%3A%2F%2Fassets.rbl.ms%2F17321535%2F980x.jpg/2000%2C2000/7Pi21jjqoP8wZktr/img.jpg", "keywords": [], "authors": ["Nidhi Singh", "Olivia Gemarro", "Caroline Forier", "Kylee Marie Wilson", "Nadia Makarova", "Sydney Lind Moore", "Kaitlin Pastor", "Bryce Payne", "Emily Wilson", "Haley Mortensen"], "canonical_link": "https://swoon.theodysseyonline.com/honeymoon-phase-end", "title": "The Honeymoon Phase Never Has To End, Maybe You're Looking At This Wrong", "meta_data": {"apple-mobile-web-app-title": "Swoon", "application-name": "Swoon", "msapplication-TileColor": "#ef38af", "msapplication-TileImage": "https://static.rbl.ms/static/img/whitelabel/odysseyswoon/favicons/mstile-144x144.png?1", "theme-color": "#ff0000", "twitter": {"card": "summary_large_image", "site": {"identifier": "@twitter", "id": 341251022}, "image": "https://assets.rbl.ms/17321535/980x.jpg"}, "fb": {"app_id": 402984699895135, "pages": 1232766503427695}, "og": {"type": "article", "url": "https://swoon.theodysseyonline.com/honeymoon-phase-end", "site_name": "Swoon", "image": {"identifier": "https://odysseyswoon-img.rbl.ms/simage/https%3A%2F%2Fassets.rbl.ms%2F17321535%2F980x.jpg/2000%2C2000/7Pi21jjqoP8wZktr/img.jpg", "width": 2000, "height": 2000}, "description": "I would hate to think that after this imaginary period within my relationship that things are bound to go downhill.", "title": "The Honeymoon Phase Never Has To End, Maybe You're Looking At This Wrong"}, "article": {"publisher": 1232766503427695, "published_time": "2018-02-20T21:13:51+00:00", "modified_time": "2018-02-22T17:15:57+00:00", "author": "https://www.facebook.com/1232766503427695"}, "referrer": "always", "description": "Is this a real phenomemnon?", "google-site-verification": "djogUE-B3y4KQ0xxTG-nyB3W5aGMBns_A0_bs_yunTE", "viewport": "width=device-width,initial-scale=1,minimum-scale=1.0,maximum-scale=1.0,user-scalable=no"}, "movies": [], "publish_date": 1519161231.0, "source": "https://swoon.theodysseyonline.com", "summary": ""}