{"url": "https://coed.com/2017/12/04/tonya-harding-net-worth-how-much-is-skater-i-tonya-contract-money-salary/", "text": "Tonya Harding is an American figure skating champion who is also a two-time Olympian, and a two-time Skate America Champion, winning the U.S. Figure Skating Championships and placing second at the World Championships, in 1991. She is also the first American woman to complete a triple axel jump in competition.\n\nHarding became a controversial figure after her ex-husband, Jeff Gillooly, contrived with Shawn Eckhart and Shane Stant to break the leg of her competitor, Nancy Kerrigan, in 1994. After pleading guilty to hindering the prosecution concerning the attack, she had been banned for life from the U.S. Figure Skating Association.\n\nA film adaptation of her life, I, Tonya, has an expected December 2017 release.\n\nTonya Harding Net Worth 2019: $30,000\n\nTonya Harding’s net worth is estimated to be around $30,000. Since leaving her skating career, Harding has tried various faculties to start a new career over the years, from music to boxing.\n\nThe Early Years\n\nHarding started her skating career at some point in the 1980’s, notably placing sixth at the 1986 U.S. Figure Skating Championships. The following two years, she placed fifth both times and went on to place third in 1989.\n\n1991-1993\n\nIt was in 1991, she landed her first triple axel at the U.S. Championships, winning the title with the event’s first 6.0 ever given to a single female skater for technical merit. That same year, as Fall 1991 Skate America, she also became the first woman to complete a triple axel in the short program, successfully execute two triple axels in a single competition and complete a triple axel combination with the double toe loop.\n\n1994-2000\n\nHarding was a member of the American ice skating team for the 1994 Winter Olympics in Norway, where she finished in eighth place. In January, however, Harding’s competition, Nancy Kerrigan, was attacked by an assailant after a practice session during the 1994 U.S. Figure Skating Championships in Detroit. The attack only bruised Kerrigan’s leg but forced her to withdraw from the competition, with Harding winning the event. The attack also soon became a tabloid event at the time. During the aftermath, Harding eventually took a guilty plea with conspiring to hinder prosecution of the attackers, leading to three years probation, 500 hours in community service and a $160K fine. In addition, she was stripped of her 1994 U.S. Championships title and banned from USFSA events, after the organization concluded she was aware of the attack beforehand. Towards the end of the 90’s, Harding toyed with careers in music and acting.\n\n2002-2010\n\nIn the early 2000’s Harding toyed with a boxing career, even appearing on the Fox TV network event, Celebrity Boxing. Eventually, she went on to boxing professionally. However, Harding would end up giving up boxing after a few years, attributing the shortness to her asthma. In 2010, she also toyed with a racing career.\n\n2011-Present\n\nA film adaptation of Harding’s life, I, Tonya, had been announced in 2016, with actress Margot Robbie playing Harding. Filmed in Georgia, it retold the events of the 1994 attack against Kerrigan, with the following aftermath ending Harding’s professional career. The film was released at the Toronto International Film Festival in September 2017, with the United States release coming on December 8, 2017.\n\nIn a statement, as seen above, Robbie said that Harding had good things to say about her performance:\n\nShe was so gracious, she was amazing about [seeing the film]. Really, really amazing. She was very complimentary about what we pulled off, and she was really kind about my skating even though I’m nowhere near as good as I should be. Yeah, she was great.\n\nAs director Craig Gillespie said in an interview with IndieWire, the film attempted to portray Harding as an empathetic figure:\n\nI really felt like it was there in Steven’s script that, by the end of the movie, we should empathize with her. I know it’s a tall order with such a huge public persona that we have, but I really felt it was possible with Margo’s performance, with this script … I heard [Tonya] was actually happy with it.\n\n2018\n\nTonya Harding is finally having her moment as the edgy new biopic ‘I, Tonya’ wins a Critics’ Choice Award.\n\nVIEW GALLERY\n\n2019\n\n2019 will be the silver anniversary of the day figure skater Nancy Kerrigan, who was whacked on the right leg by an associate of the husband of Tonya Harding.", "images": ["https://coedmagazine.files.wordpress.com/2017/12/tonya-harding-on-nbc.jpg", "https://pixel.wp.com/b.gif?v=noscript", "https://secure.gravatar.com/avatar/c91e63434d620a182c7a6c1821e8e967?s=50&d=mm&r=r", "https://s2.wp.com/wp-content/themes/vip/coedmediagroup/images/cmg1x1.gif", "https://coedmagazine.files.wordpress.com/2017/12/tonya-harding-on-nbc.jpg?quality=88&w=640"], "top_img": "https://coedmagazine.files.wordpress.com/2017/12/tonya-harding-on-nbc.jpg", "keywords": [], "authors": ["Hello", "My Name Is John Witiw", "You May Remember Me As A Writer For Viral Pirate", "Frontrunner Magazine", "Or Even Ntd Television", "But Now I'M Here. I Am Also An Editor For Turning Point News", "A Foreign Correspondent For Snip.", "And In Case You Were Wondering", "It'S Supposed To Be Pronounced", "I Think..."], "canonical_link": "https://coed.com/2017/12/04/tonya-harding-net-worth-how-much-is-skater-i-tonya-contract-money-salary/", "title": "Tonya Harding Net Worth 2019: How Much Tonya Worth Today?", "meta_data": {"viewport": "initial-scale=1.0,width=device-width,minimum-scale=1.0,maximum-scale=5.0", "description": "Tonya Harding's life, notably the incident with Nancy Kerrigan, was the basis for the Margot Robbie film, 'I, Tonya.' Let's look at her career at net worth!", "google-site-verification": "Mbac5up0vBX5xSE4g4-qKbAbeD8b5i_vSYlDSA3URsM", "msvalidate.01": "18A4633A49B08F405A290BE09BD67B47", "fb": {"app_id": 1009246519154050}, "keywords": "Athletes,Net Worth,Sports,Sports", "og": {"type": "article", "site_name": "COED", "locale": "en_US", "title": "Tonya Harding Net Worth 2019: How Much Tonya Worth Today?", "description": "Tonya Harding's life, notably the incident with Nancy Kerrigan, was the basis for the Margot Robbie film, 'I, Tonya.' Let's look at her career at net worth!", "url": "https://coed.com/2017/12/04/tonya-harding-net-worth-how-much-is-skater-i-tonya-contract-money-salary/", "image": "https://coedmagazine.files.wordpress.com/2017/12/tonya-harding-on-nbc.jpg"}, "news_keywords": "Athletes,Net Worth,Sports,Sports", "article": {"published_time": "2017-12-04T13:32:52-04:00", "modified_time": "2019-05-06T14:55:44-04:00", "publisher": "https://www.facebook.com/COEDMagazine"}, "twitter": {"card": "photo", "site": "@COED", "title": "Tonya Harding Net Worth 2019: How Much Tonya Worth Today?", "image": "https://coedmagazine.files.wordpress.com/2017/12/tonya-harding-on-nbc.jpg"}, "generator": "WordPress.com", "application-name": "Breaking News, Entertainment, Sports & College Life | COED", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "COED.com is a leading news, entertainment, sports, and lifestyle destination for millennials and beyond.", "msapplication-task": "name=Subscribe;action-uri=https://coed.com/feed/;icon-uri=https://secure.gravatar.com/blavatar/cf8c7904ee0b8186573bb7125f406948?s=16"}, "movies": [], "publish_date": 1512363600.0, "source": "https://coed.com", "summary": ""}