{"url": "https://www.usatoday.com/story/life/music/2018/01/28/grammy-awards-2018-news-updates-winners/1066860001/", "text": "CLOSE The Grammy Awards are music's biggest night of the year. Here are our must-see moments from the show! USA TODAY\n\nBruno Mars accepts the record of the year Grammy for '24K Magic.' (Photo: ROBERT DEUTSCH/USA TODAY NETWORK)\n\nWith more than a little 24K Magic, Bruno Mars was pure gold at the 60th annual Grammy Awards in New York on Sunday.\n\nDuring a night full of provocative performances and political displays, the R&B singer won six trophies, including three of the Grammys’ top honors: album of the year (24K Magic), record of the year (24K Magic) and song of the year (That’s What I Like).\n\nThe first folks Mars thanked when accepting album of the year? His fellow nominees. “You guys are the reason why I’m in the studio pulling my hair out, man, because I know you guys are only going to come with the top-shelf artistry,” Mars said of Childish Gambino, Lorde, Jay-Z and Kendrick Lamar. “Thank you guys for blessing the world with your music.”\n\nLamar also had a strong showing, picking up five Grammys including best rap album for Damn. And Alessia Cara won best new artist over SZA, Khalid, Lil Uzi Vert and Julia Michaels.\n\nHere's a minute-by-minute breakdown of the festivities:\n\nMore: Grammy Awards 2018: The winners' list\n\nMore: Brutally honest reviews of every Grammy performance\n\nThe main event:\n\n11:04: Mars finishes a big night with album of the year for 24K Magic.\n\n10:48: The \"In Memoriam\" segment begins with Chris Stapleton and Emmylou Harris doing the late Tom Petty's Wildflowers. And after a rundown of everyone the music industry lost in the last year, ending with Linkin Park's Chester Bennington, Logic, Cara and Khalid perform 1-800-273-8255. Logic finished with the political mike drop of the night: \"For those who fight for equality in a world that is not equal, not just and not ready for the change we are here to bring, I say unto you: Bring us your tired, your poor and any immigrant who seeks refuge. For together, we can build not just a better country but a world that is destined to be united.\"\n\nMore: Who wasn't at the Grammys?\n\n10:35: Mars' 24K Magic wins record of the year. \"Look at me, Pop, I'm at the Grammys right now!\" he says after tying Kendrick Lamar with five honors for the night.\n\n10:30: SZA embraces '70s chic and disco-era guitar riffs for the soulful Broken Clocks.\n\n10:13: With the Grammys in New York, of course there's a Broadway tribute. Dear Evan Hansen star (and Pitch Perfect alum) Ben Platt croons Somewhere from Leonard Bernstein's West Side Story, followed by a salute to Andrew Lloyd Webber in the form of Patti LuPone tackling Evita showstopper Don't Cry for Me Argentina.\n\nElton John and Miley Cyrus after their performance of 'Tiny Dancer.' (Photo: ROBERT DEUTSCH/USA TODAY NETWORK)\n\n10:03: In one of the evening's stranger team-ups, the retiring Elton John duets with Miley Cyrus on Tiny Dancer.\n\n10:02: Host James Corden does a bit with celebrities like DJ Khaled and Cardi B doing spoken-word narration of the Trump book Fire and Fury. The most cheers go to an appearance by Hillary Clinton. \"Is the Grammy in the bag?\" she says excitedly.\n\nSting presents Bruno Mars the song-of-the-year award for 'That\u0092s What I Like.' (Photo: ROBERT DEUTSCH/USA TODAY)\n\n9:58: Mars' That's What I Like gets song of the year — his fourth Grammy of the night. \"Fellas, it's an honor to share this with y'all tonight,\" Mars says to his co-writing crew. \"These are my brothers.\"\n\n9:45: U2 takes a stage set up along the Hudson River, with the Statue of Liberty in the background, to play Get Out of Your Own Way.\n\nKesha performs 'Praying' during the 60th Annual Grammy Awards at Madison Square Garden. (Photo: ROBERT DEUTSCH/USA TODAY NETWORK)\n\n9:36: Janelle Monáe introduces a performance for the Time's Up movement with a warning: \"We come in peace, but we mean business.\" She calls for a united music industry with women and men before bringing out Kesha to sing her hit Praying with a singers including Cyndi Lauper and Camila Cabello. Kesha hits a wide range of emotions, from tearful to raging, before getting a group hug at the end.\n\nBrothers Osborne, Maren Morris and Eric Church perform 'Tears in Heaven' at the 60th Annual Grammy Awards at Madison Square Garden. (Photo: ROBERT DEUTSCH/USA TODAY)\n\n9:26: Dedicating their performance to victims of the terrorist attacks in Manchester and Las Vegas, Maren Morris, Brothers Osbourne and Eric Church do a countrified and acoustic take on Tears in Heaven.\n\n9:23: Chris Stapleton, fresh off an SNL appearance, snags best country album for From A Room: Volume 1. \"This is a wonderful room to be in,\" Stapleton says. \"We always try to make good records and this is a testament to this.\"\n\nRihanna performs 'Wild Thoughts' during the 60th Annual Grammy Awards at Madison Square Garden. (Photo: ROBERT DEUTSCH/USA TODAY NETWORK)\n\n9:13: Palm trees and backup dancers with old-school flapper hairdos give Rihanna, DJ Khaled and Bryson Tiller's performance of Wild Thoughts an oddly mesmerizing vibe.\n\n9:01: Sting sings Englishman in New York, which is ridiculously literal given the circumstances and Grammys' home this year. Shaggy shows up to make the thing 1,000 times cooler — and to add, \"I'm a Jamaican in New York.\"\n\nDave Chapelle speaks after picking up the best comedy album award at the 60th Annual Grammy Awards at Madison Square Garden. (Photo: ROBERT DEUTSCH/USA TODAY NETWORK)\n\n8:59: Third time on stage is a charm for Dave Chappelle, who wins best comedy album for The Age of Spin & Deep In the Heart of Texas. \"I am honored to win an award. Finally,\" he deadpans.\n\nBruno Mars performs 'Finesse' during the 60th Annual Grammy Awards at Madison Square Garden. (Photo: ROBERT DEUTSCH/USA TODAY NETWORK)\n\n8:54: Cardi B and Mars are out with colorful duds and dance moves for Finesse. It should be noted Mars is aces at the \"Running Man\" in this wholly retro affair.\n\n8:51: Corden does a subway spin on his Carpool Karaoke bits with him, Sting and Shaggy doing Every Breath You Take and It Wasn't Me — and annoying onlookers. One old lady wins the day: \"I don't want to be on your stupid YouTube video!\"\n\nMore: Best-dressed stars\n\nMore: Best jokes\n\n8:42: Pink comes out, with sign-language interpreter in tow, to perform a powerful version of Wild Hearts Can't Be Broken.\n\nKendrick Lamar picks up his award for best rap album from Dave Chappelle during the 60th Annual Grammy Awards at Madison Square Garden. (Photo: ROBERT DEUTSCH/USA TODAY NETWORK)\n\n8:38: Chappelle's back out to present best rap album, which goes to Kendrick Lamar's Damn. \"This is special, man,\" Lamar says, accepting his fifth Grammy of the night. Hip-hop taught him how to be an artist, he adds. \"It's really about expressing yourself and putting that paint on the canvas for the world to evolve for the next listener and the next generation after that.\"\n\n8:27: Childish Gambino, aka a very dapper Donald Glover, enthralls the audience with a very groovy rendition of Terrified.\n\nLuis Fonsi and Daddy Yankee featuring Zuleyka Rivera perform 'Despacito' during the 60th Annual Grammy Awards at Madison Square Garden. (Photo: ROBERT DEUTSCH/USA TODAY NETWORK)\n\n8:22: Luis Fonsi and Daddy Yankee saunter out to perform the wildly popular Despacito alongside twerking dancers, bongo drummers and a grooving John Legend and Chrissy Teigen in the crowd.\n\n8:15: Best pop solo performance goes to Ed Sheeran's Shape of You, though Sheeran's not there to accept the honor.\n\n8:12: Gary Clark Jr. and Jon Batiste team up for a tribute to Fats Domino and Chuck Berry, with Batiste tinkling ivories for Ain't That a Shame and Clark getting in some great guitar riffs on Maybelline.\n\n8:03: Country group Little Big Town performs Better Man with the wind machines on full blast.\n\nAlessia Cara accepts the award for best new artist during the 60th Annual Grammy Awards at Madison Square Garden. (Photo: ROBERT DEUTSCH/USA TODAY NETWORK)\n\n7:59: Alessia Cara takes one of the biggest prizes of the night, best new artist. \"Holy cow. I've been pretend-winning Grammys since I was a kid, like in my shower, so you'd think I'd have the speech thing down but I absolutely don't,\" Cara says, paying tribute to her fans. \"You guys are the reason why I don't have to win Grammys in my shower anymore.\"\n\n7:54: Clad all in white, Sam Smith has a full chorus out to help him do Pray. He's feeling the gospel truth tonight, folks.\n\nThe Grammy for rap sung performance goes to Kendrick Lamar, who credits collaborator Rihanna, during the 60th Annual Grammy Awards at Madison Square Garden. (Photo: ROBERT DEUTSCH/USA TODAY NETWORK)\n\n7:46: Lamar picks up No. 4 for the day, winning best rap/sung performance for Loyalty. \"This is love, I appreciate every single last one of y'all,\" Lamar says, thanking his collaborator Rihanna (who happens to be the one presenting him the award): \"She gassed me on my own songs. This really belongs to her, real talk.\"\n\nLady Gaga performs 'Joanne' and 'Million Reasons' during the 60th Annual Grammy Awards at Madison Square Garden. (Photo: ROBERT DEUTSCH/USA TODAY NETWORK)\n\n7:39: Host Corden arrives just time to present Lady Gaga's performance: a stripped-down rendition of Joanne on a feathery piano. She dedicates the stirring tune to her father's late sister as well as to \"love and compassion even when you can't understand,\" and then transitions into her hit Million Reasons.\n\nKendrick Lamar performs during the 60th Annual Grammy Awards at Madison Square Garden. (Photo: ROBERT DEUTSCH/USA TODAY NETWORK)\n\n7:30: Lamar opens the show with a flag waving in the background and hooded soldiers marching with his song XXX. U2 then joins Lamar for DNA, before kicking to Dave Chappelle for a few words: \"The only thing more frightening than watching a black man be honest in America is being an honest black man in America.\"\n\nAt the early awards ceremony:\n\nPaul Shaffer hosted the \"premiere\" pre-ceremony and served as musical director with his World's Most Dangerous Band. The premiere Grammy ceremony featured the first awards of the day in over 70 categories.\n\n6:00: Shaffer ends the early show, telling the audience to get over to the main Grammy program starting at Madison Square Garden. \"Get a drink, make it a double. We'll see you over there,\" he says.\n\n5:55: Greg Kurstin wins producer of the year for his work, which includes Concrete and Gold (Foo Fighters), Dear Life (Beck) and Wall of Glass (Liam Gallagher). Kurstin won in 2017 for his work on Adele’s 25 album.\n\n5:53: Sheeran wins best pop vocal for Divide.\n\n5:50:Tony Bennett Celebrates 90 by various artists wins best traditional pop vocal album. Although not technically a winner, Bennett himself takes the stage saying, \"I am so thrilled to see my son receive this award. What a beautiful night.\" Producer and son Dae Bennett says, \"It's like being in a movie. ... That's all I can remember because he's standing right here.\"\n\nChris Stapleton accepts Best Country Solo Performance for 'Either Way' during the Grammy Awards Premiere Ceremony at The Theater at Madison Square Garden. (Photo: ROBERT DEUTSCH/USA TODAY NETWORK)\n\n5:46: Stapleton heads back on the stage for best country duo for Broken Halos. \"This is unbelievable,\" says Stapleton who thanks his frequent recording partner, Mike Henderson.\n\n5:44: Stapleton takes forever to get to the stage to accept his award for best country solo performance for Either Way. \"I'm out of breath, I just ran six miles to get up here,\" says Stapleton, who had just walked in the door to hear his name called.\n\n5:40: Lamar wins two Grammys in a row, for best rap song and best rap performance in Humble. Big night for Lamar and the big show hasn't even started.\n\n5:39: The Weeknd's Starboy wins best urban contemporary album. \"In all seriousness, The Weeknd lives right around the corner from me. I'll make sure he gets this,\" says presenter Jimmy Jam.\n\n5:35: Mars is on the Grammy scoreboard for best R&B performance with That's What I Like, which also wins best R&B song. Jimmy Jam accepts saying, \"I'll pass this off to Bruno on my way home.\" Within a minute, it seems, Mars also wins best R&B album for 24K Magic.\n\n5:32: Foo Fighters win best rock song for Run. The band is not present.\n\n5:28: The late legend Leonard Cohen wins best rock performance for You Want It Darker.\n\n5:25: A black-hooded Ice-T takes the stage with Body Count to pound out Black Hoodie: \"People talk about police brutality like it's something new, I've been talking about it for 20 years.\" He dedicates the song \"to all the people killed by police.\"\n\n5:19: Lisa Loeb is back, this time with a Grammy win for best children's album Feel What U Feel. \"Oh my gosh,\" she says, reading a speech scrawled on an envelope from the hotel. \"I feel so shaky.\"\n\nShe thanks many people, including her two young children and her \"in-laws and babysitters. Enabling me to go the studios and go on the road.\" Not often a shout-out for babysitters.\n\n5:17: The youngest son of Bob Marley, Damian \"Jr. Gong\" Marley, takes best reggae album for Stone Hill. While the band plays Give It Up, Marley is not present.\n\n5:13: Aimee Mann wins best folk album for Mental Illness. Mann is not present to accept the award.\n\nJazzmeia Horn performs during the 60th Annual Grammy Awards pre-telecast show. (Photo: TIMOTHY A. CLARY/AFP/GETTY IMAGES)\n\n5:10: Taj Mahal and Keb' Mo' win best contemporary blues album for TajMo. Mahal whoops excitedly into the mike. \"We are trying to keep the culture moving forward, keep on greasin' the wheels,\" says Mahal.\n\n5:09: The Rolling Stones win best traditional blues album for Blue & Lonesome. The Stones are not present at the pre-show ... obviously.\n\n5:07: A bluegrass tie! Between Laws of Gravity by The Infamous Stringdusters and All the Rage by Rhonda Vincent and The Rage.\n\n4:54: Reba McEntire wins best roots gospel album for Sing It Now: Songs of Faith & Hope. McEntire accepts her first Grammy in 24 years, explaining it is an odd to see a country artist up for the gospel award.\n\n\"But I have been singing these songs all my life,\" she say, \"It’s so great to get those songs on the album.\"\n\nThe album is about healing hearts. \"That’s what God put me on this Earth for. Music is so healing. I love my job. I’m so grateful to get to do it,\" says McEntire. \"I’m going to give this back to God.\"\n\n4:49: CeCe Winans wins again for best gospel album Let Them Fall In Love. Her son, Alvin Love III, accepts again, \"Thank you mom, God bless.\"\n\n4:44: Gospel legend Winans wins the Grammy for best gospel song for Never Have to Be Alone. Collaborator son Love III accepts, thanking his mother, \"for recording the song and giving birth to me as well.\"\n\n4:30: Jazz vocalist Jazzmeia Horn gets the place jumping with her Moanin' performance. Standing ovation. Breathtaking. Ledisi comes onstage and demands more applause for Horn. \"Isn't she amazing?\" Ledisi asks.\n\n4:17: Loeb looks stunning in a resplendent gray-sparkled gown (and the trademark glasses) giving out classical awards, including best orchestral performance for Shostakovich: Symphony No. 5; Barber.\n\n4:12: Lin-Manuel Miranda wins best song written for visual media for How Far I'll Go, sung by Auli'i Cravalho in Moana. Miranda is not present to accept.\n\n4:09: Hurwitz is right back for more, winning best score soundtrack for La La Land. He says, \"I'll guess I'll thank a few more people. Director Damien Chazell. He touches every single detail of the movie, I owe so much to you.\"\n\nIndia Arie performs 'I Am Light' during the Grammy Awards Premiere Ceremony at The Theater at Madison Square Garden. (Photo: ROBERT DEUTSCH/USA TODAY NETWORK)\n\n4:08:La La Land wins best compilation for soundtrack. Composer Justin Hurwitz accepts.\n\n4:05: Dear Evan Hansen takes best musical theater album, bringing composers Benj Pasek and Justin Paul to the stage. After winning an Oscar for La La Land, they are one step closer to EGOT, needing an Emmy.\n\n4:04: Carrie Fisher gets a Grammy! The late actress wins the Grammy for best spoken word for her best-selling The Princess Diarist.\n\n3:57: Shakira wins best Latin pop album for El Dorado. Shakira is not present to accept the award.\n\n3:53: A fully blue-adorned India Arie sings her song I Am Light, asking the rapt audience to listen to the inspirational lyrics. \"I'm not the mistakes that I have made/ Or any of the things that caused me pain/ I am not the pieces of the dream I left behind.\"\n\nMore: Grammy Awards 2018: The winners' list\n\n3:47: Mars' 24K Magic wins best engineered album. Engineers Serban Ghenea, John Hanes and Charles Moniz accept the award, dedicating it to master engineer Tom Coyne, who died in April.\n\nNeil deGrasse Tyson during the Grammy Awards Premiere Ceremony at The Theater at Madison Square Garden (Photo: ROBERT DEUTSCH/USA TODAY NETWORK)\n\n3:38: \"It's a tie!\" Tyson announces for best recording package. He's not joking. A Grammy tie between El Orisha De La Rosa and Pure Comedy (Deuxe Edition).\n\n3:31: Only Grammy-nominated astrophysicist presenter Neil deGrasse Tyson could point out that not only are the Grammys turning 60, but so is NASA. He gives the Grammy for best instrumental composition to Arturo O'Farrill for Three Revolutions.\n\n3:30: HBO's The Defiant Ones, about the friendship between music legends Jimmy Iovine and Dr. Dre, wins best music film.\n\n3:37: Lamar's Humble receives best music video. Lamar's first Grammy of the night is in the bag. Lamar is not at the premiere event.\n\n3:23: Shaffer gives out the first Grammy for best dance recording for Tonite by LCD Soundsystem. They are not at the ceremony, so Shaffer calls out \"darling\" to hand the award to a female stage attendant. \"When I say 'darling,' I mean it with the most 'Me Too' kind of respect,\" says Shaffer.\n\nPaul Shaffer performs at the early ceremony for the 60th annual Grammy Awards at Madison Square Garden in New York. (Photo: Matt Sayles/Invision/AP)\n\n3:20: Shaffer points out there are 75 awards going out in the premiere ceremony. So please keep \"acceptance speeches short and sweet.\" Winners have 45 seconds \"and the clock starts ticking as soon as your name is announced.\" It's going to move fast.\n\n3:09: Shaffer kicked off the show with his World's Most Dangerous Band playing the Rolling Stones classic Bitch. It's the first time the band has played together since the Late Show with David Letterman went off the air.\n\nRead or Share this story: https://usat.ly/2DWUXMT", "images": ["https://www.gannett-cdn.com/uxstatic/usatoday/usat-web-static-5006.0.0/images/sprites/icon_close.png", "https://www.gannett-cdn.com/-mm-/7ca8d357b756355638c4602a8c86f5c3a37a33ea/c=1132-224-3264-1827/local/-/media/2018/01/28/USATODAY/USATODAY/636527664334814154-XXX-Entertainment-60th-Annual-Grammy-Awards-20180128-USA-aps-1-003.jpg?width=540&height=405&fit=crop", "https://www.gannett-cdn.com/-mm-/4d6e5bfdfd6cf327c4cc94820e4e729f33ea151c/c=231-39-2669-1872/local/-/media/2018/01/28/USATODAY/USATODAY/636527496692551531-AP-60th-Annual-Grammy-Awards---Show.jpg?width=540&height=405&fit=crop", "https://www.gannett-cdn.com/-mm-/93362fea1a5dcedbcb52695373890f3861c7486e/c=231-0-3847-2719/local/-/media/2018/01/28/USATODAY/USATODAY/636527748116717235-XXX-Entertainment-60th-Annual-Grammy-Awards-20180128-USA-aps-3.jpg?width=540&height=405&fit=crop", "https://www.gannett-cdn.com/-mm-/55e956c78878219c9e459f6fcced3a2f120ddb08/c=154-0-2564-1812/local/-/media/2018/01/28/USATODAY/USATODAY/636527739111091507-XXX-Entertainment-60th-Annual-Grammy-Awards-20180128-USA-aps-2-008.jpg?width=540&height=405&fit=crop", "https://www.gannett-cdn.com/-mm-/40e727e9f591720062fe362a444a3872f4c726d5/c=192-0-3200-2262/local/-/media/2018/01/28/USATODAY/USATODAY/636527704129421246-XXX-Entertainment-60th-Annual-Grammy-Awards-20180128-USA-aps-2-002.jpg?width=540&height=405&fit=crop", "https://www.gannett-cdn.com/-mm-/a54b7fba4d029e0a8377cc0d729e6a027975d552/c=0-0-2647-1990/local/-/media/2018/01/28/USATODAY/USATODAY/636527658499908751-XXX-Entertainment-60th-Annual-Grammy-Awards-20180128-USA-aps-1-002.jpg?width=540&height=405&fit=crop", "https://www.gannett-cdn.com/sites/usatoday/images/site-nav-logo-dark@2x.png", "https://www.gannett-cdn.com/-mm-/bc132a6033c004fcf372cdc213a9c469382c7100/c=0-203-3167-1992/local/-/media/2018/01/28/USATODAY/USATODAY/636527767346024499-XXX-Entertainment-60th-Annual-Grammy-Awards-20180128-USA-aps-3-001.jpg?width=3200&height=1680&fit=crop", "https://www.gannett-cdn.com/sites/usatoday/images/site-masthead-logo-dark@2x.png", "https://www.gannett-cdn.com/-mm-/4cadd750877695a32e7cf2a5c78003a29374eaf8/c=214-0-3560-2516/local/-/media/2018/01/28/USATODAY/USATODAY/636527539111251444-XXX-Entertainment-60th-Annual-Grammy-Awards-20180128-USA-aps-0-002.jpg?width=540&height=405&fit=crop", "https://www.gannett-cdn.com/-mm-/449cbb3362cd2f4cf03d8618bd19cfe159c464e3/c=0-0-3542-2663/local/-/media/2018/01/28/USATODAY/USATODAY/636527652467350081-XXX-Entertainment-60th-Annual-Grammy-Awards-20180128-USA-aps-1-001.jpg?width=540&height=405&fit=crop", "https://www.gannett-cdn.com/-mm-/5b860f66e40032fd2c5a53dcc8114df323bc0fab/c=0-0-2830-2128/local/-/media/2018/01/28/USATODAY/USATODAY/636527725907949516-XXX-Entertainment-60th-Annual-Grammy-Awards-20180128-USA-aps-2-007.jpg?width=540&height=405&fit=crop", "https://www.gannett-cdn.com/-mm-/334256f109d5b1ba53be84d4cd4b5930fff864d9/c=203-0-3882-2766/local/-/media/2018/01/28/USATODAY/USATODAY/636527567815903447-AFP-AFP-Y62YK.jpg?width=540&height=405&fit=crop", "https://www.gannett-cdn.com/-mm-/927d8919636e4bb1ff443a01e6e470dd2b926024/c=179-0-2991-2114/local/-/media/2018/01/28/USATODAY/USATODAY/636527767346024499-XXX-Entertainment-60th-Annual-Grammy-Awards-20180128-USA-aps-3-001.jpg?width=534&height=401&fit=crop", "https://www.gannett-cdn.com/-mm-/807688bdcc5c8abc3594cad9d2af7a44b7cf81aa/c=220-0-3663-2589/local/-/media/2018/01/28/USATODAY/USATODAY/636527631469303479-USP-Entertainment-60th-Annual-Grammy-Awards-003.jpg?width=540&height=405&fit=crop", "https://www.gannett-cdn.com/-mm-/904b9e0a5fe1b1cccd6f5d6082c5c275503e879f/c=424-0-3777-2521/local/-/media/2018/01/28/USATODAY/USATODAY/636527700009746838-XXX-Entertainment-60th-Annual-Grammy-Awards-20180128-USA-aps-2-001.jpg?width=540&height=405&fit=crop", "https://www.gannett-cdn.com/-mm-/56c230aae101e7cb7ef75e7448c0f082abb3f18a/c=212-0-3524-2490/local/-/media/2018/01/28/USATODAY/USATODAY/636527516263656986-XXX-Entertainment-60th-Annual-Grammy-Awards-20180128-USA-aps-0-001.jpg?width=540&height=405&fit=crop", "https://www.gannett-cdn.com/-mm-/1156c94dcc260fbd8686b447f1ca4902dc846389/c=232-0-3870-2735/local/-/media/2018/01/28/USATODAY/USATODAY/636527715947589003-XXX-Entertainment-60th-Annual-Grammy-Awards-20180128-USA-aps-2-004.jpg?width=540&height=405&fit=crop", "https://www.gannett-cdn.com/-mm-/b5482fbeb72bc17811f7bccc204d7039ab4ce18a/c=215-0-3579-2529/local/-/media/2018/01/28/USATODAY/USATODAY/636527720934201020-XXX-Entertainment-60th-Annual-Grammy-Awards-20180128-USA-aps-2-005.jpg?width=540&height=405&fit=crop", "https://www.gannett-cdn.com/uxstatic/usatoday/usat-web-static-5006.0.0/images/indicators/facebook-loading.gif", "https://www.gannett-cdn.com/-mm-/e591eddcf4e16cc71a4e1e8caa87528c226009bd/c=161-0-2688-1900/local/-/media/2018/01/28/USATODAY/USATODAY/636527667250160842-XXX-Entertainment-60th-Annual-Grammy-Awards-20180128-USA-aps-1-004.jpg?width=540&height=405&fit=crop", "https://www.gannett-cdn.com/-mm-/12eeecc309e45617bbddee8b45489848d1d15e0e/c=281-101-2370-1672/local/-/media/2018/01/28/USATODAY/USATODAY/636527689885281938-XXX-Entertainment-60th-Annual-Grammy-Awards-20180128-USA-aps-2.jpg?width=540&height=405&fit=crop", "https://www.gannett-cdn.com/-mm-/ee09a987c29816ca90406cf47228220c2bfe884c/c=237-0-3940-2784/local/-/media/2018/01/28/USATODAY/USATODAY/636527679780785166-XXX-Entertainment-60th-Annual-Grammy-Awards-20180128-USA-aps-1-006.jpg?width=540&height=405&fit=crop"], "top_img": "https://www.gannett-cdn.com/-mm-/bc132a6033c004fcf372cdc213a9c469382c7100/c=0-203-3167-1992/local/-/media/2018/01/28/USATODAY/USATODAY/636527767346024499-XXX-Entertainment-60th-Annual-Grammy-Awards-20180128-USA-aps-3-001.jpg?width=3200&height=1680&fit=crop", "keywords": [], "authors": ["Bryan Alexander", "Brian Truitt", "Published P.M. Et Jan."], "canonical_link": "https://www.usatoday.com/story/life/music/2018/01/28/grammy-awards-2018-news-updates-winners/1066860001/", "title": "Grammy Awards 2018: Bruno Mars wins six honors, including song, record and album of the year", "meta_data": {"Content-Type": "text/html; charset=UTF-8", "google": "notranslate", "description": "Find out who takes home the biggest prize in music.", "fb": {"app_id": 215046668549694, "pages": "6271782579,6566864515,6581478870,7197664863,7850621533,8031989578,9812439851,10482066215,11277320498,13642915529,13652355666,14073085963,16511263815,17540977705,18884137648,19125738813,23332504801,25003338948,31185662683,36808884697,37412800032,41044579289,42128399297,43612894510,46050757230,47020221001,47692649063,48490808881,48958576760,48976713989,49060990988,49607602899,49680588265,49896855793,50095226239,50978409031,52929678682,54660221594,55529405081,56434454301,56732457944,62464848082,62811590881,63475094632,63475094632,63582312713,65299040658,66049156099,66281684861,68903794473,69357466992,70423731350,70657021294,71807382333,72088679443,72139486384,73736978810,74475819815,76240820015,76276576343,77475586904,79333461561,79437403137,80117331717,80335432797,81086717085,81320873283,81668556783,81917682064,82415033847,83300095936,83563566820,87171906471,87448932499,87448932499,88584644204,90329609573,94480694479,94700656192,95712466848,95926318753,97657252278,99020906334,100825602361,101112717264,103261740968,103678546758,104331357951,104935809704,105714200321,105814368912,105878288262,106644919984,107327575587,108555442934,109146355881,109686244216,109793107867,110252103235,110404119877,110527555449,115611960606,115967868757,117907407522,118427210363,121866005065,122786733297,124755637015,125551044242,126226324691,129236178055,132159529312,132779306963,133049345480,134076752154,134394490084,136737914809,138770030135,141962110815,146089950343,148668982786,152774630192,153308622465,158094820767,164935760159,168684165430,173007618420,182922701188,188894693348,189867939238,190632318566,201996980631,227627281180,231239152914,242752084180,250325640686,264717798098,274620738925,275678631915,312966181232,314817944972,319611510288,323213251787,329923389135,338437548341,347221378913,362300531934,363363051861,371547464003,385926141498,427414745045,488720200095,100855786673970,105233922869839,105347532857165,105550656158763,106451856091222,106819879363130,107117249323169,108029922557289,108981615791456,109280192597421,109280192597421,109652569058713,110311752340743,110471702456365,110743725611909,110936258937026,111203872270080,112875149052352,113056925415668,113544088682099,113819202011100,115535341805950,115612465136194,117941352212869,119027288135308,119794264705307,119941731380546,120356424669462,121160355264720,121227371225765,121242251236815,121422567927897,124075397608772,124307640925620,124528254305153,127729820590459,128075747844406,129752560371732,130211193676772,130407246974813,130934216964240,136941796341905,137098406340114,137341919636249,137698179626815,137935586280481,138064052876960,138170199553897,140615052641118,140616965982144,141822679203700,142195472502819,143851392316295,145525478832716,146112055409819,146137498764266,146315142126130,146798045922062,147760805252234,148251148521543,149641051719383,152527031492851,152785861474173,153525871324757,154425934607982,154443518023678,155874144456588,156345381090801,157305941529632,157456661011568,158095147555989,159385590790009,160735830621443,161639923860040,165912253479205,167334979948476,167487199962004,169254356561132,169571899725267,169908223021026,176115302489104,176983469019018,177037772444433,177938742707529,180004588791896,183850168300771,183882195384562,184094471609920,184741935370451,185457134911754,187466604613310,187899791275353,190953458083653,192069610842446,196267627213508,197490563626275,205576782811630,207319989616043,209524799494208,212808112063652,220757414638542,222348701505747,224163964346315,225067797622802,225571757789261,225618707473378,231988790171331,235484153604672,236655713446291,236665340121443,241091022598958,243031846042424,251228454889939,261119230567728,263714980315631,279914708715884,281030418652036,281331052320274,285377081517877,288382484929799,288570077828603,295018040526596,297522096960113,305068052985746,307826419595702,310942265948388,315461641910509,315942225236045,315942225236045,320453738073595,321223331243188,327249521057460,330565860307724,332382433821098,334297859927211,339575256116022,351359635259904,353404615129492,368424599844024,373087836097009,399493863726488,401783903349050,405292372992577,410195352524708,412113499123835,420941268096348,421255071314156,422375144525783,426754640812333,438452439879553,458808827485318,469694573429026,471891632935599,477690595750196,480464022311783,487732368292520,510151039081225,535045576657973,535551216797440,556150611109468,562348203875693,566432520196581,569900189687627,581529871999163,592673674105043,593739520831583,611437275717153,637561026326153,642020402627050,677476185677499,686958778091339,704313986314492,717947288315597,756473301219510,757336147711096,813218208713830,850378298431411,872296879526971,877111212410602,911836215623184,917342785050040,927427260614748,945986872102221,1561238324154800,1822461518079800,1889753241275160,1003311406396687,1007667299356254,1095671673874517,1111939365618797,1170250869768985,1199725526840512,1203830176364044,1224613924286312,1244424538911767,1260369167415906,1282648301845288,1413320388972813,1422299337837954,1425793144356745,1432665186743737,1443524575938047,1473996709497771,1504884589584087,1525148737812812,1526198127405784,1583851541911383,1588113081458198,1596218533974035,1602646926431957,1603698749645413,1621466394844549,1627621717510471,1667234726635829,1725861847686522,1747180218844657,1759005871036426,1774393409526131,1797367867256626,1847787168808886,1878073225844519,1946209538938897,1972936962947967,2047091012096533"}, "og": {"site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/bc132a6033c004fcf372cdc213a9c469382c7100/c=0-203-3167-1992/local/-/media/2018/01/28/USATODAY/USATODAY/636527767346024499-XXX-Entertainment-60th-Annual-Grammy-Awards-20180128-USA-aps-3-001.jpg?width=3200&height=1680&fit=crop", "width": 3200, "height": 1680}, "title": "Grammy Awards 2018: Bruno Mars wins six honors, including song, record and album of the year", "description": "Find out who takes home the biggest prize in music.", "url": "https://www.usatoday.com/story/life/music/2018/01/28/grammy-awards-2018-news-updates-winners/1066860001/", "type": "article"}, "ROBOTS": "NOODP, NOYDIR", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/-mm-/bc132a6033c004fcf372cdc213a9c469382c7100/c=0-203-3167-1992/local/-/media/2018/01/28/USATODAY/USATODAY/636527767346024499-XXX-Entertainment-60th-Annual-Grammy-Awards-20180128-USA-aps-3-001.jpg?width=1600&height=800&fit=crop", "site": "@usatoday", "creator": "@usatoday", "title": "Grammy Awards 2018: Bruno Mars wins six honors, including song, record and album of the year", "description": "Find out who takes home the biggest prize in music."}, "news_keywords": "Grammy Awards, Grammys, Jay-Z, Bruno Mars, James Corden, Recording Academy, CBS, Kendrick Lamar, Kesha, Chris Stapleton,", "viewport": "width=1070"}, "movies": [], "publish_date": 1517115600.0, "source": "https://www.usatoday.com", "summary": ""}