{"url": "https://www.glamour.com/story/nbc-good-girls", "text": "NBC's new comedy/drama series Good Girls—starring Christina Hendricks, Mae Whitman, and Retta—is described by the following tagline: Three moms get tired of trying to make ends meet and rob a supermarket. That plot might sound a bit absurd, but my advice? Just go with it. Whitman, Hendricks, and Retta's chemistry alone is worth adding a new show to your queue.\n\nAs for the show's tongue-in-cheek title, creator Jenna Bans says it's part of a larger conversation. \"My mom would say, 'Always be a good girl!' and she didn't mean it in an anti-feminist way. But as I got older—especially into my 30s—I was like, 'Fuck that, I don't have to be a good girl.' Christina Hendricks said that we're giving a huge middle finger to the phrase, and I think it's really true. You don't have to be a good girl; you don't have to do anything but you.\"\n\nWhile no one is suggesting you rob a supermarket, Bans says these characters—who have never done anything illegal before—are doing it for good because that's what they need to tell themselves in order to do it. \"These are women who are backed into a corner,\" she explains.\n\nHow so? Well, Retta plays Ruby, a married mother who desperately needs money for an experimental drug for her daughter's kidney disease. Whitman is Annie, a young mom who will do whatever it takes to have custody of her daughter. \"She's also being sexually harassed in her shitty job at the grocery store,\" Bans says. And Hendricks stars as Beth, a wife and mom who finds out her cheating husband has lost their savings.\n\n\"These characters do questionable things,\" Bans says. (No kidding.) \"You can argue whether they do them for the right reasons or not, but we just kind of do it. There's one scene where Retta's daughter's doctor says, 'You probably can't afford [this medication],' and he's just judging by her waitress uniform. I don't know if that's overt sexism, but it's definitely subtle classism. We try to tackle those types of things in a way that's not in your face, but they are inherent to what these women's lives are. Hopefully, we're saying something.\"\n\nBans has been wanting to say something ever since the 2016 election, in which she underestimated the deep-rooted anger of so many Americans toward Hillary Clinton. \"I was talking to my mom that I don't remember this feeling of 'everybody hates women' being so overt. There were all the rallies and the 'lock her up' chants, and my mom was having a really hard time even though she knew it existed. So the show was fueled from a little bit of anger and desire to completely escape from it.\"\n\nIf anyone understands how to write escapism with a modern touch, it's Bans, who got her start on Desperate Housewives before becoming a producer and writer on Grey's Anatomy and Scandal. \"I grew up loving a lot of scheming, powerful, awesome, manipulative female characters on TV,\" she says. \"I like to think these women on Good Girls are a little less scheming and a little more balls-out empowerment. They are very desperate and a product of their environment.”\n\nOnce Bans put her thoughts on paper for Good Girls, she got the green light almost instantly from NBC and Universal Television. \"My pitch meeting was almost all women, and it was awesome,\" she says. \"I got three sentences into why these women are pushed to the edges of their sanity by financial desperation and what would cause a so-called ‘good girl' to walk into the grocery store and rob it at toy gunpoint before [NBC Entertainment president] Jen Salke was like, ‘I love it, we’re doing it!’ They just got it in a way I’m not sure a bunch of male executives would. It was the easiest pitch I have ever pitched.\"\n\nNow that the series is about to premiere—tonight at 10:00 P.M. ET—Bans just hopes viewers have the same reaction. \"I hope they get an hour of total fun and wish fulfillment and escapism.\"", "images": ["https://www.glamour.com/verso/static/glamour/assets/logo-reverse.b2ce20427c8d415381a18834c479e653848cc926.svg", "https://media.glamour.com/photos/5a44fe6c968b09301d8d1f71/1:1/w_350%2Ch_350%2Cc_limit/GettyImages-843554780%2520(1).jpg", "https://media.glamour.com/photos/5d049b000cd0cf48b5e2969f/1:1/w_350%2Ch_350%2Cc_limit/GLOW_301_Unit_00334R.jpg", "https://www.glamour.com/verso/static/glamour/assets/logo-header.aeb2e510354d524c42a87c5d0a97d0a73c5d7581.svg", "https://media.glamour.com/photos/5d263078fcab930008b6eac7/1:1/w_350%2Ch_350%2Cc_limit/gossip-girl.jpg", "https://media.glamour.com/photos/5c9246c25387ab2cecaffbe9/1:1/w_350%2Ch_350%2Cc_limit/ST3%2520Production%2520Still%25202.jpg", "https://media.glamour.com/photos/5d1f529086ebd100088cd70f/1:1/w_350%2Ch_350%2Cc_limit/Stranger_Things_S03E02_24m48s35693f_R.jpg", "https://media.glamour.com/photos/5a9434db99ea9a2ba3431aba/16:9/w_1280,c_limit/_fb.jpg", "https://media.glamour.com/photos/5d1f88a83887990009030866/1:1/w_350%2Ch_350%2Cc_limit/GettyImages-965301868.jpg", "https://media.glamour.com/photos/5d268f5c495aa2000a9c5580/1:1/w_350%2Ch_350%2Cc_limit/lede.jpg", "https://media.glamour.com/photos/5a9434a9fb204a1bd58401c8/16:9/w_1280%2Cc_limit/_lede.jpg", "https://media.glamour.com/photos/5d287e7e6966c50008c4945e/1:1/w_350%2Ch_350%2Cc_limit/Maya-Hawke-river.jpg"], "top_img": "https://media.glamour.com/photos/5a9434db99ea9a2ba3431aba/16:9/w_1280,c_limit/_fb.jpg", "keywords": [], "authors": ["Condé Nast", "Christopher Rosa", "Samantha Leach", "Jessica Radlof", "Anna Moeslein", "Jessica Radloff"], "canonical_link": "https://www.glamour.com/story/nbc-good-girls", "title": "NBC's New Show 'Good Girls' Raises a Middle Finger to How Women Are Taught to Behave", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Condé Nast", "copyright": "Copyright (c) Condé Nast 2019", "description": "'Good Girls' stars Christina Hendricks, Mae Whitman, and Retta as three women who are pushed to do things they never thought they'd do.", "keywords": "good girls,christina hendricks,mae whitman,retta,jenna bans,tv", "robots": "index, follow", "og": {"description": "Why the creator of 'Good Girls' created characters who feel 'backed into a corner.'", "image": "https://media.glamour.com/photos/5a9434db99ea9a2ba3431aba/16:9/w_1280,c_limit/_fb.jpg", "site_name": "Glamour", "title": "NBC's New Show Raises a Huge Middle Finger to the Phrase 'Be a Good Girl'", "type": "article", "url": "https://www.glamour.com/story/nbc-good-girls"}, "twitter": {"card": "summary_large_image", "description": "Why the creator of 'Good Girls' created characters who feel 'backed into a corner.'", "domain": "https://www.glamour.com", "image": {"src": "https://media.glamour.com/photos/5a9434db99ea9a2ba3431aba/16:9/w_1280,c_limit/_fb.jpg?mbid=social_retweet"}, "site": "@glamourmag", "title": "NBC's New Show Raises a Huge Middle Finger to the Phrase 'Be a Good Girl'"}, "fb": {"app_id": 101358874221, "pages": 26815555478}}, "movies": [], "publish_date": null, "source": "https://www.glamour.com", "summary": ""}