{"url": "https://www.cosmopolitan.com/entertainment/a19856414/cardi-b-offset-relationship-timeline/", "text": "Pour one out for Kulture's mom and dad: Cardi B confirmed this morning that she and Offset have split following a year of marriage. In a video posted to Instagram, Cardi explained, \"We are really good friends and we are really good business partners—and you know he’s always somebody that I run to to talk to, and we got a lot of love for each other, but things just haven’t been working out between us for a long time.\"\n\nThough brief, their relationship was a complete and utter whirlwind, full of major ups (who could forget Offset's very public—and, I guess, faux—proposal?) and a few downs (ahem, those cheating rumors). Let's take a look back, shall we?\n\nEarly 2017: Offset and Cardi B meet for the first time after Offset notices her immense talent and requests a dinner. As a Migos profile in Rolling Stone tells it:\n\nThe couple met about a year ago at Offset's insistence–while he watched her rise as an artist, his interest grew, then exploded. \"I was like, 'Damn, I am on her!' \" he says. \"I am like, 'Shit, I like Cardi B!' \" He had a publicist set up a dinner in New York for a select group of women, including Cardi.\n\nBut their first real date? Keep reading because your S.O. could never.\n\nFebruary 5, 2017: Offset and Cardi B are spotted at the 2017 Super Bowl—which Offset later says was their first legit date. \"That's a power move!\" he tells Rolling Stone.\n\nBecause life is good, Cardi B Insta Stories the date, and some lovely person compiles the whole thing on YouTube.\n\nFebruary 14, 2017: Cardi B makes the relationship Instagram official with some more footage of their first date—and uses the word \"babe\" to describe Offset.\n\nMay 1, 2017: Cardi B and Offset are spotted at a Met Gala after party, looking, if we may say, FLAWLESS.\n\nSplash News\n\nMay 16, 2017: They release the video for their first collaboration, \"Lick.\"\n\nJuly 24, 2017: Offset buys Cardi B a custom $60k diamond chain, which she adores (who wouldn't, amirite?):\n\nCardi B and Offset at Meek Mill's Concert Tonight pic.twitter.com/7JMZGVMiKj — DailyCardi (@DailyCardi) July 25, 2017\n\nHere's a glorious close-up:\n\nAugust 27, 2017: Cardi B shuts down engagement rumors after fans read into her wearing a white dress. \"It is not true!\" she tells reporters at the VMAs: \"I’m happy. Looking like I’m getting married. But I’m not there.\"\n\nGetty Images\n\nOctober 11, 2017: Offset is out of the country for Cardi B's birthday so he posts a video on Instagram and writes a highly adorable message.\n\nOctober 22, 2017: The pair appear to briefly split up when Cardi B posts a photo to Insta Stories captioned \"single.\"\n\nShe later posts an update, saying she'd exaggerated.\n\nOctober 27, 2017:\n\nCardi B and Offset collaborate again, this time with Migos and Nicki Minaj.\n\nAlso October 27, 2017:\n\nOffset pops the question to Cardi B in the most extra way possible—live onstage during Power 99 radio’s Powerhouse concert at the Wells Fargo Center in Philadelphia. This video of the sweet moment is possibly the best thing your eyeballs will ever have the pleasure of seeing.\n\nOctober 28, 2017: Cardi B shows off her ring in a series of posts on Instagram, writing, \"Thank you for seeing the potential in me since you met me. For giving me advice molding me and loving me. Your such a amazing man to me your family, friends, kids and you are extremely talented.\"\n\nAlso, in case you're wondering, the ring is a massive 8 carats. We know this because Offset tells everyone on Insta Stories.\n\nDecember 21, 2017: Cardi B debuts her single \"Bartier Cardi,\" and fans criticize her for the many, many, many Offset references—including \"Cardi put the pussy on Offset / Cartier, Cardi B brain on Offset.\"\n\nCardi B's response?\n\nDecember 24, 2017: A video leaks of a man who appears to be Offset in bed with another woman. The clip was allegedly filmed in September and stolen from Offset’s iCloud. In a surprising twist, The Shade Room reveals that the reason Cardi B had posted about being single back in October was because she'd learned about his infidelity.\n\nDecember 25, 2017: Cardi B seemingly responds to cheating allegations with a brief yet to-the-point tweet:\n\nI still put the pussy on offset 🤷🏽‍♀️Bartier Cardi — iamcardib (@iamcardib) December 25, 2017\n\nDecember 26, 2017: Cardi B and Offset pretend to have sex on Instagram Live, fully clothed. She later clarifies on Instagram Stories, writing, “I was not f–kin on live! Yaaa can’t be that slow.\"\n\nJanuary 9, 2018: Cardi B responds to cheating rumors about Offset with a now-deleted tweet. \"Why is it a problem that I want to take my time with a decision on my relationship ?\" she writes. \"Why do I have to explain myself? I don’t ask ya why you still with that man that lives with his mom, that don’t pay your bills … Since when you guys had perfect relationship?\"\n\nPer Newsweek, she also writes on Instagram, \"Well if people are talking about it and keep asking me how I feel about the situation why not let them know? Right or wrong? No, it’s not right for a n----- to cheat… But what you want me to do? Go fuck me another n----? Start all over again and get cheated on again? This shit happens to everyone. People handle they relationship different soo.\"\n\nJanuary 14, 2018: The Shade Room once again comes through and posts footage of Offset's new Cardi B neck tattoo. Because nothing makes up for a cheating scandal like a public and extremely permanent declaration of love, right?\n\nFebruary 27, 2018: Cardi B talks about Offset's cheating scandal in an interview with Cosmopolitan (*waves hi*), and implies that she's not guilt-free either. \"It’s like everybody is coming down my neck like, 'Why are you not leaving him? You have low self-esteem.' I don’t have low self-esteem … I know I look good. I know I’m rich, I know I’m talented. I know I could get any man I want—any basketball player, football player. But I want to work out my shit with my man, and I don’t got to explain why. I’m not your property. This is my life ... I’m going to take my time, and I’m going to decide on my decision … It’s not right, what he fucking did—but people don’t know what I did, ’cause I ain’t no angel.\"\n\nApril 7, 2018: Cardi B shocks everyone by announcing her pregnancy *live* on SNL, during a performance in a gorgeous curve-hugging white dress:\n\nHer manager later shares footage of her screaming \"I'm free!\" backstage. Lol.\n\nShe also tweeted about her pregnancy.\n\nI started winning when the whole world was doubting on me !think imma lose with my little baby counting on me ? — iamcardib (@iamcardib) April 8, 2018\n\nAs did Offset.\n\nC A R D I A N D I L O O K F O R W A R D T O O U R N E X T C H A P T E R T O G E T H E R pic.twitter.com/C1QizKV3Cb — OFFSET (@OffsetYRN) April 8, 2018\n\nApril 19, 2018: Cardi B appears on Ellen and reveals that Offset has already picked out a name for their baby. \"My dude named the baby,\" she said. \"I really like the name. I’m gonna let him say the name since he named the baby.\"\n\nJune 25, 2018: Surprise! Turns out, Cardi and Offset have been married since September 2017. Wait, what?! TMZ was able to obtain the couple's marriage license from Fulton County in Georgia. So that highly public proposal was...just for show.\n\nFunnily enough, at the BET Awards the night before the news broke, Offset thanked \"his wife\" onstage when his rap group Migos was accepting an award, which made people wonder if they were already married.\n\nJuly 10, 2018: The baby's here! In a Beyoncé-esque move, Cardi reveals her daughter's name via a floral Instagram pic the day after she gave birth. She captioned the photo, \"Kulture Kiari Cephus.\" What a name! Twitter definitely had plenty to say about it.\n\nBut let's be real. With parents named Belcalis Marlenis Almanzar and Kiari Kendrell Cephus, Kulture couldn't have just any regular ol' name.\n\nSeptember 20, 2018: Cardi B officially confirms that she and Offset have actually been married since September 20, 2017. And in case you were wondering what she wore to her wedding: it was a white tracksuit. Yup. Classic Cardi.\n\nDecember 5, 2018: In an unexpected twist, Cardi takes to Instagram to address all the people \"bugging\" her about her relationship. And as it turns out, she and Offset have fallen \"out of love.\" 😢 In the video, the rapper says, \"It’s nobody fault, it's just, like, I guess we just grew out of love but we are not together anymore.\" Sad.\n\n\n\nJanuary 31, 2018: A week after Cardi B said she missed being home with her family, TMZ reported Cardi B and Offset are getting back together, and Cardi is apparently moving back to their Atlanta home.\n\nInstagram", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/cardi-offset-1524156381.jpg?crop=1xw:1xh;center,top&resize=1200:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-845448648-1544006510.jpg?crop=0.567xw:0.425xh;0.196xw,0.139xh&resize=300:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/cardi-offset-1524156381.jpg?crop=1xw:1xh;center,top&resize=1200:*", "keywords": [], "authors": ["Mehera", "Mehera Bonner Is A News Writer Who Focuses On Celebrities", "Royals"], "canonical_link": "https://www.cosmopolitan.com/entertainment/a19856414/cardi-b-offset-relationship-timeline/", "title": "A Definitive Timeline of Cardi B and Offset's Relationship", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "A Definitive Timeline of Cardi B and Offset's Relationship", "description": "R.I.P.", "url": "https://www.cosmopolitan.com/entertainment/a19856414/cardi-b-offset-relationship-timeline/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/cardi-offset-1524156381.jpg?crop=1xw:1xh;center,top&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "modified_time": "2019-01-31 03:42:06", "published_time": "2018-12-05 07:32:00", "section": "Celebrities & Entertainment"}, "twitter": {"site": "@Cosmopolitan", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/cardi-offset-1524156381.jpg?crop=1xw:1xh;center,top&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "Rappers Cardi B and Offset's Relationship Timeline - Why Did Cardi B and Offset Split?", "description": "News broke today that Cardi B and Offset have split following a year of marriage. Catch up on all the couple's ups and downs here.", "keywords": "offset, cardi b, offset cardi b, offset cardi b relationship timeline, offset cardi b relationship, cardi b fiance, cardi b engaged, cardi b husband, cardi b boyfriend, cardi b baby daddy", "auto-publish": "evergreen", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/cardi-offset-1524156381.jpg?crop=0.5xw:1xh;center,top&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebrities & Entertainment,entertainment", "sailthru.date": "2018-12-05T19:32:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/cardi-offset-1524156381.jpg?crop=1xw:1xh;center,top", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/cardi-offset-1524156381.jpg?crop=0.5xw:1xh;center,top", "sailthru.socialtitle": "A Definitive Timeline of Cardi B and Offset's Relationship", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1544013120.0, "source": "https://www.cosmopolitan.com", "summary": ""}