{"url": "https://en.wikipedia.org/wiki/Lady_Antebellum", "text": "This article is about the group. For the group's self titled debut album, see Lady Antebellum (album)\n\nLady Antebellum is an American country music group formed in Nashville, Tennessee in 2006. The group is composed of Hillary Scott (lead and background vocals), Charles Kelley (lead and background vocals, guitar), and Dave Haywood (background vocals, guitar, piano, mandolin). Scott is the daughter of country music singer Linda Davis, and Kelley is the brother of pop singer Josh Kelley.\n\nThe group made its debut in 2007 as guest vocalists on Jim Brickman's single \"Never Alone\", before signing to Capitol Nashville. Lady Antebellum has released six albums for Capitol: Lady Antebellum, Need You Now, Own the Night, Golden, 747, and Heart Break, plus one Christmas album (On This Winter's Night). Their first three albums are certified platinum or higher by the Recording Industry Association of America (RIAA). The albums have produced sixteen singles on the Hot Country Songs and Country Airplay charts, of which nine have reached number one. Their longest-lasting number one single is \"Need You Now\", which spent five weeks at that position in 2009; both that song and 2011's \"Just a Kiss\" reached number one on the Adult Contemporary charts.\n\nLady Antebellum was awarded Top New Duo or Group by the Academy of Country Music and New Artist of the Year by the Country Music Association in 2008. They were nominated for two Grammy Awards at the 51st Annual Grammy Awards and two more at the 52nd Annual Grammy Awards. Of these nominations, they took home the award for Best Country Performance by Duo or Group with Vocals for \"I Run to You\". They were awarded Top Vocal Group, Song of the Year (\"Need You Now\"), and Single of the Year (\"Need You Now\") at the 44th ACM Awards on April 18, 2010. They won five awards at the 53rd Annual Grammy Awards, including Song of the Year and Record of the Year for \"Need You Now\".[1] Lady Antebellum also scored \"Best Country Album\" at the 54th Grammy Awards. By August 2013, the group had sold more than 12.5 million digital singles and 10 million albums in the United States.[2][3]\n\nHistory [ edit ]\n\n2006–2007: Formation and early career [ edit ]\n\nLady Antebellum was formed in 2006,[4] in Nashville, Tennessee, by Charles Kelley, Dave Haywood, and Hillary Scott. Scott is the daughter of country music singer Linda Davis, best known for her duet vocals on Reba McEntire's 1993 hit \"Does He Love You\",[5] and Charles Kelley is the brother of pop and country artist Josh Kelley.[6] Hillary Scott attended Donelson Christian Academy in Donelson, Tennessee. Kelley moved to Nashville in mid-2005 from Winston-Salem, North Carolina, where he had been working construction with his brother John. Trying to become a successful solo country artist, Kelley convinced his old middle-school classmate, Haywood, to move to Nashville from Georgia in 2006 so they could write music together. Shortly thereafter, Scott recognized Kelley from Myspace, and they started to talk at a Nashville music club. Kelley invited Scott to join him and Haywood in the new group, which assumed the name Lady Antebellum.[7]\n\nOn the BBC Radio 2 Drivetime Show August 9, 2010, the band explained that the name comes from when the group did a photo shoot in historical costumes at antebellum houses. In American history, the Antebellum era was the period before the Civil War in the Southern United States, before slavery was abolished. The trio then began performing at local venues in Nashville before being signed in July 2007 to a recording contract with Capitol Records Nashville. In an interview with Sirius Satellite Radio, Scott said she was rejected from auditions for American Idol twice, not even making it past the first round.[5]\n\nThe name \"Lady Antebellum\" has been criticized for glorifying an era of the American South in which society revolved around the institutionalized slavery of black people.[8]\n\n2007–2009: Lady Antebellum [ edit ]\n\nLady Antebellum performs in concert in 2008, showing Charles Kelley and Hillary Scott\n\nShortly after the trio signed to the label, recording artist Jim Brickman chose Lady Antebellum to sing on his 2007 single \"Never Alone,\" which reached No. 14 on the Billboard adult contemporary charts. In mid-2007, Lady Antebellum also wrote a song for the MTV reality television series The Hills.[9]\n\nTheir solo debut single \"Love Don't Live Here\" was released in September 2007, with a music video for the song following in December.[10][11] This song was the lead-off single to the band's self-titled debut album. Released on April 15, 2008, Lady Antebellum was produced by Paul Worley along with Victoria Shaw, a Nashville songwriter and former solo artist.[4] \"Love Don't Live Here\" reached No. 3 on the Billboard Hot Country Songs charts. The album itself was the first album by a new duo or group to debut at Number One on the Billboard Top Country Albums charts.[12]\n\nA second single, \"Lookin' for a Good Time\", was released in June 2008 and peaked at No. 11 in December. In addition, Lady Antebellum was signed as an opening act on Martina McBride's Waking Up Laughing Tour in 2008.[13]\n\nLady Antebellum also contributed the song \"I Was Here\" to the AT&T Team USA Soundtrack, a song which peaked at No. 24 on the Bubbling Under Hot 100 based on downloads. In December 2008, their rendition of \"Baby, It's Cold Outside\" peaked at No. 3 on the same chart. Their third official single, \"I Run to You\", was released in January 2009. It eventually became the trio's first Number One in July 2009. On October 7, 2009, their debut album was certified platinum by the RIAA for shipments of one million copies in the United States.\n\nHaywood and Kelley co-wrote labelmate Luke Bryan's 2009 single \"Do I\", on which Scott also sings backing vocals.[14] This song is the first single from Bryan's second studio album \"Doin' My Thing\", which was released on October 6, 2009.\n\n2009–2011: Need You Now [ edit ]\n\nIn August 2009, the group released their fourth single, \"Need You Now\", the lead-off single and title track to their second studio album, which was also produced by Worley. It debuted at No. 50 on the Billboard Hot Country Songs chart and became their second Number One hit on the charts for the week of November 28, 2009. The song also reached No. 2 on the Billboard Hot 100 and topped the Hot Adult Contemporary chart, making it a crossover hit. A second single, \"American Honey\", was released to radio on January 11, 2010 and would become their third No. 1 hit. The third single from the album, \"Our Kind of Love\", was released on May 31, 2010 and went No. 1 in September 2010. The song was notable for being written in collaboration with a non-Nashville songwriter in busbee, who at that point had previously written for Katy Perry, Timbaland and Katharine McPhee.[15] Their fourth single from this album, \"Hello World\", was officially released on October 4, 2010.\n\nThe album was released on January 26, 2010 and debuted at No. 1 on the Billboard 200 and Top Country Albums charts for the week of February 2, 2010, selling 480,922 copies.[16] Four weeks after the album's release, it was certified platinum by the Recording Industry Association of America.[17] On April 28, 2010, they performed on the results show of American Idol, performing \"Need You Now\". On September 20, 2010, they launched their first headlining tour, \"Need You Now 2010\" in Orlando, Florida. On October 28, 2010, they performed the National Anthem before Game 2 at the 2010 World Series. Lady Antebellum appeared on the 44th Annual Country Music Awards on November 10, 2010.[18]\n\n2011–2012: Own the Night and On This Winter's Night [ edit ]\n\nThe week of January 9, 2011, the group ventured into the studio to begin recording for their third studio album. In an interview with Entertainment Weekly, Charles Kelley said, \"We actually just went ahead and decided we’re gonna take two, two and a half months straight in the studio to create this thing and not have all this distraction. Hopefully that will be a good thing\".[19]\n\nOn May 2, 2011, the group released the first single from their upcoming album, titled \"Just a Kiss\". The group performed the single on stage on American Idol's result show on May 5, 2011. It was a commercial and critical success, debuting and peaking at number 7 on the Billboard Hot 100, making it their highest debut on the chart. It also topped the Billboard Hot Country Songs, making it their fifth number-one single on the chart. On June 7, 2011, they announced the title of third album; called Own the Night, it was released on September 13, 2011.[20] The album cover and track listing was released on July 18, 2011.[21] All together, four singles were released from Own the Night. Follow-up singles were \"We Owned the Night\", \"Dancin' Away with My Heart\", and \"Wanted You More\", which charted moderately in the Hot Country Songs.\n\nLady A released a \"Lady Hazed\" version of Jason Aldean's song \"Dirt Road Anthem\" entitled \"Country Club Anthem\" on their installment of Webisode Wednesdays on August 10, 2011.[22] On October 1, 2011, the group performed as the musical guests on Saturday Night Live.[23]\n\nLady Antebellum released their first Christmas album On This Winter's Night on October 22, 2012.[24]\n\n2013–2016: Golden, 747, and hiatus [ edit ]\n\nOn January 22, 2013, \"Downtown,\" the first single from a new album, was released to country radio. It was made available on iTunes starting February 5, 2013, and reached number one on the Country Airplay chart in April 2013. The new album, Golden, was released on May 7, 2013.[25] The album's second single, \"Goodbye Town\", was released to country radio on May 13, 2013, and peaked at number 11 on the Country Airplay chart. The third single from the Golden era, \"Compass\", was released to the iTunes Store on October 1, 2013 and reached number one on the Country Airplay chart in March 2014. It is one of the new recordings featured on the deluxe edition re-issue of Golden, which was released on November 12, 2013. Unlike all of their previous releases, it was produced by Nathan Chapman.[26] They also sang backing vocals on Darius Rucker's 2013 single \"Wagon Wheel\".[27]\n\n\"Bartender\" was released to country radio on May 12, 2014, as the lead single for the group's sixth studio album, and was made available to digital retailers on May 19.[28] In July 2014, the album's title was confirmed as 747, and the track listing was confirmed. Chapman produced this album as well.[29] \"Bartender\" became the group's ninth number 1 hit on the Country Airplay charts in 2014, with \"Freestyle\" as the second single. The third single \"Long Stretch of Love was released on February 7, 2015, in the UK and on March 23, to country radio in the US.\n\nThey sang two songs, \"I Did With You\" and \"Falling For You\", for the 2014 film The Best of Me.\n\nIn October 2015, while appearing on Good Morning America, the group announced that they would be taking some down time once they finish with their Wheels Up Tour. During their break Kelley will be working on his solo career. Kelley stated that Lady Antebellum is his priority but wanted to try working alone out. On September 28, 2015, he released his debut solo single titled \"The Driver\" which features Dierks Bentley and Eric Paslay.[30] On October 12, 2015, Charles Kelley announced his tour dates for his solo tour. He is excited to get out of his comfort zone and having fans not know every word to all of his songs. He will be playing some Lady A songs, but his tour will showcase only his soon-to-be-released solo material.[31] Also during the break, Hillary Scott announced that she and her family (her mother, father and sister) would be working a gospel album titled Love Remains which was released on 29 July.\n\nIn 2016, Lady Antebellum were selected as one of 30 artists to perform on \"Forever Country\", a mash-up track of Take Me Home, Country Roads, On the Road Again and I Will Always Love You which celebrates 50 years of the CMA Awards.[32]\n\n2017–2018: Heart Break and label change [ edit ]\n\nOn January 19, 2017, they released \"You Look Good\" as the lead single off their upcoming seventh studio album Heart Break. It released on June 9, 2017, and is further promoted with the \"You Look Good World Tour\", which began on May 26 and ended on October 15, 2017.[33] The titular track was released as the second single on September 25, 2017. Heart Break is nominated for Best Country Album, and \"You Look Good\" is nominated for Best Country Duo/Group Performance at the 60th Annual Grammy Awards. The band co-headlined the Summer Plays On Tour with Darius Rucker starting in mid-2018.\n\nIn August 2018, Lady Antebellum ended its recording contract with Capitol Nashville and signed with Big Machine Records.[34]\n\n2019-present: Las Vegas residency, new singles and upcoming eighth album [ edit ]\n\nOn October 24, 2018, the band announced that they would headlining a residency at the Palms Casino Resort's Pearl Concert Theater in Las Vegas in 2019. The fifteen date Our Kind of Vegas residency began in February 2019.[35]\n\nIn March 2019, the band headlined the C2C: Country to Country festival in London and Dublin for the second time (having previously headlined in 2015) and for the first time in Glasgow. At the London show on 9 March, they announced they have been working on new music and performed two new songs, \"What If I Never Get Over You\" and \"Be Patient With My Love\".\n\nTheir first single on Big Machine, \"What If I Never Get Over You,\" was released on May 17, 2019, along with the music video.[36]\n\nCharity [ edit ]\n\nSince January 2012, Lady Antebellum has been partnered with the charity myLIFEspeaks, to raise awareness of and provide facilities for disabled orphans in Haiti. At the start of the year 2013, the members of the group also created the organization called LadyAID, which was created in hopes of bringing awareness to children who suffer and cannot help themselves locally, nationally and around the world. The main focus of Lady Antebellum are the children in hospitals, mainly in the United States and Canada.[37][38]\n\nAwards and nominations [ edit ]\n\nLady Antebellum in April 2010\n\nSince Lady Antebellum won the Country Music Association Awards New Artist of the Year award in 2008, they have accumulated seven more awards, including their first Grammy in 2010 for Best Country Performance by Duo or Group with Vocals. At the 2009 CMAs, the group ended Rascal Flatts' six-year reign as Vocal Group of the Year. At the 2010 CMAs, the group became the first artist in CMA Award history to receive the Single of the Year honor for two consecutive years.[39]\n\nAt the 53rd Annual Grammy Awards, the trio won the Song of the Year.[40] They won Top Vocal Group at the 2012 ACM Awards April 1, 2012.[41]\n\nIn addition to being honored, Lady Antebellum has made efforts to recognize veterans who have returned from service and contributed to their communities. In 2013, Lady Antebellum recognized 8 deserving military families for their service by inviting them to up close and personal concerts, and acknowledging them from the stage.[42]\n\nDiscography [ edit ]\n\nTours and residencies [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/06/Lady_A_-_Charlotte_12-27-12-39.jpg/300px-Lady_A_-_Charlotte_12-27-12-39.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/06/Lady_A_-_Charlotte_12-27-12-39.jpg/1200px-Lady_A_-_Charlotte_12-27-12-39.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d8/LadyAntebellumAwardsApr10.jpg/220px-LadyAntebellumAwardsApr10.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Lady_Antebellum_2008.jpg/220px-Lady_Antebellum_2008.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/06/Lady_A_-_Charlotte_12-27-12-39.jpg/1200px-Lady_A_-_Charlotte_12-27-12-39.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Lady_Antebellum", "title": "Lady Antebellum", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.13", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/06/Lady_A_-_Charlotte_12-27-12-39.jpg/1200px-Lady_A_-_Charlotte_12-27-12-39.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}