{"url": "https://www.unilad.co.uk/viral/josh-brolins-wife-hilariously-trolls-him-over-the-size-of-his-penis/", "text": "PA\n\nJosh Brolin’s wife Kathryn has trolled him over the size of his penis for all of social media to see.\n\nThere’s no beating around the bush here, it’s a damper on an otherwise terrific year for the 50-year-old actor. In 2018 alone he has starred in two of the biggest releases in the last seven months, Avengers: Infinity War and Deadpool 2.\n\nHe is currently promoting Sicario: Day of the Soldado before heading off, presumably, to film the next Avengers.\n\nBut yeah, to keep him humble, wife of two years Kathryn has brought him down to size – quite literally – by making a jibe at his manhood on the ‘Gram\n\n‘Josh I think those are too big for you,’ she says, in a video of Brolin walking around a supermarket with some Magnum XL condoms.\n\n‘They’re not!’ he snaps back before sulking off. It’s classic Brolin banter.\n\nJust a few months ago, while getting stacked for Deadpool 2, Brolin dropped trou to promote the business he set up with Kathryn, Prevail Activewear.\n\nHe talked about the intentions and desires of the brand below the black and white snap.\n\nHe wrote:\n\nAn apparel which induces total insanity, enables you to talk in tongues, and uber-familiarises you with your package. Our goal to is to live in the gym, never leave, consume only from shaker bottles, and pose in front of a myriad of mirrors until we melt from narcissism gigantica. Our hope is that we sell everything so well be left with nothing to wear.\n\nRipped, innit? His pre-production workout/diet regime worked so well even ex-pro wrestler and fellow inhabitant of the Marvel Cinematic Universe Dave Bautista complimented him in the gym.\n\nBrolin wrote on Instagram at the time:\n\nTotally clean: no sugar, no breads, no pastas, no drugs, none of it. Fish, rice, eggs, veggies, water, one @bulletproof or @cavemancoffeeco in the morning. I’m almost 50. It’s a different time: our access along with some big picture discipline results in always surprising milestones. Get on the train.\n\nDeadpool 2 was released in the United States on May 18, 2018. It has grossed over a whopping $733 million worldwide, making it the fifth highest-grossing film of 2018, as well as the third highest-grossing R-rated film and the third highest-grossing X-Men film.\n\nTalking about his eagerness to play Cable in the sequel he told Screen Rant:\n\nI mean, a good story is a good story and I never told myself… I agree with you. I was the kind of the same way. I was like, I just don’t see that, you know, and I like doing these other types of movies and whatever that means, and we kind of dipped our fingers into Jonah Hex and that didn’t turn out so well. So I was like, you know, I had an intention for that movie and I didn’t reach it. So I kind of stayed away from that thing but you know, there’s something that happens when you have the opportunity first when Kevin Fiege [sic] is talking to you and from a really like a fan, you know, base point of view and he’s saying, we thought of this great story and we always saw you doing it, you know, and it’s not the compliments necessarily, but it’s like all the Avengers against you.\n\nNice to everything paid off in the end. Even if his business is mediocre at best.\n\nIf you have a story you want to tell send it to UNILAD via [email protected]", "images": ["https://www.unilad.co.uk/wp-content/uploads/2019/07/meerkat3-140x140.jpg", "https://www.unilad.co.uk/wp-content/uploads/2019/07/video1-140x140.jpg", "https://www.unilad.co.uk/wp-content/uploads/2019/07/tape1-140x140.jpg", "https://www.unilad.co.uk/wp-content/uploads/2018/07/Screen-Shot-2018-07-24-at-19.38.06.png", "https://www.unilad.co.uk/wp-content/uploads/2019/07/friends-cast-pottery-02-140x140.jpg", "https://www.unilad.co.uk/wp-content/uploads/2019/04/unilad-logo-small-140x140.png", "https://www.unilad.co.uk/wp-content/uploads/2019/07/zamora1-140x140.jpg", "https://www.unilad.co.uk/wp-content/uploads/2018/07/joshbrolin.jpg"], "top_img": "https://www.unilad.co.uk/wp-content/uploads/2018/07/joshbrolin.jpg", "keywords": [], "authors": ["Josh Teal"], "canonical_link": "https://www.unilad.co.uk/viral/josh-brolins-wife-hilariously-trolls-him-over-the-size-of-his-penis/", "title": "Josh Brolin’s Wife Hilariously Trolls Him Over The Size Of His Penis", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=5.0", "HandheldFriendly": "true", "format-detection": "email=no", "copyright": "UNILAD", "article": {"published_time": "2018-07-24T18:59:03+00:00", "publisher": "https://www.facebook.com/uniladmag/", "author": "https://www.facebook.com/josh.teal.31", "section": "Viral"}, "fb": {"app_id": 928163853866873, "pages": 222964178047232}, "description": "He is currently promoting Sicario: Day of the Soldado before heading off, presumably, to film the next Avengers.", "og": {"locale": "en_GB", "type": "article", "title": "Josh Brolin's Wife Hilariously Trolls Him Over The Size Of His Penis", "description": "Little chance of getting over this.", "url": "https://www.unilad.co.uk/viral/josh-brolins-wife-hilariously-trolls-him-over-the-size-of-his-penis/", "site_name": "UNILAD", "image": {"identifier": "https://www.unilad.co.uk/wp-content/uploads/2018/07/joshbrolin.jpg", "secure_url": "https://www.unilad.co.uk/wp-content/uploads/2018/07/joshbrolin.jpg", "width": 1200, "height": 630, "alt": "Josh Brolin"}}, "twitter": {"card": "summary_large_image", "description": "He is currently promoting Sicario: Day of the Soldado before heading off, presumably, to film the next Avengers.", "title": "Josh Brolin's Wife Hilariously Trolls Him Over The Size Of His Penis", "site": "@unilad", "image": "https://www.unilad.co.uk/wp-content/uploads/2018/07/joshbrolin.jpg", "creator": "@unilad"}}, "movies": [], "publish_date": 1532462343.0, "source": "https://www.unilad.co.uk", "summary": ""}