{"url": "https://en.wikipedia.org/wiki/Scott_Peterson", "text": "For other people named Scott Peterson, see Scott Peterson (disambiguation)\n\nNot to be confused with Drew Peterson , an individual with a similar name and criminal case.\n\nScott Lee Peterson[1] (born October 24, 1972) is an American convicted murderer who is currently on death row in San Quentin State Prison. In 2004, he was convicted of the first-degree murder of his pregnant wife Laci Peterson and the second-degree murder of their unborn son Conner in Modesto, California, and in 2005, he was sentenced to death by lethal injection. His case is currently on automatic appeal to the Supreme Court of California.\n\nEarly life and marriage [ edit ]\n\nScott Lee Peterson was born October 24, 1972, at Sharp Coronado Hospital in San Diego, California, to Lee Arthur Peterson, a businessman who owned a crate-packaging company, and Jacqueline \"Jackie\" Helen Latham,[2][3][4] who owned a boutique in La Jolla called The Put On.[2] Though Lee and Jackie had six children from previous relationships, Scott was their only child together.[3][4] As a child, he shared a bedroom with his half-brother John in the family's two-bedroom apartment in La Jolla.[2]\n\nPeterson began playing golf at an early age, a result of time he spent with his father. By age 14, he could beat his father at the game. For a time, he had dreams of becoming a professional golfer like Phil Mickelson, his teammate at the University of San Diego High School.[3] By the end of high school, he was one of the top junior golfers in San Diego.[2] In 1990, Peterson enrolled at Arizona State University (where Mickelson had also enrolled) on a partial golf scholarship.[5] Mickelson would go on to become a highly successful PGA golfer,[6] and Lee Peterson later testified that the considerable competition that Mickelson presented to his son while they were at Arizona State discouraged Peterson. Randall Mell of the Broward County, Florida Sun-Sentinel reported that Chip Couch, the father of another Arizona State golfer, Chris Couch, told Mell that he got Peterson kicked off the golf team. Couch stated that Peterson had taken Chris out drinking and to meet girls, resulting in a hangover for Chris. As Chris was the No. 1 junior in the country, Chip did not want Peterson to threaten his son's future, and complained to the golf coach, who kicked Peterson off the team. Peterson transferred to Cuesta College in San Luis Obispo, and later, California Polytechnic State University.[7] He initially planned to major in international business, but changed his major to agricultural business. Professors who taught Peterson described him as a model student. His agribusiness professor Jim Ahern commented, \"I wouldn't mind having a class full of Scott Petersons.\"[2]\n\nWhile at California Polytechnic, Peterson worked at a restaurant in Morro Bay called the Pacific Café. One of his co-workers would receive visits from a neighbor named Laci Denise Rocha, who also attended Cal Poly[2][8] as an ornamental horticulture major.[2] When Peterson and his future wife first met at the restaurant in mid-1994, Laci made the first move, sending him her phone number. Immediately after meeting him, Laci told her mother that she had met the man that she would marry. Peterson later called Laci and they began dating, their first date being a deep-sea fishing trip on which Laci got seasick.[8] As Peterson's relationship with Laci grew more serious, he put aside his dreams of professional golf in order to focus on a business path.[3] The couple dated for two years[8] and eventually moved in together.[2] In 1997, after Laci graduated, they married at Sycamore Mineral Springs Resort in San Luis Obispo County's Avila Valley.[2][5] While Peterson finished his senior year, Laci took a job in nearby Prunedale. Prosecutors have stated that around this time, Peterson engaged in the first of at least two extramarital affairs, though they have not revealed a name or details of each relationship. Peterson graduated with a Bachelor of Science degree in agricultural business in June 1998.[2] After their graduations, the Petersons opened a sports bar in San Luis Obispo called The Shack.[2][3][8] Contrary to a Los Angeles Times story that reported that Peterson's parents loaned him money to open the establishment,[3] his parents emphatically told the San Francisco Chronicle that they did not, believing it was a bad investment. When the couple had difficulty finding a technician to install a needed vent in the restaurant, Peterson took the necessary certification course in Los Angeles in order to install it himself. Business was initially slow, but eventually improved, especially on weekends.[2] The Petersons sold The Shack in 2000 when they moved to Laci's hometown of Modesto to start a family.[3][8] In October 2000, they purchased a three-bedroom, two-bath bungalow house for $177,000 on Covena Avenue in an upscale neighborhood near La Loma Park.[2][3]\n\nLaci soon took a part-time job as a substitute teacher,[3] and Peterson got a job with Tradecorp U.S.A., a newly founded subsidiary of a European fertilizer company.[9] According to Lee Peterson, the Spanish company was trying to establish a customer base in the United States, and hired Peterson as their West Coast representative. Working on salary plus commission, he sold irrigation systems, fertilizer, chemical nutrients, and related products to big farms and flower growers, primarily in California, Arizona, and New Mexico.[3] Peterson was earning a salary of $5,000 a month before taxes.[9] Laci's loved ones, including her mother and younger sister, related that she worked enthusiastically at being the perfect housewife, enjoying cooking and entertaining, and that she and her family welcomed the news in 2002 that she was pregnant.[3] In November 2002, when Laci was seven months pregnant, Peterson was introduced by a friend to a Fresno massage therapist named Amber Frey. In later public statements, Frey said Peterson told her he was single, and the two began a romantic relationship. The last time Peterson's parents saw Laci was during a three-day weekend they spent together in Carmel, California the week before Christmas.[9]\n\nDisappearance of Laci Peterson [ edit ]\n\nOn December 23, 2002 at 5:45pm, Peterson and Laci went to Salon, Salon, the workplace of Laci's sister, Amy Rocha, where Amy cut Peterson's hair, as she did each month.[10] As they spoke, Rocha said Peterson offered to pick up a fruit basket that she had ordered for her grandfather as the Christmas gift the next day because he would be playing golf at a course nearby. Prosecutors say Peterson also told other people he would play golf on the day of Christmas Eve.[10][11] Later that evening, Sharon spoke with Laci on the telephone around 8:30 pm.[12]\n\nPeterson later told police that he last saw his wife about 9:30 a.m. on December 24, when he left to go fishing at the Berkeley Marina. He said Laci was watching a cooking television show but was preparing to mop the floor, bake cookies and walk the family dog to a nearby park.[13][14][15] The next morning a female neighbor of the Petersons says she found the Petersons' dog, a Golden Retriever named McKenzie, and returned him to the Petersons' back yard. About a half hour later, shortly after 10:45am, another neighbor named Mike Chiavetta said he found McKenzie[16] wandering the neighborhood with a muddy leash, and returned him to the Petersons' yard.[17] Peterson said he returned home that afternoon to find it empty.[13] Peterson found McKenzie in their back yard,[18] and Laci's 1996 Land Rover Discovery SE was in the driveway.[19] He showered and washed his clothes because he got wet from fishing.[13]\n\nAccording to ABC News, Peterson reported his wife Laci missing from their Modesto home.[20] However, the New York Post reported that when Laci still had not returned home by 5:15 p.m., Peterson called his mother-in-law, and that a half-hour later, Laci's stepfather, Ron Grantski, called the police.[13] The Modesto Bee also attributes the first call to police to Grantski.[21] Laci was seven-and-a-half months pregnant[20] with a due date of February 10, 2003. The couple had planned to name the baby boy Conner.[22][23] The exact date and cause of Laci's death were never determined.[24][25] Peterson reported Laci missing on Christmas Eve,[24][26] and the story attracted nationwide media interest.[27][28][29] After police arrived at the Peterson home, Laci's keys, wallet and sunglasses were found in her purse in a closet at the home the evening of December 24.[13][30] The dining room table was meticulously set for a family dinner the following night. One detective found a phone book on a kitchen counter, opened to a full-page ad for a defense lawyer. Peterson was reported to be completely calm.[13] Modesto police detective Jon Buehler and Allen Brocchini, the lead investigators on the case, questioned Scott Peterson that evening.[20] Although Scott initially said he had spent the day golfing, he later told the police that he had gone to fish for sturgeon at the Berkeley Marina. At 2:15 p.m., he left a message for Laci, stating, \"Hey, Beautiful. It's 2:15. I'm leaving Berkeley.\"[13] Peterson stated that he went fishing about 90 miles from the couple's Modesto home. Detectives immediately launched a search, but were surprised by Scott Peterson's behavior. Buehler told ABC News in 2017, \"I suspected Scott when I first met him. Didn't mean he did it, but I was a little bit thrown off by his calm, cool demeanor and his lack of questioning ... he wasn't, 'Will you call me back? Can I have one of your cards? What are you guys doing now?'\"[20]\n\nModesto police did not immediately reveal to the public that Peterson was a suspect, largely because Laci's family and friends maintained their faith in his innocence during the month following her disappearance. The police did treat the case as suspicious within the first few hours after the missing persons report was filed.[31] Eventually, the police grew more suspicious of Peterson due to inconsistencies in his story. On January 17, 2003, it became known that Peterson had engaged in two other extramarital affairs prior to Amber Frey.[32] Frey approached the police about Peterson, whom she had just begun to date, after learning that he was actually married to a missing woman.[33] At a January 24, 2003, press conference[34] the Rocha family publicly withdrew their support of Peterson,[35] explaining that they did this upon learning of his affair with Frey,[36] in particular upon seeing photos of Peterson and Frey together.[37] Laci's brother, Brent Rocha, stated that although Peterson had admitted to an earlier affair a year earlier in a January 16, 2003 phone conversation, following Laci's disappearance Peterson had ceased communicating with the Rocha family in regards to what happened to her.[35] They later said that they were angered not by the affair, but by the fact that Peterson had told Frey that he'd \"lost his wife\" on December 9, 2002 – 14 days before she disappeared,[13] and that he would be spending his first Christmas without her. Police later speculated whether this was an indication that Peterson had already decided to kill Laci,[38] which Sharon Rocha agreed was a possibility.[39]\n\nFrey agreed to let the police tape her subsequent phone conversations with Peterson in the hopes of getting him to confess.[40] During the trial, the audio recordings of the couple's telephone conversations were played, and the transcripts were publicized. The recordings revealed that in the days after Laci went missing, Peterson told Frey that he had traveled to Paris to celebrate the holidays, in part with his new companions Pasqual and François. In reality, he had made one of these phone calls while attending the New Year's Eve candlelight vigil for Laci in Modesto.[41]\n\nRecovery of Laci and Conner's remains [ edit ]\n\nOn April 13, 2003, a couple walking their dog found the decomposing but well-preserved body of a late-term male fetus in a marshy area of the San Francisco Bay shore in Richmond's Point Isabel Regional Shoreline park, north of Berkeley.[42][43] Its umbilical cord was still attached.[44] Although a judge sealed autopsy results, an anonymous Associated Press source revealed that 1.5 loops of nylon tape were found around the fetus' neck and a significant cut was on the fetus' body.[45] One day later, a passerby found the body of a recently pregnant woman, wearing beige pants and a maternity bra, washed up on the eastern shore of the bay,[43][46][47] along a rocky shoreline of the same park,[43] one mile away from where the baby's body was found.[43][47]\n\nThe corpse was decomposed to the point of being almost unrecognizable as a human body. The woman had been decapitated, parts of her limbs were missing,[48] including most of her legs,[49] and plastic tape was wrapped around the neck of her child.[48] On April 18, 2003, the results of DNA tests verified that they were the bodies of Peterson and her son Conner.[43][50] The autopsy on both bodies was performed by forensic pathologist Dr. Brian Peterson (no relation to the Petersons).[51] According to the autopsy, Conner's skin was not decomposed at all, though the right side of his body was mutilated, and the placenta and umbilical cord were not found with the body.[48] Laci's cervix was intact. The cause of death was never determined.[48] The exact date and cause of Laci's death were never determined.[24][52] She had suffered two cracked ribs, though Dr. Peterson could not determine if this occurred before or after her death.[53] Peterson's upper torso had been emptied of internal organs except for the uterus, which protected the fetus, explaining the lower level of decomposition it experienced.[49] Dr. Peterson determined that the fetus had been expelled from Peterson's decaying body, though he could not determine whether the fetus had been born alive or dead.[51]\n\nThe discovery of the bodies created a greater sense of urgency for Brocchini and Buehler, who had put a tracker on Peterson's car. Knowing that he was in San Diego at the time, they feared he would escape across the border to Mexico. Brocchini commented in 2017, \"I just thought, 'We've got to find Scott right now. He told me he was there and that’s where the bodies come up? I mean, I believe it was premeditated, he planned it... San Diego was pretty darn close to the Mexican border. Scott knew the area pretty well. That's where his parents lived. That's where he lived. So it wasn't like he was going to have to get on MapQuest to try and figure out a way to get to Tijuana.\"[20]\n\nThe FBI and Modesto Police Department performed forensic searches of Peterson's home.[54] The FBI also conducted mitochondrial DNA testing on a hair from pliers found in Peterson's fishing boat that linked them with hairs recovered from Laci's hairbrush.[55] The authorities also searched Peterson's pickup truck, toolbox, warehouse, and boat.[56] After Peterson was arrested, police conducted further searches in the bay in an attempt to locate hand-made concrete anchors they believe weighed down Laci's body while it was under water; nothing was found.[57]\n\nArrest [ edit ]\n\nPeterson was arrested on April 18, 2003,[58] near a La Jolla golf course.[59] He claimed that he was meeting his father and brother for a game of golf.[60] His naturally dark brown hair had been dyed blond,[61] and his Mercedes-Benz was \"overstuffed\" with miscellaneous items, including nearly $15,000 in cash, twelve Viagra tablets, survival gear,[62] camping equipment,[60][63] several changes of clothes, four cell phones,[63] and his brother's driver's license, in addition to his own.[61][63] Peterson's father explained that he used his brother's license the day before to get a San Diego resident discount at the golf course, and that Peterson had been living out of his car because of the media attention.[63] However, police feared these items were an indication that Peterson planned to flee to Mexico, an idea with which prosecutors would later concur.[63][64]\n\nOn April 21, 2003, Peterson was arraigned before Judge Nancy Ashley in Stanislaus County Superior Court. He was charged with two felony counts of murder with premeditation and special circumstances: the first-degree murder of Laci, and the second-degree murder of Conner. He pleaded not guilty.[65]\n\nTrial [ edit ]\n\nBefore his arraignment, Peterson had been represented by Kirk McAllister, a veteran criminal defense attorney from Modesto. Chief Deputy Public Defender Kent Faulkner was also assigned to the case. Peterson later indicated that he could afford a private attorney, namely Mark Geragos, who had done other high-profile criminal defense work.[66] On January 20, 2004, a judge changed the venue of the trial from Modesto to Redwood City, because Peterson was the victim of increasing hostility in the Modesto area.[67]\n\nPeterson's trial began on June 1, 2004,[65] and was followed closely by the media. The lead prosecutor was Rick Distaso. Geragos led Peterson's defense. Prosecution witness Frey engaged her own attorney, Gloria Allred, to represent her. Allred was not bound by the gag order imposed on those involved in the trial. Although she maintained that her client had no opinion about whether Peterson was guilty, Allred was openly sympathetic to the prosecution. She appeared frequently on television news programs during the trial.[68][69]\n\nPeterson's defense lawyers based their case on the lack of direct evidence and played down the significance of circumstantial evidence.[70] They suggested that the fetal remains were of a full-term infant and theorized that someone kidnapped Laci, held her until she gave birth, and then dumped both bodies in the bay. The prosecution's medical experts contended that the baby was not full term and died at the same time as his mother.[71] Geragos suggested that a Satanic cult kidnapped the pregnant woman.[72] He claimed Peterson was \"a cad\" for cheating on Laci, but was not a murderer.[70]\n\nJuror Frances Gorman was removed and replaced early in the trial due to misconduct. Jury foreman and attorney Gregory Jackson later requested his own removal during jury deliberations, most likely because his fellow jurors wanted to replace him as foreman.[73][74][75] Geragos told reporters that Jackson had mentioned threats he received when he requested to be removed from the jury.[76] Jackson was replaced by an alternate.[77]\n\nEvidence [ edit ]\n\nA single hair was the only piece of forensic evidence that was identified. The strand, thought to have been Laci's, was found in a pair of pliers on Peterson's boat.[78]\n\nPresented as prosecution evidence during the trial was the fact that Peterson changed his appearance and purchased a vehicle using his mother's name in order to avoid recognition by the press. He added two pornographic television channels to his cable service only days after his wife's disappearance.[79] The prosecution stated that this meant he knew she would not be returning home. Peterson expressed interest in selling the house he had shared with Laci,[80] and sold her Land Rover.[81]\n\nRick Cheng, a hydrologist with the United States Geological Survey and an expert witness on tides of the San Francisco Bay, testified as a witness for the prosecution. During cross-examination, Cheng admitted that his findings were \"probable, not precise.\"[82] Tidal systems are sufficiently chaotic, and he was unable to develop an exact model of the bodies' disposal and travel. As the trial progressed, the prosecution opened discussion of Peterson's affair with Frey and the contents of their taped telephone calls.[83]\n\nThe defense argued that a prostitute who was accused of stealing checks from Peterson's mailbox might have murdered Laci, but Modesto police detective Mike Hermosa did not indicate that the woman was ever a suspect in her disappearance. Prosecutor Dave Harris noted that the checks were stolen after she vanished, meaning the woman was not involved in her disappearance.[84]\n\nCharles March was expected to be a crucial witness for the defense, one who, according to the San Francisco Chronicle, could single-handedly exonerate Peterson by showing that Laci's fetus died a week after prosecutors claimed. Under cross-examination, March admitted basing his findings on an anecdote from one of Laci's friends that she had taken a home pregnancy test on June 9, 2002. When prosecutors pointed out that no medical records relied on the June 9 date, March became flustered and confused on the stand and asked a prosecutor to cut him \"some slack\", undermining his credibility. Summing up this key defense witness, Stan Goldman, a criminal law professor at Loyola Law School in Los Angeles said, \"There were moments today that reminded me of Chernobyl.\"[85] According to one newspaper account about March's testimony, \"By the end of his testimony Thursday, legal analysts and jurors closed their notebooks, rolled their eyes, and snickered when they thought no one was looking\".[86]\n\nMotives [ edit ]\n\nThe prosecution presented Peterson's affair with Frey and financial problems as motives for the murder. Prosecutors surmised that he killed Laci due to increasing debt and a desire to be single again.[87]\n\nVerdict and sentencing [ edit ]\n\nOn November 12, 2004, a jury convicted Peterson of two counts of murder: first-degree murder with special circumstances for killing Laci, and second-degree murder for killing the fetus she carried.[65][88] The penalty phase of the trial began on November 30, and concluded December 13, when the jury rendered a sentence of death. On March 16, Judge Alfred A. Delucchi followed the jury verdict,[65] sentencing Peterson to death by lethal injection and ordering him to pay $10,000 toward the cost of Laci's funeral,[89][90][91] calling the murder of Laci \"cruel, uncaring, heartless, and callous\".[92]\n\nIn later press appearances, members of the jury stated that they felt that Peterson's demeanor—specifically his lack of emotion and the phone calls to Frey in the days following Laci's disappearance—indicated that he was guilty. They based their verdict on \"hundreds of small 'puzzle pieces' of circumstantial evidence that were revealed during the trial, from the location of Laci's body to the myriad lies her husband told after her disappearance\". The jury decided on the death penalty because they felt that Peterson betrayed his responsibility to protect his wife and son.[93]\n\nOn October 21, 2005, a judge ruled that proceeds from a $250,000 life insurance policy Peterson took out on Laci would go to Laci's mother, which was reaffirmed by the Fifth District Court of Appeal on October 21, 2005. Peterson's automatic appeal was filed in the California Supreme Court on July 5, 2012.[65]\n\nPeterson arrived at San Quentin State Prison in the early morning hours of Wednesday, March 17, 2005. He was reported not to have slept the night before, being too \"jazzed\" to sleep.[94][95] He joined the more than 700 other inmates in California's sole death row facility while his case is on automatic appeal to the Supreme Court of California.[89][96]\n\nAppeal [ edit ]\n\nOn July 6, 2012, Peterson's attorney, Cliff Gardner, filed a 423-page appeal of Peterson's sentence, stated that the publicity surrounding the trial, incorrect evidentiary rulings, and other mistakes deprived Peterson of a fair trial.[97][98] The State Attorney General's office filed their response brief on January 26, 2015.[99] The defense filed a response to the State's brief in July 2015, claiming that a certified dog that detected Laci's scent at Berkeley Marina had failed two-thirds of tests with similar conditions.[100]\n\nIn November 2015, the defense filed a habeas corpus petition, claiming that a juror lied on her jury application, and that there was evidence that neighbors saw Laci alive after Scott left home.[101] On August 10, 2017, the State Attorney General responded to the appeal by filing a 150-page document contesting the notion disputing the claims put forward in the appeal, stating that the appeal ignored \"overwhelming evidence\" that Peterson murdered Laci. Supervising Deputy Attorney General Donna Provenzano stated that the timeline of the crime was established by the neighbor who found the Petersons' Golden Retriever, McKenzie, wandering in the street with its leash still attached, before the sightings of Laci and her dog. Provenzano also indicated, \"Purported sightings of Laci were legion,\" noting 74 reported sightings in 26 states and overseas, most of which she stated, were neither viable nor corroborated.[102]\n\nMedia portrayals [ edit ]\n\nFurther reading [ edit ]\n\nBeratlis, Greg; Marino, Tom; Belmessieri, Mike; Lear, Dennis; Nice, Richelle; Guinasso, John; Zanartu, Julie; Swertlow, Frank; Stambler, Lyndon (2007). We, the Jury: Deciding the Scott Peterson Case . Beverly Hills, CA: Phoenix Books. ISBN 1-59777-536-3 .\n\nBird, Anne (2005). Blood Brother: 33 Reasons My Brother Scott Peterson Is Guilty . New York: Regan Books. ISBN 9780060838577 .\n\nCrier, Catherine; Thompson, Cole (2005). A Deadly Game: The Untold Story of the Scott Peterson Investigation . New York: ReganBooks. ISBN 0-06-076612-3 .\n\nDalton, Matt; Hill, Bonnie Hearn (2005). Presumed Guilty: What the Jury Never Knew About Laci Peterson's Murder and Why Scott Peterson Should Not Be on Death Row . New York: Atria. ISBN 978-0743286954 .\n\nLee, Henry C.; Labriola, Jerry (2006). Dr. Henry Lee's Forensic Files: Five Famous Cases Scott Peterson, Elizabeth Smart, and more.. . Amherst, NY: Prometheus Books. ISBN 1-59102-409-9 .\n\nThomas, Donna. I'm Sorry I Lied To You: The Confession of Scott Peterson (3rd ed.). Duj Pepperman Enterprises. ISBN 1-59453-969-3 .", "images": ["https://upload.wikimedia.org/wikipedia/commons/1/19/Scott_Lee_Peterson_mugshot_2011.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/19/Scott_Lee_Peterson_mugshot_2011.jpg/220px-Scott_Lee_Peterson_mugshot_2011.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/SanQuentinSP.jpg/220px-SanQuentinSP.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/1/19/Scott_Lee_Peterson_mugshot_2011.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Scott_Peterson", "title": "Scott Peterson", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.13", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/1/19/Scott_Lee_Peterson_mugshot_2011.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}