{"url": "https://en.wikiquote.org/wiki/Elvis_Presley", "text": "The image is one thing and the human being is another... it's very hard to live up to an image.\n\nElvis Aaron Presley (8 January 1935 – 16 August 1977) was an American singer, musician, and actor, one of the most popular music artists and among the century's most significant cultural icons, he is widely known by the single name Elvis. He is often referred to as the \"King of Rock and Roll\" or simply \"the King\" ( the latter in particular something he publicly felt was not warranted) and is the best-selling individual recording artist of all time. He was of Cherokee Native American, Danish, Dutch, English, French, German, Northern Irish (Scottish-Irish) and Scottish descent.\n\nQuotes [ edit ]\n\nThe first time that I appeared on stage, it scared me to death. I really didn't know what all the yelling was about...\n\nI like Brando's acting … and James Dean … and Richard Widmark. Quite a few of 'em I like. When asked to name his favorite male actors, in \"Elvis Exclusive Interview\" with Ray Green in Little Rock, Arkansas (16 May 1956), as published in Elvis — Word for Word : What He Said, Exactly As He Said It (1999)\n\n\n\nI'd like to thank the Jaycees for electing me as one of their outstanding young men. When I was a child, ladies and gentlemen, I was a dreamer. I read comic books, and I was the hero of the comic book. I saw movies, and I was the hero in the movie. So every dream I ever dreamed, has come true a hundred times... And these gentlemen over here, these are the type of people who care, they're dedicated, and they realize that it is possible that they might be building the kingdom of heaven, it's not just too far fetched, from reality. I'd like to say that I learned very early in life that \"Without a song, the day would never end; without a song, a man ain't got a friend; without a song, the road would never bend — without a song.\" So I keep singing a song. Goodnight. Thank you. Acceptance speech for the 1970 Ten Outstanding Young Men of the Nation Award (16 January 1971), published in Elvis — Word for Word: What He Said, Exactly As He Said It (1999) by Jerry Osborne, p. 188\n\nAnd these gentlemen over here, these are the type of people who care, they're dedicated, and they realize that it is possible that they might be building the kingdom of heaven, it's not just too far fetched, from reality. I'd like to say that I learned very early in life that \"Without a song, the day would never end; without a song, a man ain't got a friend; without a song, the road would never bend — without a song.\" Goodnight. Thank you.\n\nThe first time that I appeared on stage, it scared me to death. I really didn't know what all the yelling was about. I didn't realize that my body was moving. It's a natural thing to me. So to the manager backstage I said, \" What'd I do? What'd I do? \" And he said, \"Whatever it is, go back and do it again.\" Interview (March/April 1972), as quoted in The Leading Men of MGM (2006) by Jane Ellen Wayne, p. 406\n\nI didn't realize that my body was moving. It's a natural thing to me. So to the manager backstage I said, \" \" And he said, \"Whatever it is, go back and do it again.\"\n\nThe image is one thing and the human being is another...it's very hard to live up to an image. Press conference (June 1972),also quoted in Elvis Culture : Fans, Faith, & Image (1999) by Erika Lee Doss, p. 218\n\n\n\nMan, I was tame compared to what they do now. Are you kidding? I didn't do anything but just jiggle. Press conference (June 1972) as quoted in Elvis — Word for Word : What He Said, Exactly As He Said It (1999), by Jerry Osborne, p. 208\n\n\n\nA live concert to me is exciting because of all the electricity that is generated in the crowd and on stage. It's my favorite part of the business — live concerts. Press conference (5 September 1972), also quoted in Paranoia & Power : Fear & Fame of Entertainment Icons (2007) by Gene N Landrum, p. 60\n\n\n\n'To judge a man by his weakest link or deed is like judging the power of the ocean by one wave.' Handwriten message on Elvis' King James -Bible\n\n'There is a season for everything, patience will reward you and reveal all answers to your questions.'\n\n'Truth is like the sun. You can shut it out for a time, but it ain't going away.' Another handwriten message on Elvis' King James -Bible [2]\n\n\n\nWhat honey? What is that? It's a sign, I can't see it, wait a minute. Oh, thank you darlin', thank you very much. Oh, thank you. The thought is beautiful dear, and I love you for it, but I, I haven't been caught up in this thing and I can't accept this kingship thing because to me there's only one, which is Christ. September 30, 1974. South Bend, IN. Notre Dame Ath Center. [1] [2]\n\n\n\nI had too much praise, too much flattery and fawning over and I needed to remember who I was, where I came from. One time I called a relative in Tupelo. It was Christmas and they were havin' dinner. I asked, 'What?' and she was kind of quiet, then said, 'Meat loaf.' I was shocked as we'd had the best, you know, turkey, ham, steak, everything. She said that it was near the first and they'd run out of money so they just had meat loaf. It hurt me. and so, I ate meat loaf for about eight months, every night, so I'd remember where I came from and to remind me of how many people were unable to have what I did. It was kind of a penance... originally from the book Blue Star Love by By Maia Chrystine Nartoomid.\n\n\n\nI'm strictly for [Adlai] Stevenson. I don't dig the intellectual bit, but I'm telling you man, he knows the most. Elvis Presley Was Always Too Busy to Vote for President\n\n\n\nSong lyrics [ edit ]\n\nBaby, if I made you mad\n\nFor something I might have said,\n\nPlease, let's forget the past,\n\nThe future looks bright ahead.\n\nDon't be cruel to a heart that's true.\n\nI don't want no other love,\n\nBaby it's just you I'm thinking of. Don't Be Cruel , written by Otis Blackwell and Elvis Presley (1956)\n\nFor something I might have said, Please, let's forget the past, The future looks bright ahead. Don't be cruel to a heart that's true. I don't want no other love, Baby it's just you I'm thinking of.\n\nWhen you looked into my eyes,\n\nI stood there like I was hyp-notized.\n\nYou sent a feeling to my spine,\n\nA feeling warm and smooth and fine.\n\nBut all I could do were stand there paralyzed.\n\nWhen we kissed, ooh what a thrill,\n\nYou took my hand and, ooh baby, what a chill.\n\nI felt like grabbin' you real tight,\n\nSqueeze and squeeze with all my might.\n\nBut all I could do were stand there paralyzed. Paralyzed , written by Otis Blackwell and Elvis Presley (1956)\n\nI stood there like I was hyp-notized. You sent a feeling to my spine, A feeling warm and smooth and fine. But all I could do were stand there paralyzed. When we kissed, ooh what a thrill, You took my hand and, ooh baby, what a chill. I felt like grabbin' you real tight, Squeeze and squeeze with all my might. But all I could do were stand there paralyzed.\n\nA well I bless my soul\n\nWhat's wrong with me?\n\nI'm itching like a man on a fuzzy tree.\n\nMy friends say I'm actin' wild as a bug.\n\nI'm in love,\n\nI'm all shook up.\n\nMm mm oh, oh, yeah, yeah! All Shook Up , written by Otis Blackwell and Elvis Presley (1957)\n\nWhat's wrong with me? I'm itching like a man on a fuzzy tree. My friends say I'm actin' wild as a bug. I'm in love, I'm all shook up. Mm mm oh, oh, yeah, yeah!\n\nThe way she held your hand,\n\nThe little things you planned.\n\nHer memory is with you yet,\n\nThat's someone you'll never forget. That's Someone You Never Forget , from Pot Luck , written by Elvis Presley and Red West (1961)\n\nThe little things you planned. Her memory is with you yet, That's someone you'll never forget.\n\nSweetheart we're alone\n\nAnd you are mine.\n\nLet's make this night a night to remember.\n\nDon't make our love a cold dying ember,\n\nFor with the dawn, you'll be gone. You'll Be Gone , written by Elvis Presley, Red West and Charlie Hodge (1961)\n\nAnd you are mine. Let's make this night a night to remember. Don't make our love a cold dying ember, For with the dawn, you'll be gone.\n\n\n\n\n\nDisputed [ edit ] Love me tender, love me sweet,\n\nNever let me go. \"Love Me Tender\" (1956), the lyrics of this song are credited to Presley and co-writer Vera Matson, but were primarily written by Matson's husband, Ken Darby, who when asked why he credited his wife as co-writer with Presley replied \"Because she didn't write it either.\"\n\n\n\n\n\n\n\nMisattributed [ edit ] The only thing black people can do for me is shine my shoes and buy my music. Misattributed in \"He wasn't my king\" by Helen Kolawole in The Guardian (15 August 2002) apparently citing an unsourced anecdote, that has been debunked in Counterpunch (29 August 2002) which cites an article in Jet magazine (1 August 1957):\n\n\"Tracing that rumored racial slur to its source was like running a gopher to earth\", Jet wrote. Some said Presley had said it in in Boston, which Elvis had never visited. Some said it was on Edward Murrow's on which Elvis had never appeared. Jet sent Louie Robinson to the set of Jailhouse Rock \"When asked if he ever made the remark, Missisissippi-born Elvis declared: 'I never said anything like that, and people who know me know I wouldn't have said it.'\" More on this misattribution at Snopes.com\n\nQuotes about Elvis Presley [ edit ]\n\nThe last names, or names by which people are best known and whose quotes are included below are arranged alphabetically, for ease of referenceː\n\nA [ edit ]\n\nWhen I was five years old, they again showed \"Aloha from Hawaii\" here in Norway. I had my parents wrapped around my finger, so they would let me stay up and watch it, because it was on after midnight. I was so amazed by the performance... Abbath, Norway’s globally renowned black metal superstar, as told to Tim Dawson of Team Rock, and published on 15 November 2016.\n\n\n\nIt's probably asking too much that “Ruben Brandt, Collector” sustain its pop-art ebullience across its entire running time. But the dips are hardly depressions, and there’s nearly always a frisky detail to enjoy or virtuosic tableau to bathe in, all of it augmented wonderfully by Tibor Cári’s appealing score. Mostly, though, Krstić, whose background encompasses set design and sculpture, painting and photography, has shown everybody how to throw down the first-feature gauntlet at the age of 66: with Warhol’s holstered “Elvis I & II” facing down our hero and declaring, “Draw!” Robert Abele, reviewing for the Los Angeles Times Milorad Krstić's animated film “Ruben Brandt, Collector” and as published in their November 13,2018 edition.\n\n\n\nBy honoring Presley with the Medal of Freedom, the President paid tribute to someone who arguably did as much to bridge the cultural and racial divide as anyone who ever lived, an impressive and unifying act from someone usually considered the most divisive of presidents. Gary Abernathy, contributor for the Washington Post, in an article dated 20 November 2018, and entitled \"Trump honoring Elvis? It's about time\", in reference to Elvis' being awarded the Presidential Medal of Freedom, in a ceremony held at the East Room in the White House, on November 16, 2018\n\n\n\nSongwriter Earl Brown was tapped to create a special finale song that reflected Elvis’ emotions about the social upheaval of the time. According to the show's director Steve Binder, the resulting song, “If I Can Dream,” was recorded with Elvis in the dark, almost in a fetal position, writhing on top of the studio's cement floor. And when he got done, Elvis came in the control room and asked for the song to be played more than a dozen times. Later, Binder also crafted a gospel segment populated with racially diverse singers and dancers, which he knew would spotlight the Southern-born Presley’s disdain for prejudice. Fittingly, it was the highest-rated TV special of 1968 and signalled the rebirth of Elvis’s career. Lori Acken, of ReMIND Magazine, reviewing NBC-TV's 1968 Elvis special, as published on February 6, 2018.\n\n\n\nI loved Elvis since i was a kid, as my dad was a huge Elvis fan. His range was incredible high, or low and he could croon. His impact on me was his love of African American music. Yolanda Adam, in a filmed interview for Gracelancom\n\n\n\nI am reminded of a comment made shortly after the death of Elvis Presley by a musician he had worked with. He pointed out that despite an impressive vocal range of two and a half octaves and something approaching perfect pitch, Elvis was totally willing to sing off-key when he thought the song required it. Those off-key notes were art. Patrick H. Adkins, The Dream Vaults of Opar\n\n\n\nOne of the pieces recently up for auction by Phillips-- and setting the record for the most expensive Omega ever to sell at auction – was a wrist watch given to Elvis Presley by RCA Records in 1961 to celebrate his 75 millionth record sold. The 33mm 18-karat white gold manually wound watch features a bezel set with 44 brilliant cut diamonds. The caseback features the engraving: “To Elvis, 75 Million Records, RCA Victor, 12-25-60. We were in on the bidding for that watch, which, according to our man there, Petros Protopapas, was very intense, with several watch collectors and Elvis collectors in on it. It was the most anyone at Omega had ever authorized to put a bid in for, and ultimately we garnered the piece at a hammer price of $1.8 million with buyers’ fees and premiums. In fact, we could have secretly bid on it, but we wanted people to know that it was us bidding for it and why we were doing it as this is an important part of our past and it should not be locked in a safe, but in our Museum, so we can shared it with the world. Raynald Aeschlimann, CEO of Omega, discussing with Forbes the power of vintage watches as published on their January 7, 2019 edition.\n\n\n\nI went to college in New Jersey and started off singing at open-mic spots in bars. I was so dreadful it embarrasses me even now to think about it. Music was always a passion growing up, like I used to translate Elvis Presley songs into Russian and sing them at home. Now that I’ve had a few multiplatinum albums in Russia, I want to have a go at Ireland, the UK and the rest of Europe. My heroes were Elvis, Elvis and Elvis! One of my favourite Elvis songs is My Boy, and now that I have been told that it was written by an Irishman [Phil Coulter] I love it even more. Emin Agalarov, singer and businessman, son of Russian billionaire Aras Agalarov, in an article published in the USA Today affiliated North New Jersey's July 13, 2017 online edition, as well as following an interview published in the Irish Times̪ March 22, 2015 edition.\n\n\n\nIt must have been in January of 1958 when I went to a record store to buy a 45rpm single for my older sister's birthday. I was 8 years old. When I got there, I asked if they had \"Wake up little Suzie\" by the Everly Brothers, a song she had told me was her favourite of those then playing on Mexican radios. They did, and just as it was being wrapped up the salesperson told me that there was a special, if I bought another. I asked which one should I get and he said, \"Of course, anything by Elvis\". So, inspite of never having heard of Elvis, I got the \"two for one\" special and headed back home. When my sister arrived from school I gave the Everly's record to her, \"two weeks in advance\" I said, but only as long as she allowed me to play the one I had bought for free. It was \"Dont be cruel\" with \"Hound Dog\" on the B side. The moment I heard the A side, that was it... Enrique Sealtiel Alatriste y Lozano, Mexican writer, promoter and diplomat, in his article, \"Elvis Presleyː An out of time obituary\", as published in la Revista de la UNAM. His timing was suberb, as in less than 12 months, in June of 1959, there would be no Elvis records to be found in Mexican stores, as the second of his many bans there began to exceuted by the Government authorities.\n\n\n\nHe was an extraordinary figure of his and our time, his legacy tremendous in terms of the music he created, his films, and as an entertainment personality. The generosity that he showed toward others is simply remarkable and I think it's these aspects of his character, his persona, that make him such a special person. Albert II, Prince of Monaco, after his visit to Graceland on August 7, 2010 as noted by EPE.\n\n\n\nIn an era when radio stations refused to play Chuck Berry songs, calling it “race music”, Elvis broke down barriers. Janet Albrechtsen, Australian columnist, in an article entitled \"Beware mob rule in the new racism\" published in The Australian on 23 November 2017.\n\n\n\nI’ve kind of been infatuated with Elvis since I was a kid, just always watching documentaries and stuff on him. It had a little bit to do with that and, honestly, I just wanted him to have something that wasn’t very common. Jason Aldean, explaining why he and his wife named their first son Memphis, as published on Soundslike Nashville on September 30, 2017.\n\n\n\nI remember we were in his bathroom, he took my hand, asked me to sit down in a black leather chair, said some beautiful things and then he asked me to marry him. Ginger Alden, who found Elvis lifeless in the main bathroom at Graceland, six weeks after he asked her to marry him in that same bathroom, in an interview for CBS aired in 1982.\n\n\n\nWhen Elvis Presley died, he left a worldwide legion of music fans in mourning. It was no different on Long Island, where he had been scheduled to perform at the Nassau Coliseum a week later. As many as 700 fans had camped out overnight to buy tickets to the concert, which sold out quickly. On Aug. 22, the night the concert had been scheduled, over 5,000 fans gathered in the Coliseum parking lot for an impromptu tribute to Elvis that lasted two hours. Of the 16,700 tickets that had been sold, only 1,250 were returned for refund.... Michael Alexander, quoting an Editor's note of a Newsday story originally published on Aug. 17, 1977.\n\n\n\nTo host a Warhol show in a Hollywood Regency home felt like such an incredible opportunity, so when we were presented with it, we jumped at the chance. Given Warhol’s fascination with Elvis, it was like this incredible opportunity to reenergize the home with the ghosts of the past in a supercool way. Part of what we love at the Future Perfect in general is the possibility to create that social interaction with the work that we present, because it completely changes the psychology of how you view it.” David Alhadeff, founder of Future Perfect, a design gallery one of whose Los Angeles locations is at Elvis former home at the Trousdale Estates, now known as Casa Perfect, in an article published at Vogue Fashion's February 20,2019 edition.\n\n\n\nLet us remember that Elvis’s style — which often included all-leather outfits and flashy jumpsuits — was also controversial for its mid-century time period. So, is Post Malone truly our modern-day Presley? Judging by his care-free attitude and penchant for leather Cuban heeled boots —another, Presley favorite—the verdict would appear to be yes. Cristian Allaire, for Vogue Magazine, in an article entitled \"Is Post Malone the new Elvis Presley of today̞?\",as published on December 2, 2018\n\n\n\nI was standing in the hallway, just before the show, and one of the managers told him there was a girl on the telephone who was in the hospital. She said she had tickets for the show but couldn't come as she had a serious illness. And Elvis said, 'I want to talk to her', so he marched into a room and held up the entire show for fifteen minutes to talk to that girl, asking her several questions, with warmth and interest. Just before hanging up, I remember he said, 'No, honey I don't have a blue Cadillac. I've got a pink one, a black one, a white one - a pause, and then he said, oh yeah, I do have a blue one'. He was a gentleman and I respected that immensely. Lew Allen, a then 17 year old student who went on to earn an Associate’s Degree in photography and a B.A. in Fine Arts/Photography from the Rochester Institute of Technology. He was asked to photograph Elvis at the Cleveland Arena in Ohio, on November 23, 1956 because of a labour strike affecting the three major newspapers, as told by Mr. Allen in an interview published in Rock paper on June 6, 2005.\n\n\n\nI didn't know very much about him, and those in the business knew very little about him. But, he was in the Tommy and Jimmy Dorsey, so I saw this kid and it was hard to say what he had, but there was something unusual about him. He had an interesting quality and his sound wasn't that important. It was the way he conducted himself, the way he put a song over. Anyway, I made a note immediately to book him for our new show, and we just had the good fortune that between that night and when he appeared a few weeks later suddenly there was a lot of controversy and media attention. Steve Allen's answer as to how did the Elvis appearance in his ABC.TV show, which drew 40 million viewers following the NBC TV Milton Berle controversy came about, as told in an interview on June 30 of 1996.\n\n\n\nIt was like a country show back then and we got to open it and we did a couple of his songs, which was just stupid because we thought we'd impress him and he'd like us. The first time I saw him play - I'd seen him one time before that particular tour came to town where we opened the show for him- I just couldn't believe it. He was such a rocker. I'd never seen anything like that before. Buddy was terribly impressed as well. All of us the same. Turned into a big fan. Buddy tried to sound like him for months. And personally, he was as charismatic as he could be... Jerry Allison, drummer for Buddy Holly, as well as the Crickets, recalling the early days when they opened for Elvis at Buddy Holly's hometown of Lubbock, Texas, as published in Classicbands.com\n\n\n\nRock n’ roll, through Elvis, became a target of southern segregationists, who believed that race mixing led, inevitably, to miscegenation and that exposure to black culture promoted juvenile delinquency and sexual immorality Glenn C. Altschuler, in his book \"All Shook Up: How Rock 'n Roll Changed America\" (Oxford University Press 2003)\n\n\n\nObama is like Elvis, there will always be demand for impersonators of such popular and historical people. Ilham Anas, Indonesia's most successful Obama impersonator, as reporter in This week in Asia, on November 5, 2016.\n\n\n\nAfter one of Elvis Presley's last shows, I was heading back to my car when a matron from Zachary stopped me and gushed about how wonderful he had been. Didn't you just LOVE him?\" she asked. \"Well, I thought he looked tired and sick and was just going through the motions.\" Whereupon she whacked me on the head with the rolled-up Elvis poster she was carrying. LOL. I took it in stride — nobody ever said it was easy being a music critic. … Music critic Smiley Anders, writing for The Advocate in an article published on their March 25, 2019 edition.\n\n\n\nElvis Presley has been such a determining force in music, before and after his death. On a personal level, I owe so much to Elvis as he is essentially the musician who pushed me to be the performer I am. I have always loved his music so I am returning to celebrate him along with some of my amazing musician friends. Daniel Anderson, vocalist in the Harvey World Travel East of London-organized benefit for the Cancer Association of South Africa (Cansa)'s, entitled The Wonder of You: The Story of Elvis, as reported by the Go&Express, on October 6, 2017\n\n\n\nI discovered the blues in a funny kind of a way, from the age of seven when I was listening to my father’s war-time collection of big band jazz. It had that thing about it – I didn’t really know what it was –, that set the pulse racing a bit; and then I heard echoes of it again, with early Elvis Presley. Ian Anderson, singer, flautist and leader of Jethro Tull, explaining to G.Brown, of the Denver Music Examiner, his first experience with hearing the blues, starting at the age of 7, as published in that newspaper's online edition, on August 11, 2008.\n\n\n\nUnbelievable! To hear my father grouped together with Elvis Presley, William Faulkner and Eudora Welty, it's a dream. John Anderson, son of painter Waltyer Inglis Anderson, speaking of his father's induction into the Mississippi Arts and Entertainment Experience Hall of Fame, as reported by ABC center on December 16, 2017, with the other 17 members being Jimmie Rodgers, Robert Johnson, Muddy Waters, B.B. King, Leontyne Price, Elvis Presley, James Earl Jones, Jim Henson, Morgan Freeman, Oprah Winfrey, Sela Ward, George Ohr, William Faulkner, Richard Wright, Eudora Welty, Tennessee Williams, and John Grisham\n\n\n\nHis latest album, \"Piano\", is a collection of his past work, stripped down so all you hear is his beloved piano. It was hearing an Elvis Presley song that sparked his passion for the piano when he was young. About ABBA-founder Benny Andersson's decision to take up piano, at age 11 in his native Sweden, specifically after hearing \"Treat me nice\", the B side of the \"Jailhouse Rock\" single, as noted by Tom Power of CBCRadio on December 10, 2017\n\n\n\nAfter doing ‘Dr. No’ with Sean Connery, the brass at Paramount proposed that I co-star with Elvis. At first I turned the offer down, mainly because after having dated James Dean, I had imagined Elvis to be an \"ordinary\" person. So they organized a meet-up and, to my amazement, I immediately fell for his charm. He was extremely well educated and when I told him I hated Rock and that I liked Gospel, he gave me his entire collection of gospel songs. Little did I know that was his main source of inspiration. Anyways, we became instant friends and he loved to cook for me when we were on location. He told me he would have loved to live in Europe and, when he saw the BMW 507 my then husband John Derek had, he gave me another, one of the two he had had, as a present. Twenty years later, in 1982, after selling John's to Fred Astaire, I auctioned the one Elvis gave me for US$300,000 and then the person who bought it from me later sold it for 1.2 million UK pounds. He was in fact, a one in a billion type, a wholly adorable person and we remained in touch till his death. Swiss actress Ursula Andress in an interview published in Mujer Hoy, on 12 January 2016.\n\n\n\nHis knowledge was even more extensive than mine. I prided myself on knowing all that stuff. And man, we'd be hanging out and Elvis would be talking about singers I didn't even know about!!!. Sherman Andrus, Gospel Music Hall of Famer and one of the first African Americans to be integrated into a Southern Gospel group, (Elvis' personal group The Imperials), attesting to Elvis' deep knowledge of African American Gospel music, from the Gospel side of Elvis.\n\n\n\nMy older brothers played Elvis all the time and there was a lot about his music that inspired us all. Not only an inspiration but he showed up to give his generation permission on a lot of fronts to carry a torch. When I finally met him in Houston, it was like a receiving line at a wedding, as surreal a moment as any in my life. I could not even actually shake his hand. I just bowed. Canadian singer Andy Kim, interviewed by phone from Toronto by Patrick Bales and published on the Orillia Packet & Time website on March 17, 2017\n\n\n\nBeto, he’s a rock star right now, he’s Elvis Presley, Maximo Anguiano, of the Texas Organizing Project, in reference to Beto O’Rourke̺ being the candidate who could unseat Sentaro Ted Cruz oin the 2018 mid-term elections.\n\n\n\nIn Vegas, we’d meet and we’d talk about everything. Slowly he started coming over to see my show; he’d sit up there and I’d come back after the show and we’d talk music. He would show up, this incredible God-like figure. He had everything, and the voice —what a great voice he had. Then, on August 17, 1977 I happened to be in Las Vegas, so when I turned on the news and learned of his death, I cried all day. He was a cool, nice man. Paul Anka, from his autobiography \"My way\"\n\n\n\nI want to celebrate his life. He was so gifted, I just cherish his memory, his generosity, and he was so private, like I am. He knew about honour, and respect, and was so considerate, and his manners, and the way he was so civilized. And as an entertainer he will never be repeated. I wanted him to know all that, and I did tell him, but very few others did... Actress and entertainer Ann Margret, in an interview with Charlie Rose, as broadcast on February 11, 1994.\n\n\n\nI think there was that part of the so-called punk idea that everything in the past was rubbish and all that mattered was punk. I was never really interested in the spitting and the safety pins or that nonsense. I liked the Sex Pistols, and that was about it. Adam and the Ants were very much outside of that anyway. So my liking of Elvis and rock and roll music that I’d grown up with was always in there; it was always something that was a big influence. Elvis’s death was tragic, I remember when he died, it was a very sad day in general, so it’s obviously a great loss to everybody. I never thought, Oh, he was something that didn’t matter, because he did. I have visited Graceland and you could see the man was overwhelmingly honest. He never professed any taste other than his own, that is, country boy made good. He never pretended to be anyone else. Adam Ant, leader of Adam and the Ants, a punk rock band, in an article published on September 5 2017, at the Tampa Bay Times\n\n\n\nOne day while he and Richard Davis were conversing he removed the watch from his wrist, handing it to Davis and stating there was something wrong with the back of it. When Davis turned the timepiece over to inspect it, he saw to his great surprise that the case back had been inscribed, \"To Richard, From E.P. Elvis then said, \"I guess it's yours now\". He was known for being extremely generous, often giving away his valuable personal belongings as presents so it was not surprising that he gifted his prized 18kt yellow gold Corum Buckingham to Davis. Antiquorum Auctioneers's notes for those attending the November 11 2018 auction held in Geneva, Switezerland, and highlighting the sale of a yellow 18k gold Corum 1960 Buckingham wristwatch gifted by Elvis to Richard Davis, his long time friend and last wardrobe manager, as detailed in Antiquorumwebpage.\n\n\n\nIt was the early 1970s. I was 22, working in some little show in a hotel that’s now gone, and he was doing a gig at the Las Vegas Hilton. We met backstage at a Tom Jones concert, then he showed me some karate moves, with a small party of folks ending up at his penthouse suite. There, he turned to me and said he had something to show me in his bedroom, so I thought, 'Oh, here comes the cliche,’ Turns out, he just wanted to read to me from Kahlil Gibran’s “The Prophet.” It was a sweet moment, as he sat on a footstool beside me and read like a child, his finger following the text. He signed the book, gave it to me and told me to have a blessed life. He was so sweet, that’s what struck me the most. In retrospect, I view him as a prisoner of his fame. That, and his roots in gospel music and the church, fueled his desire to seek out more knowledge about the world and self-realization. Actress Susan Anton, as told to Michael Grossberg at Dispatchcom.\n\n\n\nThe biggest surprise about his singing had been revealed when he gave us a private concert and sang \"Love me tender\" a soft, ultra-slow ballad at the quaint music bungalow on the far west side of 20th Century lot. It was away from the bustle of traffic and from the big stages and it looked like the kind of cottage Walt Disney would have built for Snow White and Prince Charming. This was where Elvis felt relaxed, comfortable. So Ken Darby sat at the grand piano at the far end of the living room and Elvis stood a few feet behind him and in front of a tall stained-glass window. He stood erect, as if he was in a choir. Ken started to play the soft melody and I hardly knew that Elvis had started to sing, as his voice, barely louder than the piano, was pitched slightly higher than his usual. It had a lot of resonance and vibration and Elvis was on-key for every note, no matter how long, short, high or low. When he finished, it seemed only normal to express our amazement. \"People think all I can do is belt,I used to sing nothing but ballads before I went professional. I love to sing slow,but seldom get to do it\", he said, the continued to explain that as a boy, an only child, he would sing like that when he sang with his mother and dad in church. \"It was a small church, only seated about 75, you couldn't sing too loud there. Army Archerd, a columnist for Variety then interviewing Elvis for the Photoplay Magazine and who was present at the sessions, including an intimate concert for a dozen or so, which preceeded the actual recording of the \"Love me tender\" soundtrack, as noted in an document entitled \"Photoplay (Jul-Dec 1956)\" as digitized by the Internet Archive in 2017 with funding from Media History Digital Library\n\n\n\nIn the high-stakes game of Los Angeles real estate, a good celebrity pedigree is always a bonus. Of course, not all celebrities are created equal. A home that was once owned by Cary Grant or Elizabeth Taylor, for instance, would probably hold broader appeal than one formerly inhabited by, say, Zsa Zsa Gabor. On that score, David Alhadef definitely struck gold when he discovered the new location for Casa Perfect, the L.A. outpost of his furniture mecca, the Future Perfect: designed in 1958 by architect Rex Lotery and renovated in the mid-1960s, the house is an idiosyncratic mash-up of classic California modernism and Hollywood Regency. For six years, it belonged to Elvis Presley. Mayer Rus, for Architectural Digest in an article entitled \"Elvis Presley's Once-Home roars back to life as a dazzling showplace for contemporary furnishings, as published in AD's February 18, 2018 edition.\n\n\n\nWhen I actually received the phone call, I couldn’t help my mind racing back to one magical day in 1956, that’s always remained vivid in my memory. When my cousin, four years older than me, played me two and a half minutes of music, which changed my life. That music was Elvis Presley, singing Hound Dog, and for the next six months – to my mother's absolute horror – I didn't want to hear anything but the rawest rock'n'roll I could lay my hands on. Do you know? For those who didn’t live through the Fifties, it’s really hard to imagine the enormous cultural gulf which existed between England and America at that time. Elvis himself was a God and in some of the first footage that we saw in England, seemed to us like an alien super being from a distant universe. I was 11 years old and I couldn’t in any way imagine being part of the same world. These early years were something of a dream. By 1964, we got a recording contract with Decca and then unbelievably by Christmas, found ourselves topping the U.S charts with our first record, “She’s Not There.” This magic land, which only eight years before had seemed so unimaginably remote and unconquerable and even more unbelievably, something we didn’t find out until many years later, Elvis actually had our records on his jukebox. I could not believe that! Rod Argent English musician, speaking about his reaction when told his band the Zombies would be inducted into the Rock and Roll Hall of Fame, as noted by RollingStone's 30 March,2019 edition.\n\n\n\nI had been called up for national service and was stationed in Germany at the same time as Elvis when I came across an article on him in a magazine. The article even had his address in Germany, so with a girl friend we set off one morning to find him. We went there and rang the bell, it was a Sunday morning. The maid answered it and told us he’d be down in a few minutes. There was nobody else there, except my friend and I. He took us inside the hallway, and we had a nice chat. He posed for photographs and signed autographs. We were very lucky that morning. Arthur Armstrong, on his love of Elvis Presley, as originally featured in a 2011 article in The Impartial Reporter and again reproduced on their issue of 7 January 2019, following his death at age 81 on December 12, 2018.\n\n\n\nIf anything, it's a lot of people here right now. It's like my record collection is actually sitting in this room. I'm truly fortunate. You know, I've always loved rock & roll music. I always have. Soon as I opened my eyes and took my first breath, I was a fan. With my brother David, we listened to Led Zeppelin, Van Halen, Mötley Crüe and Cheap Trick and Pyromania by Def Leppard. My oldest brother Alan, he had the Beatles and the Stones and the Kinks. My sister Hollie was like \"Kool and the Gang.\" My sister Anna for that record collection that turned my world inside out. And my sister, Marci, who's pretty much the person who showed me Elvis Presley for the first time. Thank you so much. Excerpted from Billie Joe Armstrong's acceptance speech, as the founder, lead singer and frontmant of the US punk supergroup Green Day, one of the 5 artists being chosen as performers at the 2015 edition of the inductees gala for the Rock and Roll Hall of Fame, as published in its entirety by RollingStone magazine on April 18, 2015.\n\n\n\nI'm definitively going to make a record with him. You would be surprised what we could do together. You ask me if I think he is good. How many Cadillacs was it he bought.? That boy's no fool... Louis Armstrong, interviewed by Memphis Press Scimitar, March 1, 1957 edition.\n\n\n\nGeorge H.W. Bush was equally at ease in all settings, something that seemed so characteristic of the man I revered. But my work with him didn’t end when he left politics. While working in government relations for Shell, I sometimes hosted foreign Ambassadors visiting Houston. On one occasion the Ambassador of Ukraine, Yuriy Shcherbak, was in town to meet with officials at NASA, give speeches and join up with the Ukrainian community there. On the last morning the Ambassador, who was a fan of Elvis Presley, did a live television interview on what by sheer coincidence happened to be Elvis' birthday, and the station had an Elvis impersonator on the set, to do a routine. When “Elvis” and the Ambassador crossed in the green room, the two exchanged bear hugs, and we took pictures. We later arrived at Bush’s office, and he cordially received Ambassador Schckerbak and asked how the visit had gone. He politely talked about the various events, then with a twinkle in his eye said: “And this morning Bill introduced me to Elvis!”. Bush gave me a quizzical look as if to ask, “What have you done now?” The Ambassador then recounted the whole tale, followed by robust laughter all around... Bill Arnold, former advance man for the then ( in 1980, therefore three years after Elvis̪ death), Vice Presidential candidate George H.W. Bush and, since 2000 Professor at the Jesse H. Jones Jones Graduate School of Business, at Rice University, recalling the Ukrainian Ambassador̪ to the US's fascination for all things Elvis, in an article written for the Houston Chronicle on the day after President Bush, for whom he worked, was laid to rest, December 5, 2018.\n\n\n\nOf course, it was 1957, he had a beautiful blonde on the back of his motorcycle. Now, I wasn’t watching the blonde and I didn’t know who he was, so I took him down to the Las Vegas police station where I then worked and I gave him a pass... Former Arizona Sheriff Joe Arpaio, recalling his most memorable traffic stop, which involved a speeding motorcycle driven by a young Elvis, as published in an interview with CBS's channel 5 on August 8, 2018.\n\n\n\nArguably some of the most important tracks in the history of Rock and Roll, Elvis' SUN recordings demonstrate what a dynamic and talented vocalist he was; the young, raw, unadulterated Elvis whom musicologist Francis Davis once called \"the greatest white blues singer”; I’m not one to argue with Mr. Davis. Art's Strange World review of the CD \"The Sun Sessions\" (15 August 2007)\n\n\n\nElena Quarestani, an Italian collector with a Salvador Dalí painting, was entangled in these onerous rules, namely the Milanese officials wanting to protect his \"Figure at a Table\" (1925) as an example of Italian cultural heritage even though it is an early work of his that does not incorporate any of the motifs for which he is known. He would likely be amused by the surreality of the government’s arbitrary ruling. Similarly, Andy Warhol would have loved that two of his early paintings hung in a casino in the German town of Aachen, a spa city near the border with Belgium and the Netherlands. On their way to slot machines and poker tables, gamblers passed \"Triple Elvis\", a 1963 silkscreen painting of three life-size images of Elvis Presley on a silver background and \"Four Marlons\", a 1966 silkscreen painting of four life-sized images of Marlon Brando on a motorcycle. Purchased in the late 1970s for $185,000 (approximately $700,000 today), the paintings were part of a plan to glamorize an otherwise off-the-beaten-track gambling parlor. When the casino conglomerate that owned the Aachen operation fell on hard times, a German state-owned bank seized control of the company and decided to sell the paintings. The sale was a reasonable action by the owners to raise cash for a troubled company. But protesters emerged, claiming this was a dangerous sale of cultural property owned by a state-run financial institution. The sale went ahead anyway, and the works sold for $151.1 million. Artsy's Doug Woodham, in an article entitled \"Why Becoming a National Treasure Can Lower an Artwork’s Value\", as published on their January 2, 2019 edition.\n\n\n\nI am the greatest contemporary artist of all-time. Rapper ASAP Rocky´s claim, which writer Jake Boyer of \"Highnobiety\" sarcastically said \"puts him the same playing field as everyone from Michelangelo to Elvis Presley\", as published in their online page on November 22, 2017.\n\n\n\nHe was stationed in Germany doing his service so on the occasion he would go visit Paris coinciding with my time there. On his first visit, he took 40 dancing girls from the Lido to the Prince des Galles Hotel. On his next, he suddenly took a great shine to me but when someone told him I was trans-sexual, he stayed away. But, if by chance we would be in the same club, he would sent me a bottle of champagne every time. He was a divine human being. April Ashley, a MBE, born George Jamieson and the first male Briton to have full sex reassignment surgery, recalling the time she met Elvis in 1959, as published in the Mirror on November 4, 2018.\n\n\n\nI found him to be an interesting person, had an entourage of good old boys, was busy with karate, breaking his hand while doing it, but he was nice and cooperative and friendly. I really liked him. Ed Asner, on the first time he met and worked with Elvis, namely during the shoot of \"Kid Gallahad\", in 1962, in an article published on July 16, 2018 on the Houston Chronicle.\n\n\n\nSouth African Elvis fans won't see his new movie 'Flaming Star' in their country. The government, which has strict laws to keep the races separate, banned the picture because Presley plays the son of an American Indian woman and a white man An Associated Press report from Johannesburg, dated May 31, 1961, the day when the film was set to open at theatres throughout the then Apartheid-ruled Republic of South Africa. A day later, 20th Century-Fox appealed and as a result the Board of Censors lifted the ban, on condition that the film not be shown to the country's indiginous population, with the film then opening to segregated theatres, starting in Durban in early June. However, it was permanently banned on cinemas in Kenya, Uganda and Tanzania, as colonial government officials in those territories were afraid the movie could reignite racial tensions in the aftermath of the bloody Mau Mau rebellion.\n\n\n\nIn times of trouble, I put my faith in Elvis Presley, who represented the South’s better angels. He was a hard worker, and although he lived the high life, he never forgot that he had been born into poverty. And he was a self-made talent, perhaps the greatest entertainer of all time, born in a two-room shack in Tupelo, Miss., in 1935. I’ve been to that small shotgun house many times, reflecting on what it says about America. Greatness can be born anywhere.His father Vernon was a laborer who was often out of work, and the Presleys relied on the kindness of family and neighbors to get them through the hard times.When Elvis was young, the Presleys lost it, and they ended up shuttling around Tupelo, often living in black neighborhoods, where Elvis famously developed an ear for black gospel and blues to supplement his love of the old-time gospel he knew from his own church.I still believe in my heart that most Southerners are still more like Elvis than President Trump. We are most likely to pull over and help someone stranded on the roadside. Most of the people I know in my Mississippi town would give you the shirt off their backs. Most Southern preachers don’t spend Sundays in the pulpit spewing hatred and intolerance. Most people agree that racism and white supremacy are evil. Even preschoolers know it’s always better to tell the truth and take your lumps than lie and evade. And yet here we are. We know right from wrong, but most of us down here voted for wrong. As Elvis once said, “Truth is like the sun. You can shut it out for a time, but it ain’t goin’ away. Ace Atkins, in his article, \"In Elvis we trust\", part of TIME magazione’s August 6 special issue on the American South.\n\n\n\nElvis changed the country music scene quite a bit; he almost put country music out of business. He was white, but he sang black. It wasn't socially acceptable for white kids to buy black records at the time. Did I have any sense of how big he was going to be when he first came to RCA? Oh yeah, we knew. Back in those days, if a guy got hot in one area you could spread it around the country, maybe the world. He was already so big in East Texas and Louisiana you couldn’t get him off stage with a firehose. We knew. When he came in to do “Heartbreak Hotel” I called up my wife and told her to come over. I said, You might not get a chance to see him again, he’s gonna get so damn big. Lots of people have asked me if Elvis could play guitar. Well, he played pretty good. And he played piano and drums. The first sessions he’d come in and work. After that, when he got more confident, he’d come in and play drums a while, then guitar, then piano only to then go to work starting around 11 o’clock at night. But he loved gospel music. The first time I ever heard him I thought, “What in the hell is this?” I couldn’t tell if he was black or bluegrass or gospel or what. Of course that was what made him what he was. He was so damn versatile he could sing anything. Chet Atkins, Pop Chronicles, Show 8 - The All American Boy: Enter Elvis and the rock-a-billies. Part 2, interview recorded January 1968.\n\n\n\nComing upon these tapes, unspooling them and watching them glide across an Ampex 440 reel-to-reel deck for the first time was the closest I’ll ever get to being a real life Indiana Jones. Beyond the staggering realization of what we had found, there was a musical element that also knocked our socks off: On these tapes Glen is singing pure rock and roll and with a sense of joy, passion and wild abandon that can only have come from knowing that his idol, the avatar Elvis Presley, would be an audience of one for these recordings.” Stephen Auerbach, detailing for RollingStone what he felt after finding and playing tapes which had been lost of Glen Campbell doing demos for Elvis, as published on October 31, 2018.\n\n\n\nWhen Elvis came back from the service and he was greeted by all the publicity, the press, the photographers, reporters, and so forth, someone said to him \"Well, what do you think now that you're not number one but Avalon is ?\" And he said \" Oh, I love his song \"Venus\" and there's room for everybody.\" And I thought that was really genuine, nice compliment. Frankie Avalon, as noted in whenstarsmeetstars.\n\n\n\n1) Ed Sheeran 2) Will Smith 3) James Cordon 4) Peter Kay 5) Her Majesty Queen Elizabeth II 6) Elvis Presley 7) Prince Harry 8) Michael Jackson 9) Beyonce and 10) Kim Kardashian UK Avis Budget Group's list of most favoured celebrity travel buddies, from a poll taken in July of 2018, of over 14,000 consumers across Europe, aged 18-66+ including 1,000 British nationals\n\n\n\nB [ edit ]\n\nDid I? That was extremely immodest and foolish of me, my apologies. I would never dare to be so presumptuous. I am only interested in the legacy my father has left behind, and I would like to work towards giving it strength and respect for as long as I live. Indian entertainer and former politician Amitabh Bachchan's answer to a question posed by a reporter on whether he recalled his once saying that he would like to leave a lasting legacy in the world, to be a sort of Elvis Presley, as published on the \"Asian Age\" on May 13, 2018\n\n\n\nIn May of 1998 I was in the middle of an Elvis Presley obsession, so I went to Graceland. Everything about the place seemed awesome to me, from the giant Corinthian columns out front, to the purple and yellow room with three televisions built into the wall, to the big man’s grave out back. But what has stuck with me the most from the visit is a particular story about Elvis. Elvis had grown up poor, and I’m sure when he was poor money was important. But when he started to make more money than he could ever spend, or maybe just enough money to have every material thing he wanted, it no longer held importance to him. So, during a party at Graceland he was inside with a guest who came from a poor background, and the other partygoers were outside on the lawn. His friend commented on how sophisticated all of the partygoers seemed. Elvis walked over to his desk, pulled a stack of money from one of the drawers, opened a window, and threw the bills out the window. The partygoers scrambled after the bills, shoving each other, trying to grab as much money as they could. Elvis turned to his friend and said, “They’re not that sophisticated.” Brett Baker, for Chicagon now, published on December 22, 2016.\n\n\n\ni) We can even hazard a little analysis as to what made his voice so appealing. \"That curious baritone,\" one critic called it. Actually, that is inexact. The voice had mixed propensities, hovering between tenor and bass and everything in between. Even a convincing falsetto lay within his range. One thing he was not, ever, was \"Steve-'n-Edie\", the polished, professionally accomplished Vegas artistes who once pronounced on an afternoon interview show (Mr. Lawrence enunciating the sentiment for himself and his partner/wife, Ms. Gorme), \"We don't really think of Elvis as a singer. But he was a star.\" It is only when, years later, one gets past the indignation of hearing such apparent ignorance, that the sense of the observation becomes clear. A singer is someone like Steve Lawrence rolling effortlessly (and meaninglessly) through a shlock-standard like \"What Now, My Love?\". More or less like doing the scales. A star is the persona in whom one invests one's vicarious longings, a being who is constantly hazarding — and intermittently succeeding at — the impossible stretches that every soul wishes to attempt but lacks the means or the will to. It's not a matter of virtuosity. ii) Take My Baby LeftMe (1956) by Arthur \"Big Boy\" Crudup, the black Mississippi sharecropper whose That's All Right had literally been Elvis' first recording, in 1954. Crudup kept his blues in a bucket; Elvis put the lid on, and cooked; bar by bar, the song comes together; first comes D.J. Fontana's rapped-out drum riff, then a top-to-bottom run from Bill Black's stand-up bass, then the controlled gallop of Scotty Moore's lead guitar; then, last of all, Elvis singing in that imperious velvet growl of his, \"Yes, my baby left me! Never said a word\"; it is the most underestimated song in the canon; there is lightning in that bucket, and it could drive a train, any train. It literally took us into a new age. Endow a university! Elvis was a university. Whoever those mystics are who teach that the universe began with sound could use him as their full curriculum\" Jackson Baker,i) in \"Memphis Magazine\" (July 2002) ii) as published in \"The Memphis Flyer\", August 8-14, 1996 edition\n\n(1956) by Arthur \"Big Boy\" Crudup, the black Mississippi sharecropper whose had literally been Elvis' first recording, in 1954. Crudup kept his blues in a bucket; Elvis put the lid on, and cooked; bar by bar, the song comes together; first comes D.J. Fontana's rapped-out drum riff, then a top-to-bottom run from Bill Black's stand-up bass, then the controlled gallop of Scotty Moore's lead guitar; then, last of all, Elvis singing in that imperious velvet growl of his, \"Yes, my baby left me! Never said a word\"; it is the most underestimated song in the canon; there is lightning in that bucket, and it could drive a train, any train. It literally took us into a new age. Endow a university! Elvis was a university. Whoever those mystics are who teach that the universe began with sound could use him as their full curriculum\"\n\nHe was fantastic. When he danced, the people danced, the girls would actually faint because of what he was doing. The people didn’t care if he was white or black, he was a good artist and they felt his music. Lavern Baker, commenting on her covering one of Presley's best early 60's songs, with a few changes in the lyrics, which she recorded in late 1961 as a answer to Presley's \"Little Sister\".\n\n\n\nPresley's voice was remarkable in the sense that, through it, he touched people in a way only great artists can do. (In fact), the people he touched are as diverse as humanity itself and, because of that his popularity has transcended race, class, national boundaries, and culture. There is no simple answer about why that is so, all I can say is he had that magic. When Elvis Presley was first popular, many people said that he did not have a good voice. Almost everyone, today, knows that he did, but more people today should see him not simply as a performer, but as an artist with a great soul. John Bakke, professor emeritus of the University of Memphis, in an interview with the US State Department, transcripted by UNUSINFO on July 18, 2006 on the legacy of Elvis Presley\n\n\n\nI don't think any two men on this planet ever had the charisma of Elvis Presley and Jackie Wilson. The two of them remind me of each other: the charisma. Hank Ballard, rhythm and blues singer and songwriter, lead vocalist of the Midnighters, as noted in the book \"Jackie Wilson: Lonely Teardrops\" by Tony Douglas.\n\n\n\nWith him, it’s the pictures that spoke loudest about the man behind the genius. Take Sunday Times photographer Chris Smith’s classic shot in which a scowling Seve, handsome head turned from the driving rain, jacket held across his chest like a matador’s cape, and he is curling his lip. It tells you everything you need to know about his mood, his game, and his grim determination to outfox the elements and annihilate his opponent. It’s pure Elvis. About Seve Ballesteros, Spain's all time greatest golfer, as reported in the Sunday Times on May 8, 2011.\n\n\n\nThen, in 1954, Elvis happened. The influence that the softly spoken Mississippi native had on popular music - and in particular rockabilly - is incalculable. First billed as 'The Hillbilly Cat' (again a nod towards black and white influences), the boy with the seemingly rubber limbs sang both blues and country songs infused with elements of this new rockabilly movement to the bemusement of a music industry not yet aware of the significance of what they were listening to. They didn't know it at the time, but the music establishment had just changed forever.Two years later he signed with RCA and the ensuing exposure he received on national television introduced rockabilly to its widest audience yet and, like fire to kindling, there was no stopping its spread. Other labels swooped to sign up any artists who sang even vaguely similar to Elvis and there was a bona fide musical gold rush underway and record executives and studio bigwigs fell over themselves to capitalise on this musical trend which was now sweeping the nation - ultimately playing a big part in rockabilly's eventual downfall, as more and more people tried to make money from it, (thus) watering down its raunchiness as they tried to make it appear to as large a market as possible, and (finally) taming its sound beyond recognition. Excerpted from an article entitled \"The Roots of Rockabilly: Examining the origins of a rock n' roll movement\", by John Balfe, and as published in www.entertainment.ie\n\n\n\nI might be the biggest Elvis fan you’ve ever met. I mean, I’ve seen it all. And I just loved him. I don’t know what it was. I mean, probably the same reason everybody loved Elvis. Cause he was electric. He was just electric, the greatest entertainer I’ve ever seen, and I think the reason why was because — and I heard him say it many times in interviews — , he always did what he felt. Genuinely did what he felt. It wasn’t choreographed. It wasn’t, OK, well, I’m gonna do this move at this time. It was coming up from inside of him, and it was coming out. That’s what it was, and that’s why people connected with it. Cause it was the real deal.” Country music songwriter and singer Frankie Ballard who, along with a few others, voted Elvis as the top entertainer in CMT Top 40 artist countdown, as published in CMT´s online edition of November 21, 2014.\n\n\n\nIt was the autumn of 1971, and two tickets to an Elvis show turned up at the offices of Creem magazine, where I was then employed. It was decided that those staff members who had never had the privilege of witnessing Elvis should get the tickets, which was how me and art director Charlie Auringer ended up in nearly the front row of the biggest arena in Detroit. Earlier Charlie had said, “Do you realize how much we could get if we sold these things?” I didn’t, but how precious they were became totally clear the instant Elvis sauntered onto the stage. He was the only male performer I have ever seen to whom I responded sexually; it wasn’t real arousal, rather an erection of the heart, when I looked at him I went mad with desire and envy and worship and self-projection. I mean, Mick Jagger, whom I saw as far back as 1964 and twice in ‘65, never even came close. Rock critic Lester Bangs' opening sentence in Elvis' obituary, by special request from and published by the Village Voice on 20 August 1977.\n\n\n\nI mean, don't tell me about Lenny Bruce, man - Lenny Bruce said dirty words in public and obtained a kind of consensual martyrdom. Plus which Lenny Bruce was hip, too goddam hip if you ask me, which was his undoing, whereas Elvis was not hip at all. Elvis was a goddam truck driver who worshipped his mother and would never say \"shit\" or \"fuck\" around her, and Elvis alerted America to the fact that it had a groin with imperatives that had been stifled. Lenny Bruce demonstrated how far you could push a society as repressed as ours and how much you could get away with, but Elvis kicked \"How Much Is That Doggie in the Window\" out the window and replaced it with \"Let's fuck.\" The rest of us are still reeling from the impact. Sexual chaos reigns currently, but out of chaos may flow true understanding and harmony, and either way Elvis almost single handedly opened the floodgates. Lester Bangs, \"Where Were You When Elvis Died,\" originally published in \"The Village Voice\", August 29, 1977. Republished in Psychotic Reactions and Carburetor Dung pg. 215-216\n\nthe window and replaced it with \"Let's fuck.\" The rest of us are still reeling from the impact. Sexual chaos reigns currently, but out of chaos may flow true understanding and harmony, and either way Elvis almost single handedly opened the floodgates.\n\nElvis' lowest effective note was a low-G, as heard on \"He'll Have To Go\"(1976); on \"King Creole\" (1958), he growls some low-F's; going up, his highest full-voiced notes were the high-B's in \"Surrender\"(1961) and \"Merry Christmas Baby\" (1971), the high-G at the end of \"My Way\" (1976 live version), and the high-A of \"An American Trilogy\"(1972); using falsetto, Elvis could reach at least a high-E, e.g, as in \"Unchained Melody\" (1977), so, it was very nearly a three-octave range, although more practically two-and-a-half. George Barbel, as a follow up to a question on what was Elvis' range, as published in All Experts.com, on 20th May, 2007.\n\n\n\nBy the time we got towards the end of our stay there, Elvis was worn out, so he got all the singers individually to do a song. Of course, all the musicians knew that I play and sang and they knew some of my songs. Elvis was obviously hesitating and thinking of something else to do, and Ronnie said: 'Let Bardwell sing'. He just went, 'Yeah, right ...'. And Guercio said, 'No, really. You wanna do something else, let him sing, because he can sing'. So Elvis went, 'Ladies and gentlemen, my bassplayer is going to sing now'. So Charlie Hodge gave me his guitar and I got Charlie's mike. Charlie was holding another mike on the guitar, for me to play it. And I didn't know what to do. I mean, how am I going to follow Kathy Westmoreland doing 'My Heavenly Father'? And Donnie Sumner said, 'Do the Hurricane song'. You know, 'Please Don't Bury Me' by John Prine. I got to the last verse of the song that's a bit off color. We were going from 'My Heavenly Father' to 'Kiss My Ass Goodbye', and it just took everybody by surprise. That was a really good moment, because I had shown Elvis a part of me that he didn't know of. He knew that what we had just done was showbusiness, and it was good showbusiness, because it was entertaining. I went back to the dressing room after the show, and Tom Diskin knocked on the door. We let him in, and he said 'I have a message for you from the Colonel' So I figured that I was fired when he sent Tom Diskin into the dressing room, but he said, He wants me to tell you that that's one of the funniest things he's ever seen at an Elvis Presley show'. I was thrilled with that. If I didn't do anything else I had done that. That was fun TCB Bass player Duke Bardwell's story of how how he got to sing John Prine’s ‘Please Don’t Bury Me’ during the October 14th, 1974 closing show in Lake Tahoe, NV, in an interview with Arjan as published on the FECC Forum'spage.\n\n\n\nBaritones UnBound continues the second season of Asolo Rep's five-year American Character Project, an in-depth look at this nation and its people. No other voice has defined the United States quite like the booming sound of the baritone. From Sinatra to Elvis and much more, this musical journey chronicles some of the most beloved singers and songs of all time. Conceived by Broadway leading man and threetime Tony Award nominee Marc Kudisch and created by Merwin Foard, three dynamite baritones take the stage to give us a captivating musical tour of the baritone voice throughout history, namely Marc Kudisch, Jeff Mattsey, and Timothy Splain. Veteran singers Jeff Mattsey and Mark Delavan join Kudisch in an illuminating performance studded with classics from Broadway, opera and beyond. From Gregorian chants to well-known arias (“Ah! Per sempre,” “Largo”) including show tunes (“I am a Pirate King,” “Oh What a Beautiful Mornin’”) and popular music (“It Was a Very Good Year,” “It’s Now or Never,” and “Pretty Women”) Baritoners Unbound's 2015' Press Release,in an article entitld Celebrating the UnCommon Voice of the Common Ma\"n\n\n\n\nAnother time we played with Herman's Hermits who were very popular. Frankly, we didn't rate them musically, but we were impressed when they told us about they having met with Elvis Presley, \"Elvo\" to us. And when they told Ian Anderson he sang like 'Elvo' he was very flattered and to this day the rest of the band and I always call Ian 'Elvo'!” Barriemore Barlow, drummer for Jethro Tull in an interview with Nick Dent-Robinson, recalling their attending Elvis' August 11, 1969 show at the International Hotel in Las Vegas on the special invitation of UK record producer Terry Ellis and as published on 03/04/2014 at the Jethro Tull Forum.\n\n\n\nA few days before Christmas one year, Elvis was in the store buying guns for some of his friends as gifts. There was a customer off to the side looking at a display case that held nothing but expensive Browning over-under shotguns. Presley went up to the gentleman and commented on how nice the guns were. The man agreed, but said they were way out of his price range, since they were all probably in the thousand dollar plus area. Elvis asked the guy which one he would buy if he was purchasing, and the fellow said probably the Diana grade with the gold inlay. Elvis then went back to the counter where Jerry Knight was, and as he left said to Jerry, \"When that guy gets ready to leave, take that Diana grade shotgun out and put it on the counter and give it to him. Tell him Elvis said Merry Christmas.\" Jerry said he did just that, and he thought the guy was going to faint when he received the gift. Ken Barnes, who worked at Kerr's Beverly Hill's Sports Shop, as published by the Californian on December 13, 2017.\n\n\n\nNot only did Elvis give teens their own music with which to identify, he proved that much of the disposable income of this generation would be spent on music, fashion, and media of its own choosing and thus turning that generation into a high-pro!le, identifable group with their own fashion sense, hair styles, slang, taste in music, preferences in movie stars and other favorite pastimes. Richard Barnet in his book The Story Behind the Song: 150 Songs that Chronicle the 20th Century. Westport, Conn.: Greenwood Press, 2004.\n\n\n\nWhile Elvis Presley and Roy Orbison were ruling the rock-pop charts in the US, he had everyone grooving to his music in Nepal. The song \"Deula yo joban timilai deula\" may have sounded similar to what was trending internationally, but was given a funky twist of his own, and arguably was responsible for introducing rock and pop to the entire nation. He became a heartthrob in his country and was soon called the Elvis Presley of Nepal because he came like a breath of fresh air in a music scene dominated by traditional tunes. About Kumar Basnet, as noted in the Kathmandu post's March 15 edition.\n\n\n\nHe started drawing on my front all the way down to my navel, doodling as I spoke to him, in front of hundreds at his dressing room after his August 1970 opening show at the International Hotel in Las Vegas. Incredible sensation, he used a biro!!! That night back at my hotel, alone, I undressed and there they were, the doodlings. I did not wash until they wore off... Shirley Bassey, as told to talk host Graham Norton.\n\n\n\nAs Jack Wilshere completed his first 90 minutes in the Premier League for Arsenal in over three years, and was arguably their best player in the 0-0 draw at West Ham's London Arena on Wednesday evening, \"A Little Less Conversation\", the song by Elvis Presley, was the tune that played the players off the pitch, the lyric urging for \"a little more spark\" a fair assessment of the game. But it is the line about the need for \"a little less conversation, a little more action\" that best sums up his situation at Arsenal... Adam Bate, one of Sky Sports top anchors, assessing Wilshire’s performance for his network, in an article published on December 11, 2017 ( Since Elvis' \"The Wonder of you\" is the song played at Arsenal's Emirates Stadium before players enter the field this could explain West Ham fans' decision to play \"A little less conversation\" when they, in turn, feel their own team needs to improve its play).\n\n\n\nHe had a musically textured rhythmic voice that had emotional intelligence; concentrate on his voice: sweet, remorseful, defiant, suggestive. Eileen Battersby, literary correspondent, citing the reasons for her being hooked on Elvis after \"discovering\" him inadvertently as she changed the dial looking for her favorite classical music radio station, as published in the \"Irish Times\" in August of 2002.\n\n\n\nIn \"Mystery Train\" (1955), he rocks out with an astounding depth, Elvis' voice never sounding so rich, nor so pleading; best of all is his final spontaneous laugh & whoop of excitement, worth its weight in gold. Review of the CD \"Elvis at SUN\", by Piers Beagley, as published in EIN, on 30th June, 2004\n\n\n\nThey are two equivalent beasts even with their differences. Diego Maradona is Elvis Presley singing 'My Way' at his last concert at the Market Square Arena in Indianapolis. He embodies the deity, the absolute power, the sunset, the snowy peaks and the abyss. And Lionel Messi is Paul McCartney, the long-play list, the continuity and the health. To ask one of them to have what the other has doesn't look to be a proof of social intelligence but one of galloping dissatisfaction of a country that doesn't conform with having two of the three best footballers in history in less than 40 years. Argentinean novelist Juan José Becerra, in an article published in July of 2016 at El Clarin, his country's most prestigious newspaper.\n\n\n\nI met Elvis in 1968 at the Aladdin Casino in Las Vegas and had a drink with him. A lady asked him for an autograph but he didn’t have a pen, so I gave him mine. Then he gave me the pen back and that's when I said, “Naw, you keep it Elvis. I don’t think anyone’s going to be asking for my autograph. William O. Beck, in an interview with Jeff Sterling for the Titusville Herald, and published on August 13, 2018.\n\n\n\nElvis is right up there with death and taxes in things that can't be avoided, Writer Joel Beers, reviewing the 1968 NBC TV Elvis Special for OC Weekly, on January 4, 2018.\n\n\n\nLike some sort of Grammy-powered \"Super Friends\" , John Legend, Post Malone, Jennifer Lopez, Blake Shelton and more than a dozen more artists joined forces on February 17,2019, for a prime time television special titled “Elvis All-Star Tribute\". The union of Post Malone and Urban demonstrated that — for Elvis Presley Enterprises, at least — the show's mission, in large part, was to affirm the idea of Elvis' universal appeal. Adam Lambert wore a blue suit and blue suede shoes during his version of \"Blue Suede Shoes\", while Jennifer Lopez went full J.Lo during \"Heartbreak Hotel\"- Another highlight was Mac Davis' solo rendition of \"Memories,\" a song he wrote for the original 1968 special. Davis, 77, the elder statesman amongst the performers (beating John Fogerty by four years), shared a poignant memory of holding the then infant Lisa Marie Presley during a visit to Elvis' Bel Air home. He later was joined by John Legend, who sang a Davis composition that has emerged as one of Elvis' biggest posthumous hits, \"A Little Less Conversation.\" Others on the show included Darius Rucker, Ed Sheeran, Kelsea Ballerini, Alessia Cara, Josh Groban, Pistol Annies and Little Big Town. Lisa Marie did not perform, but introduced a gospel medley segment featuring Carrie Underwood and Yolanda Adams; similarly, actress Riley Keough, Lisa Marie's only daughter, introduced Dierks Bentley, who contributed with the rocker, \"Little Sister\". “I’m here tonight because 50 years ago a King returned,” said Shelton, host of the program and — not coincidentally — a judge on the hit NBC vocal competition program, “The Voice.”, then adding that the original special had been often imitated but never surpassed while, in addition changing,as it also did, the game forever in music and television. John Beifuss, writing for the Commercial Appeal in an article entitled \"Post Malone, J.Lo, Blake Shelton: The Elvis '68 Comeback comeback\",as published on their February 18,2019 edtion.\n\n\n\nDifferent as our sounds were in 1956, I could see that we were in parallel tracks, Elvis was interpreting one kind of black music, R&B, while I found my inspiration in black folk songs, spirituals and calypso. ( A year passed, and while in Las Vegas) Elvis came backstage to say hello and he couldn't have been more decorous, insisting in calling me Mr. Belafonte. Only later would I learn that he had hung out for years with a lot of black musicians and had come by his style legitimately. (Alas), he performed with such put on flash that over the next years, I noticed, he inspired a whole generation of R&B players who thought they could put that flash on, and become Elvis, too.. Harry Belafonte in his autobiography, My song, published in 2011.\n\n\n\nI have been following the sound of my own voice since childhood, growing up in a family of academics in Knoxville. I spent my formative years playing air guitar while listening to the monolithic stereo console in my parents. My first concert experience was seeing an Elvis Presley in Knoxville. I was just about four years old but have some vivid memories of holding my parents’ hands and people screaming, so it was kind of scary. I also remember him doing ‘Hound Dog’ and ‘Teddy Bear.’ And ‘Teddy Bear’ was such a favorite at the age of four that I brought out a big styrofoam guitar for it. Brian Bell, discussing the effect seeing Elvis show in Knoxville, on April 8, 1972 had on him, for Live4ever, published on April 15, 2007.\n\n\n\nDid you ever meet Elvis Presley? Pope Benedict XVI's question to the then quite sick Irish comedian Frank Carson, who, in 1987, had been ordained with a Papal knighthood of the \"Order of St. Gregory\" by the now Saint Pope John Paul II. The then sitting Pope's interest, expressed some 30 years after Presley's death, may lie in the fact that he was stationed, as a young professor within the German priesthood at a town not too far from Presley's barracks during his 18 month stay in Germany with the US Army. Carson's zany reply to the Pope? \"Not yet, your Holiness, but I soon will\", (Published in the Belfast Telegraph on August 10, 2017).\n\n\n\nI think she's going to become as big as Elvis Presley. He was, incidentally, the handsomest guy I ever met in my life, and a very nice person too. Tony Bennett, referring to singer, songwriter, and actress Lady Gaga in an article on Billboard published on August 17, 2011 and during an interview with the Guardian, on 17 October, 2013.\n\n\n\nI remember the first time in '56, I saw Elvis. I’m like, I’m buying that record because it’s just the look that gets you, it’s almost as much as the music. I kind of always had this theory that you look and listen with your eyes and your ears at the same time. He was the first rock 'n roll artist I loved. In my life, I started with him, but as I got into music, Elvis and the Rolling Stones led me to blues. Bill Bentley,American music industry executive in an interview with Salon, published on May 25, 2018.\n\n\n\nI listen to a lot of Elvis on the school bus. My bus driver, Ken Lyons, is — was, he's not with us anymore — but he's the biggest Elvis fan. So Channel 13 on SiriusXM radio, many, many nights listening to Elvis Presley and him educating me on Elvis. He's great, he's one of a kind. You can label him however you want to, but his country career was unbelievable. He had a voice that even if you didn't see all the moves and how good looking he was and all that stuff, you just listen to his voice when he's on the Louisiana Hayride with Faron Young and it's like, 'Wow, his voice is really unbelievable.' Great singer. And lot to learn. Dierks Bentley,in an interview with popculturecountry and publlished on their February 15,2019 edition.\n\n\n\nThe reason I chose Elvis Presley' songs as the teaser for this article is to trigger some autobiographical memories for adults who were adolescents when his music topped the charts, which he dominated throughout the 1950s. Hopefully, these songs will inspire older adults, baby boomers, and people of all ages to get up from your chair and dance.... Christopher Bergland, activities of daily living in an article entitled ̊\"One More Reason to Keep Dancing̊\" as published in Psychology Today's December 19, 2018 edition.\n\n\n\nAppropriation, then, has something to do with intent. When another culture’s property is exploited for profit, that’s appropriation, and it’s always deserving of criticism. Elvis was just being Elvis. In \"Elvis Presley:The Searcher\" an HBO documentary, its signal achievement is in showing how the singer’s early years, family culture, and socioeconomic background made inevitable the musician he was to become. It makes clear that he was, first, and foremost, a committed artist, utterly dedicated to music and its ability to move people. Robby Berman, as published on the Big Think's April 19, 2018 edition, in an article entitled \"Was Elvis Presley a cultural appropiator of black music?\n\n\n\nFernest Acernaux was not playing zydeco on that accordion, it was rhythm and blues. And you couldn’t make it playing French, so we played blues and rock ‘n’ roll from Fats Domino, Bobby Blue Bland and Elvis Presley. Rod Bernard, celebrating his 72 years of pioneering \"swamp pop\", which combines New Orleans-style rhythm and blues, country and western, and Cajun and black Creole music, as ´published in the Daily Advertiser on November 6, 2017.\n\n\n\nElvis is the greatest cultural force in the twentieth century. He introduced the beat to everything, music, language, clothes, it’s a whole new social revolution - the 60’s comes from it.” Leornard Bernstein, as told to TIME founder Henry Luce's top aide Richard Clurman in an article published by TIME on August 10, 2017\n\n\n\nDescribe Elvis Presley? He was the greatest there ever was, is, or ever will be. We did not have the airwaves he had, but he delivered what he obtained brilliantly. Let me conclude by saying that I realized during those early years that Elvis and I were creating a new sound. Chuck Berry as published in http://www.elvis.net/whattheysay/theysayframe.html and as noted in Harry DeWitts Elvis, the Sun years.\n\n\n\nEventually, everybody has to die, except Elvis. Dave Berry, as published in http://www.elvis.net/whattheysay/theysayframe.html\n\n\n\nWelcome to the \"Veranda Suite\", Elvis Presley used to stay here... The Beverly Wilshire Hotel's Front Desk introduction to room 1001 on the 10th floor, which highlights a rooftop yurt purported to provide its guests with a one-in-a-million urban glamping experience right in the centre of the city of Los Angeles, as detailed in an article in the Telegraph on February 21, 2018.\n\n\n\ni) When you think of Vegas, of show business, of flash, of those performances, you think of Elvis. He is iconic; a lot of performers today look to that for inspiration ii) You have to have soul to sing like Elvis, and Elvis had soul\" ” Beyonce, i) as published in www.graceland.com and ii) Elvis Viva Las Vegas documentary.\n\n\n\nElvis Presley movies – I’m a big Elvis fan – although I don’t think you should feel guilty about pleasures. UK comedian Sanjeev Bhaska's answer to a question on what is his biggest guilty pleasure, in an interview with the Mail Online poubkished on July 29, 2018.\n\n\n\nWhen they asked me where I would want them to place my statue, I said I wanted it to stand between the figures of Elvis Presley and Michael Jackson, Asha Bhosle, Superstar singer from India, on what she told the Madame Russaaud people in London on the day her statue, only the second from a woman from her country, was unveiled,as published on INDIARV's online website on October 2, 1917.\n\n\n\nIntensity of communication, emotion, how the fusion of poetry is related to me as a listener. I’m disappointed by the bland and perfect vocal accomplishment, which I hear on so many recordings. Which is not to say that classical singers shouldn’t try to become vocally masterful. I take my cue more and more from good pop singers. The other day I was looking at an early concert of Elvis Presley. It was fascinating to watch, the body language, the vocal suppleness Conor Biggs, Irish bass/baritone and classical singer, a founding member of Psallentes, a Gregorian chant ensemble, explaining to Michael Dervan, of the Irishman, for tips he looks for in a recital, as a way to better communicate with a listener, as published on that paper on February 1, 2013\n\n\n\nIn late 1959, Ibn Saud, the then King of Saudi Arabia. was spending time in Germany for medical reasons. One of his sons was a huge Elvis admirer, giving him a precious garment with golden applications, a waterpipe and a tea set with the royal crest on it, as a thank you gesture for his having left the Grunwald Hotel so that his father and his entire entourage could make total use of it. Soon after posing with the garment for the King's son at his newly rented house on #14 Goethestrasse, his friend and fellow GI Charlie Hodge had a zany idea: why couldn't he go out and walk in front of the German people, or anyone, for that matter, using the garment so as not to be recognized. This was finally done on February 1960, as he took a cab to the \"Mainzer Karneval\", a big public party, staying there for 3 days in the nearby town of Mainz which was not far from Bad Nauheim. And nobody noticed the by then Sgt Elvis Presley, in spite of him being accompanied by Hodge, plus two bodyguards all dressed as sailors as well as by a mysterious girl from Bad Nauheim, who did the translations. Elvis joined the whole programme, the clubs, the pubs, the bars, parades but stayed sober. The others did not, LOL. but they all returned safe, late at night. As published by BILD, Germany's highest selling tabloid, in an article published in March of 1960.\n\n\n\nSo I said \"Why don't we turn out all the lights so we don't see this vast empty looking studio the size of a football field and make it as intimate as we can?\" We could barely make Elvis out through the glass from the control room into the studio when we cued him the backing-track. And then, Elvis started to sing. It was magic,. Next thing I know he's curled on the floor in almost a fetal position singing with a microphone next to his mouth. The hair on my arms were standing up. And that's the take that we wound up using on the soundtrack album. I did not use it in the TV show because I'm a total believer that if you're doing television I don't want anyone lip-synching. I want the real thing. And to be completely honest, as great as the sit-down shows are, had I been able to get cameras and tape him there, it would have been even greater. I never put anybody I worked with on a pedestal, yet the first time I saw him, I was awed, first of all, by the way he looked. If he was not famous, you would still stop and stare. As a director, you’re looking to see which is the good side, the bad side. Elvis was perfect from every angle. It was like a god walking in towards me... Steve Binder, director of the 1968 NBC/TV Special explaining how Elvis recorded \"If I can dream\", on June 23, 1968, exclusive for The King's court, on February 6, 2010, as well as in an interview with Vanity Fair published on August 17, 2018.\n\n\n\nHis privileged access let him show Muhammad Ali away from the ring: preaching or sleeping, posing with black leaders like Malcolm X and James Meredith or playing with his children or with Elvis Presley. About Howard Bingham, the photographer who took an estimated 1 million pictures of Muhammad Ali over more than 50 years while becoming one of the boxer’s closest friends, as published in his obituary in the Seattle Times, on December 23, 2016\n\n\n\nTime Magazine at the turn of the century asked its readers to tell them who they thought was the person who contributed most to the 20th Century. Well, obviously people said Martin Luther King Jr, others said Nelson Mandela and Elvis Presley. But who do you think was chosen? Einstein, whose books I saw being burned in 1933... Journalist and Holocaust survivor Walter Bingham, in an interview with CrossRhyhms published on August 11, 2018.\n\n\n\nCilla would record and perform Beatles numbers throughout her career, but in the 60s and up to the mid-70s, she did more than most. Her renditions of \"Yesterday\",\"For No One\" , \"Across The Universe\" and others became big favourites with radio DJs, not to mention with The Beatles, who always liked the way she interpreted their material. Previous praise from Randy Newman, for her take on one of his songs had been sweet music to her ears. And just imagine how she felt when Paul McCartney said to her that her \"Long And Winding Road\" was the song's definitive version. She had, however and this to her dying day, something to be immensely proud of – Elvis Presley had her \"You're my world\" on his famous jukebox at Graceland. About UK singer Cilla Black, in an article published at the Sunday Post̪'s December 28, 2018 edition but which nevertheless fails to highlight that it was her \"You're my world\" which was actually being played at Elvis' jukebox when the Beatles visited him at his 525 Perugia Way home in Bel Air, California on August 27, 1965.\n\n\n\nI was in a friend's studio when a buddy of his called and told him. 'I got some news for you. Do you want me to tell you now or later?' I said later because I was in the studio when President Kennedy was killed and also when Martin Luther King was killed, so I knew the effect bad news can have on a session. When the session was over he told me and I thought he was joking and it didn't hit me until I lay down to sleep. The one other time that I experienced that was when my mother and my son died. It wasn't because he wouldn't he doing any more of my songs. It was like a piece of the whole business. I mean some people you just figure are never going to die. Inside, they'll always live. When they're gone, a certain piece goes and you just can't believe it. Reaction of Otis Blackwell, the African-American songwriter, singer, and pianist, whose work significantly influenced rock and roll, to the death of Elvis Presley\n\n\n\nHe would probably be considered a baritone, but he could reach notes that most baritone singers could not. Much of his abilities emanated from a very intense desire to execute a song as he wanted to do it, which meant that he really sang higher than he would normally be able to. When the adrenalin is going, and the song is really pumping, you can get into that mode where you can actually do things, vocally, that you couldn’t normally do. So he had a tremendous range because of his desire to excel and be better, and that’s why he could do a lot of things that most people couldn’t. Terry Blackwood, lead singer of the Gospel group, the \"Imperials\".\n\nsang higher than he would normally be able to. When the adrenalin is going, and the song is really pumping, you can get into that mode where you can actually do things, vocally, that you couldn’t normally do. So he had a tremendous range because of his desire to excel and be better, and that’s why he could do a lot of things that most people couldn’t.\n\nThe moment he walked in, it was almost like all the guys there were bowing down to him, but he didn’t care whatsoever. It was an amazing time, because the electricity just floated through the air. Everybody there was on cloud nine but he just acted the way a country boy would act. Elvis was truly a gentleman and a sweetheart of a guy. Drummer Hal Blaine, telling Rolingstone what it felt like to be with Elvis in the studio during the taping of 1968 NBC special, and in an article published on August 16, 2017.\n\n\n\nMy grandmother, known as Ms Topp at the local public school, lived on Church Street. She taught Elvis Presley music and I’ll tell you a funny story about it. Years later when I asked what he was like, she said ‘Oh you know, he really was a sweet boy but he didn’t have a lick of talent’ so that tells you something about how we judge talent in our family that’s for sure,” LOL. Marion Blakey, former head of Rolls-Royce North America and of the Federal Aviation Administration, recalling what she calls her \"first claim to fame\", in an interview to Tupelo̪'s Daily Journal published on October 31, 2018.\n\n\n\nRecord producer Phil Spector, who is currently serving his sentence for the 2003 shooting death of actress Lana Clarkson, finally settled his divorce with his third wife, Rachelle Short. In the setlement, signed December 4, 2018, they are forced to sell their infamous castle and evenly divide the proceeds, while she keeps many of her vehicles, most notably a 2015 Aston Martin Vanquish and even a small aircraft. He, on the other hand, keeps his various Grammy Awards, Gold and Platinum Records, a 1965 Rolls Royce Silver Cloud III and John Lennon memorabilia, including an electric guitar and a litograph, as well as a pair of diamond cufflinks gifted personally to him by Elvis Presley. Blast Magazine, in an article entitled \"Phil Spector splits castle with ex-Wife, keeps diamond cufflinks from Elvis in divorce settlement\", published twenty days after it was finalized, in an article published on December 24, 2018.\n\n\n\nFrom Thursday to Sunday, fans traveled in a mob mentality with Tiger Woods, sprinting from hole to hole and emphatically yelling “He’s like Elvis Presley,” and, “We want to roar with you, baby!” along the way. It was the “Walking Dead” meets “Caddyshack.” A strange combination.. but the truth. Jon Blauvelt, recalling the way Tiger Woods captivated the attention of thousands upon thousands of people who stormed upon Ponte Vedra Beach for the sole reason of watching him play, as published in the Ponte Vedta Reporter on May 13, 2018.\n\n\n\nBut better Elvis should pay those multimillions in taxes (thereby doing as much for the War on Poverty) than you or I. \"If his manager\", said Goldman, \"had sheltered his income from the taxman and invested it intelligently, Elvis Presley could have been as wealthy as Bob Hope\". Well, I ask you. But I think we can be grateful to Elvis for his grin, his pelvis, his leap, and for the punky, biracial, engaging, ineluctably erotic and still mysterious tenor of his voice. Roy Blount Jr., reviewing Albert Goldman's Elvis, for the NYT in 1981. See also Kelly Phillips Erb's essay on Forbes, focussing on Elvis being his country's highest personal taxpayer for almost a decade.\n\n\n\nHe had an amazing charisma, was so passionate about what he did, and the people could feel it. James Blunt in a 1997 filmed interview\n\n\n\nI remember well the afternoon when Elvis Presley and his mother came into the Tupelo Hardware. He wanted to buy a .22 rifle and his mother wanted him to buy a guitar. I showed him the rifle first and then I got the guitar for him to look at. I put a wood box behind the showcase and let him play the guitar for some time. Then he said he did not have that much money, which was only $7.75 plus a 2% sales tax. His mother told him that if he would buy the guitar instead of the rifle, she would pay the difference for him. The small amount of money that he had to spend had been earned from running errands and doing small jobs for people. Forrest L. Bobo, of the Tupelo Hardware store in Tupelo, MS, in an an affidavit written in 1979 where he confirmed the details of the purchase of Elvis first guitar, a 1940 Kay model, paid for by both Elvis, with his savings, and his mother, for his eleventh birthday and on January 8, 1946.\n\n\n\nI want to do an Elvis Presley song... Andrea Bocelli, as suggested to musician and producer David Foster during the rehearsals for a television special taped in Portofino, Italy, on August 11, 2012. They settled on \"Love me Tender\", one of Bocelli's favourite Elvis songs, with Foster playing the piano. According to Reba McEntire, Elvis is one of Bocelli's favourite singers.\n\n\n\nWe’re now trying to get the National Park Service to recognize his home in Louieville as a national historic landmark. Hopefully we can partner with them to continue to run it as a museum, like they’ve done it with Martin Luther Kings home in Atlanta and with Elvis Presley’s home in Memphis. Ali walks among those giants.” George Bochetto, trial lawyer and former Pennsylvania State Boxing Commissioner in an article published at Wave3 on February 24, 2019\n\n\n\nAt age 5, he decided that he wanted to be a musician when his father took him to the Elvis Presley concert in his home town of Sioux City on May 26, 1956. About US musician Tommy Bolin, (1951-76) former lead guitarist for the UK band Deep Purple, in an article penned by Tom Longden and published on the Des Moines Register on 23 December 2017.\n\n\n\nThree friends of mine and I were singing ‘Teddy Bear\" and I remember thinking it not at all remarkable that we would sing this Elvis Presley song. So here’s these four black young men singing, ‘Just wanna be your Teddy Bear,’ We just said, “This is OK, this guy is alright.‘ I think my peers thought Elvis Presley was OK. Julian Bond, African American Civil rights leader recalling the time, in 1957, when he and his friends found themselves singing an Elvis song at an ice-breaker event at Atlanta’s prestigious black Morehouse College, as published by the Independent on August 16, 2017.\n\n\n\nWe Germans will never understand U.S. foreign policy. You save Europe with The Marshall Plan, Berlin with the Airlift, and then you turn around and give us.... Elvis Presley.\" The Federal City of Bonn's Public Relations Office on the arrival of PFC Elvis Presley to Germany, on October 3, of 1958.\n\n\n\ni) I recently met with Coretta Scott King, John Lewis and some of the other leaders of the American civil rights movement, and they reminded me of the cultural apartheid rock & roll was up against. I think the hill they climbed would have been much steeper were it not for the racial inroads black music was making on white pop culture. The Beatles, the Rolling Stones, Creedence Clearwater Revival were all introduced to the blues through Elvis. He was already doing what the civil rights movement was demanding: breaking down barriers. You don't think of Elvis as political, but that is politics: changing the way people see the world. ii) In Elvis, you had the whole lot; it's all there in that elastic voice and body. As he changed shape, so did the world. His last performances showcase a voice even bigger than his gut, where you cry real tears as the music messiah sings his tired heart out, turning casino into temple. I think the Vegas period is underrated. I find it the most emotional. By that point Elvis was clearly not in control of his own life, and there is this incredible pathos. The big opera voice of the later years -- that's the one that really hurts me. Bono lead singer of U2, for Rolling Stone Magazine, as published in their April 15, 2004 edition.- 2004 Issue Rolling Stone\n\n\n\nI identify a lot with Elvis. He was a loyal guy and love his style of singing. Jon Bon Jovi as published in http://www.elvis.net/whattheysay/theysayframe.html\n\n\n\nElvis Presley was serving in the military in 1959 when he came under the weather. Doctors diagnosed tonsillitis and suggested that the vocalist, then the biggest performer in the universe, have his tonsils removed. Presley, already more trustworthy than most modern performers in his pleasant acceptance of military duty, agreed. The problem was that no doctor nearby wanted to risk operating on the star, fearing that malpractice would leave him without his golden voice, and either a lawsuit or an an angry fan could ruin any medical career and/or life. They gave him penicillin instead and fortunately everything worked out Ryan Book, in The Music Times Dec 1, 2014\n\n\n\nWhen Bob King and I hosted our radio shows on WBMK and WKGN in the 1980s, we played R&B music of the 1940s through 1969, talked about the music, the artists and stories related to the music industry and revealed the real names of the performers while taking requests from the listeners. We would chuckle as we introduced “The Twist” by Ernest Evans. How could our audience know that the real name of the man who recorded “It’s Just a Matter of Time” was Benjamin Franklin Peay? I believe I would have changed my name to Brook Benton, too. Yet one could go from bad to worse. I don’t know why Otha Elias Bates McDaniels changed his name to Bo Diddley. Dinah Washington had 34 top 10 records. She didn’t like her birth name, Ruth Jones, and changed it. Some of the others were James Brown, the Godfather of Soul, with 107 hits during the time we were on the air. Billie Holiday, the great jazz singer changed her name from Eleanor Gough. Many referred to her as Lady Day. Ella Fitzgerald, the most honored jazz singer of all time, won the Down Beat Magazine poll as top female vocalist more than 20 times. Aretha Franklin was the Queen of Soul with 60 numbers on that chart during our broadcast. Although we did not play any Bessie Smith, we knew she had been dubbed Empress of the Blues. Finally, on our shows we recognized Elvis Presley, who had 33 numbers on the R&B chart, as the King of Rock ‘n’ Roll. Robert J. Booker African American freelance writer and former executive director of the Beck Cultural Exchange Center, in an article published by the Knoxville News Sentinel on 11 October 2016.\n\n\n\nWe became very good friends, leased homes in Bel Air and visited each other. And back then, in the early 60's of course, I had a wife, and four little children, he was not married, and would come over some afternoons unannounced and visit with me, my wife and my children. They would maybe jump out of the swimming pool, and come running up and get in his lap, and he would become soaking wet, you know, and I would say, 'Girls, don't do that'. And Elvis said, 'Oh, no, let them, let them'. And I knew that he wanted a family. Pat Boone, in an exclusiv3e interview with David Adamas, for elvisaustralia\n\n\n\nHe was not quite a hillbilly, not yet a drugstore cowboy. He was a Southern — in that word’s connotation of rebellion and slow, sweet charm. Stanley Booth, casting back to the 1950s in his Esquire magazine article “Situation Report: Elvis in Memphis, 1967.”\n\n\n\nI may consider filing a resolution for Indiana to honor Elvis, after all we should do something to recognize the fact that his last concert was here in Indiana. Bruce Borders Representative for the 45th District in the Indiana House of Representatives, former Mayor of Jasonville, Indiana and an Elvis ETA since 1980.\n\n\n\nWe’ve drafted people who are far, far more important than he is. Chairman of the Memphis Draft Board Stanley Bowers's statement to the media, made public about a month before it became known that he had made a special visit to Graceland, over the 1957 Christmas period, to PERSONALLY inform Elvis of his impending draft, the first time that such a special gesture had ever been made by any Army Board, to any draftee, in the history of the US Armed Forces, as noted in the book, \"Colonel Parker, the Curious life of Elvis' manager\"\n\n\n\nApparently Elvis heard my demos, because we were both on RCA, and Colonel Parker thought I should be introduced to him and maybe the two of us start working in a production-writer capacity. But it never came to pass. I would have loved to have worked with him. God, I would have adored it. He did send me a note once, which read \"All the best, and have a great tour.\" I still have that note. He was a major hero of mine and I was probably stupid to think that having the same birthday as him meant something. David Bowie, commenting on what could have taken place had he and Elvis worked together, as published in interview bowiewonderworld and wwwelvisnet\n\n\n\nMy celebrity crush was Elvis Presley. I got to first meet him with George at Madison Square Garden in 1972. Pattie Boyd, the former wife of George Harrison and Eric Clapton, in an interview with the Sydney Herald in an article entitled \" Pattie Boyd: What my marriage to George Harrison and Eric Clapton taught me, as published on May 5, 2018. Two years later, she accompannied Clapton to a meet up with Elvis at a Memphis cinema. (Kindly refer to Clapton's entry).\n\n\n\nTo have Elvis come home, so to speak during this bicentennial year for the state he was born into is very exciting, Betsy Bradley, Director of the ", "images": ["https://en.wikiquote.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/80/Wikipedia-logo-v2.svg/50px-Wikipedia-logo-v2.svg.png", "https://en.wikiquote.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Commons-logo.svg/50px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/62/Elvis%27_tomb.jpg/220px-Elvis%27_tomb.jpg", "https://en.wikiquote.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/82/Elvis_Presley_1970.jpg/220px-Elvis_Presley_1970.jpg", "https://upload.wikimedia.org/wikipedia/commons/8/82/Elvis_Presley_1970.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Elvis_Presley_promoting_Jailhouse_Rock.jpg/220px-Elvis_Presley_promoting_Jailhouse_Rock.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/8/82/Elvis_Presley_1970.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikiquote.org/wiki/Elvis_Presley", "title": "Elvis Presley", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.13", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/8/82/Elvis_Presley_1970.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikiquote.org", "summary": ""}