{"url": "https://www.bustle.com/articles/191829-how-to-make-a-gel-manicure-last-as-long-as-possible-according-to-an-expert", "text": "For a woman like me, gel manicures that last two weeks are a dream come true. Not only are they supposed to be extra-long lasting so your nails look presentable for weeks on end, but they ensure that you only have to get your butt to the salon (which is my least favorite weekend activity) twice a month, max. Sounds too good to be true, right?\n\nWhen gel manicures first became a thing, I thought I'd found the solution to all of my problems. As someone who could barely keep a manicure in tact on the way to the dryer, let alone for an entire week, it felt like the miracle polish that could not only dry immediately, but also last two weeks. That is, until I chipped it four days later, and had to peel the entire manicure off (which, by the way, is a serious no-no and can really damage your nails).\n\nSo what's the deal? Why is it seemingly impossible to keep gel manicures in tact for their intended two weeks? I spoke to Samira Far, founder of Bellacures, about her tips for making gel last as long as they're actually supposed to. \"A proper gel manicure should last for two weeks,\" says Far. \" Around that time, your nails will have grown out and you will start to notice.\" If you've made it that long, mazel tov! It's never happened to me, but apparently it really is possible! Here are seven things you can do ride your gel nails out until the very end.\n\n1. Keep Up Your Nail Strength\n\nFormula X The Prescription CLIX! – Treatment Nail Polish Set, $19.50, Sephora.com\n\nGet those girls to the gym! (JK LOL.) But you do need to take measures to keep up your nail strength \"If you have weak, dry or damaged nails to begin with, gels will tend to not last as long,\" says Far. Try a strengthening base and top coat on your non-gel weeks, and don't peel off or pick at your polish!\n\n2. Keep Your Nails Clean\n\nSally Hansen Salon Professional Gel Nail Polish Cleanser, $4.57, Jet.com\n\nMake sure to thoroughly clean your nail beds with alcohol prior to the base coat to make sure all oils are gone. You can basically just wipe them down with an alcohol swab or nail polish remover pad. \"You almost want to 'dehydrate' the nail,\" says Far. \"This will ensure the polish will last longer.\"\n\n3. Make Sure The Gel Is Being Applied Correctly\n\nYou may not be a manicure expert, but you should know what to watch out for when you're having polish put on. \"When the gel isn’t applied correctly, there tends to be air bubbles or lifted edges, which causes chipping and makes for an easy target to start picking them.\" This can cause damage to your nail beds, so don't do it!\n\n4. Don't Skimp On Drying\n\nJustin Sullivan/Getty Images News/Getty Images\n\nTrust me, I know — sitting with your nails under the gel dryer is annoying, especially when you get a text you need to respond to immediately. But, it's still a must. \"Make sure you leave your nails under the UV lamp for long enough, or event a little longer than you are supposed to,\" says Far. \"If you under-cure the polish and don't give it enough UV light, the polish won't firm up enough to stay on as long as it should.\"\n\n5. Moisturize!\n\nDeborah Lipman Cuticle Oil, $20, Sephora.com\n\nLike with any part of your body, your nails need moisture and hydration too! \"Be sure to moisturize your nails and cuticles constantly with vitamin E oil to help reverse the drying effect,\" says Far.\n\n6. Know What To Do If You Do Get A Chip\n\nRed Lips Manicure Set, $4.39, Partycity.com\n\nFirst: Don't panic. Then: \"If you can’t make it to the salon, clip off the lifted gel with a nail or cuticle clipper, buff it down to flatten it out, and fill in the chip with a similar color until your next appointment,\" says Far.\n\n7. Find A Salon With A Guarantee\n\nA lot of salons offer a guarantee (Bellacure's is 10 days) and will fix gel manicures for free if you end up with an early chip. Talk about #thumbsup!\n\nImages: Bustle; Courtesy of Brands", "images": ["https://imgix.bustle.com/lovelace/getty/56990829.jpg?w=646&fit=max&auto=format&q=70", "https://imgix.bustle.com/rehost/2016/10/28/8c8e144d-148e-4b85-ab68-bb5f269f9d5a.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://cdn.bustle.com/bustle/production/public/loading-d7a38c.svg", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/rehost/2016/10/28/8c8e144d-148e-4b85-ab68-bb5f269f9d5a.jpg?w=970&h=546&fit=crop&crop=faces&auto=format&q=70", "https://imgix.bustle.com/lovelace/uploads/1137/31fcf4b0-7e9e-0134-ce15-0aec1efe63a9.jpg?w=646&fit=max&auto=format&q=70", "https://imgix.bustle.com/lovelace/uploads/1137/0a957f00-7ea4-0134-ce0b-0aec1efe63a9.png?w=646&fit=max&auto=format&q=70", "https://imgix.bustle.com/lovelace/uploads/1137/5d8de6d0-7ea2-0134-ce15-0aec1efe63a9.jpg?w=646&fit=max&auto=format&q=70"], "top_img": "https://imgix.bustle.com/rehost/2016/10/28/8c8e144d-148e-4b85-ab68-bb5f269f9d5a.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/articles/191829-how-to-make-a-gel-manicure-last-as-long-as-possible-according-to-an-expert", "title": "How To Make A Gel Manicure Last As Long As Possible, According To An Expert", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "fb": {"app_id": 132694503601208}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/articles/191829-how-to-make-a-gel-manicure-last-as-long-as-possible-according-to-an-expert", "type": "article", "title": "How To Make A Gel Manicure Last For Two Weeks", "description": "For a woman like me, gel manicures that last two weeks are a dream come true. Not only are they supposed to be extra-long lasting so your nails look presentable for weeks on end, but they ensure that you only have to get your butt to the salon…", "image": {"identifier": "https://imgix.bustle.com/rehost/2016/10/28/8c8e144d-148e-4b85-ab68-bb5f269f9d5a.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "For a woman like me, gel manicures that last two weeks are a dream come true. Not only are they supposed to be extra-long lasting so your nails look presentable for weeks on end, but they ensure that you only have to get your butt to the salon…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}