{"url": "https://www.rollingstone.com/music/music-news/chris-cornells-widow-vicky-pens-letter-to-late-singer-im-sorry-you-were-alone-on-final-night-2-193292/", "text": "Chris Cornell‘s widow, Vicky, has published an emotional open letter to her late husband. “I’m sorry you were alone, and I know that was not you, my sweet Christopher,” she wrote to in the note, issued via Billboard. “Your children know that too, so you can rest in peace.”\n\nElsewhere in the soul-bearing letter, she wrote that she thinks of the Soundgarden, Audioslave and Temple of the Dog frontman “every minute of every day,” adding, “I will fight for you” and that she still felt connected to him. “It has been said that paths that have crossed will cross again, and I know that you will come find me, and I will be here waiting,” she wrote.\n\nChris died of suicide by hanging last Thursday at the age of 52. Shortly after his death, Vicky issued a statement speculating that her husband had suffered an adverse side effect of Ativan, an anxiety medication he took. “When we spoke after the show, I noticed he was slurring his words; he was different,” she wrote then. “When he told me he may have taken an extra Ativan or two, I contacted security and asked that they check on him. What happened is inexplicable and I am hopeful that further medical reports will provide additional details. I know that he loved our children and he would not hurt them by intentionally taking his own life.”\n\nA note from Vicky’s lawyer, Kirk Pasich, accompanied her statement then, saying that: “Chris, a recovering addict, had a prescription for Ativan and may have taken more Ativan than recommended dosages.” Moreover, he said that if Chris had taken his own life, he’d done so unknowingly.\n\nCornell’s family will hold a funeral for the singer on Friday at Los Angeles’ Hollywood Forever cemetery. It is also planning on holding a public memorial, though details for that are not yet public.\n\nRead Vicky Cornell’s full open letter:\n\nTo My Sweet Christopher,\n\nYou were the best father, husband and son-in-law. Your patience, empathy and love always showed through.\n\nYou had always said I saved you, that you wouldn’t be alive if it were not for me. My heart gleamed to see you happy, living and motivated. Excited for life. Doing everything you could to give back. We had the time of our lives in the last decade and I’m sorry, my sweet love, that I did not see what happened to you that night. I’m sorry you were alone, and I know that was not you, my sweet Christopher. Your children know that too, so you can rest in peace.\n\nI’m broken, but I will stand up for you and I will take care of our beautiful babies. I will think of you every minute of every day and I will fight for you. You were right when you said we are soulmates. It has been said that paths that have crossed will cross again, and I know that you will come find me, and I will be here waiting.\n\nI love you more than anyone has ever loved anyone in the history of loving and more than anyone ever will.\n\nAlways and forever,\n\nYour Vicky\n\nChris Cornell’s wife Vicky issued a statement speculating whether his suicide was the result of too much anxiety medication. Watch here.\n\n", "images": ["https://www.rollingstone.com/wp-content/themes/vip/pmc-rollingstone-2018/assets/build/images/_dev/vivid-seats.png", "https://www.rollingstone.com/wp-content/uploads/2018/08/RS-Get-The-Magazine-062818.png", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-vicky-cornell-chris-cornell-a3383ab5-dc89-4f1d-ad4c-7d4d24920132.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.rollingstone.com&path=%2Fmusic%2Fmusic-news%2Fchris-cornells-widow-vicky-pens-letter-to-late-singer-im-sorry-you-were-alone-on-final-night-2-193292%2F&ct=article&lob=rollingstone&loc=us&env=desktop&post_id=193292"], "top_img": "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-vicky-cornell-chris-cornell-a3383ab5-dc89-4f1d-ad4c-7d4d24920132.jpg", "keywords": [], "authors": ["Kory Grow", "Senior Writer", "Kory Grow'S Most Recent Stories", "Hear Opeth S Proggy New Single In Both Swedish", "Tupac S Private Apology To Madonna Could Be Yours For", "Hear Lily Allen Lament A Dying Phone Battery On Oscar Scheller S", "View All"], "canonical_link": "https://www.rollingstone.com/music/music-news/chris-cornells-widow-vicky-pens-letter-to-late-singer-im-sorry-you-were-alone-on-final-night-2-193292/", "title": "Chris Cornell’s Wife Vicky Doesn’t Blame Him for Suicide – Rolling Stone", "meta_data": {"viewport": "width=device-width, initial-scale=1", "theme-color": "#df3535", "apple-mobile-web-app-title": "Rolling Stone", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.rollingstone.com/wp-content/themes/vip/pmc-rollingstone-2018/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.rollingstone.com/wp-content/uploads/2018/07/cropped-rs-favicon.png?w=270", "msapplication-TileColor": "#eff4ff", "application-name": "Rolling Stone", "description": "Vicky Cornell, the widow of Chris Cornell, has penned an open letter to her late husband saying that she would fight for his memory.", "news_keywords": "Chris Cornell, Soundgarden, Suicide", "og": {"type": "article", "title": "Chris Cornell’s Widow Vicky Pens Letter to Late Singer: I Don't Blame You for Suicide", "url": "https://www.rollingstone.com/music/music-news/chris-cornells-widow-vicky-pens-letter-to-late-singer-im-sorry-you-were-alone-on-final-night-2-193292/", "description": "“It has been said that paths that have crossed will cross again, and I know that you will come find me, and I will be here waiting,” she writes", "site_name": "Rolling Stone", "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-vicky-cornell-chris-cornell-a3383ab5-dc89-4f1d-ad4c-7d4d24920132.jpg", "width": 1024, "height": 700, "alt": "chris cornell police report, chris cornell ativan, chris cornell funeral, chris cornell cause of death, chris cornell suicide, chris cornell death detroit police report, chris cornell suicide details, vicky cornell, chris cornell wife, soundgarden"}, "locale": "en_US"}, "article": {"published_time": "2017-05-24T21:10:00+00:00", "modified_time": "2018-06-25T15:58:56+00:00"}, "twitter": {"text": {"title": "Chris Cornell’s Widow Vicky Pens Letter to Late Singer: ‘I’m Sorry You Were Alone’ on Final Night"}, "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-vicky-cornell-chris-cornell-a3383ab5-dc89-4f1d-ad4c-7d4d24920132.jpg", "alt": "chris cornell police report, chris cornell ativan, chris cornell funeral, chris cornell cause of death, chris cornell suicide, chris cornell death detroit police report, chris cornell suicide details, vicky cornell, chris cornell wife, soundgarden"}, "card": "summary_large_image", "site": "@RollingStone", "creator": "@korygrow", "title": "Chris Cornell’s Widow Vicky Pens Letter to Late Singer: ‘I’m Sorry You Were Alone’ on Final Night", "description": "Vicky Cornell, the widow of Chris Cornell, has penned an open letter to her late husband saying that she would fight for his memory."}, "generator": "WordPress 5.2.2", "author": "Kory Grow", "content_type": "Article", "title": "Chris Cornell's Widow Vicky Pens Letter to Late Singer: 'I'm Sorry You Were Alone' on Final Night", "published_at": "2017-05-24 21:10:00", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-vicky-cornell-chris-cornell-a3383ab5-dc89-4f1d-ad4c-7d4d24920132.jpg?w=1024", "comment_count": 0, "tags": "Suicide", "topics": "Music News", "body": "Chris Cornell's widow, Vicky, has published an emotional open letter to her late husband. \"I'm sorry you were alone, and I know that was not you, my sweet Christopher,\" she wrote to in the note, issued via Billboard. \"Your children know that too, so you can rest in peace.\"Elsewhere in the soul-bearing letter, she wrote that she thinks of the Soundgarden, Audioslave and Temple of the Dog frontman \"every minute of every day,\" adding, \"I will fight for you\" and that she still felt connected to him. \"It has been said that paths that have crossed will cross again, and I know that you will come find me, and I will be here waiting,\" she wrote.Chris died of suicide by hanging last Thursday at the age of 52. Shortly after his death, Vicky issued a statement speculating that her husband had suffered an adverse side effect of Ativan, an anxiety medication he took. \"When we spoke after the show, I noticed he was slurring his words; he was different,\" she wrote then. \"When he told me he may have taken an extra Ativan or two, I contacted security and asked that they check on him. What happened is inexplicable and I am hopeful that further medical reports will provide additional details. I know that he loved our children and he would not hurt them by intentionally taking his own life.\"A note from Vicky's lawyer, Kirk Pasich, accompanied her statement then, saying that: \"Chris, a recovering addict, had a prescription for Ativan and may have taken more Ativan than recommended dosages.\" Moreover, he said that if Chris had taken his own life, he'd done so unknowingly. Cornell's family will hold a funeral for the singer on Friday at Los Angeles' Hollywood Forever cemetery. It is also planning on holding a public memorial, though details for that are not yet public.Read Vicky Cornell's full open letter:To My Sweet Christopher,You were the best father, husband and son-in-law. Your patience, empathy and love always showed through.You had always said I saved you, that you wouldn't be alive if it were not for me. My heart gleamed to see you happy, living and motivated. Excited for life. Doing everything you could to give back. We had the time of our lives in the last decade and I'm sorry, my sweet love, that I did not see what happened to you that night. I'm sorry you were alone, and I know that was not you, my sweet Christopher. Your children know that too, so you can rest in peace.I’m broken, but I will stand up for you and I will take care of our beautiful babies. I will think of you every minute of every day and I will fight for you. You were right when you said we are soulmates. It has been said that paths that have crossed will cross again, and I know that you will come find me, and I will be here waiting.I love you more than anyone has ever loved anyone in the history of loving and more than anyone ever will.Always and forever, Your VickyChris Cornell's wife Vicky issued a statement speculating whether his suicide was the result of too much anxiety medication. Watch here.", "fragment": "!"}, "movies": [], "publish_date": 1495660200.0, "source": "https://www.rollingstone.com", "summary": ""}