{"url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/07/24/michael-phelps-didnt-actually-race-a-real-shark-on-tv-and-viewers-arent-happy/", "text": "Remember back in December 2014, when Discovery Channel hyped that a man would be eaten and then regurgitated by a giant snake on a special called “Eaten Alive?” Then that didn’t actually happen, and viewers were furious?\n\nWe bring this up because 57 minutes into Discovery’s heavily promoted Sunday night Shark Week program — in which Olympic powerhouse swimmer Michael Phelps was set to race against a great white shark — viewers heard this quote from ecologist Tristan Gutteridge, one the featured scientists:\n\n“Clearly, we can’t put Michael in one lane and a white shark on the far lane. We’re gonna have to do a simulation.”\n\nHold on. So Phelps wasn’t going to actually race a shark in a TV event titled “Phelps vs. Shark: Great Gold vs. Great White”?! Why was the hour-long special billed as such?\n\nWhile common sense probably could have saved any disappointment — along with preshow interviews where Phelps assured everyone that he wouldn’t really race next to a shark in open water — many viewers were not pleased.\n\nMichael Phelps race against a computer generated shark will go down as one of TV's most hyped flops. #gullibleTVviewers — PhantomAcct (@phantomacct) July 24, 2017\n\nphelps racing a fake shark is like when ur teacher says there's gonna be a sub but shows up the next day — リ (@reqnna) July 24, 2017\n\nMichael Phelps has been hyping up that he's going to race a shark for months now. He did it tonight and it was a damn CGI shark #FakeNews — Cole Hill (@theSwoleCole) July 24, 2017\n\nMy friend was genuinely upset when I told her Phelps' shark was CGI lol — stupider time (@knifexparty) July 24, 2017\n\nThroughout the episode, viewers watched as Gutteridge and the team collected data about the swim speed of sharks, which is apparently very hard to do, because sharks don’t typically swim in a straight line.\n\nSo, Gutteridge said, instead of Phelps and a shark swimming side by side, the scientists would use the speed data they obtained to create a computer-generated image of a shark racing. And Phelps would compete against that.\n\nUnacceptable, said the Internet.\n\nYOU SAID HE WOULD FACE A SHARK, NOT A CGI SHARK — Cindy (@ESPNCindy) July 24, 2017\n\nCall me crazy but I thought they were gonna put Phelps up against a real shark not a simulation. I feel robbed. #SharkWeek #PhelpsVsShark pic.twitter.com/XgdEphkl6m — 𝓜𝓮𝓰 𝓒. (@MegDownSouth) July 24, 2017\n\nWaited an hour for Michael Phelps to race a CGI shark.\n\n\n\nDiscovery is receiving a strongly worded letter fur sure. — Jerod Breth (@PhreshBreth) July 24, 2017\n\nI was so disappointed when I found out that Phelps didn't actually race against a great white 😂 #SharkWeek — dani (@sunrxe) July 24, 2017\n\nWhat really rubbed salt in the wound? Phelps lost.\n\nThe computer simulated great white shark swam 100 meters in 36.1 seconds. Phelps, fitted in a special wet suit and monofin that bound his feet together, took 38.1 seconds to swim the same distance. So close — but no dice.\n\nIT WAS A FAKE SHARK. Phelps raced a fake shark....and lost.\n\nI feel cheated #SharkWeek2017 pic.twitter.com/nEABV6PRNZ — Jessica Morrey (@JessicaMorrey) July 24, 2017\n\nwe just wasted a hour waiting to see micheal phelps swim against a computer generated shark, and lose — casmier (@kylecasmier) July 24, 2017\n\n#Spoiler #PhelpsVShark was essentially 58 minutes of fishing for sharks & 38 seconds of #Phelps in the water LOSING to a CGI #Shark. 🦈👎🏻 — James Campbell (@WHOtheFisJC) July 24, 2017\n\nReactions from the shark community after the Phelps/fake shark competition. pic.twitter.com/8vziyzWOjr — Bud Crawford Stan Account (@MikeSciandra) July 24, 2017\n\nPhelps looked disappointed, though not surprised. Earlier in the episode, when he saw a simulation of a 20-foot great white shark competing in an Olympic swimming pool, he knew it was a long shot. After all, the shark’s average speed of 25 miles per hour was more than four times Phelps’s own top speed in the pool.\n\n“Honestly, the first thought that went through my head when I saw the shark, there’s probably very little chance for me to beat him,” he said.\n\nAt least Discovery had a sense of humor about this special, such as when the narrator mentioned Phelps’s many Olympic accolades: “Sharks don’t care about medals.” And for those still upset about the CGI shark situation, just remember that whenever Discovery hypes something crazy happening with an animal — well, there may be a twist that makes it not quite as exciting as it seems.\n\nThe people mad Phelps raced an fake shark are the same people mad they used computer graphic plates in the live action Beauty and the Beast — Alfred Cohol (@Hombrevender) July 24, 2017\n\nRead more:\n\nShark weak: Michael Phelps loses race to computer-generated great white\n\nThe Phelps vs. shark charade was another bizarre episode of humans racing animals\n\nMichael Phelps’s ‘Shark Week’ race against a great white has an intense trailer", "images": ["https://www.washingtonpost.com/resizer/yAFxThroW-CI5t-yu8Q6FsF7kHI=/1x1/www.washingtonpost.com/pb/resources/img/spacer.gif", "https://me.effectivemeasure.net/em_image", "https://www.washingtonpost.com/resizer/yDzxO8C486sCbyLZoqOrjlYpAGs=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/IRZVLUGB4A6JBMB5VKGHSMARPY.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=3005617&cv=2.0&cj=1"], "top_img": "https://www.washingtonpost.com/resizer/yDzxO8C486sCbyLZoqOrjlYpAGs=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/IRZVLUGB4A6JBMB5VKGHSMARPY.jpg", "keywords": [], "authors": ["Emily Yahr", "Style Reporter Covering Pop Culture", "July", "Emily Yahr Is An Entertainment Reporter For The Washington Post. She Joined The Post In", "Has Previously Written For The Boston Globe", "Usa Today", "The Lexington", "Ky.", "Herald-Leader", "The American Journalism Review."], "canonical_link": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/07/24/michael-phelps-didnt-actually-race-a-real-shark-on-tv-and-viewers-arent-happy/", "title": "Michael Phelps didn’t actually race a real shark on TV, and viewers aren’t happy", "meta_data": {"object-hash": 1555882065, "viewport": "width=device-width, initial-scale=1.0, user-scalable=yes, minimum-scale=0.5, maximum-scale=2.0", "referrer": "unsafe-url", "keywords": "michael phelps shark, fake shark discovery, shark race phelps discovery, did michael phelps really race a shark, michael phelps shark week great white", "news_keywords": "michael phelps shark, fake shark discovery, shark race phelps discovery, did michael phelps really race a shark, michael phelps shark week great white", "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "creator": "@emilyyahr"}, "og": {"type": "article", "site_name": "Washington Post", "url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/07/24/michael-phelps-didnt-actually-race-a-real-shark-on-tv-and-viewers-arent-happy/", "image": "https://www.washingtonpost.com/resizer/yDzxO8C486sCbyLZoqOrjlYpAGs=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/IRZVLUGB4A6JBMB5VKGHSMARPY.jpg", "title": "Michael Phelps didn’t actually race a real shark on TV, and viewers aren’t happy", "description": "Discovery Channel's much-hyped ‘Phelps vs. Shark: Great Gold vs. Great White’ special was missing one key ingredient."}, "article": {"publisher": "https://www.facebook.com/washingtonpost", "content_tier": "metered", "author": "https://www.facebook.com/emily.yahr"}, "fb": {"app_id": 41245586762, "admins": 500835072}, "zeusAds": "true", "description": "Discovery Channel's much-hyped ‘Phelps vs. Shark: Great Gold vs. Great White’ special was missing one key ingredient.", "robots": "index,follow", "theme": "normal", "author": "https://www.facebook.com/emily.yahr"}, "movies": [], "publish_date": 1500868800.0, "source": "https://www.washingtonpost.com", "summary": ""}