{"url": "https://en.wikipedia.org/wiki/The_Real_Housewives_of_Orange_County", "text": "California-based reality television series in the United States\n\nThe Real Housewives of Orange County (abbreviated RHOC) is an American reality television series that premiered on March 21, 2006 on Bravo. It has aired thirteen seasons and focuses on the personal and professional lives of several women residing in Orange County, California.\n\nThe current cast consists of Tamra Judge (since season 3), Shannon Beador (since season 9), Kelly Dodd (since season 11), Gina Kirschenheiter and Emily Simpson (both since season 13), and Braunwyn Windham-Burke (since season 14). Previously-featured cast members include original housewives Kimberly Bryant, Jo De La Rosa, Vicki Gunvalson, Jeana Keough, and Lauri Waring; and later-added housewives Tammy Knickerbocker, Quinn Fry, Gretchen Rossi, Lynne Curtin, Alexis Bellino, Peggy Tanous, Heather Dubrow, Lydia McLaughlin, Lizzie Rovsek, Meghan King Edmonds, and Peggy Sulahian.\n\nThe show's success has allowed for the development of The Real Housewives franchise and similar spin-off series based in New York City, Atlanta, New Jersey, Washington, D.C., Beverly Hills, Miami, Potomac and Dallas. The show has also resulted in the spin-offs Date My Ex: Jo & Slade and Tamra's OC Wedding.\n\nOverview and casting\n\nVicki Gunvalson appeared as a main cast member from seasons 1-13 making her the longest housewife of the series\n\nSeason 1–3\n\nIn April 2005, The Real Housewives was ordered by American television network Bravo.[1] It was renamed as The Real Housewives of Orange County in January 2006.[2] Producer Scott Dunlop, said that it was originally planned to be set in a single gated community in Coto de Caza, California.[3] The show was inspired by scripted soap operas Desperate Housewives and Peyton Place, and would document the lives of upper-class women who \"lead glamorous lives in a Southern California gated community where the average home has a $1.6 million price tag and residents include CEOs and retired professional athletes.\"[2]\n\nThe first season premiered on March 21, 2006, and starred Kimberly Bryant, Jo De La Rosa, Vicki Gunvalson, Jeana Keough and Lauri Waring. Bryant left after the first season. Tammy Knickerbocker joined the cast for the second season which premiered on January 16, 2007. Bryant appeared as a guest. After the second season, De La Rosa exited the series as a regular cast member. The third season premiered on November 6, 2007, which featured Tamra Judge (then Barney) as the latest housewife. While Quinn Fry joined the cast in the sixth episode.[4][5] Bryant and De La Rosa returned as guests. Knickerbocker and Fry left the main cast after the third season.\n\nSeason 4–8\n\nGretchen Rossi was introduced in the fourth season premiere on November 25, 2008. Peterson made her final appearance as a main cast member in the third episode. While Lynne Curtin joined the cast in the fourth episode.[6][6][7] Bryant and De La Rosa made their final guest appearance during the season finale. While Knickerbocker returned as a guest. Keough's final season as a full-time cast member, season five premiered on November 5, 2009. After Keough left the show as a full-time cast member, Alexis Bellino was added to the main cast.[8][9][10] Fry, Knickerbocker and Peterson returned as a guest. Curtin left after the fifth season.\n\nThe sixth season which premiered on March 6, 2011 introduced Peggy Tanous as the newest housewife and friend of the housewives Fernanda Rocha.[11] Keough returned in a friend of the housewives status, while Curtin, Fry, and Knickerbocker appeared as guests. Heather Dubrow joined the cast in the seventh season which premiered on February 7, 2012. Keough and Tanous appeared as a guest, while Sarah Winchester was featured as a friend of the housewives. On April 1, 2013, the eighth season premiered and the cast was joined by Lydia McLaughlin. Peterson also appeared as a friend of the housewives in the eighth season.[12] Bellino, McLaughlin, Rossi and Peterson departed after the season.\n\nSeason 9–present\n\nThe ninth season premiered on April 14, 2014 and introduced Shannon Beador and Lizzie Rovsek as the new housewives. While Danielle Gregorio joined as friend of the housewives.[13] The tenth season which premiered on June 8, 2015, saw Rovsek as a friend of the housewives,[14][15] and Meghan King Edmonds joining the cast. Curtin, Keough and Knickerbocker made guest appearances in the season.[16][17]\n\nThe eleventh season premiered on June 20, 2016. It featured Kelly Dodd joining the cast and Keough making a guest appearance.[18] The season served as Dubrow's final season.[19] McLaughlin returned for the show's twelfth season which premiered on July 10, 2017.[20] Peggy Sulahian joined as the latest housewife. While Keough, Rossi and Rovsek made guest appearances.[21] After the season concluded, King Edmonds, McLaughlin and Sulahian left the show.[22][23][24]\n\nGina Kirschenheiter and Emily Simpson joined the cast for the thirteenth season, which premiered on July 16, 2018.[25]\n\nFor the fourteenth season, Gunvalson was demoted to a \"friend of the housewives\", while Braunwyn Windham-Burke joined as a housewife. It is set to premiere on August 6, 2019.[citation needed]\n\nTimeline of housewives\n\nHousewives Seasons 1 2 3 4 5 6 7 8 9 10 11 12 13 14 Kimberly Bryant Main Guest Jo De La Rosa Main Guest Vicki Gunvalson Main Friend Jeana Keough Main Friend Guest Guest Lauri Peterson Main Guest Friend Tammy Knickerbocker Main Guest Guest Quinn Fry Main Guest Tamra Judge Main Lynne Curtin Main Guest Guest Gretchen Rossi Main Guest Alexis Bellino Main Peggy Tanous Main Guest Heather Dubrow Main Lydia McLaughlin Main Main Shannon Storms Beador Main Lizzie Rovsek Main Friend Guest Meghan King Edmonds Guest Main Guest Kelly Dodd Main Peggy Sulahian Main Gina Kirschenheiter Main Emily Simpson Guest Main Braunwyn Windham-Burke Main Friends of the housewives Fernanda Rocha Guest Friend Sarah Winchester Guest Friend Danielle Gregorio Friend\n\nEpisodes\n\nSeason Episodes Originally aired First aired Last aired 1 8 March 21, 2006 ( ) May 9, 2006 ( 2006-05-09 ) 2 10 January 16, 2007 ( ) March 20, 2007 ( 2007-03-20 ) 3 12 November 6, 2007 ( ) January 29, 2008 ( 2008-01-29 ) 4 15 November 25, 2008 ( ) June 11, 2009 ( 2009-06-11 ) 5 17 November 5, 2009 ( ) March 11, 2010 ( 2010-03-11 ) 6 16 March 6, 2011 ( ) June 20, 2011 ( 2011-06-20 ) 7 23 February 7, 2012 ( ) July 24, 2012 ( 2012-07-24 ) 8 22 April 1, 2013 ( ) September 1, 2013 ( 2013-09-01 ) 9 21 April 14, 2014 ( ) September 8, 2014 ( 2014-09-08 ) 10 24 June 8, 2015 ( ) November 12, 2015 ( 2015-11-12 ) 11 21 June 20, 2016 ( ) November 21, 2016 ( 2016-11-21 ) 12 21 July 10, 2017 ( ) November 27, 2017 ( 2017-11-27 ) 13 21 July 16, 2018 ( ) December 9, 2018 ( 2018-12-09 ) 14 TBA August 6, 2019 ( ) TBA\n\nSpin-offs\n\nDate My Ex: Jo & Slade became the first spin-off from The Real Housewives of Orange County; the dating game show documented De La Rosa as she began dating after moving to Los Angeles, where potential suitors were regularly surveyed by Smiley. It premiered on June 30, 2008, and ended on September 8, 2008, after broadcasting nine episodes during its first and only season.[26]\n\nAfter becoming engaged to Judge in February 2013,[27] Barney was commissioned to star in the three-part spin-off special Tamra's OC Wedding.[28] It highlighted the preparations for their nuptials and was broadcast from September 2, 2013 until September 16, 2013.[28]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/b/b9/TheRealHousewivesOfOrangeCountyLogo.png/250px-TheRealHousewivesOfOrangeCountyLogo.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/en/b/b9/TheRealHousewivesOfOrangeCountyLogo.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/09/Vicki_Gunvalson_2009_cropped.jpg/170px-Vicki_Gunvalson_2009_cropped.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/b/b9/TheRealHousewivesOfOrangeCountyLogo.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/The_Real_Housewives_of_Orange_County", "title": "The Real Housewives of Orange County", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.13", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/b/b9/TheRealHousewivesOfOrangeCountyLogo.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}