{"url": "https://www.hollywoodreporter.com/news/stacey-dash-withdraw-congressional-race-1098721", "text": "She had been running as a Republican in California's 44th District.\n\nActress and former Fox News commentator Stacey Dash will withdraw from her congressional race just one month after filing the necessary paperwork to run as a Republican in California's 44th District.\n\nInsiders told The Hollywood Reporter on Friday that her decision was partially based on fear she had for the safety of her family.\n\n\"There were too many threats against her and her family. It was overwhelming,\" said one person close to her campaign.\n\nDash, perhaps best known for her role as Dionne in the 1995 comedy Clueless, was a Democrat who voted for President Barack Obama in 2008, though by 2012 she had switched parties and she has been controversial (at least among liberals) practically ever since.\n\nIn 2016, for example, she criticized feminists for not allowing men to \"be masculine\" and she criticized the notion of transgender people choosing which public restroom to use, calling it a \"tyranny by the minority.\"\n\nDash, a black and Hispanic woman, also criticized the BET Awards and Black History Month, opinions that led to an appearance at the 2016 Oscars where Chris Rock jokingly introduced her to a baffled audience as the \"new director\" of the Academy's \"minority outreach program.\"\n\nIn a lengthy statement emailed to THR, Dash acknowledged she intends to quit the race, saying her \"goal was, and remains, to improve the lives of people who have been forgotten for decades by the Democratic Party.\"\n\nDash had been one of three conservatives in Hollywood who had decided to run for office as Republicans in California; former soap star Antonio Sabato Jr. is running for Congress in the state's 26th District and film producer Frank DeMartini is running for the seat occupied by Democratic Rep. Maxine Waters of California's 43rd District.\n\n\"After much prayer, introspection and discussions with my family, I am withdrawing my candidacy,\" Dash said in her statement. \"I believe that the overall bitterness surrounding our political process, participating in the rigors of campaigning, and holding elected office would be detrimental to the health and wellbeing of my family. I would never want to betray the personal and spiritual principles I believe in most: that my God and my family come first.\"\n\nShe added that she knows her \"political positions have often been labeled as controversial, but the real controversy is how decades of government corruption and political disempowerment have created a system where skyrocketing home prices, dirty needles in the streets, and long bus trips to other districts for jobs are somehow considered acceptable.\"", "images": ["https://assets.hollywoodreporter.com/assets/1562102990/images/brand/thr-logo-white.svg?a0259e7bd063a50286c0", "https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/03/writerimage-thr.jpg", "https://cdn1.thr.com/sites/default/files/2018/03/769341148_5761248216001_5761250500001-vs.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1"], "top_img": "https://cdn1.thr.com/sites/default/files/2018/03/769341148_5761248216001_5761250500001-vs.jpg", "keywords": [], "authors": ["Paul Bond", "Paul.Bond Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/news/stacey-dash-withdraw-congressional-race-1098721", "title": "Stacey Dash to Withdraw From Congressional Race", "meta_data": {"viewport": "width=device-width", "description": "She had been running as a Republican in California's 44th District.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/news/stacey-dash-withdraw-congressional-race-1098721", "domain": "https://www.hollywoodreporter.com/", "title": "Stacey Dash to Withdraw From Congressional Race", "description": "She had been running as a Republican in California's 44th District.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2018/03/769341148_5761248216001_5761250500001-vs.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "Stacey Dash to Withdraw From Congressional Race", "description": "She had been running as a Republican in California's 44th District.", "url": "https://www.hollywoodreporter.com/news/stacey-dash-withdraw-congressional-race-1098721", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2018/03/769341148_5761248216001_5761250500001-vs.jpg", "width": 1280, "height": 720, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "Stacey Dash to Withdraw From Congressional Race", "sailthru.description": "She had been running as a Republican in California's 44th District.", "sailthru.author": "Paul Bond", "sailthru.vertical": "Politics", "sailthru.date": "2018-03-30 13:15:55", "sailthru.tags": "Politics,Stacey Dash"}, "movies": [], "publish_date": 1522430155.0, "source": "https://www.hollywoodreporter.com", "summary": ""}