{"url": "https://money.usnews.com/money/personal-finance/spending/articles/2017-08-31/18-best-labor-day-sales-for-2017", "text": "These Labor Day sales offer deals on everything from apparel to electronics at stores such as Old Navy, Best Buy, Home Depot and others. (Getty Images)\n\nAs the unofficial end of summer, Labor Day always sees sensational sales on last season's wares. In addition to summer styles and outdoor gear, these Labor Day sales events often include deals on appliances, mattresses and more. Expect to save as much as 80 percent when shopping 2017 Labor Day sales, says Carson Yarbrough, consumer insights specialist at Offers.com.\n\nReady to send off the summer with a shopping spree? Check out the year's 18 best Labor Day sales.\n\nApparel and Accessory Sales\n\nAbercrombie & Fitch\n\nSept. 1 to Sept. 4\n\nAs the summer ends, Abercrombie & Fitch is dropping prices sitewide. Its Labor Day sale will include the following deals:\n\n40 percent off in stores and online.\n\nAll jeans for $39.\n\nAnn Taylor\n\nAug. 31 to Sept. 3\n\nIn honor of Labor Day, Ann Taylor will take 50 percent off all sale items.\n\nExpress\n\nAug. 31 to Sept. 4\n\nAs with last year, Express is going all out this Labor Day weekend. For its holiday sale, the apparel retailer is taking 40 percent off everything in stores and online.\n\nHollister\n\nAug. 28 to Sept. 4\n\nHollister is running a Labor Day sale on jeans. Throughout the weekend, the retailer will offer denim starting at $25.\n\nGap\n\nAug. 29 to Sept. 2\n\nGap is starting early with an online-only Labor Day \"Kickoff Event.\" The sale will feature these web-exclusive deals:\n\nUp to 50 percent off sitewide.\n\nAn extra 20 percent off your purchase with code GETMORE.\n\nLord & Taylor\n\nAug. 30 to Sept. 5\n\nTo celebrate Labor Day, Lord & Taylor is throwing a sale on apparel, accessories and home goods. Details include:\n\nUp to 30 percent off women's apparel.\n\nBuy one, get one 50 percent off jeans with promo code LABORDAY.\n\n20 percent off regular and sale-price items with promo code LABORDAY.\n\nUp to 25 percent off home essentials with promo code LABORDAY.\n\nMacy's\n\nAug. 30 to Sept. 4\n\nThis year, the store is offering 20 percent off any purchase and free shipping on orders of more than $49.\n\nNordstrom\n\nSept. 1 to TBA\n\nDuring the Labor Day sale, the retailer will slash 40 percent off designer brands for men, women and kids.\n\nOld Navy\n\nAug. 31 to Sept. 4\n\nThe rumor is that Old Navy is planning something extra special for Labor Day. The retailer is expected to take 50 percent off all dresses, tees and jeans, clearance excepted.\n\nOutdoor Recreation Sales\n\nBackcountry\n\nEnds Sept. 4\n\nFor Labor Day, Backcountry is discounting outdoor apparel and equipment. The Backcountry sale will include these offers:\n\nUp to 50 percent off men's and women's apparel.\n\nUp to 50 percent off footwear.\n\nMoosejaw\n\nAug. 21 to Sept. 4\n\nMoosejaw is calling its end-of-the-season clearance event the \"Fall is for Lovers Sale.\" Here are the details:\n\nUp to 40 percent off top brands.\n\n20 percent off one full-price item with promo code HOTDOG.\n\n30 percent off one full-price Arc'teryx item with promo code ARCTERYX3.\n\nREI\n\nUntil Sept. 4\n\nWith summer on its way out, REI is offering deep discounts on outdoor apparel and gear. Highlights from the REI Labor Day sale include:\n\nUp to 40 percent off select REI Co-op brand gear and clothing.\n\nUp to 25 percent off select hiking and trail-running footwear.\n\nUp to 30 percent off select tents and sleeping bags.\n\nUp to 40 percent off cycling clearance.\n\nUp to 50 percent off last season's ski and snow accessories.\n\n30 percent off on one full-price Arc'teryx item.\n\nExtra 20 percent off one item at REI Garage online with promo code XTRA20.\n\n$700 off an Italy Hiking Amalfi Coast and Capri vacation.\n\nMattress, Appliance and Home Goods Sales\n\nJCPenney\n\nEnds Sept. 4\n\nJCPenney is focusing on appliances, furniture and home goods this Labor Day. The department store will provide the following deals:\n\nUp to 60 percent off select furniture.\n\nUp to 60 percent off select mattresses with free delivery on mattresses costing more than $599.\n\nUp to 40 percent off select major appliances.\n\nAn extra 20 percent off select home, furniture and mattress purchases with a JCPenney credit card with promo code 30HOME.\n\nAn extra 15 percent off select home, furniture and mattress purchases with any method of payment with promo code 30HOME.\n\nAn extra 15 percent off custom blinds and shades with promo code 30HOME.\n\nMattress Firm\n\nAug. 16 to Sept. 4\n\nMattress Firm is touting its Labor Day sale as having some of the year's best deals. Noteworthy offers include:\n\nAll mattresses on sale.\n\nMore than 50 percent off Beautyrest mattress sets.\n\nFree adjustable base on select purchase of $1,299.99.\n\nFree box spring with purchase of iComfort or Beautyrest Recharge mattresses.\n\nOverstock\n\nEnds Sept. 4\n\nOverstock is promising its \"biggest ever Labor Day sale\" this year. The online retailer will feature these Labor Day offers:\n\nUp to an extra 15 percent off furniture.\n\nUp to an extra 15 percent off bed and bath.\n\nUp to an extra 20 percent off area rugs.\n\nUp to an extra 20 percent off home decor.\n\nBest Buy\n\nTBA\n\nEvery Labor Day, Best Buy holds a huge sale on appliances and electronics. This year, the electronics store will offer:\n\nUp to 35 percent off select refrigerators.\n\nUp to 30 percent off select washer-dryer sets.\n\nUp to 40 percent off select ranges and over-the-range microwaves.\n\nUp to 30 percent off select built-in appliances.\n\nFree $300 gift card with purchase of three qualifying appliances totaling $3,000 or more.\n\nFree $400 gift card with purchase of four qualifying appliances totaling $4,000 or more.\n\nSpecial pricing on 4K Ultra HDTVs, HDTVs and other home theater products.\n\nHome Depot\n\nAug. 24 to Sept. 13\n\nThe home improvement retailer will offer the following Labor Day deals:\n\nUp to 40 percent off select refrigerators.\n\nUp to 35 percent off select washer-dryer sets.\n\nUp to 30 percent off select wall ovens and microwaves.\n\nUp to 25 percent off select dishwashers.\n\nUp to 25 percent off select vacuums.\n\nKmart\n\nEnds Sept. 9\n\nKmart is throwing one of the most eclectic Labor Day sales, with discounts on everything from appliances to apparel. Top offers include:\n\nUp to 30 percent off major appliances.\n\n10 percent off Polaroid and Samsung TVs.\n\nUp to 60 percent off accent rugs, area rugs and doormats.\n\nDiscounts on all furniture.\n\nBuy one, get one 50 percent off regular-price family footwear.\n\n20 percent off team sports apparel and merchandise.\n\nKids' and women's jeans starting at $10.", "images": ["https://www.usnews.com/static/img/usn-logo-large.svg", "https://www.usnews.com/dims4/USNEWS/b89efdc/2147483647/crop/2000x1313%2B0%2B20/resize/640x420/quality/85/?url=http%3A%2F%2Fcom-usnews-beam-media.s3.amazonaws.com%2F65%2Fda%2F6878c4bf4f48beeaece57e4aa021%2F170524-shopping-stock.jpg", "https://media.beam.usnews.com/50/3c/5438b2f142939830f903a1757d17/181116-wealthofknowledge-logo-design.jpg", "https://www.usnews.com/dims4/USNEWS/165fb08/2147483647/thumbnail/640x420/quality/85/?url=http%3A%2F%2Fcom-usnews-beam-media.s3.amazonaws.com%2F31%2F48%2Fea3d2d1a440ebc9b4858c0466c04%2F151130-brokenpiggy-stock.jpg", "https://www.usnews.com/dims4/USNEWS/857ec6b/2147483647/resize/1200x%3E/quality/85/?url=http%3A%2F%2Fcom-usnews-beam-media.s3.amazonaws.com%2F65%2Fda%2F6878c4bf4f48beeaece57e4aa021%2F170524-shopping-stock.jpg", "https://www.usnews.com/dims4/USNEWS/8419be5/2147483647/thumbnail/84x84/quality/85/?url=http%3A%2F%2Fcom-usnews-beam-media.s3.amazonaws.com%2F30%2F9a%2Fa17379aa408897d6e24aea2b310f%2Fmaria-lalonde.png"], "top_img": "https://www.usnews.com/dims4/USNEWS/857ec6b/2147483647/resize/1200x%3E/quality/85/?url=http%3A%2F%2Fcom-usnews-beam-media.s3.amazonaws.com%2F65%2Fda%2F6878c4bf4f48beeaece57e4aa021%2F170524-shopping-stock.jpg", "keywords": [], "authors": [], "canonical_link": "https://money.usnews.com/money/personal-finance/spending/articles/2017-08-31/18-best-labor-day-sales-for-2017", "title": "18 Best Labor Day Sales for 2017", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0", "description": "For some of the best Labor Day sales, look for deals and freebies at Macy's, Old Navy, Best Buy, Ann Taylor, Express, Hollister, Gap and other retail stores.", "keywords": "Maria Lalonde,shopping,personal finance,personal budgets,money,My Money,Spending", "site": "money-news", "zone": "home/articles", "fb": {"pages": 5834919267, "app_id": 130063997038366}, "og": {"title": "18 Best Labor Day Sales for 2017", "description": "The summer's end brings sales on apparel, outdoor gear and seasonal merchandise.", "image": "https://www.usnews.com/dims4/USNEWS/857ec6b/2147483647/resize/1200x%3E/quality/85/?url=http%3A%2F%2Fcom-usnews-beam-media.s3.amazonaws.com%2F65%2Fda%2F6878c4bf4f48beeaece57e4aa021%2F170524-shopping-stock.jpg", "type": "article", "site_name": "US News & World Report", "url": "https://money.usnews.com/money/personal-finance/spending/articles/2017-08-31/18-best-labor-day-sales-for-2017"}, "twitter": {"image": "https://www.usnews.com/dims4/USNEWS/857ec6b/2147483647/resize/1200x%3E/quality/85/?url=http%3A%2F%2Fcom-usnews-beam-media.s3.amazonaws.com%2F65%2Fda%2F6878c4bf4f48beeaece57e4aa021%2F170524-shopping-stock.jpg", "card": "summary_large_image", "site": "@USNews", "title": "18 Best Labor Day Sales for 2017", "description": "The summer's end brings sales on apparel, outdoor gear and seasonal merchandise."}, "google-site-verification": "owJBuFHD3VHcTSsnPSOYizmUcs3GSBjbx09vBbBi1MM", "msvalidate.01": "A8E47FA91124063A4A9C78AD5273DC0F", "optimizely": "Optimizely is supported by this application but is not enabled for this page."}, "movies": [], "publish_date": 1504152000.0, "source": "https://money.usnews.com", "summary": ""}