{"url": "http://uk.businessinsider.com/do-high-spf-sunscreens-work-better-50-2017-5", "text": "High SPF sunscreens aren't all they're cracked up to be. Shutterstock\n\nIn theory, sunscreen with super-high SPF should give you the best protection against damaging UV radiation.\n\nBut in practice, it doesn't really work that way.\n\nAt best, high-SPF sunscreens give you only slightly better protection than a sunscreen with SPF 50, according to the annual sunscreen report just published by the Environmental Working Group (EWG). At worst, they could give you a false sense of security and make you spend more time in the sun — upping your risk for burns and skin cancer.\n\nHere's what you need to know about SPF to keep your skin the safest.\n\nHigh-SPF products don't give you a whole lot more protection.\n\nThere are two kinds of UV radiation that hit your skin when you're in the sun: UVA and UVB. UVB is the kind responsible for sunburns, while UVA is the kind that reaches deeper into the skin and causes skin aging. Both of them increase your risk of skin cancer.\n\nSPF (short for \"sun protection factor\") is a measure of how well a sunscreen protects you from UVB. It seems like an SPF 100 sunscreen would give you double the protection of an SPF 50 sunscreen. But the truth is that higher-SPF products are only marginally better at shielding you from UVB, according to both the EWG and the Skin Cancer Foundation. SPF 30 blocks nearly 97% of UVB radiation, SPF 50 blocks about 98%, and SPF 100 blocks about 99%.\n\nSPF 30 is a solid choice. Chris Carlson/AP\n\nIn 2011, the FDA even went as far as to call sunscreens with SPF values greater than 50 \" inherently misleading.\"\n\nExperts also worry that high SPF products might make people spend more time in the sun because they think they're getting extra protection.\n\nYou should choose a sunscreen with an SPF between 15 and 50.\n\nThe EWG recommends choosing sunscreens within the SPF 15-50 range.\n\n\"I'd really recommend sticking with the lower SPF products, applying a liberal coating, and reapplying often,\" EWG senior scientist David Andrews, PhD, told INSIDER. (\"Often\" generally means every two hours, and anytime after swimming, toweling off, or excessive sweating.)\n\nBut remember: There's more to sunscreen than SPF.\n\nThere's no reason to purchase SPF 100 sunscreen. AP/Dave Martin\n\nSPF only measures protection from UVB radiation. It has nothing to do with deep-penetrating UVA radiation. In fact, the US has no labeling system that tells consumers how much UVA protection they're getting (or not) in a sunscreen.\n\nThis is another major downside of higher-SPF products. A product with SPF can protect you from sunburns, but it could still leave you vulnerable to doses of UVA radiation.\n\nTo ensure you're getting equal protection from both types of radiation, check the ingredients list. The product should contain 3% avobenzone or at least 15% zinc oxide, Andrews said. Both ingredients block UVA.\n\nLastly: Don't let sunscreen do all the heavy lifting. Shade, hats, sunglasses, and clothing should be part of your sun protection, too.\n\nFor help finding a new, more effective sunscreen — or to see how your current brand stacks up — check out the EWG's brand new sunscreen guide for 2017.", "images": ["https://amp.businessinsider.com/images/59282cd24cb1e402cf4ed7e5-750-563.jpg", "https://amp.businessinsider.com/images/59282cd24cb1e402cf4ed7e6-1920-960.jpg"], "top_img": "https://amp.businessinsider.com/images/59282cd24cb1e402cf4ed7e6-1920-960.jpg", "keywords": [], "authors": ["Caroline Praderio"], "canonical_link": "https://www.insider.com/do-high-spf-sunscreens-work-better-50-2017-5", "title": "Why experts say you should avoid sunscreen higher than SPF 50", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "ii-ab-test": {"hpi4": "variant"}, "msapplication-config": "//media.businessinsider.com/public/assets/BI/US/favicons/browserconfig.xml", "theme-color": "#1d607c", "date": "2017-05-31", "sailthru.date": "2017-05-31", "news_keywords": "Sunscreen, Sun protection, Sun, Summer, Health, Skin, Skin Cancer, Skincare, Caroline Praderio", "sailthru.tags": "Sunscreen, Sun protection, Sun, Summer, Health, Skin, Skin Cancer, Skincare, Caroline Praderio", "description": "That SPF 100 sunscreen might be giving you a false sense of security.", "sailthru.description": "That SPF 100 sunscreen might be giving you a false sense of security.", "title": "Why experts say you should avoid sunscreen higher than SPF 50", "sailthru.verticals": "science-contributor, science", "sailthru.title": "Why experts say you should avoid sunscreen higher than SPF 50", "linkedin": {"owner": "mid:1d5f7b"}, "tbi-image": "https://amp.businessinsider.com/images/59282cd24cb1e402cf4ed7e6-1920-960.jpg", "sailthru.image.full": "https://amp.businessinsider.com/images/59282cd24cb1e402cf4ed7e5-1536-1152.jpg", "sailthru.image.thumb": "https://amp.businessinsider.com/images/59282cd24cb1e402cf4ed7e5-160-120.jpg", "tbi-vertical": "Science Contributors", "sailthru.author": "Caroline Praderio", "og": {"title": "Why experts say you should avoid sunscreen higher than SPF 50", "description": "That SPF 100 sunscreen might be giving you a false sense of security.", "type": "article", "url": "https://www.businessinsider.com/do-high-spf-sunscreens-work-better-50-2017-5", "image": "https://amp.businessinsider.com/images/59282cd24cb1e402cf4ed7e6-1920-960.jpg", "site_name": "Business Insider"}, "article": {"publisher": "businessinsider"}, "author": "Caroline Praderio, INSIDER", "twitter": {"url": "https://www.businessinsider.com/do-high-spf-sunscreens-work-better-50-2017-5", "title": "Why experts say you should avoid sunscreen higher than SPF 50", "description": "That SPF 100 sunscreen might be giving you a false sense of security.", "card": "summary_large_image", "image": "https://amp.businessinsider.com/images/59282cd24cb1e402cf4ed7e6-1920-960.jpg", "creator": "@c_praderio", "site": "@bi_contributors"}, "Business Insider": "Snapchat", "Why experts say you should avoid sunscreen higher than SPF 50": "The Fastest Way to Share a Moment!", "fb": {"pages": 20446254070}, "apple-itunes-app": "app-id=554260576"}, "movies": [], "publish_date": 1496203200.0, "source": "http://uk.businessinsider.com", "summary": ""}