{"url": "https://www.thisisinsider.com/what-will-meghan-markle-title-be-if-she-marries-prince-harry-2017-3", "text": "Meghan Markle, soon-to-be royal. Evan Agostini/Invision/AP\n\nMeghan Markle is an American actress and activist who's engaged to Prince Harry.\n\nOnce they get married in 2018, Markle will likely get a royal title.\n\nRoyals experts say she'll probably be known as the Duchess of Sussex.\n\nMeghan Markle is an accomplished woman in her own right. She's the star of TV drama \"Suits,\" a thoughtful writer, an activist who's worked with the UN, and the creator of an affordable fashion line.\n\nShe's also engaged to Prince Harry of the British royal family. The couple formally announced their plan to tie the knot in a statement released November 27.\n\nNow, royals fans are wondering what kind of royal title Markle might receive once the wedding happens. (It's just one of the many ways her life will change after marrying Harry.) Here's what we know so far.\n\nShe would become a princess by marriage.\n\nWill and Kate, the Duke and Duchess of Cambridge. Sean Gallup / Getty\n\nHarry's title is currently \"His Royal Highness Prince Henry of Wales.\" Royal family expert Imogen Lloyd Webber once told People that Markle would \"definitely\" be called \"Her Royal Highness Princess Henry of Wales.\"\n\nShe wouldn't be \"Princess Megan\" for the same reason that Kate Middleton is not \"Princess Kate.\" Neither of them was born royal — but became (or could become) royal by marriage. (Here are 18 commoners who married into royalty.)\n\nShe'd probably become a duchess, too.\n\nIt's tradition for men of the royal family to get a new title, bestowed by the queen, when they marry. Take William: For most of his life, he was just \"His Royal Highness Prince William of Wales.\" But upon his marriage to Kate Middleton in 2011, he became the Duke of Cambridge, and Kate became the Duchess of Cambridge.\n\nPrince Harry and Meghan Markle. Getty/Chris Jackson; Alberto E. Rodriguez\n\nWebber suspected that Prince Harry will become the Duke of Sussex upon his eventual marriage, and royal historian Marlene Koenig agreed. That would make Markle the Duchess of Sussex.\n\nThe titles Duke and Duchess of Clarence and Buckingham are also \"available\"— meaning the people who last held them have died and the titles are free to be bestowed by the Queen. The Dukedom of Sussex, for example, has been available since 1843.\n\nIt seems like most royals experts and bloggers are putting their money on Sussex, but sadly, there's no way to know for sure unless a marriage really happens.\n\nWhat do these titles mean, anyway?\n\nTitles like \"Duke\" are part of the Peerage. Essentially, it's a ranked system for British nobility.\n\nWay back in the day, the monarch bestowed these titles on \"peers of the realm\"— people who swore loyalty to the crown in exchange for land or money, according to the Peerage experts at Debrett's London. The five possible titles, ranked from highest to lowest: duke, marquess, earl, viscount, and baron.\n\nIn addition to being bestowed, the titles could also be inherited, but only by male heirs.\n\nQueen Elizabeth II and her husband Philip, the Duke of Edinburgh. AP/MJ Kim\n\nAll the people who had these titles formed the Peerage, and for a long time, the Peerage also had the right to sit in the British Parliament. Seems just slightly unfair — and that's probably why the British government voted to rescind that right back in 1999, with the House of Lords Act.\n\nToday, these ranked titles still exist, and just as before, they can only be bestowed by the monarch or inherited by a son.\n\nWhile lots of Peerage titles are held by royals, but you don't have to be royal to have one. And even though the members of Peerage lack the political power they once had, Debrett's guide says that \"their social influence remains undimmed, and their lives remain a source of interest and speculation.\" We can't argue with that.\n\nSign up hereto get INSIDER's favorite stories straight to your inbox.", "images": ["https://amp.insider.com/images/58de8e2a8508681e008b47bd-750-563.jpg", "https://amp.insider.com/images/58de8f0d2d9f6f25008b4861-1136-568.jpg"], "top_img": "https://amp.insider.com/images/58de8f0d2d9f6f25008b4861-1136-568.jpg", "keywords": [], "authors": ["Caroline Praderio"], "canonical_link": "https://www.insider.com/what-will-meghan-markle-title-be-if-she-marries-prince-harry-2017-3", "title": "Here's what Meghan Markle's title will likely be when she marries Prince Harry", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "ii-ab-test": {"hpi4": "control"}, "msapplication-config": "//media.insider.com/public/assets/INSIDER/US/favicons/browserconfig.xml", "theme-color": "#111111", "date": "2018-05-14", "sailthru.date": "2018-05-14", "news_keywords": "royals, Royal Family, Prince Harry, Marriage, Weddings, Love, Relationships, People, Celebrities, Caroline Praderio", "sailthru.tags": "royals, Royal Family, Prince Harry, Marriage, Weddings, Love, Relationships, People, Celebrities, Caroline Praderio", "description": "The royal wedding is quickly approaching and royal family experts have a few ideas about what Markle will be called when she and Prince Harry tie the knot.", "sailthru.description": "The royal wedding is quickly approaching and royal family experts have a few ideas about what Markle will be called when she and Prince Harry tie the knot.", "title": "Here's what Meghan Markle's title will likely be when she marries Prince Harry", "sailthru.verticals": "people", "sailthru.title": "Here's what Meghan Markle's title will likely be when she marries Prince Harry", "linkedin": {"owner": "mid:1d5f7b"}, "tbi-image": "https://amp.insider.com/images/58de8f0d2d9f6f25008b4861-1136-568.jpg", "sailthru.image.full": "https://amp.insider.com/images/58de8e2a8508681e008b47bd-1136-852.jpg", "sailthru.image.thumb": "https://amp.insider.com/images/58de8e2a8508681e008b47bd-160-120.jpg", "tbi-vertical": "People", "sailthru.author": "Caroline Praderio", "og": {"title": "Here's what Meghan Markle's title will likely be when she marries Prince Harry", "description": "The royal wedding is quickly approaching and royal family experts have a few ideas about what Markle will be called when she and Prince Harry tie the knot.", "type": "article", "url": "https://www.thisisinsider.com/what-will-meghan-markle-title-be-if-she-marries-prince-harry-2017-3", "image": "https://amp.insider.com/images/58de8f0d2d9f6f25008b4861-1136-568.jpg", "site_name": "INSIDER"}, "author": "Caroline Praderio", "twitter": {"url": "https://www.insider.com/what-will-meghan-markle-title-be-if-she-marries-prince-harry-2017-3", "title": "Here's what Meghan Markle's title will likely be when she marries Prince Harry", "description": "The royal wedding is quickly approaching and royal family experts have a few ideas about what Markle will be called when she and Prince Harry tie the knot.", "card": "summary_large_image", "image": "https://amp.insider.com/images/58de8f0d2d9f6f25008b4861-1136-568.jpg", "creator": "@c_praderio", "site": "@thisisinsider"}, "INSIDER": "Snapchat", "Here's what Meghan Markle's title will likely be when she marries Prince Harry": "The Fastest Way to Share a Moment!", "fb": {"pages": 20446254070}}, "movies": [], "publish_date": 1526270400.0, "source": "https://www.thisisinsider.com", "summary": ""}