{"url": "https://en.wikipedia.org/wiki/Taylor_Swift%27s_Reputation_Stadium_Tour", "text": "Reputation Stadium Tour Tour by Taylor Swift Associated album Reputation Start date May 8, 2018 ( ) End date November 21, 2018 ( 2018-11-21 ) Legs 5 No. of shows 40 in North America\n\n6 in Europe\n\n5 in Oceania\n\n2 in Asia\n\n53 in total Box office $345.7 million[1] Taylor Swift concert chronology\n\nThe 1989 World Tour\n\n(2015)\n\n(2015)\n\nReputation Stadium Tour\n\n(2018)\n\n(2018)\n\n\n\nTaylor Swift's Reputation Stadium Tour[2] was the fifth concert tour by American singer-songwriter Taylor Swift, in support of her sixth studio album, Reputation (2017). The tour began on May 8, 2018 in Glendale and concluded on November 21, 2018 in Tokyo, comprising 53 concerts. The tour was attended by 2,888,892 fans and grossed $345,700,000 in revenue, becoming Swift’s most successful tour to date, and the 13th highest grossing concert tour of all time. The supporting acts for the tour were Charli XCX, Camila Cabello, and Broods.\n\nA concert film of the same name was directed by Paul Dugdale and released on Netflix on December 31, 2018.[3] It was filmed at the second show in Arlington, Texas on October 6, 2018.\n\nDevelopment\n\nIn August 2017, Billboard reported that Swift would be using Ticketmaster's Verified Fan program to prevent bots and ticket scalpers from purchasing tickets. The program, named \"Taylor Swift Tix\", allowed fans to purchase tickets in advance of the public on-sale by participating in boost activities to increase chances of getting a pre-sale access code.[2][4]\n\nOn November 13, 2017, Swift's management announced the first round of dates for the tour jointly with Ticketmaster.[5][6] Tickets went on sale to the general public on December 13, 2017, the day of Swift's 28th birthday.\n\nIn late November, Swift announced shows in Manchester, Dublin, and London. Due to overwhelming demand, additional dates were announced for all three cities. Furthermore, the singer also announced extra shows in North America for Pasadena, Chicago, East Rutherford, Foxborough, Toronto, and Atlanta due to popular demand before the pre-sale began.[7][8] On December 3, Swift announced five dates for Oceania.[9][10] In January 2018, due to huge demand, Swift went on to add second dates in Santa Clara, Landover, Philadelphia, Minneapolis and Arlington and third dates in East Rutherford and Foxborough, totalling 40 shows for the tour's North American leg.[11]\n\nOn March 1, 2018, Swift officially announced Camila Cabello and Charli XCX as the opening acts for the Reputation Stadium Tour.[12] Cabello was previously speculated as the opening act because her Never Be the Same Tour dates didn't coincide with Swift's tour dates;[13] Portland's Live 95.5 also announced her in a sweepstake for the concert of June 22, 2018 at the Wembley Stadium in London through a since-deleted post on Twitter, a day before Swift confirmed her as the opening act.[14]\n\nOn May 7, 2018, the day before the tour kicked off at Glendale, Arizona, Swift invited 2,000 foster and adopted children to a private dress rehearsal.[15]\n\nOn May 8, 2018, Swift announced two shows in Tokyo, with Charli XCX as the opening act.[16] In September 2018, Broods was announced as an opening act for the Oceania leg of the tour.[17]\n\nCritical reception\n\nThe tour has received rave reviews, being commonly labeled as the best of Swift's career thus far and the best tour of 2018.[18][19][20] Ed Masley, from The Arizona Republic, wrote that \"there were many moments in the course Swift's performance that felt like she was playing to the back rows of the stadium by simply sharing with her fans\", while complimenting the tour's production and highlighting Swift's connection with the crowd.[21] Jim Harrington, from The Mercury News, praised the improvement of the singer's vocal work and performance skills over the years: \"Her game is well-rounded enough that she can excel equally at every different aspect of the show.\"[22] Chris Tuite, from CBS San Francisco, wrote: \"The only thing more prominent than the singer herself during her current costume-change filled spectacle are the massive, vicious looking snakes that symbolically appear throughout the set.\"[23] Michael Tritsch from 303 Magazine commented the tour \"broke new ground and set the bar high for future stadium tours\" while adding \"The reputation of this show burned its way into the history books\".[24]\n\nCommercial performance\n\nTicket sales\n\nAfter four days of sales through the Verified Fan platform and three days of sales to the general public that began December 13, the tour had already grossed $180 million from 33 dates in North America alone.[25] Pollstar reported data supplied by the Gridiron Stadium Network, a consortium of NFL facilities that work together to book concerts at their buildings, which showed at least 35,000 tickets had been sold at ten of the stadiums on the route as of December 18. The tickets sold ranged from 35,419 at Heinz Field in Pittsburgh to a high of 48,039 at Lincoln Financial Field in Philadelphia. With more than 47,000 tickets sold, it was reported the May 12, 2018 date at Levi's Stadium in Santa Clara was generating close to $9 million in ticket revenue, which prompted the addition of an extra date.[26]\n\nAccording to StubHub, the tour is the best-selling female tour in the United Kingdom in 2018.[27]\n\nBoxscore\n\nThe first seven shows of the tour grossed $54 million with 390,000 tickets sold, leading Swift to the top of Billboard's Hot Tours chart in June 2018.[28] She performed to sold out crowds of 59,157 in Glendale and 107,550 in Santa Clara (over two nights), grossing $7.21 million and $14 million respectively, while the Pasadena shows combined for a gross of nearly $16.3 million and Seattle accounted more than $8.6 million.[28][29][30] The concerts in Louisville and Columbus, reported in July 2018, grossed $11.5 million with around 115,000 tickets sold, with the latter city having the highest gross and most tickets sold, with approximately 63,000 tickets and $6.6 million. These concerts led the singer once again to the top of Hot Tours chart.[31]\n\nRecords\n\nThe tour has broken multiple venue attendance and grossing records. The debut performance at University of Phoenix Stadium set new venue records in both gross and attendance, topping Metallica's $5.2 million gross earned in August 2017 by almost $2 million. With 59,157 tickets sold, she also broke the attendance record set during One Direction's Where We Are Tour in 2014 by 2,633 seats.[32] With a $14 million take from 107,550 sold tickets at Levi's Stadium she topped her own gross and attendance counts set during The 1989 World Tour in 2015. With more than 118,000 fans in attendance at the Rose Bowl, the two-show run earned $16.2 million and set a new gross record for a single headliner at the venue, surpassing U2's 2017 record by over $467,000. Grossing records previously set by U2 as well were broken at Seattle's CenturyLink Field, where she topped their Joshua Tree Tour 2017 gross by $2.4 million, and Denver's Sports Authority Field at Mile High, where she surpassed the $6.6 million gross set by the band in 2011 during their 360° Tour by $1.2 million.[28]\n\nSwift made history by becoming the first female artist to headline Dublin's Croke Park twice, with reportedly 136,000 fans in attendance.[33][34] Similarly, she achieved the milestone of becoming the first woman to headline three consecutive nights at MetLife Stadium[35] and Gillette Stadium.[36]\n\nFollowing the tour's 29th show in North America at Hard Rock Stadium in Miami, it had grossed $202.3 million in the continent ($191.1 million in the United States and $11.1 million in Canada) thus breaking Swift's own record of the highest grossing North American tour by a female artist, previously held by The 1989 World Tour, with fewer dates.[37]\n\nAwards\n\nSet list\n\nThis set list is from the concert on May 8, 2018 in Glendale, Arizona. It is not intended to represent all shows from the tour.[43]\n\nNotes During the first show in Landover, the second show in Philadelphia, the third show in East Rutherford, and the second show in Tokyo, Swift performed \"So It Goes...\" in place of \"Dancing with Our Hands Tied\". [44]\n\nDuring the second show in Philadelphia, Swift performed \"Our Song\" and \"Wildest Dreams\" a cappella after the levitating basket stage used during \"Delicate\" malfunctioned. [45]\n\nDuring the second show in East Rutherford, Swift performed \"Clean\" before the \"Long Live\" / \"New Year's Day\" medley. [46]\n\nDuring the shows in Seattle and Tokyo, Swift performed \"Shake It Off\" with Charli XCX only.\n\nDuring the show in Perth, Swift performed \"Shake It Off\" alone.\n\nDuring the shows in Melbourne, Sydney, Brisbane, and Auckland, Swift performed \"Shake It Off\" with Charli XCX and Georgia Nott of Broods.\n\nDuring the show in Sydney, Swift did not perform \"Dancing With Our Hands Tied\".\n\nShows\n\nNotes\n\n^ [59] Due to hospitalization from dehydration and orders from doctors, Cabello cancelled her appearance for the Seattle show.\n\nSee also", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b5/Taylor_Swift_Sports_Authority_Field_05.25.18_%2840569473010%29.jpg/220px-Taylor_Swift_Sports_Authority_Field_05.25.18_%2840569473010%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8c/Extended-protection-shackle.svg/20px-Extended-protection-shackle.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/b/b3/Taylor_Swift%27s_Reputation_Stadium_tour.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b3/Taylor_Swift%27s_Reputation_Stadium_tour.png/220px-Taylor_Swift%27s_Reputation_Stadium_tour.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7e/Taylor_Swift_Reputation_Tour1_%28cropped%29.jpg/170px-Taylor_Swift_Reputation_Tour1_%28cropped%29.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/b/b3/Taylor_Swift%27s_Reputation_Stadium_tour.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Taylor_Swift%27s_Reputation_Stadium_Tour", "title": "Taylor Swift's Reputation Stadium Tour", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.11", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/b/b3/Taylor_Swift%27s_Reputation_Stadium_tour.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}