{"url": "https://www.makeup.com/messy-bun-how-to", "text": "When you use Facebook to login to our site, be advised that your data is governed by Facebook’s privacy policies and terms of use. You can always clear your Facebook history here\n\nThis sign-up is for US consumers. By registering, you understand and agree that your data will be collected and used subject to our US privacy policy and terms of use\n\nGet more than ever out of your MAKEUP.com. Save your favorite articles for quick access to the expert tips and tricks that speak to you – and the products you need to get the looks!\n\nConsider it one of life’s great ironies: When it comes to beauty, the most undone looks usually require the most effort. Take Meghan Markle, Duchess of the Messy Bun, for example. She waltzed into her wedding with a subtle face of makeup that said “I’m too cool to care” and a slightly less messy bun than usual. Well, we all know those looks took hours and countless products to create — the jig is up. Unfortunately, our struggle to master the perfect I-woke-up-like-this messy bun has also required a massive amount of effort (and many lost minutes). Usually, it’s either too messy and deflated, too ballerina-tight, or just wrong all together … until now. We found a fool-proof way to nail the perfect messy bun hairstyle in just three steps.\n\nThe secret to getting the perfect look? Second-day hair (or third, or even fourth). Think of it this way: A tousled, messy bun is to dirty hair what champagne is to a girls’ night out: absolutely essential if you want to do it right. If there’s a hairstyle that’s more of a saving grace on mornings you just can’t get it together enough to wash your hair (or afternoons when you’ve managed to sneak in a lunchtime workout), we haven’t found it yet.\n\n“The messy bun is playful and timelessly chic — and it’s easy,” explains Jill Engelsen, senior stylist and educator at Butterfly Studio Salon in NYC. ”Most importantly, you feel like you’re you when you wear a messy bun — you don’t feel like you’re trying to be something you’re not.”\n\nHow to Get a Messy Bun Right\n\nSTEP 1: First, flip your head upside down and pull your hair into a loose ponytail, as high or as low as you’d like it. Don’t use a comb or worry about your strands being perfectly slicked back — some bumps are ok.\n\nSTEP 2: Twist the hair, and spin it around the base of the ponytail, continuing to wrap below the bun. Be sure to leave the tail out at the end.\n\nSTEP 3: Secure it with a hair elastic and bobby pins.\n\nQuick Tip: One of our favorite things about messy buns is they work well on dirty hair (love you, snooze button), but if your hair is clean and you want to pull off the look, spray your hair with dry shampoo or texturizing spray to add some texture and grip. To make your messy bun look even more, well, messy, pull on the sections and the pieces of hair that frame your face. “As you wear it throughout the day, it starts to take on its own personality,” says Engelsen. “Only redo it if it’s really drooping; otherwise, go with it.” And there you have it — effortless style that’s actually easy to achieve.\n\nA Sexy, Messy Bun for Wavy Hair\n\nSTEP 1: Use your fingers to comb through the hair, and then pull it into a high tight ponytail.\n\nSTEP 2: Spray a fine-tooth comb with hairspray and gently tease the ponytail, from roots to ends.\n\nSTEP 3: Wrap the teased ponytail loosely around the hair tie, creating coils until all hair is swept around the tie.\n\nSTEP 4: Secure with bobby pins in the front, back and sides.\n\nSTEP 5 : If there are excessive flyaways, spritz with hairspray and gently pull back towards the topknot with your fingertips.\n\nA Sleek Messy Bun That Works on Straight Hair\n\nSTEP 1: Brush hair up into a loose ponytail.\n\nSTEP 2: Spray a fine-tooth comb with hairspray Garnier Fructis Style Full Control Hairspray and comb back all flyaways towards the ponytail.\n\nSTEP 3: Pull the pony out and re-brush into place. For a fierce look, position on top of the head in front of the crown (where the head starts to round) or right at the crown for a tamer look.\n\nSTEP 4: Rub a texturizing, strong hold gel or cream onto a fine-tooth comb and lightly comb hair back towards the ponytail.\n\nSTEP 5: Coil the ponytail around the hair-tie, making sure not to stack the coils on top of each other. The first several wraps should be extremely tight and close to the ponytail holder. Each subsequent wrap can get looser and looser.\n\nSTEP 6: Once all of the hair is coiled, tuck it under the first coiled layer and secure using bobby pins. When inserting the bobby pin, place the opening towards your scalp, push down and into the knot.\n\nSTEP 7: Use bobby pins to secure the rest of the knot--front, back and sides. The thickness of the knot will determine how many pins you will need.\n\nSTEP 8: Finish by spritzing with spray.\n\nA Funky Festival-Friendly Messy Bun For Thicker Hair\n\nSTEP 1: Apply a volumizing, texturizing powder to roots, and separate the front pieces of your hair.\n\nSTEP 2: Part the rest of your hair into two sections and then tie the two sections together into a knot (just like you would as if you were doing the first step in tying your shoe laces).\n\nSTEP 3: Continue to repeat knotting your hair until you've reached the ends.\n\nSTEP 4: Secure the knot in place with several bobby pins, but leave the ends out.\n\nSTEP 5: Take the front pieces of your hair (if you have bangs or shorter pieces in front, if not then skip this part) and twist them while bringing them to the back. Secure them under the knot with bobby pins.\n\nSTEP 6: Lightly mist a hairspray over the knot to keep hair in place.\n\nThe Hottest Messy Bun Trend to Try Right Now\n\nEver thought you’d be wearing something called an Octopus Bun? Chances are you already do, maybe even daily. You just never thought about giving it an Instagram-worthy name. Here’s what it looks like: Strands are haphazardly pulled up into a knotted twist at the top of your head with the ends splayed out along the top of your head like the tentacles of an octopus. So, it’s the simplest of the messy bun options. To make sure the look is a little more on-trend than ordinary, spread the ends all around the bun instead of letting them bunch up in one place. Looking for hipster extra credit? Quickly crimp ends before throwing hair up in the messy bun so you see the crimpy ends sticking out.\n\nHair: Jill Engelsen\n\nMakeup: Justine Sweetman", "images": ["https://trc.taboola.com/1121677/log/3/unip?en=page_view", "http://www.makeup.com/-/media/images/makeup/2018/july/31-messy-bun-how-to/makeupcompostgraphicsheroarticle2refeaturemessybunhowto73118r2.jpg", "https://www.makeup.com/-/media/root-images/dawn-davis/makeupcomlaurenperlsteinportraitsdawnsite.jpg?h=960&w=960&hash=5B18A5AAA06401FD2B3EA6D0967B8C40F951B3D9", "https://www.makeup.com/assets/shared/images/1x1.png", "https://www.makeup.com/-/media/project/makeup/logo/mudc_vertical_logo_svg_1.svg", "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mP8Xw8AAoMBgDTD2qgAAAAASUVORK5CYII=", "https://www.makeup.com/Assets/Makeup/Images/MUDC_vertical_logo_svg_1.svg"], "top_img": "http://www.makeup.com/-/media/images/makeup/2018/july/31-messy-bun-how-to/makeupcompostgraphicsheroarticle2refeaturemessybunhowto73118r2.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.makeup.com/messy-bun-how-to", "title": "The Perfect Messy Bun in 3 Easy Steps", "meta_data": {"HandheldFriendly": "true", "format-detection": "telephone=no", "viewport": "width=device-width,user-scalable=no,width=device-width, minimum-scale=1.0, maximum-scale=1.0, initial-scale=1.0", "description": "How to create the perfect messy bun in three quick and easy steps. This messy bun tutorial is chic yet effortless and only takes a few minutes.", "keywords": "messy bun , messy bun tutorial , messy bun in three steps , how to make a messy bun , how to do a messy bun , messy bun hairstyle , hair buns how tom , hair buns how to , how to do messy buns , how to make a bun ,bun ,bun hair ,hair ,ballerina bun ,bun hairstyles ,bun ideas ,bun tutorial ,bun tutorials", "og": {"locale": "en_US", "site_name": "Makeup.com", "title": "The Perfect Messy Bun in 3 Easy Steps", "description": "How to create the perfect messy bun in three quick and easy steps. This messy bun tutorial is chic yet effortless and only takes a few minutes.", "image": "http://www.makeup.com/-/media/images/makeup/2018/july/31-messy-bun-how-to/makeupcompostgraphicsheroarticle2refeaturemessybunhowto73118r2.jpg", "url": "https://www.makeup.com/messy-bun-how-to", "type": "article"}, "fb": {"pages": 367424610539}, "twitter": {"title": "The Perfect Messy Bun in 3 Easy Steps", "description": "How to create the perfect messy bun in three quick and easy steps. This messy bun tutorial is chic yet effortless and only takes a few minutes.", "image": "http://www.makeup.com/-/media/images/makeup/2018/july/31-messy-bun-how-to/makeupcompostgraphicsheroarticle2refeaturemessybunhowto73118r2.jpg", "card": "summary_large_image", "site": "@makeupdotcom", "domain": "Makeup.com", "creator": "@makeupdotcom"}, "article": {"section": "Spotlight"}, "onespot": {"default-display-category": "Spotlight", "category": "Spotlight"}, "VIcurrentDateTime": 636986433762377084, "google-site-verification": "RHwpUWicfJ_SUxvexS4gfA6RN4R0ehYw1qdXccGhl2Y", "ir-site-verification-token": 1169586596}, "movies": ["https://www.youtube.com/embed/pPbrCcocxiU"], "publish_date": null, "source": "https://www.makeup.com", "summary": ""}