{"url": "https://www.click2houston.com/entertainment-tonight/10-laguna-beach-moments-that-prove-its-still-the-best-reality-tv-show-of-all-time", "text": "Turns out, it's not so easy to go back, back to the beginning. This Monday, MTV is rolling out its newest summer-centric reality series, Siesta Key. The new docuseries follows the lives of a handful of twenty-somethings fresh out of college for summer break/their transition into the real world in Siesta Key, Florida, a small island near Sarasota in the Gulf of Mexico.\n\nAnd while the network is quick to mention that the series is brought to you by the producers of Laguna Beach and the cinematic location shots prove that Siesta Key is, in fact, a beautiful place to live, the comparisons end there.\n\nLaguna was shot in the early aughts, conveniently timed to when The O.C. was at its peak. It was the golden age of the Razor flip phone, the denim miniskirt, the totally relevant Dashboard Confessional song and the epic teenage flat-ironed hair. The series came out before Twitter, giving the stars no platform to break down every little side glance or nasty comment made behind their friends' backs. It left an element of mystery that's impossible in today's reality TV landscape.\n\nThe show, which lasted for three seasons and spawned The Hills, also followed a real-life group of friends in high school. Instead of the jaded post-college blues, these teens were filled with hope for the future, desperate to have the perfect senior prom and guess where they'd end up in 10 years.\n\nMORE: 'Laguna Beach' Cast Reunites for Dieter Schmitz's Wedding\n\nThe cast of Siesta Key, which consists of one guy that three-quarters of the girls are lusting after and an Orphan Black-esque conveyor belt of identical blonde women with little to no identifying features, seem only interested in partying and hooking up. They mention college graduation and job searching as afterthoughts.\n\nThey don't fit the mold of the musician, drama queen, princess, jock, activist, or loyal friend because they're so busy meeting one criteria: Entitled Millennial. Gone are the relatable moments from Laguna that harkened back to those formative teenage years. Instead, Siesta Key tries to highlight the rich and seemingly aimless lives of these twenty-somethings as they tan, drink, and party.\n\nIn addition to Laguna's ability to capture a generation of drama-loving youths, the show was also filled with memorable moments, quotes and Cabo trips. Here some of the best moments:\n\n1. The Black and White Party\n\nTo quote Lauren Conrad in the show's pilot episode, \"All this drama started with the Black and White party.\" The fun soiree was planned by LC and her friends and thrown in the suite of a nearby hotel. Everyone had to wear black or white -- a rule that Stephen Colletti happily broke in his navy jacket -- and the girls all crowded around the mirror, getting ready together and commenting on the fact that all white dresses looked trashy. Meanwhile, Kristin Cavallari showed up in -- you guessed it -- a white minidress. There was dancing, trash talking, and a heartbroken LC -- what more could you ask for?\n\n2. \"My Car Is Dunzo!\"\n\nProbably the most iconic line in Laguna history came from K. Cavs, who was desperate to convince her dad to get her a new car. When she and some friends went car shopping, her old car started overheating in the middle of some \"gnarly traffic\" and she was forced to declare it \"dunzo.\" Sadly, Cavy-ava-alari didn't get a new ride because she was the one who forgot to change the oil, and her dad didn't want to reward bad behavior. Solid parenting, Dennis.\n\n3. What Happens in Cabo Stays in Cabo\n\nWhere do you go for Spring Break when you live in paradise? To a similar paradise where you can legally drink at 18. All of Laguna Beach High School hits up the same Cabo resort for spring break and things get real, real fast. Whether it was season one, when Stephen declared, \"Keep dancing on the bar, slut,\" to Kristin or season two, when Alex M. tried to fight Jessica in the parking lot for kissing her man, Jason, Cabo never disappointed.\n\n4. Trey vs. Little Man\n\nWho hasn't gone to a Blink-182 concert and almost gotten into a brawl with a small tattooed man? In season one, Trey, a political activist and the founder of Active Young America, didn't take too kindly to a random stranger calling his friends \"sluts\" in the parking lot of a Blink-182 concert. He got very close to fighting, which later prompted LC to ask one of life's greatest mysteries: \"Who would win in a fight, Trey or the 'little man'?\"\n\n5. Prom-Posals\n\nSeriously, the way the Laguna guys asked the Laguna girls to prom was more elaborate than most wedding proposals. Trey spelled out \"Prom?\" in candles and rose petals, Stephen set up a fake secret admirer letter, and a rando friend named Gary gave Morgan a kiddie pool of goldfish with the tagline: \"Of all the fish in the sea, prom with me?\" Who needs a diamond?\n\n6. Broadway Audition\n\nChristina was labeled the \"Reverend's Daughter,\" and she took that stereotype seriously when she landed a Broadway audition and sang Mandy Moore's \"Only Hope\" from A Walk to Remember. Spoiler alert: It didn't land her a role in Wicked, but it did remind us how often we used to sing that song and convince ourselves we were destined for Broadway.\n\n7. \"Swear on Our Relationship?\"\n\nDrama, drama, drama. High school romances were so short-lived and so passionate. Nothing better portrayed that than the romance between Jason and Jessica in season two, which ended up lasting a total of two months but felt neverending on our screens. These two fought constantly and finally split after she spent $100 on Valentine's cookies and candles, only get back together while Jason was dating both Alex M. and LC. What a player.\n\n8. \"Don't Stop Believing\"\n\nThe Stephen-Lauren-Kristin love triangle is still the greatest of its kind. You wanted LC to finally get the guy, and when Stephen picked up her for a dinner date and they sang Journey's \"Don't Stop Believing\" in the car, it gave you hope that true love really existed. Also noteworthy, Glee didn't come until five years later -- where's the credit, Ryan Murphy?!\n\n9. Fashion Shows\n\nTrey was known for his edgy style (he actually went on to work for Vera Wang later in life), and he loved putting on fashion shows in Laguna. In season one, he organized a show centered around the most memorable accessory of the early '00s -- the trucker hat. Then in season two, he put together a fundraiser fashion show to help local mudslide victims. That turned into a scene of Jason and Jessica kissing in front of LC, which proved to be one of the show's most dramatic moments. Style plus cheating plus emo music? Pure reality TV gold.\n\n10. Graduation Promises\n\nNo show has captured high school graduation better than Laguna Beach. From the cap-and-gown pics to the tearful goodbyes, fans got to watch as these lifelong friends were forced to be apart for the first time, going off to college and getting out of the Laguna \"bubble.\" Seeing Stephen and Kristin say goodbye and making romantic declarations to one another was both so sweet and so naïve, touching at the heart of what made the show so relevant and genuine. It also aired right in the heyday of Vitamin C's hit \"Graduation Day,\" so, like, are we not supposed to weep openly?\n\nWhat's your favorite Laguna moment? Comment below! And for updates on The Hills cast today, watch the clip below!\n\nSiesta Key premieres Monday, July 31 at 10 p.m. ET on MTV.\n\nCopyright (c) 2016 CBS Studios Inc. All Rights Reserved.", "images": ["https://media.click2houston.com/photo/2019/07/12/6P%20V%20TEEN%20KILLED%20SPRING_KPRC6037_1562974451515.jpg_22098852_ver1.0_160_90.jpg", "https://media.click2houston.com/photo/2019/07/12/barry-blog2_1562941265114_22097074_ver1.0_640_360.jpg", "https://media.click2houston.com/photo/2019/02/25/10P%20BILL%20WORST%20COMMUTE%20TIMES%20PKG_1551148967297.jpg_20415291_ver1.0_160_90.jpg", "https://media.click2houston.com/photo/2019/07/12/Barry%20Track_1562986442649.JPG_22098991_ver1.0_160_90.jpg", "https://media.click2houston.com/photo/2019/07/12/Barry%20Track_1562986442649.JPG_22098991_ver1.0_640_360.jpg", "https://media.click2houston.com/photo/2019/07/12/10PM%20PKG%20KINGWOOD%20CAR%20BREAK-INS%20-%20BRITTANY_ToKPRCftp_1_1562984159215.jpg_22098972_ver1.0_160_90.jpg", "https://media.click2houston.com/photo/2019/07/12/6P%20P%20APOLLO%2011%20FRANK%20HU_KPRC601D_1562974897909.jpg_22098857_ver1.0_160_90.jpg", "https://media.click2houston.com/photo/2019/07/12/acevedo-gonzalez_1562948261390_22097528_ver1.0_160_90.jpg", "https://media.click2houston.com/photo/2019/07/12/10P%20P%20MISSING%20KID%20STRAT_KPRC6047_1562981621874.jpg_22098786_ver1.0_640_360.jpg", "https://media.click2houston.com/photo/2019/07/12/10PM%20PKG%20KINGWOOD%20CAR%20BREAK-INS%20-%20BRITTANY_ToKPRCftp_1_1562984159215.jpg_22098972_ver1.0_640_360.jpg", "https://sharedmedia.grahamdigital.com/photo/2017/07/26/1280_laguna_beach_mtv_10166922_ver1.0_1280_720.jpg", "https://media.click2houston.com/photo/2019/07/12/barry-blog2_1562941265114_22097074_ver1.0_160_90.jpg", "https://media.click2houston.com/photo/2019/07/12/6P%20V%20TEEN%20KILLED%20SPRING_KPRC6037_1562974451515.jpg_22098852_ver1.0_640_360.jpg", "https://media.click2houston.com/photo/2019/07/12/elandon-roberts-traffic-stop_1562957686057_22098020_ver1.0_160_90.jpg", "https://media.click2houston.com/photo/2019/07/12/10P%20P%20MISSING%20KID%20STRAT_KPRC6047_1562981621874.jpg_22098786_ver1.0_160_90.jpg"], "top_img": "https://sharedmedia.grahamdigital.com/photo/2017/07/26/1280_laguna_beach_mtv_10166922_ver1.0_1280_720.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.click2houston.com/entertainment-tonight/10-laguna-beach-moments-that-prove-its-still-the-best-reality-tv-show-of-all-time", "title": "10 'Laguna Beach' Moments That Prove It's Still the Best Reality TV Show of All Time", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "description": "Turns out, it's not so easy to go back, back to the  beginning. This Monday, MTV is rolling out its newest summer-centric reality  series,  Siesta Key . The new docuseries follows the lives of a ...", "keywords": "News", "og": {"title": "10 'Laguna Beach' Moments That Prove It's Still the Best Reality TV Show of All Time", "description": "Turns out, it's not so easy to go back, back to the  beginning. This Monday, MTV is rolling out its newest summer-centric reality  series, Siesta Key. The new docuseries follows the lives of a  handful of twenty-somethings fresh out of college for summer break/their  transition into the real world in Siesta Key, Florida, a small island near  Sarasota in the Gulf of Mexico.", "type": "news", "url": "https://www.click2houston.com/entertainment-tonight/10-laguna-beach-moments-that-prove-its-still-the-best-reality-tv-show-of-all-time", "image": {"identifier": "https://sharedmedia.grahamdigital.com/photo/2017/07/26/1280_laguna_beach_mtv_10166922_ver1.0_1280_720.jpg", "width": 1280, "height": 720}, "locale": "en_US", "site_name": "KPRC"}, "fb": {"app_id": 111452835671872, "pages": 110260895670639}, "article": {"section": "Entertainment Tonight", "published_time": "2017-07-26T14:50:00+00:00", "modified_time": "2017-07-26T14:50:00+00:00", "expiration_time": "2042-03-17T14:50:00+00:00"}, "twitter": {"card": "summary_large_image", "title": "10 'Laguna Beach' Moments That Prove It's Still the Best Reality TV Show of All Time", "description": "Turns out, it's not so easy to go back, back to the  beginning. This Monday, MTV is rolling out its newest summer-centric reality  series, Siesta Key. The new docuseries follows the lives of a  handful of twenty-somethings fresh out of college for summer break/their  transition into the real world in Siesta Key, Florida, a small island near  Sarasota in the Gulf of Mexico.", "site": "KPRC", "image": "https://sharedmedia.grahamdigital.com/photo/2017/07/26/1280_laguna_beach_mtv_10166922_ver1.0_1280_720.jpg", "domain": "https://www.click2houston.com", "app": {"name": {"googleplay": "click2houston.com"}, "id": {"googleplay": "com.ibsys.app.pns_ant"}}}, "page-category": "Entertainment Tonight", "endplay.categories": "Entertainment Tonight", "content_id": 552636640, "vf": {"unique_id": 552636640}, "page-type": "article", "news_keywords": "10 'Laguna Beach' Moments That Prove It's Still the Best Reality TV Show of All Time", "sailthru.title": "10 'Laguna Beach' Moments That Prove It's Still the Best Reality TV Show of All Time", "sailthru.description": "Turns out, it's not so easy to go back, back to the  beginning. This Monday, MTV is rolling out its newest summer-centric reality  series,  Siesta Key . The new docuseries follows the lives of a  handful of twenty-somethings fresh out of college for summer break/their  transition into the real world in Siesta Key, Florida, a small island near  Sarasota in the Gulf of Mexico.", "sailthru.tags": "News", "sailthru.date": "2017-07-26T14:50:00+0000", "sailthru.image.full": "https://sharedmedia.grahamdigital.com/photo/2017/07/26/1280_laguna_beach_mtv_10166922_ver1.0_1280_720.jpg", "sailthru.image.thumb": "https://sharedmedia.grahamdigital.com/photo/2017/07/26/1280_laguna_beach_mtv_10166922_ver1.0_160_90.jpg", "al": {"ios": {"app_store_id": 426129542, "app_name": "click2houston.com"}, "android": {"package": "com.ibsys.app.pns_ant", "app_name": "click2houston.com"}}}, "movies": ["https://www.youtube.com/embed/c_EW9JM2u3A?feature=oembed", "https://www.youtube.com/embed/bGi7jIOCd8A?feature=oembed", "https://www.youtube.com/embed/GaKe_ylQXBU?feature=oembed"], "publish_date": 1501080600.0, "source": "https://www.click2houston.com", "summary": ""}