{"url": "https://people.com/celebrity/what-was-the-whopping-cost-of-kim-kardashian-and-kanye-wests-wedding/", "text": "Image zoom AKM-GSI\n\nOkay, so how much do I owe you?\n\nNow that all of the glittery dust has settled on Kim Kardashian and Kanye West‘s ultra-extravagant wedding – which included nearly weeklong festivities in Paris and Florence, Italy, and left nothing to be desired for its star-studded guest list – there’s one question that’s top of mind: How much did the fabulous foreign affair cost?\n\nPretty sure the mile-long receipt is still being tallied, but here’s a running list of items included in the multimillion-dollar/euro event.\n\nTop-Notch Accommodations\n\nIn Paris, guests who began arriving around May 19 stayed at Hôtel George V, a luxury five-star hotel offering rooms starting at $750 a night. Once the party headed to Florence, guests stayed at least a night at either the St. Regis or Four Seasons. Both offer rooms for about $885 a night. Multiply all that by roughly 200 guests and the hotel price tag could be more than half a million dollars. That’s not to mention the family’s luxe Villa San Michele accommodations in Florence, which cost at least $1,800 a night per room.\n\nPre-Wedding Spree\n\nAmong the wedding activities list was a private bachelorette dinner for the bride and her closest girlfriends at Hôtel Costes, home of one of Paris’ top restaurants. With prices up to $190 a plate, that dinner alone comes in at nearly $4,100 – probably much much less than the cost of the next day’s rehearsal dinner, which included a performance by Lana Del Rey (Kanye is rumored to have paid her a pretty penny to sing Kardashian’s favorite song, “Young and Beautiful”) and the subsequent guided tour of Versailles.\n\nPrivate Transportation\n\nIn order to get their guests from pre-wedding festivities in Paris to the main event in Florence, the Wests chartered two private jets. Once on the ground a fleet of 45 to 50 cars and vans shuttled them to and from the Florence airport. The price for the cars alone is estimated at nearly $70,000, gas included.\n\nHair and Makeup for All\n\nLucky guests availed themselves of a full glam team for the couple’s big day. High-end Paris-based stylist Allison Depriestre says such a service could easily cost $380 per person. For 200-plus guests that’s more than $65,000 just to get pretty.\n\nThe Breathtaking Venue\n\nThe over-the-top couple said their official “I do”s atop Forte di Belvedere, an imposing 16th-century fortress in Florence offering gorgeous views of the ancient Italian city. Kardashian and West are said to have spent more than $409,000 to rent the property for their May 24 wedding. That’s before all of the upgrades, lighting and construction needed for the grand event.\n\nRare Flowers\n\nWith fresh flower walls similar to the one West gifted his bride for Mother’s Day, the wedding’s buds alone cost a small fortune. Among the mountain of flower arrangements that arrived at the fort were bushels of tuberose, which is extremely rare this time of year, renowned for its beautiful unique scent and considered an almost sacred flower. Florists at Fiori Della Signoria, one of the city’s oldest flower shops, estimate total flower costs to be $136,000.\n\nFabulous Food\n\nTop chefs Annie Féolde and her husband, Giorgio Pinchiorri, led Florence-based Galateo catering company in handling the super-tasty, super-pricey wedding menu. Considering Féolde and Pinchiorri’s own renowned Florentine restaurant Enoteca Pinchiorri – where a plate of spaghetti can set you back $100 – the wedding feast was easily in the tens of thousands. Add on the couple’s 7-ft wedding cake and the price climbs even higher.\n\nCouture Everything\n\nThe Vogue cover couple got hitched in front of all their designer-clad guests wearing the best Givenchy had to offer. For Kardashian that meant a custom Givenchy Haute Couture gown designed by her friend Riccardo Tisci, estimated cost up to $500,000. Not to be upstaged, daughter North donned a mini matching handmade dress, which was probably a little bit cheaper.\n\nGuests say the week’s pomp and circumstance was all worth it. As Kardashian family friend Malika Haqq told PEOPLE after the wedding, “Kanye really went all out there with his love.” No kidding!\n\nReporting by EMMA TYLER, ANDREA LAVINTHAL and MARY GREEN\n\nRELATED: Complete Timeline of Kim and Kanye’s Love Story\n\n[IMAGE” “” “” “0” ]\n\nMore on Kim & Kanye’s Wedding:\n\n• From Europe with Love! Personal Snaps from Kim & Kanye’s Wedding Weekend\n\n• Kim & Kanye’s Crazy in Love Quotes\n\n• Kim & Kanye’s Worldwide Whirlwind Romance\n\n• Kim & Kanye’s Matchy-Matchy Couple Style", "images": ["https://peopledotcom.files.wordpress.com/2019/04/couple-1.jpg?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2019/05/channing-tatum-jessie-j-3.jpg?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2016/08/kim-kardashian-300x400-90.jpg", "https://peopledotcom.files.wordpress.com/2019/04/jessica-alba-cash-warren-paris-vacation.jpg?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2016/08/kim-kardashian-300x400-90.jpg?w=300&h=400&crop=1", "https://peopledotcom.files.wordpress.com/2019/03/john-delaney.jpg?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2019/04/screen-shot-2019-04-25-at-8.41.31-am.png?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2018/04/mickey-pretzels-1-2000.jpg?&fit=250%2C250"], "top_img": "https://peopledotcom.files.wordpress.com/2016/08/kim-kardashian-300x400-90.jpg?w=300&h=400&crop=1", "keywords": [], "authors": [], "canonical_link": "https://people.com/celebrity/what-was-the-whopping-cost-of-kim-kardashian-and-kanye-wests-wedding/", "title": "Kim Kardashian and Kanye West Wedding Costs: PEOPLE Breaks Down the Bill", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "Kimye wedding, kim kanye wedding, kim and kanye, kim kardashian kanye west, how much did kim and kanye wedding cost, kim kanye Florence, kim kanye Italy, kim kanye paris, kim kanye married, kim kanye wedding details, kim kanye wedding millions", "news_keywords": "Kimye wedding, kim kanye wedding, kim and kanye, kim kardashian kanye west, how much did kim and kanye wedding cost, kim kanye Florence, kim kanye Italy, kim kanye paris, kim kanye married, kim kanye wedding details, kim kanye wedding millions", "description": "Okay, so how much do I owe you? Now that all of the glittery dust has settled on Kim Kardashian…", "og": {"title": "Kim Kardashian and Kanye West Wedding Costs: PEOPLE Breaks Down the Bill", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/celebrity/what-was-the-whopping-cost-of-kim-kardashian-and-kanye-wests-wedding/", "description": "Luxury hotels, private planes, fancy meals and more take the Kardashian-West wedding budget well into the millions", "image": {"identifier": "https://peopledotcom.files.wordpress.com/2016/08/kim-kardashian-300x400-90.jpg?w=300&h=400&crop=1", "width": 300, "height": 400}}, "pinterest": {"url": "https://people.com/celebrity/what-was-the-whopping-cost-of-kim-kardashian-and-kanye-wests-wedding/", "description": "Okay, so how much do I owe you? Now that all of the glittery dust has settled on Kim Kardashian…", "media": "https://peopledotcom.files.wordpress.com/2016/08/kim-kardashian-300x400-90.jpg?w=300&h=400&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/celebrity/what-was-the-whopping-cost-of-kim-kardashian-and-kanye-wests-wedding/", "title": "Kim Kardashian and Kanye West Wedding Costs: PEOPLE Breaks Down the Bill", "description": "Okay, so how much do I owe you? Now that all of the glittery dust has settled on Kim Kardashian…", "site": "@people", "image": "https://peopledotcom.files.wordpress.com/2016/08/kim-kardashian-300x400-90.jpg?w=300&h=400&crop=1"}, "fb": {"pages": 95926963131}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}