{"url": "https://www.cosmopolitan.com/style-beauty/beauty/how-to/a33187/how-to-defrizz-your-hair/", "text": "Let's start this off with a reminder that frizz is natural and beautiful. Your hair does not need to be \"tamed\" or \"handled\" or \"conquered,\" okay? That being said, I'm guessing you've come to this article because you're looking to try a smooth, flyaway-free style—and hey, that's totally fine. You can embrace frizz and flyaways on a daily basis and still want to try a slicked-back look every now and then.\n\nIf you're wondering WTF is causing your frizz, here's some fast facts: When your hair is damaged, dry, or chemically treated, the outer layer of the strand (called the cuticle) rises, allowing for moisture to enter the strand, fatten it up, and create frizz. The fix? Get preternaturally smooth hair cuticles—something only reserved for newborn babies and, soon, you. Because we got six celebrity hairstylists to offer up their expert tricks and product recommendations to help you get the smoothest hair of your life. Keep reading to find out how.\n\n\n\nLove Cosmo? Want the mag? Subscribe here!\n\nCourtesy Image Davines OI Shampoo amazon.com $34.00 SHOP NOW\n\n1. Only use gentle shampoos\n\n“Find a shampoo that is sulfate-free,” says celebrity hairstylist Laura Rugetti, who works with Tori Spelling, Teddi Mellencamp, Audrina Patridge, and Lisa Rinna. Shampoos with sulfates strip and dehydrate your strands, which is the opposite of you want when looking to maintain moisture. “My favorite gentle shampoo is Davines Oi Shampoo—it's super moisturizing and leaves your hair feeling silky,\" she says.\n\nMurumuru Reconstructive Shampoo for Curly Hair naturabrasil.com $9.00 SHOP NOW\n\n2. Load up on the glycerin\n\nAlong with cutting out the sulfates, look for a shampoo with glycerin as one of the first ingredients (the closer the ingredients are to the top of the list, the more concentrated they are in the formula). Not only does glycerin help combat frizz by penetrating the hair shaft and hydrating it from the inside out, but it also creates a protective coating on the strand, helping mitigate damage, says celebrity hairstylist Mark Townsend, who works with Elizabeth Olsen, Jennifer Lawrence, and virtually every other celeb you love.\n\nCourtesy Image SmoothProof Conditioner biolage matrix.com $703.00 SHOP NOW\n\n3. Don't skip conditioner\n\n“Clients often ask me if they need conditioner, and the answer is absolutely,” says Giovanni Vaccaro, hairstylist and artistic director at Glamsquad. “Conditioner is your number-one weapon in fighting frizz.” Try Biolage SmoothProof Conditio ne r (Vaccaro's favorite), or Aveda Cherry Almond Softening Conditioner (my favorite). Apply it from mid-shaft down to your ends, keeping it away from your roots, and wait at least five full minutes—yes, really—before rinsing it out.\n\nCourtesy Image Redken Genius Wash Cleansing Conditioner for Coarse Hair amazon.com $21.25 SHOP NOW\n\n4. But do skip a daily shampoo\n\nYou might think your hair needs to be shampooed several times a week, but it really doesn't, especially if you have coarse or curly hair. So every two days, rinse your hair with only conditioner (conditioner contains a small amount of cleansers, so it will still lightly clean your hair without stripping it). Hairstylist Mark Garrison suggests using a lightweight conditioner if you have fine hair, like Nexxus Hydra-Light Weightless Moisture Conditioner . If you have thick and coarse hair, you can use a richer formula, like Redken Genius Wash for Coarse Hair .\n\nKevin Murphy Hydrate Me Masque amazon.com $53.24 $30.80 (42% off) SHOP NOW\n\n5. Always mask weekly\n\nDoing a deep-conditioning treatment at least once a week, especially in the colder months, will help fill any gaps in your hair shaft (gaps and spaces contribute to frizz). Rugetti suggests Kevin Murphy’s Hydrate Me Masque to keep hair feeling soft and moisturized. For even deeper hydration, try applying your mask to dry hair—yes, dry—and leave it on for at least 30 minutes before hopping in the shower and rinsing it off.\n\nCourtesy Image Aquis Microfiber Towel AQUIS amazon.com $24.99 SHOP NOW\n\n6. Ditch your regular hair towel\n\nAs you know, your hair is at its most vulnerable state when it’s wet. So, using the wrong towel can literally make (or break) your hair, making your fabric choice that much more important. “Cotton towels create friction with your hair, leading to frizz and breakage,” says Vaccaro. “I love and always recommend Aquis Towels to dry your hair—they have a microfiber technology that prevents friction and helps dry hair faster.”\n\nCourtesy Image Alterna Bamboo Smooth Kendi Oil Dry Oil Mist dermstore.com $25.00 SHOP NOW\n\n7. Add a light layer of dry oil\n\nWhile your hair is still wet, rake a few drops of a moisture-locking dry oil, like Alterna Bamboo Smooth Kendi Dry Oil Mist, from your mid-lengths to ends. Why? Oil acts as a barrier, keeping humidity from penetrating and causing flyaways. Once your hair is 90 percent dry, blow-dry your hair with a mixed-bristle round brush (the plastic bristles pick up the hair and pull it taught, and the boar bristles help make your hair super straight) to seal the cuticle for a smooth finish. You can also flat-iron your hair after it's dry—nothing will seal the cuticle like intense heat, Garrison says.\n\nCourtesy Image Slip for Beauty leep 3-Pack Slipsilk Hair Ties nordstrom.com $39.00 SHOP NOW\n\n8. Get frizz-free waves with buns\n\nAlthough hot tools are ideal for sealing a cuticle, you shouldn't have to mess with your natural texture if you don't want to. So if you want waves but have curly hair, try twisting your damp hair (use a leave-in conditioner, first) into two low buns while it dries, tying them off with Scrunchies to prevent kinks. As your hair dries, your curls will slightly stretch and your cuticle will close. Smooth a dab of dry oil (see above) through your dry hair in the morning to lay down any frizz.\n\nCourtesy Image Oribe Curl Gelée for Shine & Definition oribe.com $44.00 SHOP NOW\n\n9. Get yourself a really good curl cream (or gel)\n\nCurls are naturally drier and, in turn, naturally more prone to frizz. To keep your hair defined, rake and squeeze a dollop of curl cream through your sopping-wet curls after shampooing and conditioning. Then, twirl small sections of curls around your fingers to shape them and define them, before letting them air-dry. To speed up the drying process and get extra volume, diffuse your curls on low speed, high heat (avoid touching your hair as much as possible or it'll frizz) until it's 80 percent dry.\n\nCourtesy Image GlamSquad Flexible Hairspray glamsquad.com $12.00 SHOP NOW\n\n10. Touch up with a toothbrush\n\nWhile you may think you need a layer of oil to smooth flyaways around your hairline, Vaccaro likes to opt for a hairspray instead, as \"these guys need a stronger solution,\" he says. Instead of blasting your hair with a layer of spray, opt for a lighter touch: Spritz a clean toothbrush with hairspray (try Glamsquad’s Take Hold Hairspray—yes, it's Vaccaro's own line, but it's legit good), then brush it over your hairline or part to keep those wisps down.\n\nCourtesy Image NuMe Megastar Hair Straightener ulta.com $139.00 SHOP NOW\n\n11. Pick the right tools\n\nSure, you may think that your flat iron from 2008 works just fine, but it might actually be causing more damage and frizz than you realize. Hairstylist Jessica Shakir swears by the NuMe MegaStar Straightener for her clients. \"It has this negative ion conditioning technology that seals the hair’s cuticle to keep it smooth,\" she says. “I also spritz a lightweight heat-protectant spray over damp hair before I use any hot tool to help prevent frizz, and I'll also use it to smooth any flyaways on dry hair later in the day.”\n\nThe One by Frederic Fekkai One to Believe In Leave-In Conditioner nordstrom.com $26.00 SHOP NOW\n\n12. Leave-in before you work out\n\nWeird side effect of your Spin class (other than a really good butt): dry hair. The sodium in your sweat can actually dehydrate your hair, making it extra prone to frizz and breakage. So before you tie back your hair, spray it with a leave-in conditioner to protect your strands during your sweat session. Also, if you have textured hair and normally work out in a silk scarf, swap it for a cotton handkerchief—cotton absorbs moisture, and you want the fabric to soak up the sweat, not trap it in.\n\nGoody 50-Count Bobby Pins amazon.com $6.42 SHOP NOW\n\n13. Clamp down your flyaways with accessories\n\nAccording to Garrison, serums aren't ideal or strong enough for smoothing flyaways, since they don't have any holding power. So if your updo tends to get frizzy, stick to cute bobby pins and hairspray to help slick down those bad boys.\n\n\n\nCourtesy Image Slip for Beauty Sleep Slipsilk Pure Silk Pillowcase nordstrom.com $85.00 SHOP NOW\n\n14. Switch up your pillowcase situation\n\nIf you're still sleeping on cotton, now is officially the time to switch to a silk pillowcase. “Silk really helps protect your hair while you sleep,” says Vaccaro. “It maintains your hair's natural oils, which is especially important if your hair is fragile from chemical treatments.\"\n\n15. Try an in-salon smoother\n\nListen, I get it. Sometimes, DIYs and at-home hacks simply aren’t powerful enough. In that case, Rugetti suggests trying an in-salon treatment: “I really love the Pura Luxe straightening treatment—it's similar to the new-and-improved keratin treatments, but it’s non-toxic.\" Call your salon ahead of making your appointment to see which smoothing treatments they recommend, especially if you have curly hair.", "images": ["https://hips.hearstapps.com/vader-prod.s3.amazonaws.com/1554229595-5102Bs9mzW2L.jpg?crop=0.667xw:1xh;center,top", "https://hips.hearstapps.com/vader-prod.s3.amazonaws.com/1554229923-32774.jpg?crop=0.642xw:0.962xh;0.178xw,0.0180xh", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/option2-1544108498.png?crop=1.00xw:1.00xh;0,0&resize=300:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/vader-prod.s3.amazonaws.com/1554236630-nume-update-1554236621.jpg?crop=1xw:1xh;center,top", "https://hips.hearstapps.com/vader-prod.s3.amazonaws.com/1554229118-41kl7-2IT0L.jpg?crop=0.667xw:1xh;center,top", "https://hips.hearstapps.com/vader-prod.s3.amazonaws.com/1554233739-37db929c-778a-4971-b6c7-641faa055f9d.jpg?crop=1xw:0.978xh;center,top", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/frizz-1554478900.jpg?crop=1xw:1xh;center,top&resize=1200:*", "https://hips.hearstapps.com/vader-prod.s3.amazonaws.com/1554829900-matrix-1554829878.jpg?crop=0.553xw:0.830xh;0.245xw,0.0962xh", "https://hips.hearstapps.com/vader-prod.s3.amazonaws.com/1554229238-31mvDxXWiDL.jpg?crop=0.799xw:1xh;center,top", "https://hips.hearstapps.com/vader-prod.s3.amazonaws.com/1554394708-oribesite_curlgelee.png?crop=1.00xw:0.992xh;0,0.00825xh", "https://hips.hearstapps.com/vader-prod.s3.amazonaws.com/1554233120-gs-hi-res-1554233088.jpg?crop=0.809xw:0.809xh;0.0555xw,0.0967xh", "https://hips.hearstapps.com/vader-prod.s3.amazonaws.com/1554227814-davines-hi-res-1554227774.jpg?crop=0.803xw:0.803xh;0.0896xw,0.0988xh", "https://hips.hearstapps.com/vader-prod.s3.amazonaws.com/1554232369-be340987-b628-4c89-867e-86e271559639.jpg?crop=1xw:0.978xh;center,top", "https://hips.hearstapps.com/vader-prod.s3.amazonaws.com/1554227561-META_TAG_HTML_URL_COMPONENT_Murumuru-Reconstructive-Shampoo-for-Curly-Hair_desktop-2_1920x.jpg?crop=0.220xw:0.852xh;0.542xw,0.0675xh", "https://hips.hearstapps.com/vader-prod.s3.amazonaws.com/1554234138-31aKJUjM3JL.jpg?crop=0.670xw:1.00xh;0.200xw,0", "https://hips.hearstapps.com/vader-prod.s3.amazonaws.com/1554234391-942264a1-93a2-40f4-b225-aa0d4c627a28.jpg?crop=1xw:0.978xh;center,top"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/frizz-1554478900.jpg?crop=1xw:1xh;center,top&resize=1200:*", "keywords": [], "authors": ["Janell M. Hickman", "Carly Cardellino", "Janell M.", "Beauty Director", "Carly Cardellino Is The Beauty Director At Cosmopolitan", "Writing About All Things Beauty For Both Print"], "canonical_link": "https://www.cosmopolitan.com/style-beauty/beauty/a33187/how-to-defrizz-your-hair/", "title": "Best Hairstyles, Shampoo, and Products to Tame Frizzy Hair", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "15 Genius Tricks to Smooth Your Frizz and Flyaways", "description": "Seriously, you need to try these.", "url": "https://www.cosmopolitan.com/style-beauty/beauty/how-to/a33187/how-to-defrizz-your-hair/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/frizz-1554478900.jpg?crop=1xw:1xh;center,top&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "modified_time": "2019-04-09 05:11:57", "published_time": "2019-04-05 03:43:00", "section": "Beauty"}, "twitter": {"site": "@Cosmopolitan", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/frizz-1554478900.jpg?crop=1xw:1xh;center,top&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "15 Frizzy Hair Solutions - Best Hairstyles, Shampoo, and Products to Tame Frizzy Hair", "description": "There's nothing wrong with frizz or flyaways, but they can certainly be annoying. We found 15 solutions to help you have your best hair day yet.", "keywords": "frizzy hair, best products for frizzy hair, best shampoo for frizzy hair, best conditioner for frizzy hair, hairstyles for frizzy hair, how to tame frizzy hair", "auto-publish": "evergreen", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/frizz-1554478900.jpg?crop=0.5xw:1xh;center,top&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Beauty & Style,style-beauty,beauty,shopclick,Mark Garrison,how to defrizz,defrizz,Mark Townsend", "sailthru.date": "2019-04-05T15:43:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/frizz-1554478900.jpg?crop=1xw:1xh;center,top", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/frizz-1554478900.jpg?crop=0.5xw:1xh;center,top", "sailthru.socialtitle": "15 Genius Tricks to Smooth Your Frizz and Flyaways", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1554450180.0, "source": "https://www.cosmopolitan.com", "summary": ""}