{"url": "https://web.archive.org/web/20160216180541/https://flipboard.com/@thenewsdesk/the-grammy-awards-sb7qbk6pz", "text": "The Grammy Awards\n\nBy Flipboard Newsdesk | The news, looks and best moments from music's biggest night on February 15, 2016.\n\nAdele and Lionel Richie finally meet backstage at Grammys It's them you're looking for Hello, it’s the most anticipated photo of the Grammys: Lionel Richie posing with Adele. After much back and forth in the press, Richie and Adele finally met backstage at Monday’s award show. Both have songs title “Hello” – maybe you heard Adele’s version once or twice – … Lionel Richie\n\nGrammys 2016: Celebs name music they can’t get out of their head Some of the biggest names in music stopped by the Grammys Monday night, and while many of them were there to accept awards for their own work, that didn’t stop them from geeking out over their favorite artists on the red carpet. Ahead of Monday night’s show, PEOPLE and EW asked artists like A$AP … Award Shows\n\nLauryn Hill, Grammy President Trade Words After Hill No-Show Fugees singer rehearsed with the Weeknd for Grammy performance, but didn't take stage Monday night The worst-kept secret going into Music's Biggest Night was an unannounced appearance by Lauryn Hill, who was supposed to join the Weeknd during his Grammy performance of \"In the Night\"; photos of the … Lauryn Hill\n\nPitbull Closes Out The GRAMMY Awards With A Special Guest — Sofia Vergara! Leave it to Mr. Worldwide to pull off the biggest surprise of the night.... The 2016 GRAMMY Awards closed out with a performance by Pitbull and a few of his famous friends, including Robin Thicke, Travis Barker and Joe Perry. But one famous non-singer also joined the rapper on stage: his good friends, … Sofia Vergara\n\nHow Taylor Swift, Andra Day, and More of Your Favorite Stars Celebrated After the Grammys When the Grammys are over, what is a celebrity to do? Attend the after parties, of course. All around Los Angeles, music labels held soirees to celebrate—and we were there to bring out all the behind-the-scenes scoop. Here's what you didn't see happen on TV. Down the street from the Staples Center at … Taylor Swift\n\nSelena Gomez and Taylor Swift's Brother Posed for a Photo at the Grammys ​And the Internet cannot handle it. Nope.​ Moments before Taylor Swift opened last night's Grammy Awards, her biggest fans took a cute little photo from the comfort of their front row seats, as you do on music's biggest night. Selena Gomez and former Yeezy Boosts owner Austin Swift, who I guess was … Selena Gomez\n\nSee Gwen Stefani's live music video from the Grammys Gwen Stefani unveiled the track list and release date for her forthcoming new album This is What the Truth Feels Like last week, and on Monday night she debuted its first music video (for “Make Me Like You”) during the Grammys. But the clip wasn’t a traditional music vid. Instead, Stefani performed … Gwen Stefani\n\nGrammys 2016: Celebs want Kanye, Adele, or Beyoncé to write lyrics about them Many artists include references to real-life people in their songs – and sometimes in ways that cause great amounts of backlash (hi, Kanye West) – but who do the artists themselves want to have immortalize them with a lyric? Great question, because that’s what PEOPLE and EW asked a group of music’s … Award Shows\n\nGrammys 2016: Justin Bieber's secret talent is... Ping pong. It's ping pong. Justin Bieber made personal history at the Grammys on Monday night, winning his first-ever award for “Where Are U Now,” his collaboration with Skrillex and Diplo. But if there were an awards show for ping-pong players, Bieber might have broken through much sooner. “He’s … Justin Bieber\n\nLady Gaga gets David Bowie tattoo ahead of Grammys tribute (CNN) — Fame may be fleeting, but Lady Gaga is honoring David Bowie in a way that is very permanent. She went under the needle to get a tattoo of the late rock legend just before performing a tribute to him at this year's 58th annual Grammy Awards. The 29-year-old singer posted the video of herself … Tattoos\n\nGrammys 2016: Zendaya comments on her red-carpet look Zendaya was among the celebrities to pay some passing tribute to David Bowie on the Grammys’ red carpet Monday night, wearing a pant suit and mullet wig to much acclaim during the ceremony pre-show. “We’re always inspired by the past, we kind of wanted to give this a vintage feel,” she said to … Zendaya\n\nThe Crazy and Emotional Grammys Moments You Didn’t See on TV Taylor Swift sheds a tear Another Grammy Awards is in the books, and there were no shortage of crazy moments off-camera. Taylor Swift kicked off the show with a world TV premiere performance of “Out of the Woods.” While many were wowed by her vocals, the night’s album of the year winner was not … Taylor Swift\n\nAlabama Shakes Make Grammy Performance Debut With 'Don't Wanna Fight' Brittany Howard and Co. deliver smoldering cut that won Best Rock Song and Rock Performance The Alabama Shakes made their Grammy performance debut with a rendition of \"Don't Wanna Fight\" after the Sound and Color cut garnered a trophy for Best Rock Song and Best Rock Performance. Frontwoman Brittany … Award Shows\n\nMeghan Trainor Breaks Down in Tears During Her Grammys Acceptance Speech She won in the Best New Artist category. When Meghan Trainor took to the stage on Monday night to accept her Grammy Award for Best New Artist, she kept it short, sweet — and tear-filled. She thanked L.A. Reid for \"looking at me like an artist instead of just a songwriter,\" and gave a shout-out to … Meghan Trainor\n\nTwitter Reacts Angrily to the Grammy Awards Not Giving the Late Natalie Cole Her Own Tribute Segment Although many tributes were included in Monday night's Grammy Awards, Natalie Cole was not one of those individually honored – and fans are not happy about it. Unlike music legends David Bowie, Maurice White, Glenn Frey, and Lionel Richie, Cole's contribution to music was noted in the Grammys in … Natalie Cole\n\nFree streaming music attacked at Grammys as Apple Music/Sonos ad airs during break Free streaming music came under attack at last night’s Grammys, as Apple and Sonos aired a new Apple Music ad during the break. Recording Academy President Neil Portnow and Common said that free tiers on streaming music services threaten the viability of music as a career, reports The Verge. “Isn’t a … Award Shows\n\nGrammys 2016: Beyoncé Wears Sheer White Gown to Announce Record of the Year When Beyoncé only has about a minute onstage, she’s going to make the most out of every second. The star presented the night’s biggest honor, record of the year, to Bruno Mars and Mark Ronson for “Uptown Funk,” at the 58th Grammy Awards in Los Angeles on Monday. Though she did not perform or win a … Celebrity Style\n\nAdele plagued by technical problems during Grammys performance Adele made what should have been her triumphant return to the Grammys on Monday night. However, the mega-selling singer's performance proved a disappointment to TV viewers when it was plagued by sound problems. Bruno Mars introduced Adele, who sang \"All I Ask,\" which they wrote together for her new … Adele\n\nSee Kate Hudson Shedding Tears During Adele's Grammy Awards Performance Technical difficulties included, Adele still managed to give everyone the feels – including Kate Hudson. The actress, who watched the Grammy Awards from home, took to Snapchat on Monday, letting the world in on her secret; Adele's performance really brought her to tears. \"She's just too much,\" … Kate Hudson\n\nRihanna cancels Grammys performance at the last minute Rihanna canceled her Grammys performance right before the show, citing illness. “Based on Rihanna’s examination, after Grammy rehearsal today, Rihanna’s doctor put her on vocal rest for 48 hours because she was at risk of hemorrhaging her vocal chords,” her rep told Page Six on Monday night. Her rep … Rihanna\n\nWatch Johnny Depp Go Full Rock Star at the 2016 Grammys His supergroup, the Hollywood Vampires, paid homage to late Motörhead front man Lemmy Kilmister. Monday evening’s Grammy Awards got a jolt of movie stardom when Johnny Depp took the stage to perform with the Hollywood Vampires—the heavy-metal supergroup he formed with Alice Cooper, Aerosmith’s Joe … Johnny Depp\n\nBeyoncé Casually Wore a Wedding Dress to the Grammys ​The queen can do as she pleases. If you stayed up until the end of the Grammys you were rewarded with Beyoncé. The pop star didn't walk the red carpet or sit through the three (plus!) hour show. She merely floated in to present the final award, for Best Record. \"Art is an unapologetic celebration of … Award Shows\n\nGrammys featured nearly as many tributes as new music Kendrick Lamar, Taylor Swift and Alabama Shakes were the biggest winners at a Grammy Awards ceremony that, due to the recent deaths of some seminal stars, felt as much a tribute to music's past as its present. Monday's ceremony included performances honoring David Bowie, Glenn Frey, B.B. King, … New Music\n\nJustin Bieber and James Corden Sang Carpool Karaoke On Their Way to the Grammys They eventually made it there. Because two rides aren't nearly enough, Justin Bieber and James Corden went on their third carpool karaoke joyride together to the Grammys. CBS aired the segment during their red carpet show, which featured Justin applying lotion and twinning with James. The real magic … James Corden\n\nGrammy winners: A quick-read list of 2016 winners (CNN) — The 58th Annual Grammy Awards were held Monday night. Here is a list of some of the big winners noted with an asterisk *. Best rap album \"2014 Forest Hills Drive\": J. Cole \"Compton\": Dr. Dre \"If You're Reading This It's Too Late\": Drake \"To Pimp A Butterfly\": Kendrick Lamar * \"The Pinkprint\": … Mark Ronson\n\nIt Sounds Like Taylor Swift Responded To Kanye West In Her Grammys Speech “There are going to be people along the way who will try to undercut your success or take credit for your accomplishments or your fame.” Tonight, Taylor Swift said that she became “the first woman to win Album of the Year at the Grammys twice.” And in her acceptance speech, she had a powerful message … Taylor Swift", "images": ["https://web.archive.org/web/20160216180541im_/https://cdn.flipboard.com/flipboard.com/2a73562322cc932354c0dac46168d42ff3139922/original.jpg", "https://web.archive.org/web/20160216180541im_/https://www.facebook.com/tr?id=684329528366609&ev=PixelInitialized"], "top_img": "https://web.archive.org/web/20160216180541im_/https://cdn.flipboard.com/flipboard.com/2a73562322cc932354c0dac46168d42ff3139922/original.jpg", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20160216180541/https://flipboard.com/@thenewsdesk/the-grammy-awards-sb7qbk6pz", "title": "The Grammy Awards on Flipboard", "meta_data": {"viewport": "width=device-width,initial-scale=1", "version": "dfc186a", "fragment": "!", "description": "By Flipboard Newsdesk | The news, looks and best moments from music's biggest night on February 15, 2016.", "referrer": "origin", "fb": {"app_id": 105130332854716}, "og": {"type": "flipboard:magazine", "url": "https://web.archive.org/web/20160216180541/https://flipboard.com/@thenewsdesk/the-grammy-awards-sb7qbk6pz", "title": "The Grammy Awards on Flipboard", "image": "https://web.archive.org/web/20160216180541im_/https://cdn.flipboard.com/flipboard.com/2a73562322cc932354c0dac46168d42ff3139922/original.jpg", "description": "By Flipboard Newsdesk | The news, looks and best moments from music's biggest night on February 15, 2016."}, "twitter": {"card": "summary_large_image", "site": "flipboard", "url": "https://web.archive.org/web/20160216180541im_/https://flipboard.com/@thenewsdesk/the-grammy-awards-sb7qbk6pz", "title": "The Grammy Awards on Flipboard", "description": "By Flipboard Newsdesk | The news, looks and best moments from music's biggest night on February 15, 2016.", "image": {"src": "https://cdn.flipboard.com/flipboard.com/2a73562322cc932354c0dac46168d42ff3139922/original.jpg"}, "app": {"name": {"iphone": "Flipboard", "ipad": "Flipboard", "googleplay": "Flipboard"}, "id": {"iphone": 358801284, "ipad": 358801284, "googleplay": "flipboard.app"}, "url": {"iphone": "flipboard://showSection/sid/sb7qbk6pz/thenewsdesk?title=The%20Grammy%20Awards%20on%20Flipboard", "ipad": "flipboard://showSection/sid/sb7qbk6pz/thenewsdesk?title=The%20Grammy%20Awards%20on%20Flipboard", "googleplay": "flipboard://showSection/sid/sb7qbk6pz/thenewsdesk?title=The%20Grammy%20Awards%20on%20Flipboard"}}}}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}