{"url": "https://tech2.org/canadafr/amber-heard-and-elon-musk-vacationing-in-chile-together-a-week-after-kissing-photos/", "text": "A week after discarding reports that they are not a couple, Amber Heard and Elon Musk were seen having dinner together in Chile on Friday night.\n\nLooky-loos on Instagram noticed that the ex were at the bottom of a photo, which was published yesterday by the official account of El Taringa restaurant in Santiago.\n\nThe photo showed the co-founder and CEO of Tesla and the American actress sitting next to each other, at a table with Elon's brother, famous South African restauranteur Kimbal Musk .\n\nThe legend of the restaurant said: \"What an inspiration to have had Kimbal Musk and his family with us\". in Taringa. Thank you for sharing your ideas about sustainable supply chains _ The kitchen _ and its whole concept is a model to follow. Memorable night! \"\n\nIt seems they inadvertently caught the couple while they were on a vacation Radar!", "images": ["https://tech2.org/canadafr/wp-content/themes/sahifa/favicon.ico", "https://akns-images.eonline.com/eol_images/Entire_Site/20171130/rs_600x600-171230181804-600.amber-heard-elon-musk.ct.123017.jpg?fit=around"], "top_img": "https://tech2.org/canadafr/wp-content/themes/sahifa/favicon.ico", "keywords": [], "authors": [], "canonical_link": "https://tech2.org/canadafr/amber-heard-and-elon-musk-vacationing-in-chile-together-a-week-after-kissing-photos/", "title": "Amber Heard and Elon Musk Vacationing in Chile together, a week after kissing photos – TECH2", "meta_data": {"og": {"title": "Amber Heard and Elon Musk Vacationing in Chile together, a week after kissing photos - TECH2", "type": "article", "description": "[ad_1] A week after discarding reports that they are not a couple, Amber Heard and Elon Musk were se", "url": "https://tech2.org/canadafr/amber-heard-and-elon-musk-vacationing-in-chile-together-a-week-after-kissing-photos/", "site_name": "TECH2"}, "generator": "WordPress 5.2.2", "viewport": "width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://tech2.org", "summary": ""}