{"url": "http://nickalive.blogspot.com/2018/03/kel-mitchell-reveals-that-there-has.html", "text": "If you grew up in the ‘90s, you'll truly understand the power of the orange soda, thanks toand. In fact, if you listen closely, somewhere in the back of your head your can still hear Kel Mitchell saying, “Welcome to Good Burger, home of the Good Burger,” and “Who loves orange soda?”Whether you first saw Kel and now--legend Kenan Thompson on Nickelodeon's, their self-titled spinoff, or Nickelodeon Movies' Good Burger , it’s hard not to love their goofy brand of sketch comedy. And now the great nostalgia wave of the 2010s has yet another surprise for you: plans for asequel have already been put into motion!Kel Mitchell dropped the tentative sequel news himself during a BuzzFeed interview in which he answered fan questions.“The conversations have started,” he said when asked about a sequel. “There's something in the water, everything's coming back. It will definitely be awesome and there was a meeting!”“They're just working everything out contractually, so just keep your ears to the streets,” he added.This was the only information that Kel was willing to spill, but considering the source, it’s probably okay to start getting just a little bit excited. Plus, the information lines up somewhat with last month’s announcement that the cast of, which also starred Lori Beth Denberg and Josh Server, reunited for an upcoming episode of MTV’sIf you can’t wait until until the powers-that-be work out those contracts, you can relive thedays with this 2015 Jimmy Fallon sketch that reunited Kenan and Kel’s characters, Ed the Good Burger Guy ans Lester Oaks, construction worker.After Fallon brought the two beloved actors together again, they both realized there was still something to their ‘90s show and they had to work together again. “From this, working together and talking about it and seeing reaction from the fans and how they were screaming, and seeing that the magic is still there, we’re just like, 'Yeah, we gotta do some more stuff,' so you’ll definitely see some more stuff,” Mitchell said back in 2015. “You'll definitely see something coming up.”Kel also recently revealed that he'd like his fellowco-star Amanda Bynes to guest star on his latest Nickelodeon hit,Check out BuzzFeed 's super interview with Kel Mitchell below!:Everyone's favorite orange soda-drinker — Kel Mitchell — stopped by BuzzFeed to spill some #TBTea on his former Nickelodeon days while answering your fan questions......and BOY, did he SPILL IT, including some dirt on a potential Good Burger sequel:1. Which cast member on All That made you laugh the hardest?Kel: Kenan, of course. We would always try to make each other laugh. One of the times we both just cracked up at a live show and Nickelodeon actually kept it. I think I took a burger and turned it into a shake? I turned back around and Kenan just broke, and then I broke, and we both just started cracking up laughing.2. Who was your favorite All That character that you played?Kel: Coach Kreeton was a lot of fun, just because there was a lot of physical comedy and I knew I got to tear up the place and scream. I love physical comedy and anytime I can get really physical, I love those moments.3. What was your favorite memory on set with Amanda Bynes?Kel: Her talent is amazing! Her physical comedy — like, she was never scared to get physical. They [Nickelodeon] were like, \"She wants to do physical comedy like how you do.\" And I just gave her a lot of pointers — she took it and ran with it. She's a beast, she's fearless. I liked all of Amanda's scenes. She was another one that was really fun to watch.4. Were your characters in Kenan & Kel based on your actual friendship with Keenan IRL?Kel: The friendship, that's where it initially started. They [Nickelodeon] were like, \"This needs to be a show!\" Having fun and having your friend's back, yeah that's definitely like me. As far as the other crazy stuff that he [Kel] would do, not me so much! I love playing that character man, he's just awesome.5. Which of Kel’s catchphrases do people ask you to repeat the most?Kel: It's between \"Welcome to Good Burger!\" and \"Who loves orange soda?\" Anywhere I go, I'm treated like the Burger King. If I order anything at a restaurant and it's not an orange soda, \"You're supposed to be drinking orange sodas!\" Don't be scared to come up and ask me, if you see me in person, and talk about orange soda and burgers. I'm not gonna spill the orange soda in your face, it's all good!6. Did you actually have to drink all that orange soda?Kel: Oh, I drank a lot of orange soda on set! And it wasn't like, just little bottles or cans of orange soda, I mean these were liters that I'd just be chugging. I have a lot of fructose inside of me.7. Are there any plans for a Good Burger sequel?Kel: That's a good one! The conversations have started. There's something in the water, everything's coming back. It will definitely be awesome and there was a meeting! They're just working everything out contractually, so just keep your ears to the streets.8. If you were to give your younger Nickelodeon-self any advice, what would it be?Kel: I would say just have fun man, enjoy it! I was ready to battle. I just had the heart of a lion. I was like, every sketch, \"I'm about to make it the funniest thing you've ever seen!\" I would say just have a little bit more fun with it, but also still keep that intensity because it definitely worked.--Ends--Make sure to catch Kel starring on, airing Sundays on Nickelodeon USA!Watch all your '90s Nickelodeon favorites on NickSplat , your late-night destination for your favorite childhood Nickelodeon cartoons and live-action shows! NickSplat doesn't question football-shaped heads, but embrace them - along with Reptar bars, a Big Ear of Corn, orange soda, and even slime for Pete (and Pete's) sake. Make your slime-covered Nickelodeon childhood dreams come true every night at 11 PM ET/PT, only on TeenNick USA! #NickSplat!", "images": ["https://1.bp.blogspot.com/-ih5oSbbLKDQ/XMIMoQ7dqeI/AAAAAAABGYI/R4rH0gN-k_cUrmYO-Yc9nVE5_ACQhdqsACLcBGAs/s1600/owlcat-ask-fm-icon.png", "https://1.bp.blogspot.com/-2uP4e4RTvpg/XMIKkN8DazI/AAAAAAABGX0/LYsFgwldYDEK8-uvmlo7--qWMdO7ib6lQCLcBGAs/s1600/telegram-icon.png", "https://4.bp.blogspot.com/-hfF5DimXOT8/Wphd6WTIIAI/AAAAAAAA4DI/govIZg9ju3MlDy_wnwl9xenIHMQQ7YJpgCLcBGAs/s320/Kenan-And-Kel-Thompson-Mitchell-Stars-Cast-Characters-Orange-Soda-Nickelodeon-Nick-The-Splat_2.jpg", "https://3.bp.blogspot.com/-7A0qOde5FpY/XCf_2CY4Y8I/AAAAAAABCc0/atqAVljJV5E-6mAuTXXzW8g54VDexAWgACLcBGAs/s1600/reddit-icon.png", "https://3.bp.blogspot.com/-cHzeEz3DQm8/XLJN6wssgWI/AAAAAAABGDc/qL14BKm2fBcKqKLbwU_pfFKXamkrzFBJQCLcBGAs/s1600/discord-icon.png", "https://2.bp.blogspot.com/-yjmY63x2r9A/WQuV82yUQHI/AAAAAAAAvAI/JWd3mL5BQFUYSH4620neWzG4MpWNgUlLQCLcB/s1600/rss-icon.png", "http://c.statcounter.com/5310013/0/a3d81974/0/", "https://4.bp.blogspot.com/-4CXlYZTHURw/XRkgsZwh84I/AAAAAAABIlo/uYNaZ2M9Y14VUeaP9yrlAcG17Ivso9Q0wCLcBGAs/s1600/20-years-of-spongebob-squarepants-logo-nickelodeon-nick-sbsp-nickalive-sidebar-best-year-ever_2.png", "https://4.bp.blogspot.com/-uxCPizPi_G0/XNh0rxXJUVI/AAAAAAABGso/8oSQFAOamK8mzrLiLStHLst681xwHsKvwCLcBGAs/s1600/vkontakte-icon.png", "https://1.bp.blogspot.com/-PMRjA0wqSXs/WQuV8CqwKCI/AAAAAAAAu_4/xd8pZfH5uHc7RI1NxiiI6BppmgQKmDFBgCLcB/s1600/bloglovin-icon.png", "https://4.bp.blogspot.com/-OSchx-Aqlss/WQudcj2-_mI/AAAAAAAAvAo/mw06uRS2VTo-ucpjDPhBBaS6j-Pnf1GgwCLcB/s1600/email-icon.png", "https://3.bp.blogspot.com/-f9yTR_cO3nU/WG1FSZGeP0I/AAAAAAAArtg/VpBbJovtOno1uSMW6H62LQFvRvt_P_GmwCLcB/s1600/Nickelodeon-Splat-Nick-Logo.gif", "https://1.bp.blogspot.com/-fEyWDFgmx4w/WQuV8sTSLmI/AAAAAAAAvAA/tCI9sAQyrv8JUgiJZn4bwwzozLDDZiHtQCLcB/s1600/pinterest-icon.png", "https://4.bp.blogspot.com/-hfF5DimXOT8/Wphd6WTIIAI/AAAAAAAA4DI/govIZg9ju3MlDy_wnwl9xenIHMQQ7YJpgCLcBGAs/w1200-h630-p-k-no-nu/Kenan-And-Kel-Thompson-Mitchell-Stars-Cast-Characters-Orange-Soda-Nickelodeon-Nick-The-Splat_2.jpg", "https://4.bp.blogspot.com/-Z7BPjW5Uuxw/WQuV8nWEL6I/AAAAAAAAu_8/A7wufiMnt_IuZ1YDyg0qxHqjIoWEzWiIgCLcB/s1600/instagram-icon.png", "https://2.bp.blogspot.com/-yWSPmoqtxaQ/WQuV9KCB4_I/AAAAAAAAvAQ/3JT98-I7HOw4aQyhS6B3J685qsPDaG_MQCLcB/s1600/twitter-icon.png", "https://4.bp.blogspot.com/-DsciZIkXezQ/WQuV8DdV0iI/AAAAAAAAu_0/H1jOmtPNGxA5KzCY4xdkIcdFc152wZT9ACLcB/s1600/disqus-icon.png", "https://1.bp.blogspot.com/-mKP-Lymzug8/WVa3zI0N7NI/AAAAAAAAwcw/avIJXVfIe_E4qMMHueg53JQ1KT4YVuguACLcBGAs/s1600/nickwalk_main-nickelodeon-gak-slime-man-nicktoons-ident-bumper.GIF", "https://resources.blogblog.com/img/icon18_edit_allbkg.gif", "http://img1.blogblog.com/img/icon18_email.gif", "https://1.bp.blogspot.com/-ZI6jXB6sn0s/WVa3uIstuLI/AAAAAAAAwcs/xjZdcZqpbAM-WrD6rv5Yl0wRcW1EQOgmwCLcBGAs/s1600/nickelodeon-uk-spongebob-squarepants-dressed-in-a-queens-guards-uniform-nicktoon-salute-hat-saluting-queens-diamond-jubliee-character-cartoon-nick.JPG", "https://3.bp.blogspot.com/-fPXg6mVZV0I/XLJN3erxWTI/AAAAAAABGDY/uHw1y6x7rDEWYtAtpHLOS7jil6n4iFlOACLcBGAs/s1600/flipboard-icon.png", "https://4.bp.blogspot.com/-zkfaL-EYLDE/WQuV8KjF_YI/AAAAAAAAu_w/IZ9lJh6xPuckERyJ9O-N9FlU5Qhaf6F3gCLcB/s1600/facebook-icon.png", "https://3.bp.blogspot.com/-a8Zv8VHTuLI/WQuV9B3pa6I/AAAAAAAAvAM/GunaiBUEB6of0zKG8fGkdR33bjUK3CiuwCLcB/s1600/tumblr-icon.png", "https://resources.blogblog.com/img/icon18_wrench_allbkg.png"], "top_img": "https://4.bp.blogspot.com/-hfF5DimXOT8/Wphd6WTIIAI/AAAAAAAA4DI/govIZg9ju3MlDy_wnwl9xenIHMQQ7YJpgCLcBGAs/w1200-h630-p-k-no-nu/Kenan-And-Kel-Thompson-Mitchell-Stars-Cast-Characters-Orange-Soda-Nickelodeon-Nick-The-Splat_2.jpg", "keywords": [], "authors": [], "canonical_link": "http://nickalive.blogspot.com/2018/03/kel-mitchell-reveals-that-there-has.html", "title": "NickALive!: Kel Mitchell Reveals That There Has Been Talks For A 'Good Burger' Sequel", "meta_data": {"viewport": "width=1100", "generator": "blogger", "description": "Kel Mitchell Reveals That There Has Been Talks For A 'Good Burger' Sequel!", "og": {"url": "http://nickalive.blogspot.com/2018/03/kel-mitchell-reveals-that-there-has.html", "title": "Kel Mitchell Reveals That There Has Been Talks For A 'Good Burger' Sequel", "description": "Kel Mitchell Reveals That There Has Been Talks For A 'Good Burger' Sequel!", "image": "https://4.bp.blogspot.com/-hfF5DimXOT8/Wphd6WTIIAI/AAAAAAAA4DI/govIZg9ju3MlDy_wnwl9xenIHMQQ7YJpgCLcBGAs/w1200-h630-p-k-no-nu/Kenan-And-Kel-Thompson-Mitchell-Stars-Cast-Characters-Orange-Soda-Nickelodeon-Nick-The-Splat_2.jpg"}, "keywords": "Nickelodeon UK, Nick, presentation, promos, bumpers, idents, station ID\"s, adverts, presenters, NickALive, Nicktoons, Nickelodeon News", "twitter": {"card": "summary_large_image", "site": "@DailyNickNews", "creator": "@DailyNickNews", "domain": "http://nickalive.blogspot.com/", "url": "http://nickalive.blogspot.com/2018/03/kel-mitchell-reveals-that-there-has.html", "title": "Kel Mitchell Reveals That There Has Been Talks For A 'Good Burger' Sequel", "description": "Kel Mitchell Reveals That There Has Been Talks For A 'Good Burger' Sequel!", "image": {"src": "https://4.bp.blogspot.com/-hfF5DimXOT8/Wphd6WTIIAI/AAAAAAAA4DI/govIZg9ju3MlDy_wnwl9xenIHMQQ7YJpgCLcBGAs/w1600/Kenan-And-Kel-Thompson-Mitchell-Stars-Cast-Characters-Orange-Soda-Nickelodeon-Nick-The-Splat_2.jpg"}}}, "movies": ["https://www.youtube.com/embed/KHtQKV0fi3s", "https://www.youtube.com/embed/odQQ4jgGpFU"], "publish_date": null, "source": "http://nickalive.blogspot.com", "summary": ""}