{"url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/07/03/why-hannah-gadsbys-netflix-special-nanette-is-so-remarkable/", "text": "\n\nHannah Gadsby in “Nanette.” (Netflix)\n\n“Nanette” won’t be like any other stand-up comedy special you’ve seen.\n\nIn her first Netflix hour, released last month, Australian Hannah Gadsby delivers both sharp setups and punchlines and a searing indictment of comedy itself, arguing that the genre cannot grapple with trauma.\n\nThe first half of “Nanette” falls more within the boundaries of a traditional special, with jokes about penicillin, identity and growing up “a little bit lesbian” in conservative Tasmania. (“I don’t even think lesbian is the right identity for me,” she quips. “I identify as tired.”) But midway through, Gadsby starts methodically dissecting how comedy works to explain why she needs to quit stand-up altogether.\n\n“I built a career out of self-deprecation, and I don’t want to do that anymore,” she says. “Because you do understand what self -deprecation means from somebody who already exists in the margins? It’s not humility. It’s humiliation.”\n\nYou’ll laugh, but you also may cry several times while watching “Nanette.” It’s not a comedy special that offers escapist laughs but, instead, demands that the audience not shy away from considering harsh truths.\n\n[Grappling not only with Louis C.K., but sexism and power in comedy]\n\nWeeks after the show premiered on Netflix, fellow comedians are still buzzing about the hour and how it calls into question the common comedic devices performers have relied upon for so long.\n\n“I’ve been a professional comic for 30 years. I’ve been studying comedy for even longer. I thought I had seen everything … until I watched Nanette,” tweeted comedian Kathy Griffin. “I was blown away. I urge you to watch it ASAP – one hour and it’ll change your life.”\n\n“This is one of the most incredible, powerful, wrenching pieces of comedy and art I have ever seen,” tweeted comedian Aparna Nancherla.\n\n“This one’s gonna linger for a while and will influence a whole generation of comedians,” comedian Jenny Yang tweeted. “If I don’t change how I do comedy after seeing her special, why even?”\n\nRecorded at the Sydney Opera House, “Nanette” won best comedy show at Edinburgh Fringe in 2017 before Gadsby brought it to New York City for several months.\n\nIn the show, Gadsby presents a treatise on the mythology of being an artist — that to be creative you must suffer — and zeros in on the women made to suffer for the sake of protecting men’s’ reputations. She also explains that comedy needs tension for punchlines to work, but she’s tired of tension. As a child, her very existence created tension, so she learned to use humor to deflect.\n\nStill, Gadsby plays with tension in the special, using silences and alternating between calm setups and explosions of fury for maximum emotional impact.\n\nOther recent specials have showcased comics’ masterful use of timing, silence and discomfort. In her sophomore 2018 Netflix special, “Hard Knock Wife,” Ali Wong quietly and unhurriedly lays the groundwork for her jokes before she explodes into cascading punchlines. And Tig Notaro famously told jokes about her just-received cancer diagnosis to an unsuspecting audience in 2013’s “Live,” greeting their applause with, “Hello! I have cancer, how are ya?”\n\n[Comedy’s next big star Michelle Wolf doesn’t want to make a point — she just wants to make you laugh]\n\nBut Gadsby does something else within “Nanette.” She uses comedic elements like joke callbacks while also breaking comedy into its component parts for the audience.\n\n“I feel like in a comedy show there’s no room for the best part of the story, which is the ending,” she says. “In order to finish on a laugh, you have to end with punchlines.”\n\nSo Gadsby goes back and undoes her earlier punchlines. Early in the special, she gets laughs with jokes about a dimwitted, homophobic man at a bus stop and the time she “forgot” to come out to her grandmother. But later, she tells the rest of those real stories, including the devastating parts she had to leave out to get laughs.\n\nShe remains in control, bringing in silly asides even as she unleashes anger, like when she skewers comics who turned Monica Lewinsky into “an easy punchline” instead of mocking “the man who abused his power.”\n\n“It’s not my place to be angry on a comedy stage,” she says. “People feel safer when men do the angry comedy; they’re the kings of the genre. When I do it, I’m just a miserable lesbian ruining all the fun and the banter. When men do it, ‘heroes of free speech!’ ”\n\nBut even after she showcases the power of her anger, she ends by offering a final argument against anger, as well: “It knows no other purpose than to spread blind hatred, and I want no part of it.”\n\n“I don’t want to unite you with laughter or anger,” she says. “I just needed my story felt and understood.”\n\nRead more:\n\nThe new rock stars: Inside today’s golden age of comedy\n\nBreaking news, last-minute Kanye jokes: How to make late-night TV in the Trump era", "images": ["https://www.washingtonpost.com/resizer/hnzgumNGNKlrAZ9wP1Tp3WD5_KQ=/1024x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/6U6325RE7M543NXI75R6MNJ3CU.png", "https://sb.scorecardresearch.com/p?c1=2&c2=3005617&cv=2.0&cj=1", "https://www.washingtonpost.com/resizer/yAFxThroW-CI5t-yu8Q6FsF7kHI=/1x1/www.washingtonpost.com/pb/resources/img/spacer.gif", "https://me.effectivemeasure.net/em_image", "https://www.washingtonpost.com/resizer/TbPyjLyZ8Miz4xbgLOu5s0ZzuQE=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/PK2MYG5FHQYYHFUOB5I7ROFY4M.png"], "top_img": "https://www.washingtonpost.com/resizer/TbPyjLyZ8Miz4xbgLOu5s0ZzuQE=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/PK2MYG5FHQYYHFUOB5I7ROFY4M.png", "keywords": [], "authors": ["Elahe Izadi", "Pop Culture Writer", "July", "Elahe Izadi Is A Pop Culture Writer For The Washington Post. Prior To Joining The Post In As A General Assignment Reporter", "She Covered Congress", "Race", "Local News. She Has Worked For National Journal", "Wamu", "Tbd.Com", "The Gazette Community Newspapers."], "canonical_link": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/07/03/why-hannah-gadsbys-netflix-special-nanette-is-so-remarkable/", "title": "Why Hannah Gadsby’s Netflix special ‘Nanette’ is so remarkable", "meta_data": {"object-hash": 1530643749, "viewport": "width=device-width, initial-scale=1.0, user-scalable=yes, minimum-scale=0.5, maximum-scale=2.0", "referrer": "unsafe-url", "keywords": "hannah gadsby, nanette, nannettee, netflix comedy, standup, comedy specials, kathy griffin, aparna nancherla, australia comedy", "news_keywords": "hannah gadsby, nanette, nannettee, netflix comedy, standup, comedy specials, kathy griffin, aparna nancherla, australia comedy", "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "creator": "@ElaheIzadi"}, "og": {"type": "article", "site_name": "Washington Post", "url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/07/03/why-hannah-gadsbys-netflix-special-nanette-is-so-remarkable/", "image": "https://www.washingtonpost.com/resizer/TbPyjLyZ8Miz4xbgLOu5s0ZzuQE=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/PK2MYG5FHQYYHFUOB5I7ROFY4M.png", "title": "Analysis | Why Hannah Gadsby’s Netflix special ‘Nanette’ is so remarkable", "description": "The Australian comic delivers laughs, as well as a searing indictment on comedy's ability to grapple with pain."}, "article": {"publisher": "https://www.facebook.com/washingtonpost", "content_tier": "metered", "author": "https://www.facebook.com/elahei"}, "fb": {"app_id": 41245586762, "admins": 500835072}, "zeusAds": "true", "description": "The Australian comic delivers laughs, as well as a searing indictment on comedy's ability to grapple with pain.", "robots": "index,follow", "theme": "normal", "author": "https://www.facebook.com/elahei"}, "movies": ["https://www.youtube.com/embed/5aE29fiatQ0?feature=oembed"], "publish_date": 1530590400.0, "source": "https://www.washingtonpost.com", "summary": ""}