{"url": "https://en.wikipedia.org/wiki/Lin-Manuel_Miranda", "text": "American actor and songwriter\n\nLin-Manuel Miranda (; born January 16, 1980)[1] is an American composer, lyricist, actor, playwright and television producer, widely known for creating and starring in the Broadway musicals In the Heights and Hamilton. His awards include a Pulitzer Prize, three Tony Awards, three Grammy Awards, an Emmy Award, a MacArthur Fellowship, and a Kennedy Center Honor in 2018.\n\nMiranda wrote the music and lyrics for the 2008 Broadway musical In the Heights. His work won the Tony Award for Best Original Score,[2] the show's cast album won the Grammy Award for Best Musical Theater Album,[3] and the show won the Tony Award for Best Musical. Miranda was also nominated for the Tony Award for Best Actor in a Musical for his lead role. He gained wider recognition for writing the book, music and lyrics for Hamilton, which has been acclaimed as a pop culture phenomenon since its Broadway premiere in 2015.[4] The show earned the Pulitzer Prize for Drama, the Grammy Award for Best Musical Theater Album, and was nominated for a record-setting 16 Tony Awards, of which it won 11, including Best Musical, Best Original Score and Best Book. For portraying the titular role, Miranda was nominated for another Tony Award for Best Actor in a Musical. The Hamilton cast recording spent ten weeks atop Billboard's Top Rap Albums chart in 2015, while The Hamilton Mixtape, an album of covers of songs from the musical, developed by and featuring Miranda, reached number one on the Billboard 200.\n\nMiranda's television work includes recurring roles on The Electric Company (2009–2010) and Do No Harm (2013). He hosted Saturday Night Live for the first time in 2016 and earned his first Emmy award nomination for acting. Among other film work, Miranda contributed music and vocals for a scene in Star Wars: The Force Awakens (2015); wrote music and songs in the animated musical Moana (2016), which gained him nominations for the Golden Globe Award for Best Original Song and the Academy Award for Best Original Song, for the song \"How Far I'll Go\"; and starred as Jack in the musical fantasy Mary Poppins Returns (2018), for which he was nominated for a Golden Globe Award for Best Actor – Motion Picture Musical or Comedy.\n\nMiranda has been politically active, most notably on behalf of Puerto Rico.[5] He met with politicians in 2016 to speak out in favor of debt relief for Puerto Rico,[5] and raised funds for rescue efforts and disaster relief after Hurricane Maria struck the island in 2017.[6]\n\nEarly life\n\nMiranda was born in New York City[1] and raised in the neighborhood of Inwood, the son of Luz Towns, a clinical psychologist, and Luis A. Miranda, Jr., a Democratic Party consultant who advised New York City mayor Ed Koch.[7][8][9] Miranda has one older sister, Luz, who is the Chief Financial Officer of the MirRam Group.[10] During childhood and his teens, he spent at least one month each year with his grandparents in Vega Alta, Puerto Rico.[11][12] He is of mostly Puerto Rican descent. His mother's ancestors include an interracial couple, Sophie, who was black, and David Towns, who was white; from the early 1800s, this couple spent their married life trying to outrun slavery as laws and governments changed around them. Ensuing branches of the Towns family primarily married Mexican spouses in Texas and Mexico, and Miranda, for his part, has described his ancestry as a quarter Mexican.[9][13][14] The name \"Lin-Manuel\" was inspired by a poem about the Vietnam War, Nana roja para mi hijo Lin Manuel, by the Puerto Rican writer José Manuel Torres Santiago.[15][16]\n\nAs a child, Miranda wrote jingles, including one later used for Eliot Spitzer's 2006 gubernatorial campaign. He attended Hunter College Elementary School and Hunter College High School,[17] where his classmates included journalist Chris Hayes, who was Miranda's first director when the latter starred in a school play described by Hayes as \"a 20-minute musical that featured a maniacal fetal pig in a nightmare that [Miranda] had cut up in biology class\",[18] and rapper Immortal Technique, who bullied Miranda during high school, although the two later became friends.[19][20]\n\nAs a student at Wesleyan University, Miranda co-founded a hip hop comedy troupe called Freestyle Love Supreme. He wrote the earliest draft of In the Heights in 1999, his sophomore year of college. After the show was accepted by Wesleyan's student theater company, Second Stage, Miranda added freestyle rap and salsa numbers, and the show was premiered there in 1999.[12] Miranda wrote and directed several other musicals at Wesleyan, and acted in many other productions, ranging from musicals to Shakespeare. He graduated from Wesleyan in 2002.[12][21]\n\nCareer\n\n2002–10: In the Heights\n\nIn 2002, Miranda and John Buffalo Mailer worked with director Thomas Kail to revise In the Heights.[12][7] Playwright Quiara Alegría Hudes joined the team in 2004.[22] After success off-Broadway, the musical went to Broadway, opening in March 2008.[12] It was nominated for 13 Tony Awards, winning four, including Best Musical and Best Original Score.[2] It also won the Grammy Award for Best Musical Theater Album.[3] Miranda's performance in the leading role of Usnavi earned him a nomination for the Tony Award for Best Actor in a Musical. Miranda left the cast of the Broadway production on February 15, 2009.[23]\n\nMiranda reprised the role when the national tour of In the Heights played in Los Angeles from June 23 to July 25, 2010.[24][25] He again joined the tour in San Juan, Puerto Rico.[26] Miranda rejoined the Broadway cast as Usnavi from December 25, 2010 until the production closed on January 9, 2011, after 29 previews and 1,185 regular performances.[27]\n\nMiranda performs \"The Hamilton Mixtape\" at the White House in 2009\n\nMiranda created other work for the stage during this period. He wrote Spanish language dialogue and worked with Stephen Sondheim to translate into Spanish song lyrics for the 2009 Broadway revival of West Side Story.[28][29] In 2008, he was invited by composer-lyricist Stephen Schwartz to contribute two new songs to a revised version of Schwartz and Nina Faso's 1978 musical Working, which opened in May 2008 at the Asolo Repertory Theatre in Sarasota, Florida.[30]\n\nMiranda also did work for film and television. In 2007, he made a guest appearance on the television series The Sopranos in the episode \"Remember When\",[31] and in 2009, he played Alvie, Gregory House's roommate in a psychiatric hospital, in the two-hour season six premiere episode of House; he returned to the role in May 2010. He also has done work for Sesame Street, playing occasional roles and singing the theme song to the recurring segment Murray Has a Little Lamb.[32] He was a composer and actor on the 2009 revival of The Electric Company[33][34] and appeared in the CollegeHumor sketch \"Hardly Working: Rap Battle\", playing himself working as an intern and rapper.[35]\n\nDuring these years, Miranda also worked as an English teacher at his former high school, wrote for the Manhattan Times as a columnist and restaurant reviewer, and composed music for commercials.[36]\n\n2011–14: Bring It On and television work\n\nBring It On\n\nMiranda co-wrote the music and lyrics for Bring It On: The Musical with Tom Kitt and Amanda Green. Bring It On premiered at the Alliance Theatre in Atlanta, Georgia in January 2011.[37] The musical began a US national tour on October 30, 2011 in Los Angeles, California.[38][39] It then played a limited engagement on Broadway at the St. James Theatre, beginning previews on July 12, and officially opening on August 1, 2012. It closed on December 30, 2012. It was nominated for Tony Awards in the categories of Best Musical and Best Choreography.[40]\n\nOther theatrical work\n\nIn February 2012, Miranda appeared in Merrily We Roll Along, in the role of Charley, in an Encores! staged concert at New York City Center.\n\nHis theatrical achievements in 2014 included an Emmy Award for the song \"Bigger!\", which he and Kitt co-wrote for the opening number at the 67th Tony Awards.[41]\n\nMiranda also wrote music and lyrics for the one-act musical 21 Chump Street, and performed as narrator for the show's single performance at the Brooklyn Academy of Music on June 7, 2014, which was broadcast on National Public Radio's This American Life on June 20, 2014.[42] Later that month, he starred in the June 2014 Encores! revival of Jonathan Larson's Tick, Tick... Boom!, under the artistic direction of Jeanine Tesori. The show was directed by Oliver Butler.[43]\n\nEarlier in 2014, he guest starred in a show by comedy duo The Skivvies.[44]\n\nFilm and television appearances\n\nMiranda appeared in a small role in the Walt Disney Pictures live-action film The Odd Life of Timothy Green (2012).[45][46]\n\nHe also played several television roles during this period. He appeared on the TV series Modern Family in the 2011 episode \"Good Cop Bad Dog\".[47] In 2013, he played the recurring role of Ruben Marcado in the NBC drama Do No Harm.[48] He later appeared in the CBS sitcom How I Met Your Mother, in an all-verse episode titled \"Bedtime Stories\" that aired in November 2013.[49]\n\nHamilton: An American Musical (2015)\n\nHamilton, 2016 Miranda in, 2016\n\nWhile on a vacation in 2008, Miranda read Ron Chernow's biography of Alexander Hamilton and, inspired by the book, wrote a rap about Hamilton that he performed for the White House Evening of Poetry, Music, and the Spoken Word, on May 12, 2009, accompanied by Alex Lacamoire. Miranda later said he spent a year writing the Hamilton song \"My Shot\", revising it countless times for every verse to reflect Alexander Hamilton's intellect.[50][15] By 2012, Miranda was performing an extended set of pieces based on the life of Hamilton, which he then referred to as the Hamilton Mixtape; the New York Times called it \"an obvious game changer\".[51]\n\nHamilton: An American Musical premiered off-Broadway at The Public Theater in January 2015, directed by Thomas Kail. Miranda wrote the book and score, and starred as the title character.[52][53] The show received highly positive reviews,[54] and its engagement was sold out.[55] Chernow and Miranda received the 2015 History Makers Award from the New York Historical Society for their work in creating the musical.[56] The show began previews on Broadway in July 2015 at the Richard Rodgers Theatre and officially opened on August 6, 2015,[57] earning positive reviews.[58] On the first night of Hamilton previews over 700 people lined up for lottery tickets.[59] The Hamilton ticket lottery evolved into Ham4Ham, a series of outdoor mini-performances for lottery participants that was hosted daily by Miranda and cast members for over a year, until August 31, 2016.[60] Miranda earns a 3% royalty on each performance of Hamilton, earning him $12.7 million by July 2017.[61][62]\n\nOn March 15, 2016, members of the cast of Hamilton performed at the White House and hosted workshops; Miranda performed freestyle rap from prompts held up by President Obama.[63]\n\nIn April 2016, Miranda and Jeremy McCarter published Hamilton: The Revolution, a book describing Hamilton's journey from conception to Broadway success and discussing the cultural revolution that permeates the show.[64]\n\nIn May 2016, for his work in the role of Alexander Hamilton, Miranda received the Drama League Distinguished Performance Award.[65] Miranda gave his last performance in Hamilton on July 9, 2016[66] and vowed to return to the show.[67] Miranda reprised the role of Alexander Hamilton's role for a three-week run in Puerto Rico January 11–27, 2019, for which the engagement was sold out in three hours, November 2018.[68] In a review, Chris Jones praised \"deeper on-stage emotions\" on Miranda's reprisal, as well as improved vocal and dance technique than on Broadway.[69]\n\nA documentary about the creation of the show, Hamilton's America, featuring Miranda, premiered at the New York Film Festival on October 1, 2016 and first aired on PBS' Great Performances series on October 21, 2016.[70][71]\n\n2015–present: Disney and post-Hamilton work\n\nDisney projects\n\nMiranda interviewed with Disney in the winter of 2013, and submitted a six-song demo package to Walt Disney Animation Studios.[72] This kicked off a series of collaborations with the studio:\n\nTheatre and television appearances\n\nOn January 24, 2016, Miranda performed the offstage cameo role of Loud Hailer in the Broadway production of Les Misérables,[87] fulfilling his childhood dream of being in the show, as it was the first production he ever saw on Broadway.[88]\n\nOn April 24, 2016, on the TV show Last Week Tonight with John Oliver, at the end of a segment about the debt crisis in Puerto Rico, Miranda performed an emotional rap about allowing the island to restructure its debt.[89]\n\nMiranda hosted Saturday Night Live on October 8, 2016, and in July 2017, he received an Emmy Award nomination for the appearance.[90]\n\nMiranda played himself in two episodes of Curb Your Enthusiasm in 2017.\n\nForthcoming projects\n\nIn August 2016, Miranda agreed to write songs with Alan Menken for Disney's forthcoming live-action remake of The Little Mermaid.[91] Miranda will also co-produce the film with Marc Platt.[91] As of 2018 , no release date has been set, but Menken announced in July 2017 that he and Miranda had begun working on new songs for the project.[72][92]\n\nMiranda agreed in 2016 to serve as executive producer and composer of Lionsgate's film adaptation of The Kingkiller Chronicle by Patrick Rothfuss, as well as a tie-in television series.[93][94]\n\nMiranda will provide eleven new songs for Vivo, a Sony Pictures Animation film directed by Kirk DeMicco[95] set to be released on November 6, 2020.[96]\n\nImagine Entertainment announced in July 2018 that Miranda will make his debut as a film director with an adaptation of Jonathan Larson's semi-autobiographical musical Tick, Tick... Boom!, to be scripted by Dear Evan Hansen librettist Steven Levenson.[97][98] Miranda will also produce the film alongside Ron Howard and Brian Grazer,[98] and will be released on Netflix.[99]\n\nHe will play Lee Scoresby in an upcoming adaptation of His Dark Materials.[100]\n\nPersonal life\n\nFamily\n\nMiranda married Vanessa Adriana Nadal, a high school friend, in 2010.[101] At the wedding reception, Miranda, along with the wedding party, performed the Fiddler on the Roof song \"To Life\";[102] the video has been viewed more than six million times on YouTube.[103] Nadal was a lawyer at the law firm Jones Day.[104] Miranda and Nadal's first son, Sebastian, was born in November 2014.[105] On December 3, 2017, Miranda announced he and Nadal were expecting their second child.[106] Their second son, Francisco, was born in February 2018.[107]\n\nMiranda discovered that he is related to artists Residente and ILE of Calle 13 during a 2009 concert by the group in San Juan, Puerto Rico, where Miranda was invited to perform. Backstage, the mother of Residente and ILE revealed their connection to Gilberto Concepción de Gracia, founder of the Puerto Rican Independence Party.[108][109][110] Miranda and Residente have since confirmed the relationship.[111][112][113][114] In 2017, Miranda performed on the opening track of Residente's self-titled debut album.[115]\n\nActivism\n\nAfter a meeting with President Barack Obama in March 2016,[116] Miranda joined U.S. Senators Kirsten Gillibrand, Chuck Schumer, Elizabeth Warren, and other Democratic lawmakers to call for congressional action to back a Senate bill in Washington that would allow Puerto Rico to declare bankruptcy and significantly ease its $70 billion government-debt burden.[117] Miranda was particularly active in the wake of Hurricane Maria's devastation in Puerto Rico,[5][6] and by December 2017, proceeds from his song \"Almost Like Praying\" had helped the Hispanic Federation to raise $22 million for rescue efforts and disaster relief.[118][119]\n\nHe performed with Ben Platt at the March for Our Lives anti-gun violence rally in Washington, D.C. on March 24, 2018.[120][121]\n\nIn order to raise money for Puerto Rico's reconstruction after being struck by hurricanes Irma and María, including at least $15 million to be channeled through the Flamboyán Foundation, Lin-Manuel decided to take, and once again play the protagonist role of, Hamilton to his father's native Puerto Rico. The Miranda family donated approximately $1 million to bring the University of Puerto Rico theater up to par in order to use it as the venue for the musical's performance in January, 2018. After tickets sold out in two days for the three-week run, producers decided to move out of the university venue due to warnings of potential disruptions by a university workers' labor organization, and move the already-installed set to the Luis A. Ferré Performing Arts Center in Santurce, where the performances will run from January 11 through 27th. The production will donate an additional hundreds of thousands of dollars worth in improvements to the Ferré Center.[122]\n\nAwards and achievements\n\nAmong his numerous accolades, Miranda has won a Pulitzer Prize, three Tony Awards, three Grammys, an Emmy, and two Olivier Awards and has been nominated for an Academy Award. In 2015, he was the recipient of a Genius Grant from the MacArthur Fellows Program. In 2016, Time magazine included Miranda in its annual Time 100 as one of the \"Most Influential People in the World\" and he received a star on the Puerto Rico Walk of Fame.[124][125] It was announced in June 2017 that Miranda would be honored with a star on the Hollywood Walk of Fame in 2018.[126] Miranda received his star on the Hollywood Walk of Fame on November 30, 2018.[127] In December 2018, he received the Kennedy Center Honors for creating Hamilton.[128]\n\nIn 2015, Miranda was the recipient of Smithsonian Magazine's American Ingenuity Award in the History category.[129]\n\nHonorary degrees\n\nMiranda received an honorary degree in 2009 from Yeshiva University in Washington Heights, Manhattan, becoming the youngest person to receive an honorary degree from that university.[130] Ed Koch, former mayor of New York City, presented Miranda with the degree.[131]\n\nHe received the honorary degree of Doctor of Humane Letters in 2015 from his alma mater, Wesleyan University,[132] and gave their commencement address.[133] In May 2016, he received an honorary Doctorate of the Arts from the University of Pennsylvania and gave the commencement speech.[134]\n\nTheater credits\n\nFilmography\n\nFilm\n\nTelevision\n\nBibliography\n\nBooks\n\nHamilton: The Revolution (2016) with Jeremy McCarter\n\n(2016) with Jeremy McCarter Gmorning, Gnight!: Little Pep Talks for Me & You (2018) with Jonny Sun\n\nArticles\n\n\"Stop the Bots From Killing Broadway,\" The New York Times (2016) [140]\n\n(2016) \"Give Puerto Rico Its Chance to Thrive,\" The New York Times (2016)[141]\n\nDiscography\n\nSoundtracks\n\n^ Billboard 200, but peaked at number 25 on the \"The Hamilton Instrumentals\" did not enter the US200, but peaked at number 25 on the Digital Song Sales and number 71 on the Top Album Sales chart.\n\nSingles\n\nAudiobook narration\n\nSee also", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/f/f4/Rose_Garden_Freestyle_feat._Lin-Manuel_Miranda.webm/250px--Rose_Garden_Freestyle_feat._Lin-Manuel_Miranda.webm.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/Flag_of_New_York_City.svg/24px-Flag_of_New_York_City.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/43/Lin_Manuel-Miranda_in_2019_%28cropped%29.jpg/1200px-Lin_Manuel-Miranda_in_2019_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/92/Lin-Manuel_Miranda_in_Hamilton.jpg/220px-Lin-Manuel_Miranda_in_Hamilton.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/28/Flag_of_Puerto_Rico.svg/24px-Flag_of_Puerto_Rico.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/16/MTLogo2.png/24px-MTLogo2.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f0/Lin_Manuel_Miranda_White_House_Poetry_Jam_2009.webm/220px--Lin_Manuel_Miranda_White_House_Poetry_Jam_2009.webm.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/Nuvola_apps_kaboodle.svg/16px-Nuvola_apps_kaboodle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/43/Lin_Manuel-Miranda_in_2019_%28cropped%29.jpg/220px-Lin_Manuel-Miranda_in_2019_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/21px-P_vip.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/43/Lin_Manuel-Miranda_in_2019_%28cropped%29.jpg/1200px-Lin_Manuel-Miranda_in_2019_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Lin-Manuel_Miranda", "title": "Lin-Manuel Miranda", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.13", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/43/Lin_Manuel-Miranda_in_2019_%28cropped%29.jpg/1200px-Lin_Manuel-Miranda_in_2019_%28cropped%29.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}