{"url": "https://www.self.com/story/jenna-dewan-tatum-interview", "text": "When I learned I'd be sitting down with dancer and actress Jenna Dewan Tatum at a Young Living Essential Oils event, I was incredibly excited (and, honestly, pretty nervous). I'd never interviewed a celebrity before, and on top of that, I've been a fan of Dewan Tatum's since she starred alongside now-husband Channing Tatum in the 2006 film Step Up . My appreciation for her has only grown in the years since, as she's openly discussed her sex life , killed it in lip-sync battles , and shared down-to-earth Instagram posts documenting her experiences as a new parent.\n\nWhether you've seen Dewan Tatum dance, watched one of her interviews, or talked with her in person, you know she's many things. Bright. Sweet. Fun. And above all else, confident. She radiates a kind of magnetic self-assurance that draws you in, and before you know it, you're asking her about things like awkward moments in the bedroom, risk-taking, and self-care . But everything she says circles back to one core idea: There's nothing more powerful than knowing who you are and pursuing what makes you feel happiest.\n\nWe begin our conversation by talking about self-love, and Dewan Tatum tells me she feels sexiest when she's in nature—or when she's dancing.\n\nThis statement surprises me, but the way she explains it makes sense: Dancing and being in nature both allow her to feel more comfortable in her skin. \"When that side of myself is activated, I feel more earthy and connected to my body,\" Dewan Tatum says. She adds that dance, in particular, makes her feel like a more sensual person. \"It grounds me into my body and makes me feel confident, sexy, and ready to go,\" she says.\n\nLoading View on Instagram\n\nSo whenever she's feeling down, she books a dance class—or at the very least, throws an impromptu dance party in her home. Finding time for herself amidst a booming career and life as a new parent hasn't been easy, so Dewan Tatum has gotten creative. She and her 4-year-old daughter Everly are known to get up and dance any time a song comes on in a movie they're watching. \"We all have moments where we feel insecure, [but] I think moving your body is essential to a healthy mind,\" she says.\n\nJuggling work, parenthood, and a sex life can get challenging, but Dewan Tatum says she and Channing do their best to make time for each other.\n\nI ask her if she has any creative solutions to maintaining an exciting sex life as a new parent. She laughs and says, \"No, we just do whatever we can to see each other and make it work.\" Dewan Tatum adds that like anything in life—careers, relationships, whatever—there are ebbs and flows. And instead of being hard on herself, she does her best and takes it in stride. \"You just try to make it a priority,\" she says. \"At certain times, you're better at it than other times.\"\n\nLoading View on Instagram\n\nAnd as far as she's concerned, awkward moments in the bedroom (yes, she's experienced them, too) are honestly no big deal. \"I think everyone's had an awkward, embarrassing moment in the bedroom,\" Dewan Tatum says. \"If you haven't, you're not living—it's just a part of life.\" She laughs before zeroing in on her point: \"I think every experience you have—sexually or not sexually—brings you closer to what you want to feel in life.\" For her, an uncomfortable moment in bed is an excuse to reevaluate what she's actually into and then go for it. \"Really, every great experience comes from your own sense of self and your own confidence,\" she continues.\n\nDewan Tatum describes parenting the same way she describes many fulfilling things in life: scary, yet rewarding.\n\nI mention something Dewan Tatum Instagrammed recently—a quote card that said, \"Choose to expand.\" In the post's caption , she wrote, \"Always choosing the more expansive feeling in your life makes room for the magic,\" which she reiterates to me now. Whether she's pursuing a new career opportunity, considering jumping off a cliff (literally), or tackling first-time parenting, she tries to do the expansive, risky, and ultimately fulfilling thing. \"It's hard because you want to choose the thing that makes you feel more comfortable or sheltered or safe,\" she says. \"But there's always the thing right beyond that—the one that's maybe a little scary and intimidating. If you choose that, your whole life and sense of power gets bigger.\"\n\nLoading View on Instagram\n\nI ask her for examples of this in her own life, and she has plenty—like transitioning from dancing to acting in 2006 or, more recently, signing on to host the reality competition show World of Dance . She even cites a recent experience she had on vacation. \"I was in Italy recently, and there was this cliff to jump off. I'm a pretty adventurous, adrenaline-junkie kind of person, but I was even wondering, Should I do this? \" she explains. \"And I realized that I was scared, so I had to do it. It was transformative. You realize you did it, you survived, and you can do it again.\"\n\nDewan Tatum views being a first-time parent pretty similarly: It's nerve-wracking, but surprisingly empowering. \"One day, you have a baby, and everyone's like, 'Go home and figure it out,'\" she says. It's up to you to answer questions, solve problems, and raise this little human being. That's undeniably hard , Dewan Tatum says, but it also forces you to trust yourself. \"It tunes you into your own gut and your own inner wisdom. You have to rely on that more than anything,\" she says. \"You can get a million different opinions, but what matters is what you feel.\"\n\nLoading View on Instagram\n\nBefore I know it, my time with Dewan Tatum is up, and I catch myself smiling as I walk away. In a marked difference from the anxiety I felt before the meeting, I now feel calm and in control. Doing my first-ever celebrity interview was, to borrow Dewan Tatum's words, the \"expansive thing\" for me to do. And now that I've done it, I feel happy, confident, and ready to tackle the next challenge that comes my way.\n\nRelated:\n\nYou might also like: CrossFit Athletes Try Their Hardest to Keep Up with a Professional Ballerina—See How They Did", "images": ["https://media.self.com/photos/5c795af52b76c7596ac68e06/4:3/h_130/SELF-storyboardArtboard%201%20copy%204.jpg", "https://media.self.com/photos/59b84cadfd62025412d7e1ab/4:3/w_728,c_limit/Jenna-Dewan-Tatum-Interview.gif", "https://media.self.com/photos/59b84cadfd62025412d7e1ab/2:1/pass/Jenna-Dewan-Tatum-Interview.gif", "https://collector-PX69t0oUvr.perimeterx.net/api/v1/collector/noScript.gif?appId=PX69t0oUvr", "https://media.self.com/photos/5cd34500ae5715db3ad635da/4:3/h_130/21911_Self_08_036_v1.jpg", "https://www.self.com/images/self-starter-failsafe.jpg", "https://media.self.com/photos/5c34dc7c7905722ccab1bfa2/4:3/h_130/advice-after-12-years-of-marriage.jpg"], "top_img": "https://media.self.com/photos/59b84cadfd62025412d7e1ab/2:1/pass/Jenna-Dewan-Tatum-Interview.gif", "keywords": [], "authors": ["Lindsey Lanquist", "September"], "canonical_link": "https://www.self.com/story/jenna-dewan-tatum-interview", "title": "Jenna Dewan Tatum: If You Haven’t Had an Awkward Moment in Bed, You’re Not Living", "meta_data": {"generator": "autopilot-build-Sat Jul 13 2019 13:01:08 GMT+0000 (UTC)", "msapplication-tap-highlight": "no", "viewport": "user-scalable=no, width=device-width, initial-scale=1, maximum-scale=1", "author": "Lindsey Lanquist", "copyright": "Copyright (c) Cond&#233; Nast 2019", "description": "Actress and dancer Jenna Dewan Tatum talks to SELF about first-time parenting, practicing self-care through fitness, and embracing awkward sex moments.", "keywords": "jenna dewan tatum,news,channing tatum,sex", "news_keywords": "Sex Love,Sex,jenna dewan tatum,news,channing tatum,sex", "og": {"description": "Jenna Dewan Tatum talks to SELF about embarrassing sex moments, practicing self-care through fitness, and more.", "image": "https://media.self.com/photos/59b84cadfd62025412d7e1ab/2:1/pass/Jenna-Dewan-Tatum-Interview.gif", "site_name": "SELF", "title": "Jenna Dewan Tatum Shares How She Keeps Her Sex Life Exciting as a New Parent", "type": "article", "url": "https://www.self.com/story/jenna-dewan-tatum-interview"}, "twitter": {"card": "summary_large_image", "creator": "@SELFmagazine", "description": "Jenna Dewan Tatum talks to SELF about embarrassing sex moments, practicing self-care through fitness, and more.", "domain": "https://www.self.com", "image": {"src": "https://media.self.com/photos/59b84cadfd62025412d7e1ab/2:1/pass/Jenna-Dewan-Tatum-Interview.gif?mbid=social_retweet"}, "site": "SELFmagazine", "title": "Jenna Dewan Tatum Shares How She Keeps Her Sex Life Exciting as a New Parent"}, "fb": {"pages": 8908243810, "admins": "1515690174,835972574,1301604672,505160,43600163"}}, "movies": [], "publish_date": null, "source": "https://www.self.com", "summary": ""}