{"url": "http://www.hallmarkchannel.com/christmas/the-latest-news", "text": "The Latest Christmas News Blog\n\n\n\nTuesday, July 9 2019\n\nHallmark Channel is excited to announce three all-new original Countdown to Christmas movies featuring stars Erin Krakow, Kevin McGarry and Elizabeth Mitchell.\n\nFirst up, Erin Krakow will star in Sense, Sensibility & Snowmen, based on the novel by author Melissa de la Cruz.\n\nThe film, which stars Luke Macfarlane centers on Christmas enthusiast party planners Ella (Krakow) and her sister, Marianne, who clash with their client, Edward (MacFarlane), who is a not-so-jolly toy company CEO.\n\nKevin McGarry will star in “Christmas Scavenger Hunt” alongside Kim Shaw. When Belinda (Kim Shaw) heads back to her hometown for the holidays, things get complicated when she is forced to team up with her ex, Dustin (McGarry), at the town's annual Christmas scavenger hunt.\n\nFinally, Elizabeth Mitchell will star in her first Hallmark Channel movie “The Christmas Club” opposite Cameron Mathison. In the movie, based on the novel by Barbara Hinske, two busy strangers, Olivia Bennett (Mitchell) and Edward Taylor (Mathison), meet when they help an elderly woman find her lost Christmas savings. Thanks to fate and Christmas magic, they also find something they were both missing: true love.\n\nTuesday, July 2 2019\n\n\n\n\n\nHallmark Channel is preparing to celebrate 10 years of Countdown to Christmas and it all starts Friday, October 25th!\n\nGet excited for 24 brand new movies featuring some of your favorite Hallmark stars like: Candace Cameron Bure (“Christmas Town”), Jill Wagner (“Christmas Wishes and Mistletoe Kisses”) Jodie Sweetin and Andrew Walker (“Merry & Bright”) and Lacey Chabert! There will also be some new faces like Kristin Chenoweth and Scott Wolf who will make their Hallmark debut in “A Christmas Love Story” this November.\n\nIn addition Hallmark will launch a merry line of merchandise that any Hallmark Channel fan will adore, coming in October. Check out new Hallmark Channel products here!\n\nStay tuned here for the latest news, information and first looks!\n\nFriday, June 28 2019\n\n\n\n\n\n\n\nChristmas in July is almost here! Tune into Hallmark Channel, Hallmark Movies & Mysteries and stream from Hallmark Movies Now for some of your favorite holiday movies during the month of July. Tune in for Pride, Prejudice & Mistletoe, A Shoe Addict's Christmas, and the beloved classic The Christmas Card.\n\nView the Hallmark Channel Schedule >>\n\nView the Hallmark Movies & Mysteries Schedule here >>\n\nFor 90+ commercial-free holiday movies starting July 1, start your 7-DAY FREE trial to Hallmark Movies Now here>>\n\nWednesday, June 19 2019\n\n\n\n\n\n\n\nHallmark Channel is excited to announce the Countdown to Christmas original movie, “Christmas Duet” which will bring Chaley Rose and Rome Flynn together with Hallmark fan-favorite Teryl Rothery.\n\nIn the movie, well-loved music duo Averie and Jesse, famous for their duet \"Wouldn’t be Christmas,\" haven't played together since they went their separate ways years ago. Averie gave up music and opened a beautiful lodge in a snowy Vermont town - while Jesse still tours, struggling to find the same kind of success they had as a duo. When fate brings them together over the holidays at Averie's lodge just in time for the annual Yuletide Festival, can the magic of Christmas help reunite them once again?\n\nAdding to the drama, Rothery’s character is a writer for a popular travel magazine who has arrived at Averie’s inn to consider it for “Top Winter Lodge,” and earn her a much-needed cash prize.\n\nTuesday, June 11 2019\n\n\n\n\n\nHallmark Channel is excited to announce the Countdown to Christmas original movie, “Two Turtle Doves” which stars Nikki DeLoach and Michael Rady. In the movie, named after a lyric from \"The 12 Days of Christmas,\" Dr. Sharon Hayes (DeLoach) searches for a beloved family heirloom in a small Christmas town. When she unexpectedly discovers an adorable little girl and her disheartened father (Rady), she realizes that Christmas miracles really do happen.\n\nPreviously, DeLoach has starred in the Hallmark Channel original movies, “Christmas Land,” “A Dream of Christmas” and last year's “Reunited at Christmas.” Michael Rady last starred in “Christmas in Homestead,” “A Joyous Christmas” and “Christmas at Pemberley Manor.”\n\n\n\nWednesday, June 5 2019\n\nFind out more about the all-new original movies coming to “Christmas in July” on both Hallmark Channel and Hallmark Movies & Mysteries!\n\nFirst up, “Christmas Camp” will premiere on Hallmark Movies & Mysteries on Sunday, July 7 at 9pm/8c as a part of Gold Crown Christmas Week - Christmas in July.\n\nThe movie stars Lily Anne Harrison and Bobby Campo, and centers around an advertising exec (Harrison) who must bring in a new account in the form of a traditional toy company. To learn more about the holiday and its traditions, she attends a “Christmas Camp,” where she crosses paths with the camp owner’s son (Campo), who teaches her about other stuff, too, like love.\n\nTune in for your favorite holiday movies on Hallmark Channel starting Friday, July 12 and on Hallmark Movies & Mysteries beginning June 28!\n\nMay 30, 2019\n\nAre you excited to celebrate the 10th anniversary of Hallmark Channel's Countdown to Christmas this holiday season? Watch a preview for a look at what is in store for 2019!\n\n\n\n\n\n\n\n\n\n\n\nMay 22, 2019\n\nGet a first look at the Hallmark Channel original movie, \"A Christmas Love Story.\"\n\n\n\n\n\nMay 17, 2019\n\nLacey Chabert will be appearing in her eighth Hallmark holiday movie, “Christmas in Rome” alongside co-star Sam Page.\n\nIn the movie, Chabert plays an independent-minded American tour guide named Angela, who is fired from her job in Rome just before Christmas and crosses paths with an American executive named Oliver (Page), who wants to buy a high-end Italian ceramics company. Oliver hires Angela to be his tour guide around the Eternal City, as the owner of the ceramics company won’t sell it to him until he learns “the heart and soul of Rome.” But is there another heart and soul that he may win?\n\nTune in for “Christmas in Rome” during the Countdown to Christmas 10th Anniversary Celebration on Hallmark Channel!\n\nMay 9, 2019\n\nHallmark Channel is thrilled to announce the Countdown to Christmas Hallmark Channel original movie, “Christmas Town” starring Candace Cameron Bure!\n\nIn the movie, Lauren Gabriel (Bure) leaves everything behind in Boston to embark on a new chapter in her life and career. But an unforeseen detour to the charming town of Grandon Falls has her discover unexpected new chapters – of the heart and of family – helping her to embrace, once again, the magic of Christmas.\n\nTim Rozon stars opposite Candace Cameron Bure and plays Travis, a town local who helps Lauren out with a ride from the train station in to the town of Grandon Falls. Beth Broderick plays Betty, a waitress at the local diner who helps Lauren in the new town.\n\n\n\nMay 2, 2019\n\nHallmark Channel is excited to announce that Jodie Sweetin (Entertaining Christmas) will return to star in an all-new original Countdown to Christmas movie.\n\nSweetin will star in her third holiday film for the network, this one tentatively titled “Merry and Bright” alongside Andrew Walker who plays her romantic interest.\n\nThe story begins when Cate (Sweetin), CEO of the Merry & Bright Candy Cane Company, meets Gabe (Walker) during the busy Christmas season. She assumes Gabe is the suitor her well-meaning mother is trying to set her up with when in reality, he works for Empire Corporate Recovery, which has been hired to take a closer look at Merry & Bright's operation and find ways to make the company more profitable. As Cate and Gabe begin to work together, they find ways to elevate the business and find that they have more in common than savvy business sense.\n\n\n\nApril 19, 2019\n\n\n\nChad Michael Murray (Road to Christmas), Torrey DeVitto (Best Christmas Party Ever), Drew Seeley (A Christmas for the Books), Grant Show and Lolita Davidovich (Once Upon a Christmas Miracle) will join forces this season for the Christmas movie, \"Five Cards for Christmas.\"\n\nThe movie centers around a recently single Jessica (DeVitto) who sends Christmas cards to give people that have impacted her life -- the aunt (Lolita Davidovich) who raised her, her younger brother in the military, a popstar (Drew Seeley) that was part of the soundtrack of her life, the music teacher that inspired her, and the best friend who always tells the truth.\n\nApril 16, 2019\n\nA follow-up to Christmas at Graceland is coming, and this time, wedding bells will be ringing.\n\nHallmark Channel has announced Wedding at Graceland will premiere this June. The cast, including Wes Brown and Kellie Pickler, return to Memphis, Tennessee with filming to take place around the city, including the late Elvis Presley's mansion. In addition, the movie will feature a special appearance by Priscilla Presley, former wife of Elvis as well as a special performance by Lee Brice.\n\nWedding at Graceland finds Laurel (Pickler) accepting Clay's (Brown) marriage proposal only to discover they can get married at the Graceland Chapel in three weeks or wait 18 months for the next opening. In addition when Laurel and Clay's family meet the two families discover they are more different than alike.\n\nWedding at Graceland airs June 1st on Hallmark Channel.\n\nFriday, April 12, 2019\n\nGet excited for an encore presentation of \"Christmas at Pemberley Manor\" on Friday, April 19 at 8pm/7c. Take a look back at a fun Tinsel Trivia video where stars Jessica Lowndes and Michael Rady play holiday charades!\n\n\n\n\n\nThursday, April 4, 2019\n\nCountdown to Christmas is getting an upgrade this year, with 40 brand new movies rolling out on Hallmark Channel and Hallmark Movie and Mysteries. Hallmark Channel will air 24 of these, while Hallmark Movie and Mysteries will have 16 new movies.\n\nThese include, \"A Family Under The Christmas Tree,\" (tentative title) starring Merritt Paterson (Christmas at the Palace) and Jon Cor (Love on Safari). The movie centers around an extreme sports photographer who returns home for the holiday to look after her grandmother and ends up lending a helping hand to a neighbor who needs assistance watching his nephew.\n\n\"A Family Under the Christmas Tree,\" joins previously announced movies: \"A Christmas Love Story\" starring Kristin Chenoweth and Scott Wolf, \"Holiday for Heroes\" starring Melissa Claire Egan and Marc Blucas, and a Blake Shelton Executive Producer film.\n\nDon't want to wait until late 2019 to get in the holiday spirit? Look for a brand new Christmas movie to debut this July during Hallmark Channel's Keepsake Christmas.\n\nFriday, March 22, 2019\n\n\n\nChristmas is coming to Hallmark Drama this season with the addition of two new original programs.\n\n\"Project Christmas Joy\" which will give a town in need an extreme Hallmark holiday transformation. This includes an extravagant Christmas tree lighting to a Main Street Makeover, the series goal is to spread holiday cheer for a town that needs it the most.\n\n\"Christmas Cookie Countdown,\" is a five-episode competition series featuring some of the most talented amateur home bakers around the country in the most exciting yuletide cookie challenges the holiday season has ever seen. The series will be judged by a panel of three well-known pastry chefs and hosted by a rotating panel of beloved Hallmark stars who will be on hand to offer encouragement and support throughout the competition.\n\nGo to HallmarkDrama.com to find out where you can watch Hallmark Drama in your area!\n\nStay tuned for more!\n\n\n\nWednesday, March 20, 2019\n\nDonna Mills has joined the cast of \"Christmas Wishes & Mistletoe Kisses,\" a new Hallmark Channel Original Christmas movie. She joins previously announced stars Jill Wagner (Christmas in Evergreen: Letters to Santa) and Hallmark newcomer Matthew Davis.\n\nMills will play Caroline, mother to Nick (Davis). The movie revolves around Abbey (Wagner), who has decides to follow her heart and explore a new job as an interior designer. She is hired by Nick to decorate his house by Christmas Eve. With the deadline in sight, Abbey must juggle a working relationship with Nick in hopes of launching a new career.\n\nMills is not new to Hallmark Channel, with her last holiday appearance in the fan-favorite “12 Gifts of Christmas.” Look for \"Christmas Wishes and Mistletoe Kisses\" to debut later this year during Countdown to Christmas.\n\nTuesday, March 12, 2019\n\nThis Just In: Hallmark Channel has announced the new original movie, \"Christmas Wishes and Mistletoe Kisses,\" starring Jill Wagner (Christmas in Evergreen: Letters to Santa) and Matthew Davis (The Vampire Diaries), making his Hallmark debut.\n\nThe movie centers around Abbey (Wagner), a single mom who takes a risk in following her true passion of interior designing. She is hired by a local businessman, Nick, (Davis) to decorate his estate by Christmas Eve. With the deadline in sight, Abbey must navigate her working relationship with Nick in hopes that this is just the start to a successful new career.\n\nLook for \"Christmas Wishes and Mistletoe Kisses\" to debut later this year during Countdown to Christmas.\n\nFriday, March 1, 2019\n\n\n\nThe third annual Merry Madness Christmas Bracket is now open! Pick your favorite holiday movies in head to head matchups to earn points. Create up to 10 brackets until March 28th. Join the fun and enter for a chance to win $10,000, $2,500 & $1,000!\n\nFebruary 20, 2019\n\n\n\n\n\n\n\nHallmark Channel is thrilled to announce the all-new original movie, \"Wedding at Graceland,\" the sequel to the Countdown to Christmas movie, \"Christmas at Graceland.\" The movie will be filmed in Memphis and will reunite stars Kellie Pickler and Wes Brown as Laurel and Clay, the former Memphis sweethearts who rekindled their romance during \"Christmas at Graceland.\"\n\nThe wedding is planned to take place in the Graceland Wedding Chapel in the Woods, which opened during Elvis Week last year on the grounds of the Elvis Presley mansion.\n\nThe honeymoon will continue when Pickler returns in a third Elvis-inspired Hallmark Channel movie set for December!\n\nFebruary 12, 2019\n\n\n\nHallmark Channel is excited to announce the all-new original movie, “A Christmas Love Story” starring Kristin Chenoweth and Scott Wolf! The movie will be directed by Eric Close.\n\nIn the movie, Chenoweth is a youth choir director who needs to write a big song for a Christmas Eve show but is distracted when a boy with a golden voice joins her choir, which comes as a surprise to his widowed father (Wolf). \"A Christmas Love Story\" is slated to premiere sometime in November in Hallmark Channel’s Countdown to Christmas lineup.\n\n\n\nFebruary 9, 2019\n\nCrown Media Family Networks announces its first original movie adaptation from Hallmark Publishing’s bestselling novel to-date, The Christmas Company. The new movie will be part of the network’s beloved “Countdown to Christmas” holiday slate.\n\nThe Christmas Company was written by first-time novelist Alys Murray, who is thrilled to join the Hallmark Channel family. The Christmas Company novel can currently be found on Hallmark.com, Amazon.com, Target.com, Walmart.com, BarnesandNoble.com and everywhere else books are sold.\n\n\n\n\n\n\n\n\n\nFebruary 9, 2019\n\nHallmark Channel, the worldwide leader in celebrations, announces the 10th anniversary of America’s favorite, most-watched holiday tradition, “Countdown to Christmas.” Hallmark Channel will honor the 10th anniversary of “Countdown to Christmas” with the biggest holiday season yet, featuring a programming extravaganza of a world record number of original premieres, celebrated talent, holiday specials and more! Currently, the network is in production on its first original holiday movie, “The Christmas Song,” starring Kristin Chenoweth and Scott Wolf, and directed by Eric Close.\n\n\n\nFebruary 9, 2019\n\nFollowing the ratings success of “Time for Me to Come Home for Christmas,” which premiered during “Miracles of Christmas” on Hallmark Movies & Mysteries in December 2018, the network has announced a development deal with country superstar Blake Shelton for an all new Christmas movie for 2019.\n\nShelton will serve as executive producer of the original movie. The all-new film will chronicle the emotional journey home at Christmastime and songs from Shelton’s library of Christmas music will be featured.\n\n\n\nFebruary 6, 2019\n\nBe sure to tune in for the next Friday night holiday movie on February 8th! Take a closer look at \"Pride, Prejudice and Mistletoe\" starring Lacey Chabert and Brendan Penny.\n\n\n\n\n\n\n\n\n\n\n\nJanuary 31, 2019\n\nHallmark Channel is excited to celebrate the 10th anniversary of Countdown to Christmas! Tune in for original holiday movies every Friday night at 8pm/7c.\n\n\n\nJanuary 23, 2019\n\nCandace Cameron Bure shares a special message of gratitude for Countdown to Christmas fans!\n\n\n\n\n\n\n\nJanuary 14, 2019\n\n\n\nThis past holiday season, Hallmark Channel’s premiere of “Christmas at Graceland” was the highest-rated of all 37 originals that aired during Countdown to Christmas and Miracles of Christmas. The film stars American Idol alum Kellie Pickler as Laurel, a high-powered Chicago executive who travels to Memphis to take over the city’s oldest family-owned bank. Along the way, she crosses paths with an ex-boyfriend/musical partner named Clay who rekindles her passion for music that was snuffed out when they were on the cusp of stardom.\n\nWith Winterfest already in full-swing, look for three more weekend premieres during January! The first Winterfest premiere, “Winter Castle,” was the highest-rated and most-watched cable program of the week (excluding news and sports) during its January 5 debut. It tells the story of Jenny, who falls in love with Craig, the best man at her sister’s destination wedding at an ice hotel.\n\nLook out for even more romance this February during Hallmark Channel’s Countdown to Valentine’s Day. The season of love kicks off with “Valentine in the Vineyard,” the third movie featuring Rachael Leigh Cook and Brendan Penny as Frankie and Nate, winemakers who have partnered in love and business. The movie premieres Saturday, February 2 at 8pm/7c. On Saturday, February 9 at 8pm/7c, Maggie Lawson stars in “The Story of Us” as Jamie, a woman who learns that her first love Sawyer (Sam Page) is the architect of a development that wants to change her beloved neighborhood and threatens her bookstore.\n\nJanuary 3, 2019\n\nHallmark Channel will be celebrating the 10th anniversary of Countdown to Christmas in 2019!\n\n\n\n\n\n\n\n\n\n\n\nNovember 7, 2018\n\nHallmark Channel and LEGOLAND® Parks are teaming up this holiday season to bring guests a Christmas experience with more yuletide fun than ever before. The network has signed on as the official presenting sponsor of the annual winter holiday events at LEGOLAND®California Resort, LEGOLAND® Florida Resort and all eleven LEGOLAND® Discovery Centers in the U.S. Guests will enjoy live entertainment, life-size LEGO®holiday decorations and even some snow fall. As part of the new sponsorship, Hallmark Channel will bring photo opportunities and holiday displays, exterior and interior park signage and logo inclusion on all event materials.\n\nAdditionally, Jodie Sweetin, star of two Hallmark Channel original movies from the network’s seasonal programming event sensation, “Countdown to Christmas”, will be the honorary guest at the annual Tree Lighting Ceremony at LEGOLAND® California Resort on November 26th.\n\nLEGOLAND California Resort’s Holidays event officially kicks off on November 17th and LEGOLAND Florida Resort’s Christmas Bricktacular event begins on December 1st, with special activities at each location every Saturday and Sunday. For more information, visit www.LEGOLAND.com.\n\n\n\n\n\n\n\nOctober 30, 2018\n\nLast week Crown Media Family Networks’ Hallmark Channel and Corus Entertainment’s W Network – both leading entertainment destinations in their respective countries – announced an historic multi-platform partnership that brings the United States’ most iconic family-friendly entertainment brand to Canada for the first time ever. The multi-year partnership grants W Network exclusive Canadian licensing rights to all movies and scripted series produced by Crown Media for Hallmark Channel and sister network, Hallmark Movies & Mysteries.\n\nW Network will launch Hallmark Channel on November 1, coinciding with the kick-off of the U.S. cable network’s annual “Countdown to Christmas” programming event. Throughout the season, W Network viewers will have an opportunity to tune in to Hallmark Channel’s beloved holiday movies, including a selection of brand new 2018 titles that will make their Canadian debuts in conjunction with the U.S. world premieres.\n\nVisit www.wnetwork.com for more details!\n\n\n\n\n\nOctober 23, 2018\n\nHallmark Channel and SiriusXM announced today a new 24/7 holiday music channel, Hallmark Channel Radio, which is scheduled to launch on Thursday, November 1 in conjunction with the network’s highly popular “Countdown to Christmas” programming event.\n\nHallmark Channel’s 24/7 “Countdown to Christmas” initiative has become an annual holiday tradition for millions of viewers nationwide, while SiriusXM offers an extensive lineup of holiday music channels across an array of genres. This year Hallmark Channel and SiriusXM are joining forces to bring the warmth and joy of the season to listeners across the country with Hallmark Channel Radio.\n\nSiriusXM’s Hallmark Channel Radio will keep listeners in the holiday mood all day and all night with timeless Christmas carols and music introduced by top network talent including LeAnn Rimes, Holly Robinson Peete, Lacey Chabert, Danica McKellar, Kellie Pickler, and more. Hallmark Channel stars will also open up about their personal yuletide traditions, share their own favorite songs from the season, and take listeners behind the scenes of their new “Countdown to Christmas” movies.\n\nVoiced by one of the network’s most beloved stars, Candace Cameron-Bure, Hallmark Channel Radio will launch on Thursday, November 1 and will be accessible through December 29 via satellite on channel 70, through the SiriusXM app on smartphones and other connected devices, as well as online at siriusxm.com. Hallmark Channel’s 2018 “Countdown to Christmas” begins October 26 and will feature an unprecedented 24/7 slate of 22 all new original holiday movies, as well as fan-favorites from years past.\n\nSiriusXM offers people without a subscription the chance to sample SiriusXM’s content on the SiriusXM app and the streaming web player at SiriusXM.com, seamlessly and without any registration requirements. Go to https://siriusxm.us/HCR to tune in.\n\nSiriusXM subscribers are able to listen to Hallmark Channel Radio (channel 70) on SiriusXM radios, and those with streaming access can listen online, on-the-go with the SiriusXM mobile app and at home on a wide variety of connected devices including smart TVs, Amazon Alexa devices, Apple TV, PlayStation, Roku, Sonos speakers and more. Go to www.SiriusXM.com/streaming to learn more.\n\n\n\nOctober 18, 2018\n\n\n\nJonathan Bennett will co-star opposite Alexa PenaVega in \"Christmas Made to Order.\" Additionally, Adelaide Kane, best known for her work in \"Once Upon a Time\" and \"Reign,\" will co-star in \"A Midnight Kiss\" for Hallmark Channel's Countdown to Christmas event.\n\nIn \"Christmas Made to Order,\" architect and Christmas amateur Steven (Bennett) finds himself hosting his family for Christmas. Desperate for help, he recruits holiday coordinator Gretchen (Alexa PenaVega) to bring holiday joy to his home. Gretchen’s expert Christmas spirit brings Steven’s family together, but neither expects it to bring them closer to each other.\n\nIn the New Year's Eve-themed \"A Midnight Kiss,\" Mia Pearson (Kane) and her family of party planners are given the biggest job in their company’s history with only one week to prepare: a New Year's Eve Party for tech entrepreneur Kate Clark. When her brother breaks his leg and her parents head off on a planned vacation, Mia reluctantly enlists the help of her brother's visiting college buddy, David Campos (Carlos PenaVega), to help her pull off the event which just so happens to fall on her favorite day of the year. What Mia doesn’t plan on is falling in love in the process.", "images": ["https://www.facebook.com/tr?id=473132866159356&ev=PageView&noscript=1", "https://cdn.crownmediadev.com/9f/f5/bf98ddaf4272b473e2c23a1fd2de/christmas-news-candace-lacey-726x410.jpg", "https://cdn.crownmediadev.com/dims4/default/c00ba91/2147483647/thumbnail/726x410%3E/quality/90/?url=https%3A%2F%2Fcdn.crownmediadev.com%2Fa6%2F53%2Ff72409884f8cb2deba4f0b74a007%2F4-4-post.jpg", "https://cdn.crownmediadev.com/dims4/default/fd9f972/2147483647/crop/1212x684%2B241%2B283/resize/726x410%3E/quality/90/?url=https%3A%2F%2Fcdn.crownmediadev.com%2Fea%2Fe5%2F2f504a814a5c9df7b45b4d5e0b66%2Fletterstosanta-00813-cb.jpg", "https://s.amazon-adsystem.com/iui3?d=forester-did&ex-fargs=%3Fid%3Def390f0e-d9cd-252d-9832-21f4dca0dedc%26type%3D55%26m%3D1&ex-fch=416613&ex-src=www.hallmarkchannel.com&ex-hargs=v%3D1.0%3Bc%3D4004675079119%3Bp%3DEF390F0E-D9CD-252D-9832-21F4DCA0DEDC", "https://cdn.crownmediadev.com/dims4/default/28ee3a6/2147483647/thumbnail/726x410%3E/quality/90/?url=https%3A%2F%2Fcdn.crownmediadev.com%2F8a%2F52%2Fa4d7f298417f9ee843c3c0c804fa%2Fkevin-erin.jpg", "https://cdn.crownmediadev.com/dims4/default/1afbc97/2147483647/thumbnail/726x410%3E/quality/90/?url=https%3A%2F%2Fcdn.crownmediadev.com%2Ff5%2F62%2F79fe1e364a9eb7a10df6bd3fe687%2Fcc-00274-cb.jpg", "https://cdn.crownmediadev.com/dims4/default/d77422b/2147483647/thumbnail/726x410%3E/quality/90/?url=https%3A%2F%2Fcdn.crownmediadev.com%2F4b%2F4a%2F1d58b104446791d47cceb95571f0%2Flacey-sam-duo-shot.jpg", "http://hallmarkcrownmediadev.112.2O7.net/b/ss/hallmarkcrownmediadev/1/H.20.3--NS/0", "https://cdn.crownmediadev.com/dims4/default/fa53a9c/2147483647/thumbnail/726x410%3E/quality/90/?url=https%3A%2F%2Fcdn.crownmediadev.com%2F77%2F99%2Fba23e3234247ab5b830a5e7857db%2Fchristmasatgraceland-0933-cb.jpg", "https://cdn.crownmediadev.com/dims4/default/e789442/2147483647/resize/x60%3E/quality/90/?url=https%3A%2F%2Fcdn.crownmediadev.com%2F5d%2Fe1%2F3d5a62294c7f8381bc0c70169c19%2Fcountdowntochristmas-10th-anniversary-logo.png", "https://cdn.crownmediadev.com/dims4/default/38305aa/2147483647/thumbnail/726x410%3E/quality/90/?url=https%3A%2F%2Fcdn.crownmediadev.com%2Fde%2F80%2Fc8eb5f1b450aab4c2d4b7f314598%2Fthechristmassong.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=8272010&c5=&cv=2&cj=1", "https://cdn.crownmediadev.com/dims4/default/f4e23b4/2147483647/crop/2500x1412%2B0%2B0/resize/726x410%3E/quality/90/?url=https%3A%2F%2Fcdn.crownmediadev.com%2F1f%2Ffd%2F3a73267149159cd2b8a69131d2c2%2Fday09-raw-entertainingchristmas-0157-cb-rt.jpg", "https://cdn.crownmediadev.com/dims4/default/c75d4c3/2147483647/thumbnail/726x410%3E/quality/90/?url=https%3A%2F%2Fcdn.crownmediadev.com%2F14%2F5b%2F3ea47a294ed4bc1a74255dd2a735%2Fjodie-andrew.jpg", "https://cdn.crownmediadev.com/dims4/default/b912d1c/2147483647/thumbnail/726x410%3E/quality/90/?url=https%3A%2F%2Fcdn.crownmediadev.com%2F9f%2Ff8%2Fa20df8614a6bb7e8c577cc1df836%2Fdigi18-ctc-landscape-853x570.jpg", "https://cdn.crownmediadev.com/dims4/default/722785f/2147483647/thumbnail/726x410%3E/quality/90/?url=https%3A%2F%2Fcdn.crownmediadev.com%2Fbc%2F06%2F3bb7afed41bc93567379dd623a36%2Ffive-christmas-cards.jpg", "https://cdn.crownmediadev.com/dims4/default/29076d1/2147483647/thumbnail/726x410%3E/quality/90/?url=https%3A%2F%2Fcdn.crownmediadev.com%2Fc3%2Ff4%2F6c22f24a43f8a17ab1030da5dd11%2Fnikki-michael-duo.jpg", "https://cdn.crownmediadev.com/dims4/default/7e3be1c/2147483647/thumbnail/726x410%3E/quality/90/?url=https%3A%2F%2Fcdn.crownmediadev.com%2F5e%2F60%2F072ddca94748a05b2afa9bc73519%2Fdonna-bio-pic.jpg", "https://cdn.crownmediadev.com/dims4/default/c680a8b/2147483647/thumbnail/726x410%3E/quality/90/?url=https%3A%2F%2Fcdn.crownmediadev.com%2F05%2Fea%2Fd4e805724291be690ca151abd1c6%2Fhappy-wnetwork-announcement.jpg", "https://cdn.crownmediadev.com/dims4/default/c15fff6/2147483647/crop/1350x762%2B71%2B327/resize/726x410%3E/quality/90/?url=https%3A%2F%2Fcdn.crownmediadev.com%2F3f%2F72%2F6f2ed5d9485283f94db6c6eb14b4%2Fbottledwithlove-0500-cb.jpg", "https://cdn.crownmediadev.com/dims4/default/a6403c5/2147483647/thumbnail/726x410%3E/quality/90/?url=https%3A%2F%2Fcdn.crownmediadev.com%2F77%2Fea%2Fccee9adf4a29887054023c3a5ced%2Fmm-bracket-logo-648x432-2019.jpg", "https://cdn.crownmediadev.com/dims4/default/13318f5/2147483647/thumbnail/726x410%3E/quality/90/?url=https%3A%2F%2Fcdn.crownmediadev.com%2F6f%2Fac%2F9b058d3e4778bf24988cf23a472f%2Fjonathan-alexa.jpg", "https://cdn.crownmediadev.com/dims4/default/503d495/2147483647/thumbnail/726x410%3E/quality/90/?url=https%3A%2F%2Fcdn.crownmediadev.com%2F42%2F4f%2Fc3b041e2484183e7581449e4bd9b%2Fday14-prideprejudiceandmistletoe-0061-rt.jpg", "https://cdn.crownmediadev.com/dims4/default/bc3ae73/2147483647/crop/2491x1407%2B0%2B87/resize/726x410%3E/quality/90/?url=https%3A%2F%2Fcdn.crownmediadev.com%2Ffb%2F37%2Fbaa5641d48728a6fe5ed1060ac6a%2Fsmalltownchristmas-0274-cb.jpg", "https://cdn.crownmediadev.com/dims4/default/0c1cf61/2147483647/thumbnail/726x410%3E/quality/90/?url=https%3A%2F%2Fcdn.crownmediadev.com%2Fae%2Fd5%2F6004c6d2442c8cb59d375abde647%2Fcandace-cameron-eighth-hallmark-channel-christmas-movie-smaller.jpg", "https://cdn.crownmediadev.com/dims4/default/fd28a0c/2147483647/thumbnail/726x410%3E/quality/90/?url=https%3A%2F%2Fcdn.crownmediadev.com%2F68%2Fef%2F61ad6d394dbcb16a87bdd1ebfbd3%2Fdigi18-siriusxm-sharegraphic-726x410-candace-f2.jpg", "https://cdn.crownmediadev.com/dims4/default/23fbcc9/2147483647/crop/1390x785%2B76%2B0/resize/726x410%3E/quality/90/?url=https%3A%2F%2Fcdn.crownmediadev.com%2F39%2F5e%2F4e1cf5a245ebb1950e0371071727%2Fon-location-number1.jpg", "https://cdn.crownmediadev.com/dims4/default/c107f2f/2147483647/thumbnail/704x704%3E/quality/90/?url=https%3A%2F%2Fcdn.crownmediadev.com%2F5e%2Fae%2F17fc24e8440a989ee88cb2c5297a%2Fthe-christmas-company-400x600.jpg", "https://cdn.crownmediadev.com/dims4/default/7cc2b4c/2147483647/thumbnail/726x410%3E/quality/90/?url=https%3A%2F%2Fcdn.crownmediadev.com%2F19%2F78%2Fee89dd64480db85c2a282f0ab063%2Fcarlos-adelaide.jpg", "https://cdn.crownmediadev.com/dims4/default/ec8b6fb/2147483647/thumbnail/726x410%3E/quality/90/?url=https%3A%2F%2Fcdn.crownmediadev.com%2Fdb%2Ff9%2Fc43bc20b48d0949aa5803dad4299%2Fjune19-726x410.jpg"], "top_img": "https://cdn.crownmediadev.com/9f/f5/bf98ddaf4272b473e2c23a1fd2de/christmas-news-candace-lacey-726x410.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.hallmarkchannel.com/christmas/the-latest-news", "title": "Countdown to Christmas 2019 - The Latest News", "meta_data": {"og": {"title": "Countdown to Christmas 2019 - The Latest News | Hallmark Channel", "description": "Get the latest updates and news on Countdown to Christmas movies, only on Hallmark Channel!", "url": "https://www.hallmarkchannel.com/christmas/the-latest-news", "fb_appid": 2086772908252464, "site_name": "Hallmark Channel", "image": "https://cdn.crownmediadev.com/9f/f5/bf98ddaf4272b473e2c23a1fd2de/christmas-news-candace-lacey-726x410.jpg"}, "description": "Get the latest updates and news on Countdown to Christmas movies, only on Hallmark Channel!", "keywords": "countdown to christmas,hallmark countdown to christmas,hallmark christmas,christmas,hallmark channel christmas", "viewport": "width=320, user-scalable=yes, initial-scale=1", "twitter": {"card": "summary", "title": "Countdown to Christmas 2019 - The Latest News | Hallmark Channel", "description": "Get the latest updates and news on Countdown to Christmas movies, only on Hallmark Channel!", "image": "https://cdn.crownmediadev.com/9f/f5/bf98ddaf4272b473e2c23a1fd2de/christmas-news-candace-lacey-726x410.jpg"}}, "movies": [], "publish_date": null, "source": "http://www.hallmarkchannel.com", "summary": ""}