{"url": "https://www.vogue.com/article/georgina-chapman-life-after-harvey-weinstein", "text": "On the day in late February when I arrive at Georgina Chapman’s town house in the West Village to interview her, it’s unseasonably hot, nearly 80 degrees. I am ushered to the parlor floor, where, even though it feels like August outside, a fire is roaring away. As I wait, it suddenly dawns on me that I am sitting in Harvey Weinstein’s living room. He purchased the six-story house in 2006, the year before he married Chapman, and she has since put her stamp all over it: black floors and white rugs, chinoiserie, lots of gilt and glass, hydrangeas in a vase, a Jo Malone candle burning. On a console table are silver-framed photographs from happier times, mostly of the couple’s children: India and Dashiell, seven and five. All evidence of the original occupant would appear to have been scrubbed away—except for a large piece of art hanging in the hallway. At the bottom, it is signed, “For Harvey Weinstein.” The drawing is dominated by a large empty circle, next to which it reads, “The moon was here.”\n\nI had been introduced to Chapman, dressed in a floor-length dark print dress, a couple of weeks earlier at the West Twenty-sixth Street atelier of the fashion company, Marchesa, that she co-owns with Keren Craig. That day, she struck me as hyperalert: flitting around, wide-eyed and nervous, uncomfortable in her skin—or lack thereof, as it were. She mentioned, almost in passing, that she hadn’t been out in public in five months—not since the news broke in October of so many unbearably similar accusations by so many women of harassment, abuse, and rape perpetrated by her husband. When she appears today, dressed in jeans, a white T-shirt, ballerina flats, and an armful of gold bracelets, she is more relaxed, though there’s a gallows humor—a morbidity—firmly in place. When I mention the disturbingly warm weather, she laughs and says, “Think of all the poor plants that are going to spring out and then die.”\n\nWe head downstairs to the ground floor, where most of the living takes place: a big, casual, open space with lots of color, modern furniture, and surprising art. There’s a huge, elegant kitchen that looks out onto a backyard, and a TV room where Dash, on spring break, is sitting on a sectional, ensorcelled by some kind of electronic device. At 42, Chapman looks younger. Or is it that she seems younger? In photographs, she has often reminded me of Victoria Beckham—chiseled and somewhat brittle-looking. But, today, dressed so California-casual, her hair now long and blonde, with wide-set blue eyes and fine features, she looks more like a younger Michelle Pfeiffer. Though she is English to her core, using whilst and learnt in a thick, posh accent, she is more goofy than I had imagined. As we sit down to lunch—a simple spread of veal Milanese and eggplant parmigiana—she seems a bit flustered, unable to maintain a hostess facade for too long, or even to decide where I should sit.\n\nOur meeting, in her soon-to-be ex–town house that her soon-to-be ex-husband recently sold, was meant to be the moment when Chapman would finally, publicly address for the first time what happened. The night before, she had called me fairly late, and I thought she was going to back out. She sounded worried, apologizing profusely, talking fast. She was not ready to address anything too difficult, did not feel prepared. I reassured her that we could talk about her life before Harvey or about Marchesa—which is exactly what we did at first.\n\nNot long after the news broke, common wisdom had it that no actress would ever wear a Marchesa dress again, and no bride would ever walk down the aisle in a gown designed by Chapman. In January, she canceled the runway show for Marchesa’s fall 2018 collection, which fueled rumors that the brand was in trouble. But Chapman says she herself made the decision not to offer any clothes for awards season. “We didn’t feel it was appropriate given the situation,” she says. “All the women who have been hurt deserve dignity and respect, so I want to give it the time it deserves. It’s a time for mourning, really.” But she also has loyal supporters. “A lot of people reached out and said, ‘Let me wear something,’ ” and Scarlett Johansson picked a Marchesa gown to wear to May’s Met ball.\n\nFashion now is such a social business—so many parties, so much self-presentation. Turns out, Chapman has felt insecure and awkward at social functions for much of her life. She does not enjoy being the focus of attention, which is one of the reasons she has a tendency to redirect focus onto others. As the actor David Oyelowo, her friend of 25 years, tells me, “It’s something she’s had to cultivate: the ability to try to fade into the background. That’s why, when she’s at a party, she spends a lot of time and energy making other people feel comfortable, listened to, important.”\n\nAs our lunch is winding down, I ask, almost in passing, if Chapman really hadn’t been out in five months; she seems to shrink before my eyes as her mouth goes dry. “I was so humiliated and so broken . . . that . . . I, I, I . . . didn’t think it was respectful to go out,” she says. “I thought, Who am I to be parading around with all of this going on? It’s still so very, very raw. I was walking up the stairs the other day and I stopped; it was like all the air had been punched out of my lungs.”\n\nI ask if she’s been seeing a therapist. “I have,” she says. “At first I couldn’t, because I was too shocked. And I somehow felt that I didn’t deserve it. And then I realized: This has happened. I have to own it. I have to move forward.” She takes a long, deep breath. “There was a part of me that was terribly naive—clearly, so naive. I have moments of rage, I have moments of confusion, I have moments of disbelief! And I have moments when I just cry for my children. What are their lives going to be?” She has been crying through most of this, and now she breaks down into sobs loud enough that her assistant appears with a box of tissues. “What are people going to say to them?” She is crying so hard she has to take a moment. “It’s like, they love their dad. They love him.” It is almost unbearable to witness, this broken person in front of me. “I just can’t bear it for them!”\n\nChapman grabs a tissue and wipes her tears away—“I wasn’t prepared to say any of that!”—and lets out a deep, guttural laugh.\n\nThings are less fraught when, two weeks later, I meet her at her office at Marchesa and she is surrounded by her team, easily smiling and engaging the world—or at least her world. One of the few working ateliers left in Manhattan, Marchesa is a surprisingly big operation, with about 80 employees, and sewing machines whirring away. Chapman is wearing black leather pants—leggings, really—with zippers at the backs of the ankles, an untucked white tuxedo shirt, and a pair of bedroom slippers studded with fake pearls. Her hair is pulled off her face with a band, and she’s absentmindedly eating from the bag of popcorn that’s sitting on her desk next to an achingly beautiful arrangement of pale-pink and white roses.\n\nKeren Craig is in her office, along with a couple of other women on the design team, as they look at fabrics and swatches and mood boards in search of inspiration for the resort collection they are just beginning to work on. Craig is dressed much like Chapman was the day I first met her: long black floral-print dress to the floor, but with creeper boots, also studded with fake pearls. When I ask if they bedazzled their footwear together, they shout “No!” in unison and crack up laughing. “They came bedazzled,” says Craig. Chapman rolls her eyes. “We don’t have time to bedazzle our shoes, unfortunately.”\n\nThe two women met when they were seventeen, during what the British call a foundation course at the Chelsea College of Art and Design. After stints at different art colleges, in the early 2000s they were both living in London. Chapman was getting work doing music videos and, in one particularly odd job, making costumes for a female wrestler. “Crazy getups!” she says.\n\nIn 2004 Chapman and Craig rented a studio together and came up with the name Marchesa because Craig was enthralled with the book Infinite Variety, about the eccentric fin de siècle glamour-puss Marchesa Luisa Casati. Their initial idea was to create a loungewear company. Just weeks into this new venture, the two women were invited to a Louis Vuitton party in the English countryside, and, as Craig puts it, “We were like, Now that we’ve got this fashion label, we really ought to make ourselves something to wear.” They wound up seated at a table with Isabella Blow, who was so taken with Chapman’s dress that she borrowed it to wear to the Paris couture. Once Blow took them under her wing, they started to make real connections and then caught a series of lucky breaks: a sponsorship from Swarov-ski; advice from Jimmy Choo cofounder Tamara Mellon to focus on red-carpet dressing; meetings with powerful publicists and stylists like Nanci Ryder and Rachel Zoe.\n\nBy now, Chapman was dating Weinstein as she went back and forth between London, Los Angeles, and New York, and it did not hurt that he came to every Marchesa show, usually with a celebrity in tow. Marchesa managed to get a dress on Renée Zellweger for the premiere of Bridget Jones: The Edge of Reason in London. “The next morning,” says Craig, “she was on the cover of every single British newspaper with a picture of our dress.” One day they got a call from Neiman Marcus with an offer they couldn’t refuse: to put Marchesa in multiple stores and help with production to create a diffusion line, which became Marchesa Notte. “In order to make that happen, I had to move to New York,” says Chapman. “I only meant to come for a few weeks, and then never left.”\n\nWhen you ask about her fashion inspirations, Chapman cites John Galliano and Alexander McQueen—two of the most theatrical, outré designers imaginable—but there is nothing even remotely edgy about what she does. She is unapologetically romantic, clinging to a decidedly unfeminist ideal that there is no happier moment in a woman’s life than when she finally finds that perfect dress. As one fashion insider puts it, “Georgina puts pretty girls in pretty dresses—and there’s value in that.” And Chapman has no illusions of being avant-garde. She describes Marchesa dresses as “keepsakes,” to be worn “lots of times” and then hopefully handed down to a daughter. “We’re not doing disposable fashion,” she says. “We treat each dress like a piece of jewelry, an entity unto itself, with its own journey. It’s not just one in a queue.”\n\nThat being said, they do have bestsellers and perennial favorites. I ask Chapman about price-point sweet spots. “It really depends,” she says. “One of the gowns we did last season was nearly $13,000, and we couldn’t stop selling it. And then there’s an evening gown we make a version of every year that sells for around $4,995.” Chapman runs down the hall, grabs one, and dangles it in front of me. “It’s quite sexy. You’ve got a corset, it’s off the shoulder, you get some drama around the neck with these feathers, it nips you at the waist, gives you a bosom, and you get a bit of leg! When you get it out, you know you’re going to feel good in that dress.”\n\nThe formula has worked for them. As recently as 2016, actresses wore Marchesa more often than any other designer on the red carpet. As Christy Rilling, who fitted Michelle Obama into nearly every dress she wore as First Lady, says, “Their atelier is really special. And they’ve gotten better over the years. I’ve seen what they do for the Oscars—they really make magic happen.”\n\nOne of the criticisms that has been leveled at Marchesa is that they’d have been nothing without Harvey Weinstein, who, people have claimed, bullied stars into wearing his wife’s dresses. “They absolutely had a push from Harvey,” says Chapman’s friend the writer Neil Gaiman. “But you cannot hype something from nothing and make it last. And Harvey’s hyping worked because George is actually an artist. I’ve watched her at work and been impressed and fascinated. She has a vision, and she’s really good at it.”\n\nOne morning in early April, Chapman texts me a photograph of a young girl in a very grown-up dress: It’s gray, with a wide skirt made of tulle and a silk corset, all of it covered with pink flowers. “Just found this picture of a dress I made when I was eleven! Things haven’t changed that much!!!”\n\nChapman was born and raised in Richmond, an affluent suburb on the Thames about eight miles from central London. Her father, Brian Chapman, was the founder of Percol, the first ground-coffee company on the shelves to bear the Fairtrade mark. Her mother, Caroline Wonfor, was a journalist who worked for Reader’s Digest for many years. She has a younger brother, Edward, who is the CEO of Marchesa, and even though their parents divorced when she was in her 20s, they are a very close-knit group. “My father is self-made,” says Chapman. “He came from a council estate, left school at sixteen, and he built his own company with an incredible work ethic. He’s a true entrepreneur, and he’s always been deeply involved with philanthropy, a forward-thinker that way.”\n\nShe admits she had a very awkward childhood. She was born with a hip defect, “which meant that I had terrible pigeon toes, so I couldn’t walk to the top of the street without falling over. I was incredibly clumsy, and it set me back at school socially. I was always that kid who was the last to be picked for any sport because I literally couldn’t do it.” She was also severely dyslexic, which went undiagnosed until she was eight. “I remember going to the library and everyone else could read and I couldn’t. I had terrible anxiety. In class when they would go around and everyone had to read . . . it was just torture.”\n\nSome unholy combination of going to the Victoria and Albert Museum costume department at seven, seeing Princess Diana’s wedding on TV that same year, and being deeply envious of her Catholic cousins “going through all of their ceremonies in these beautiful white dresses” planted the seeds for her future. When Chapman was at boarding school—Saint David’s in Ashford, Surrey—she took up drawing and painting. Her roommate there was Andrea Remanda, now a songwriter living in Los Angeles. “Her side of the room looked like a bomb exploded,” Remanda says. “She had a Guns N’ Roses poster, and I was into Prince. When we were in prep—forced homework time after school—she would draw sketches of what we did during the day, and they were amazing. I still have them.”\n\nRemanda spent a lot of time at Chapman’s parents’ house on weekends. “When we were sixteen we went clubbing one night, and she had bought a secondhand man’s blazer from Oxfam for 25 pence. She got out her sewing machine—I don’t even know how she found it in her crazy messy bedroom—and she did a few stitches and put it on, and I just couldn’t believe it! It’s my favorite outfit she’s ever worn. Everyone was like, Where did you get your dress? It looked like a Vivienne Westwood.”\n\nChapman was scouted by an agent when she was seventeen and modeled for a few years, but as she puts it, “It was very much to make ends meet. I had three jobs: I worked in a bar, I was working in a ski shop on Saturdays—a job I took because I could drink coffee and smoke cigarettes—and I was also waitressing. And I was a terrible waitress. I was so forgetful, I was clumsy, just the worst waitress ever.” Remanda tells me that Chapman did not love modeling. “Being scrutinized as you are in that industry—‘Too short for the catwalk!’ ‘You’ve got to lose weight!’—I don’t think she really wanted to be a part of all that.”\n\nShe was interested in acting, though, and when Chapman was eighteen, she took a train to Hull in northern England to check out the drama-studies department at a college there. The train broke down for three hours, and while she waited she got talking to another young, aspiring actor who was heading the same way for the same reason. It turned out to be Oyelowo, who would go on to play Martin Luther King Jr. in Selma. “Well, anyone who has seen Georgina, the first thing that hits you like a ton of bricks is how beautiful she is, and I’d be lying if I said I didn’t notice that,” he recalls. “But as we talked, I found her to be an interesting and deeply friendly person. She had none of that frostiness that could be associated with a model.”\n\nNeither one of them wound up going to the drama school in Hull, but they’ve stayed friends. “I was part of a youth theater group at the National Theatre in London,” Oyelowo recalls, “and I invited George along to be part of it. She’s a wonderful actress. I remember clearly thinking that she had a very real career ahead of her had she wanted it.” A couple of years later, Chapman invited Oyelowo to an art exhibition at her college. “A lot of the drawings were of fashion, and her work really stood out,” he says. “I was blown away.” So much so that Oyelowo asked Chapman to make the costumes for The Love of the Nightingale, a play he was performing at the Edinburgh Festival. “And these costumes arrived, made from transparent material into which she’d sewn pieces of mirror to reflect the light. They were extraordinary. They upstaged everything else.”\n\nOne Friday afternoon in late March, I head back to Chapman’s town house for another interview over lunch, this one served by her daughter, India, playing waitress. Chapman’s mother, an elegant woman with silver hair in a shag cut, is visiting from London: She comes often these days and spends long stretches, helping out with India and Dash. “She’s such a happy-go-lucky person,” says Chapman, “so she always lifts the mood and the spirits.”\n\nWhen the one-two punch of all of the allegations against Weinstein landed in early October—first the New York Times investigation, followed by the much more damning piece in The New Yorker a few days later—Chapman was in a kind of stupor. “I lost ten pounds in five days. I couldn’t keep food down.” I ask her how long it took for her to absorb the information. “About two days,” she says. “My head was spinning. And it was difficult because the first article was about a time long before I’d ever met him, so there was a minute where I couldn’t make an informed decision. And then the stories expanded and I realized that this wasn’t an isolated incident. And I knew that I needed to step away and take the kids out of here.”\n\nShe fled to Los Angeles with the children, while her partner, Craig, did her best to steady the ship. “Our friendship always comes first, so foremost, I was worried for Georgina,” Craig says. “Secondly, we have so many talented, loyal people who work for us, some who’ve been here for twelve, thirteen years, so my concern was to get to the office and get the collections out, so that people could be paid and pay their rents.”\n\nChapman eventually went to London to be with her parents, but first she took refuge with an old friend. “I kind of found myself in a first-responder capacity,” says Oyelowo. “My wife and I were right there with her two kids, and this catastrophe was unfolding in real time across the globe, literally your worst nightmare in terms of a marriage, in terms of the future of your kids and your business. And none of this was your own doing and yet you are entirely lumped into it. The thing that was the most difficult to witness was that she quite rightly took the stance of not going out there and defending herself, because there was just too much white noise and too much bile headed in her general direction. She felt, How dare I raise my head and say, ‘Oh, by the way, I’m suffering too?’ ”\n\nBecause of the scale of Weinstein’s abuse and manipulations—and the lengths he allegedly went to to cover them up—there is a widely held assumption of complicity on Chapman’s part. “She must have known” is what so many people say at dinner parties. “The thing that pains me,” says her friend the model and singer Karen Elson, “is that when anyone finds out that I know George, that’s the first thing they say. Like she is somehow responsible for his hideous behavior. When I say, ‘Well, actually she didn’t know,’ it becomes this other judgment: ‘How could she not have known?’ Or: ‘Well, that’s on her if she didn’t.’ It’s so complicated.”\n\nIt’s complicated, but it is also the oldest story in the book. Even Chapman points out that—putting aside the enormity of her situation—women are betrayed by their husbands every day because they turn out to be not the men their wives thought they were. “I don’t want to be viewed as a victim,” she says, “because I don’t think I am. I am a woman in a shit situation, but it’s not unique.”\n\nChapman first met Weinstein socially, at a party, and they began dating on and off. “I was living in England, and I had just come out of a relationship, so it was very slow.” Was it a good marriage? “That’s what makes this so incredibly painful: I had what I thought was a very happy marriage. I loved my life.” Asked if she was ever suspicious about his behavior, she says, “Absolutely not. Never.” For one thing, he traveled constantly. “And I’ve never been one of those people who obsesses about where someone is.”\n\nIt’s very difficult now for people to imagine that there was ever anything good about Harvey Weinstein. But the fact remains that before all of the horrifying revelations, most people thought Weinstein could be an asshole and a bully, but they didn’t think he was a monster. There is always that beauty-and-the-beast mystery: What does she see in him? When I ask Chapman what the initial attraction was, she says, “Well, he’s a wonderful father to my kids. But initially? He’s charismatic. He’s an incredibly bright, very learned man. And very charitable. He paid for a friend of mine’s mother, who had breast cancer, to go to a top doctor. He was amazing like that. He is amazing like that. That is the tough part of this . . . this black-and-white thing . . . life isn’t like that.” When I tell her that a friend of the couple’s told me that Weinstein gave Chapman confidence, she says, “Yes. Absolutely. He was a wonderful partner to me. He was a friend and a confidant and a supporter. Yes, he’s a big personality. . . . And . . . but . . . I don’t know. I wish I had the answers. But I don’t.”\n\nWhen I ask the people who have known Chapman the longest what they thought of her marriage, the common thread is how surprised they were by it—but for very different reasons. “I first met him at a polo match,” says Remanda, “and I had no idea who he was. I know George very well, and she’d had, like, two boyfriends before Harvey. So my initial reaction was, Whoa. He’s older, he’s brash, he’s American. Who is he? We sat down and I think we laughed, belly-laughed, falling off our chairs, for two hours. I thought, She’s going to marry this guy.”\n\nOyelowo also vividly remembers the day he met Harvey. “I was in my car on Mulholland Drive, and I got a call from George. She said, ‘Come to Shutters on the Beach; I want you to meet my new boyfriend.’ George was there, and the very famous producer Harvey Weinstein was there, and I was still waiting for the boyfriend to emerge until it sort of became evident: Oh, this is who she meant! And I will be 100 percent honest with you: I was very skeptical. But as time went on, as they got married, had children, there was no way of denying that this was a genuine couple.’”\n\nLast summer Chapman got to know Huma Abedin, a few months before the news of the allegations about Weinstein broke, during play dates between their sons. Now they are supertight. “We just . . . bonded,” Abedin says and lets out a dark laugh. “In allll kinds of ways. This particular club, ironically, it’s not such a small one: women who have had to endure it in such a public way, women like Georgina and me. People don’t feel sorry for us; you don’t get that empathy. People think you’re beautiful, you’re thin, you’re rich, you’re photographed on the red carpet, and you get stuck in this category. There’s so much more depth beyond all that with Georgina.”\n\nOver the summer, Abedin came to see that depth. “You look at her from the outside, if you don’t know her, and you think, She’s perfect,” says Abedin. “She could be a model for the clothes she designs. But when you go to the house, she opens the door without any makeup on, and she’s stunning, and she’s funny and goofy with her children—who are clearly the most important people in her life. She’s at the stove making chicken fingers and French fries, and she’s one of the realest people I know. There’s nothing entitled about her. You believe she is someone who works really hard at being a good and present mom, and doing her job really well.”\n\nA friend of Chapman’s told me that, because of the divorce, money, the kids, Georgina is in regular contact with Harvey. I ask her, “Is there anything you can say about his state of mind?” “Well,” she replies with a roll of the eyes, “not really. Clearly when I was married to him I didn’t know anything about his state of mind, so I’m probably not the best person to ask.”\n\nChapman’s close circle is rallying around her and hoping she will have a fresh start. “What I want for Georgina,” says Elson, “and it’s going to take time, and it’s impossible to come out unscathed, but let this be a moment in her life where she realizes that this is what made her. This is what made her a woman.” When I ask Chapman if there’s anything she can say about her finances, now much changed, and her future, she replies, “I’m just living moment to moment. Is it difficult? Of course. But one adjusts. Is it going to be for the worse? Maybe not.”\n\nOn the day I visited her office, I noticed that Chapman kept checking her phone, like she was waiting for news. Turns out, she was: She had put a bid on a house in upstate New York—a farm—and was hoping to find out if the bid was accepted. “Fingers crossed,” she said. With the sale of all the family homes—in the Hamptons, Connecticut, and the West Village—Chapman is trying to get herself and the children situated. “As soon as this happened, I had this crazy vision: I know what I need to do. I need to move to a farm upstate. My daughter loves riding; my son responds to animals. I need to build a farm.”\n\nIndeed, when the kids came in after school. Dash was carrying an enormous stuffed giraffe, and India was galloping in like a horse. “She’s obsessed,” says Chapman. “And when she’s not with a horse she’s pretending to be a horse. I’ve had to look at my life, and maybe I’m going to create something better for my children out of this.” The farm, she says, is “rambling, it’s magical, it’s private, down a long driveway. And it’s connected to horse trails, so you can just ride off of the property. I promised the kids donkeys and goats.”\n\nChapman finds out that I live in Woodstock, New York, and brings up Neil Gaiman, who also has a house there. They met when she hired him to write the screenplay for a ten-minute short she directed in 2013; Gaiman had collaborated with Weinstein on Hayao Miyazaki’s Princess Mononoke. “Neil still possesses that magical quality of having a child’s imagination,” she says. “When you see the way that he works and the way that he thinks, it just reminds me of how one thought when one was younger—that sense of endless possibility, just pure . . . untrapped creativity.” The word untrapped hung in the air.\n\nUnlike other friends of Chapman’s, Gaiman did actually worry about her being married to Weinstein. “One reason is that I watched the person he tried to be when he was around her—which was sort of, at least to some degree, uxorious—which was not the person that he tried to be the rest of the time. But I never felt that there was anything going on other than that Georgina was actually in love with him. There’s that point where Harvey stops being a person and becomes a cultural phenomenon, though it is worth reminding people that there are human beings here. And that one of those human beings could be affable and charming if he wished to be and also bullying and deceitful. And he was obviously very good at this.” He pauses for a long while and says, finally, “She’s a good person who married a bad person. Or, if you want to be less judgmental, she’s a good person who married a person who did some terrible things. And who now has to make a go of it on her own. And I know she can. And I’m sure she will.”\n\nIn this story:\n\nSittings Editor: Tabitha Simmons.\n\nHair: Benoit Moeyaert; Makeup: Gucci Westman.\n\nSet Design: Mary Howard.", "images": ["https://collector-PX0lizzs6W.perimeterx.net/api/v1/collector/noScript.gif?appId=PX0lizzs6W", "https://www.vogue.com/wp-content/themes/vogue/images/logo_vogue.svg", "https://assets.vogue.com/photos/5af35b2173084b3aba5248e3/16:9/pass/gc-vogue-june-2018.jpg"], "top_img": "https://assets.vogue.com/photos/5af35b2173084b3aba5248e3/16:9/pass/gc-vogue-june-2018.jpg", "keywords": [], "authors": ["Jonathan Van Meter", "Annie Leibovitz"], "canonical_link": "https://www.vogue.com/article/georgina-chapman-life-after-harvey-weinstein", "title": "Georgina Chapman on Life After Harvey Weinstein", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=no, width=device-width, initial-scale=1, maximum-scale=1", "copyright": "Copyright (c) Condé Nast 2019", "og": {"site_name": "Vogue", "url": "https://www.vogue.com/article/georgina-chapman-life-after-harvey-weinstein", "title": "Georgina Chapman on Life After Harvey Weinstein", "description": "When numerous women spoke out about Harvey Weinstein, his wife remained silent—until now. Georgina Chapman opens up about her marriage, her divorce & her future.", "image": "https://assets.vogue.com/photos/5af35b2173084b3aba5248e3/16:9/pass/gc-vogue-june-2018.jpg", "type": "article"}, "twitter": {"site": "@voguemagazine", "card": "summary_large_image", "domain": "www.vogue.com", "title": "Georgina Chapman on Life After Harvey Weinstein - Vogue", "image": {"src": "https://assets.vogue.com/photos/5af35b2173084b3aba5248e3/16:9/pass/gc-vogue-june-2018.jpg"}, "creator": "@voguemagazine", "description": "When numerous women spoke out about Harvey Weinstein, his wife remained silent—until now. Georgina Chapman opens up about her marriage, her divorce & her future."}, "apple-itunes-app": "app-id=1087973225, app-argument=https://www.vogue.com/article/georgina-chapman-life-after-harvey-weinstein, affiliate-data=ct=smart-banner&pt=45076", "description": "When numerous women spoke out about Harvey Weinstein, his wife remained silent—until now. Georgina Chapman opens up about her marriage, her divorce & her future.", "keywords": "Magazine,Culture,mobileAppReadyTrue", "news_keywords": "Magazine,Culture,mobileAppReadyTrue", "articleSection": "Magazine", "article": {"publisher": "http://www.facebook.com/vogue"}}, "movies": [], "publish_date": 1525950000.0, "source": "https://www.vogue.com", "summary": ""}