{"url": "https://www.teenvogue.com/story/selena-gomez-things-you-didnt-know", "text": "No wonder she’d later cite Britney as a key source of inspiration for her Stars Dance world tour and 2013 MTV Movie Awards performance. In an interview, she gushed over Britney’s “impeccable,” snake-laden performance of “I’m a Slave 4 U” at the 2001 VMAs and expressed admiration for the way Brit handled her transition from Disney kid to grown-up pop star.\n\n\"I think she's one of the best that made that transition,\" she said. \"I definitely wanted to do that with my transition, but I don't think there's a path you have to follow. I think you just have to figure it out and hope for the best, so if it has a similarity, that's only a compliment.\"\n\n8. She’s the Queen of Instagram, but she has a “love/hate relationship” with social media\n\nWith 139 million followers, Selena is still the most-followed person on Instagram – a streak she’s maintained since 2016. She ran her own accounts for a long time and loved having an “authentic” connection with her fans.\n\nHowever, while in treatment in 2016, she surrendered her phone and took a three-month hiatus from the social media app. She eventually returned, but posted more sparingly and restricted access by putting the password in her assistant’s possession. Seeing negative comments can also take a toll.\n\n\"I delete the app from my phone at least once a week,\" she admitted , adding that \"You fixate on the [negative] ones. They’re not like, ‘You’re ugly.’ It’s like they want to cut to your soul. Imagine all the insecurities that you already feel about yourself and having someone write a paragraph pointing out every little thing—even if it’s just physical.\"\n\nDespite her turbulent history with the platform, Selena seems to have made peace with Instagram. Recently, she convinced 13 Reasons Why’s Katherine Langford to make her Instagram public. “Selena pointed out that the show is targeting young adults like me and that [social media] is a good medium to talk directly with those who relate to my character, Hannah,\" Katherine explained.\n\n9. She has plenty of philanthropic causes she supports.\n\nAppointed to the role at age 17, Selena became the youngest UNICEF ambassador…ever. In her first official field mission, Gomez spent a week in Ghana, bringing awareness to children and families in need. Through her participation in numerous campaigns, events, and initiatives, Selena helped raise hundreds of thousands of dollars for the organization.\n\nOver the past couple of years, Selena has also hosted WE Day, a yearly event with the mission to unite like-minded youth who want to change the world for the better. This past year, she opened up about her kidney transplant and brought out Nellie Mainor, a young survivor of a rare kidney disease, onstage.\n\n\"This little girl with the big heart believes in the power of spreading joy and light to all,\" Selena said, holding back tears.\n\n10. She’s been pretty quiet about it, but she’s working diligently on her next album.\n\nIn May 2018, Selena admitted there’s “no date” and “no idea” for her third solo effort. But that hasn't kept her from releasing new music over the past couple of years, including bops such as \"Wolves\" and \"Back To You.\"\n\n“But I have a lot of music that I've collectively put away,\" she continued. \"I have so many exciting things coming. It just feels like it's my time and it's at my pace. I'm not trying to throw a bunch of music in people's faces until I'm ready.\" Take your time, girl. Just know that we’ve stayed ready.\n\n11. Her kidney transplant has been a long journey.\n\nLast summer, Selena underwent a life-saving kidney transplant to help treat her lupus. Close friend and fellow actor Francia Raísa was the donor, with Selena sharing a photo on Instagram of the two holding hands while in hospital gowns.\n\nSelena’s condition was dire before the procedure, her lupus having progressed to a point where she was suffering from arthritis and organ failure. But there were complications afterward, too.", "images": ["https://assets.teenvogue.com/photos/5d07b94a9025a77847c9a6f6/1:1/w_350%2Ch_350%2Cc_limit/lede-REAL.jpg", "https://assets.teenvogue.com/photos/5d13f86c4b98130009ffd2ca/1:1/w_350%2Ch_350%2Cc_limit/Acne%2520Awards_Beauty%2520Blogger_Story.jpg", "https://www.teenvogue.com/verso/static/teen-vogue/assets/logo-header.a32c5f649a1140996fd12f4a5ee1d0638ce23dc6.svg", "https://assets.teenvogue.com/photos/5d0e81487997273b855d765c/1:1/w_350%2Ch_350%2Cc_limit/GettyImages-1068957460.jpg", "https://www.teenvogue.com/verso/static/teen-vogue/assets/logo-reverse.c9fd2ea81f6f84a7d604882e3d5f7ab119aeee5a.svg", "https://assets.teenvogue.com/photos/5b54952f2337b62062e1df0f/16:9/w_1280,c_limit/FB.jpg", "https://assets.teenvogue.com/photos/5d13df1cfe2b69000a9f98e3/1:1/w_350%2Ch_350%2Cc_limit/mist_Story.jpg", "https://assets.teenvogue.com/photos/5d05343029cbad14799097dc/1:1/w_350%2Ch_350%2Cc_limit/promo-image-selena-gomez-style.jpg", "https://assets.teenvogue.com/photos/5b54952ae4fe7304e7107d9f/16:9/w_1280%2Cc_limit/lede.jpg", "https://assets.teenvogue.com/photos/5d03e42ccbf906a6517c4b12/1:1/w_350%2Ch_350%2Cc_limit/Celeb%2520Fash%2520Roundup_6.14_Story.jpg"], "top_img": "https://assets.teenvogue.com/photos/5b54952f2337b62062e1df0f/16:9/w_1280,c_limit/FB.jpg", "keywords": [], "authors": ["Condé Nast", "Kara Nesvig", "Tatum Dooley", "Em Ford", "Tina Ferraro", "Bianca Nieves", "Hanna Lusti", "De Elizabeth"], "canonical_link": "https://www.teenvogue.com/story/selena-gomez-things-you-didnt-know", "title": "11 Selena Gomez Facts You Might Not Have Known", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Condé Nast", "copyright": "Copyright (c) Condé Nast 2019", "description": "In celebration of Selena Gomez's birthday on July 22, here are 11 things about the triple threat you might not have known.", "keywords": "selena gomez", "robots": "index, follow", "og": {"description": "This is how we're celebrating Selena's birthday.", "image": "https://assets.teenvogue.com/photos/5b54952f2337b62062e1df0f/16:9/w_1280,c_limit/FB.jpg", "site_name": "Teen Vogue", "title": "11 Things About Selena Gomez You Might Not Have Known", "type": "article", "url": "https://www.teenvogue.com/story/selena-gomez-things-you-didnt-know"}, "twitter": {"card": "summary_large_image", "description": "This is how we're celebrating Selena's birthday.", "domain": "https://www.teenvogue.com", "image": {"src": "https://assets.teenvogue.com/photos/5b54952f2337b62062e1df0f/16:9/w_1280,c_limit/FB.jpg?mbid=social_retweet"}, "site": "@TeenVogue", "title": "11 Things About Selena Gomez You Might Not Have Known"}, "fb": {"app_id": 1013284322017473, "pages": 6636341311, "admins": 108943}}, "movies": [], "publish_date": null, "source": "https://www.teenvogue.com", "summary": ""}