{"url": "https://www.wmagazine.com/story/daria-reboot", "text": "Today on Sick, Sad World: \"Hollywood has run out of new ideas.\" That's one way of saying that Daria , the beloved MTV cartoon that ran from 1997 to 2002, is being rebooted.\n\nMTV network president Chris McCarthy confirmed the news, revealing that iconoclast Doria Morgendorffer will be reappearing in a new spinoff show dubbed Daria & Jodie , which co-stars one of the few other reasonable and intelligent people at Lawndale High School, Jodie Landon. At least one thing that will be different from the original is the fact that Grace Edwards, who's served as a story editor on Unbreakable Kimmy Schmidt and a writers assistant for Broad City and Inside Amy Schumer , will be leading the production.\n\n\"The story [Grace Edwards] wants to tell of Daria is different, it's about Daria and Jodie and two close friends taking on the world today and what's happening in our culture at large,\" McCarthy told The Hollywood Reporter , adding that \"Edwards is a huge fan of Daria... What made Daria pop for us is because we love the franchise and Grace Edwards has a point of view and angle she wants to tell.\" McCarthy also addressed Daria's skeptical disciples, many of whom are no doubt rolling their eyes at this very moment.\n\n\"It's less about the monetization and more about telling great stories,\" he said. \"Of course, we're going to make money but it's about taking this IP and bring it into the future and doing these shows on platforms where audiences make the most sense.\" Interestingly, that most likely will not be on the show's original home network, MTV.\n\nInstead, McCarthy says the new Daria could land on a streaming service — like Queer Eye or Arrested Development: Fateful Consequences . \"The best place for it isn't necessarily cable but more with an SVOD partner where we can have better storytelling and allow more flexibility and be able to go deeper than traditional cable may allow,\" he said.\n\nOne thing that will remain the same is that Daria & Jodie will still be told through Morgendorrfer's perspective, as well as Landon's \"while deconstructing popular culture, social classes, gender and race,\" as The Hollywood Reporter notes.\n\nWhile the idea of anyone touching the perfect show is cause for shuddering, this Daria fan can't help but think that there is a mine of modern-day material that Daria would have the perfect quips for. Not to mention, since the show aired, it's become harder and harder to separate real-life from an episode of Sick, Sad World .\n\nRelated: Daria Turns 20: A Fall 2017 Style Update For Your Favorite Misanthropic Cartoon", "images": ["https://www.wmagazine.com/images/w_logo.svg", "https://media.wmagazine.com/photos/58b9ff1275b3e14ae8673e9b/4:3/w_1536/daria%2520copy.png", "https://vulcan.condenastdigital.com/wmag-services/photos/591a0f0e2006e2187de4708f/1:1/w_128,c_limit/Scarlett%20Johanson.jpg", "https://media.wmagazine.com/photos/58b9ff1275b3e14ae8673e9b/2:1/w_790,c_limit/daria%20copy.png", "https://vulcan.condenastdigital.com/wmag-services/photos/592f0706802c577242df3ef1/1:1/w_128,c_limit/Michelle_Obama_Face.png", "https://vulcan.condenastdigital.com/wmag-services/photos/592f1855cc1eac746f6e7549/1:1/w_128,c_limit/Kristen%20Stewert.jpg"], "top_img": "https://media.wmagazine.com/photos/58b9ff1275b3e14ae8673e9b/2:1/w_790,c_limit/daria%20copy.png", "keywords": [], "authors": ["Marissa G. Muller"], "canonical_link": "https://www.wmagazine.com/story/daria-reboot", "title": "Daria Is Being Rebooted With a Few Big Twists", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=no, width=device-width, initial-scale=1, maximum-scale=1", "msapplication-TileColor": "#ffffff", "msapplication-TileImage": "/images/favicon/ms-icon-144x144.png", "theme-color": "#ffffff", "author": "Marissa G. Muller", "copyright": "Copyright (c) Condé Nast 2019", "description": "La la la la la. Daria, the beloved MTV show that ran from 1997 to 2002, is being rebooted, this time as Daria & Jodie, featuring Jodie Landon.", "publishDate": "2018-06-21T17:54:49Z", "keywords": "daria,mtv,reboots,remakes,tv,cartoons", "fb": {"app_id": 230068530489385, "admins": 108943, "pages": 40621875003}, "og": {"site_name": "W Magazine", "title": "Daria Is Being Rebooted With a Few Big Twists", "url": "https://www.wmagazine.com/story/daria-reboot", "description": "Nevermind that we basically all live in \"Sick, Sad World\" now.", "type": "article", "image": "https://media.wmagazine.com/photos/58b9ff1275b3e14ae8673e9b/2:1/w_790,c_limit/daria%20copy.png"}, "twitter": {"card": "summary_large_image", "site": "wmag", "title": "Daria Is Being Rebooted With a Few Big Twists", "description": "Nevermind that we basically all live in \"Sick, Sad World\" now.", "image": "https://media.wmagazine.com/photos/58b9ff1275b3e14ae8673e9b/2:1/w_790,c_limit/daria%20copy.png?mbid=social_retweet", "domain": "wmagazine.com"}, "version": "2.0.0"}, "movies": [], "publish_date": 1529603689.0, "source": "https://www.wmagazine.com", "summary": ""}