{"url": "https://www.harpersbazaar.com/celebrity/latest/a23457080/meghan-markle-prince-harry-first-public-appearance-one-year-anniversary/", "text": "The Duchess of Sussex stepped out for her first solo engagement as a royal today, and she also marked a very important anniversary.\n\nA year ago today, Meghan Markle and Prince Harry made their first public appearance together at a Wheelchair Tennis match at the Invictus Games in Toronto, Markle's former home base. Prior to that, the only confirmation we had of their romance was a statement from Kensington Palace in November 2016.\n\n\n\nThe first official photos of the now-Duke and Duchess of Sussex out together were filled with adorable PDA, cheeky smiles, and genuine warmth. Harry and Meghan looked besotted with one another—and they still do.\n\nChris Jackson Getty Images\n\nFor Meghan, in particular, the past year has been filled with dramatic changes. Back in September 2017, Meghan was still an actress on Suits and a resident of Toronto, where the show filmed. She still had an Instagram account, which she used regularly, and her lifestyle blog, The Tig. She was also a Twitter user, and regularly posted photos of her friends, vacations, and work life on social media.\n\nBut on November 21, 2017, Meghan's \"normal\" life changed forever when it was reported that the future-Duchess had officially moved to London. At the same time, it was reported that she'd finished all of her filming commitments on Suits, and was moving to England permanently.\n\nDays later, on November 27, 2017, Meghan and Harry announced their engagement. The news was revealed on Kensington Palace's social media accounts, along with a photo from the couple's first public appearance together at the Invictus Games just two months earlier:\n\nThe Prince of Wales has announced the engagement of Prince Harry and Ms. Meghan Markle. pic.twitter.com/rtlAnFCWTf — Kensington Palace (@KensingtonRoyal) November 27, 2017\n\nLater that same day, Meghan and Harry spoke to the BBC about their plans to marry, and it was already clear the actress' life had changed dramatically—and that really loves Prince Harry.\n\nThe very next day, on November 28, 2017, the USA Network revealed that Meghan would officially be leaving Suits at the end of Season 7.\n\nBreaking with royal tradition, Meghan spent Christmas with the royals, proving that she was already considered a part of the family. The Queen reportedly waived her rule regarding only spouses attending the festive celebrations, allowing Meghan to attend as Harry's fiancée.\n\nShortly after Christmas, in early January 2018, Meghan deleted her online presence—including lifestyle website The Tig, her Instagram, and her Twitter account. As she was about to officially join the royal family, she appeared to be making more of her personal life private, in keeping with her soon-to-be husband's own practices.\n\nExcitement about the royal wedding consumed the first few months of 2018, with Meghan and Harry tying the knot at Windsor Castle on May 19. In a custom Givenchy gown, Meghan officially became the Duchess of Sussex. The former actress incorporated many American touches into the royal wedding, signaling that she has not forgotten her heritage.\n\nWPA Pool Getty Images\n\nAlmost a month after the royal wedding, Meghan made her very first solo outing with Queen Elizabeth II, Prince Harry's grandmother. The duo appeared to get along very well, and their outing, without any other members of the royal family, showed the immense amount of faith the royals already had in Meghan.\n\nMax Mumby/Indigo Getty Images\n\nA slew of royal events later, Meghan is attending her first solo event as a royal, exactly one year after she first stepped out publicly with Prince Harry. With her and Harry's first royal tour due to start next month—during which they'll travel to Australia, New Zealand, Fiji, and Tonga—it's clear that the Duchess of Sussex's life will continue to evolve rapidly.\n\nBut her first year in the royal spotlight proves Meghan will handle every new change with aplomb.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-prince-harry-meghan-markle-wellchild-awards-gettyimages-1026695284.jpg?crop=1.00xw:0.276xh;0,0.0351xh&resize=300:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-meghan-markle-first-apperance-index-1537900455.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-938168298-1524077058.jpg?crop=1.00xw:0.654xh;0,0.136xh&resize=300:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-meghan-markle-first-apperance-index-1537900455.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "keywords": [], "authors": ["Amy Mackelden"], "canonical_link": "https://www.harpersbazaar.com/celebrity/latest/a23457080/meghan-markle-prince-harry-first-public-appearance-one-year-anniversary/", "title": "How Meghan Markle Has Changed Since Her First Appearance with Prince Harry 1 Year Ago", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#606060", "og": {"type": "article", "site_name": "Harper's BAZAAR", "title": "Meghan Markle's First Appearance with Prince Harry Was a Year Ago", "description": "Today, she held her first solo event as a royal. So much has changed in one year.", "url": "https://www.harpersbazaar.com/celebrity/latest/a23457080/meghan-markle-prince-harry-first-public-appearance-one-year-anniversary/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-meghan-markle-first-apperance-index-1537900455.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 227018747326504, "pages": 8327967561}, "article": {"publisher": "https://www.facebook.com/HarpersBazaar", "modified_time": "2018-09-25 07:01:06", "published_time": "2018-09-25 07:01:00", "section": "Celebrity News"}, "twitter": {"site": "@harpersbazaarus", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-meghan-markle-first-apperance-index-1537900455.jpg?crop=1.00xw:1.00xh;0,0&resize=640:*"}, "google-site-verification": "bNUXKPTEqUVDbaxHrYA-c1kj007Ao4VsMKdoU80EyiU", "title": "How Meghan Markle Has Changed Since Her First Appearance with Prince Harry 1 Year Ago", "description": "The past 12 months have been a total whirlwind, especially when you take into consideration the fact that Meghan Markle and Prince Harry﻿ made their first public appearance together only one year ago today. Prior to that, their romance had been rumored, but nothing had been made official.", "keywords": "meghan markle, meghan markle photos, oceania, royal academy, royal academy of the arts, meghan harry, meghan markle prince harry, givenchy, meghan markle first appearance prince harry", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-meghan-markle-first-apperance-index-1537900455.jpg?crop=0.502xw:1.00xh;0.498xw,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebrity,celebrity,latest,Meghan Markle", "sailthru.date": "2018-09-25T19:01:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-meghan-markle-first-apperance-index-1537900455.jpg?crop=1.00xw:1.00xh;0,0", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-meghan-markle-first-apperance-index-1537900455.jpg?crop=0.502xw:1.00xh;0.498xw,0", "sailthru.socialtitle": "Meghan Markle's First Appearance with Prince Harry Was a Year Ago", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1537873260.0, "source": "https://www.harpersbazaar.com", "summary": ""}