{"url": "https://en.wikipedia.org/wiki/The_Crown_(TV_series)", "text": "The Crown is a historical drama web television series about the reign of Queen Elizabeth II. Created and principally written by Peter Morgan and produced by Left Bank Pictures and Sony Pictures Television for Netflix, The Crown evolved out of Morgan's 2006 film The Queen and 2013 stage play The Audience. The first season covers the period from Queen Elizabeth's marriage to Philip, Duke of Edinburgh, in 1947 to the disintegration of her sister Princess Margaret's engagement to Group Captain Peter Townsend in 1955. The second season covers the period from the Suez Crisis in 1956 through the retirement of the Queen's third prime minister, Harold Macmillan, in 1963 to the birth of Prince Edward in 1964. The third season will continue from 1964, covering Harold Wilson's two periods as prime minister until 1976, while the fourth will include Margaret Thatcher's premiership and introduce Lady Diana Spencer.\n\nThe series is intended to last 60 episodes over six seasons, with 10 one-hour episodes per season, covering Elizabeth's life from her younger years to her reign, and with new actors being cast every two seasons. Claire Foy portrays the Queen in the first two seasons, alongside Matt Smith as Prince Philip, and Vanessa Kirby as Princess Margaret. For the third and fourth seasons, Olivia Colman will take over as the Queen, Tobias Menzies as Prince Philip, and Helena Bonham Carter as Princess Margaret. Filming for the series takes place at Elstree Studios in Borehamwood, Hertfordshire, with location shooting throughout the United Kingdom and internationally.\n\nThe first season was released on Netflix on November 4, 2016, with the second released on December 8, 2017. The series has been renewed for a third and fourth season, with the third intended to be released in the second half of 2019.[5] The Crown has been praised for its acting, direction, writing, cinematography, production values, and the relatively accurate historical account of Queen Elizabeth's reign. It has received several accolades, including winning Best Actress and Best Actor at the 23rd Screen Actors Guild Awards for Foy and Lithgow, respectively, in addition to receiving a total of 26 nominations for its first two seasons at the Primetime Emmy Awards, including twice for Outstanding Drama Series.[6]\n\nPremise [ edit ]\n\nThe Crown traces the life of Queen Elizabeth II from her wedding in 1947 through to the present day.[7] The first season, in which Claire Foy portrays the Queen in the early part of her reign, depicts events up to 1955, with Winston Churchill resigning as Prime Minister and the Queen's sister Princess Margaret deciding not to marry Peter Townsend.[8] The second season covers the Suez Crisis in 1956, the retirement of the Queen's third Prime Minister, Harold Macmillan, in 1963 following the Profumo affair political scandal, and the birth of Prince Edward in 1964.[9][10][11]\n\nBeginning with season three, Olivia Colman will portray the Queen.[12] Season three will cover Harold Wilson's time as Prime Minister,[13] the Aberfan disaster,[14] the Apollo 11 moon landing,[15] the 1969 Investiture of Prince Charles,[16] the decolonisation of Africa and the Caribbean,[17] and Princess Margaret's eight-year affair with baronet and gardening expert Roddy Llewellyn that leads to the Princess's divorce from Antony Armstrong-Jones in 1978.[9][18] The third season also introduces Camilla Shand and Lady Diana Spencer, who will be more prominent in the fourth season, set during Margaret Thatcher's premiership.[13]\n\nCast [ edit ]\n\nMain [ edit ]\n\nFeatured [ edit ]\n\nThe below actors are credited in the opening titles of single episodes in which they play a significant role.\n\nRecurring [ edit ]\n\nSeason 1 [ edit ]\n\nSeason 2 [ edit ]\n\nEpisodes [ edit ]\n\nSeason 1 (2016) [ edit ]\n\nNo.\n\noverall No. in\n\nseason Title Directed by Written by Original release date 1 1 \"Wolferton Splash\" Stephen Daldry Peter Morgan November 4, 2016 ( ) 2 2 \"Hyde Park Corner\" Stephen Daldry Peter Morgan November 4, 2016 ( ) 3 3 \"Windsor\" Philip Martin Peter Morgan November 4, 2016 ( ) 4 4 \"Act of God\" Julian Jarrold Peter Morgan November 4, 2016 ( ) 5 5 \"Smoke and Mirrors\" Philip Martin Peter Morgan November 4, 2016 ( ) 6 6 \"Gelignite\" Julian Jarrold Peter Morgan November 4, 2016 ( ) 7 7 \"Scientia Potentia Est\" Benjamin Caron Peter Morgan November 4, 2016 ( ) 8 8 \"Pride & Joy\" Philip Martin Peter Morgan November 4, 2016 ( ) 9 9 \"Assassins\" Benjamin Caron Peter Morgan November 4, 2016 ( ) 10 10 \"Gloriana\" Philip Martin Peter Morgan November 4, 2016 ( )\n\nSeason 2 (2017) [ edit ]\n\nNo.\n\noverall No. in\n\nseason Title Directed by Written by Original release date 11 1 \"Misadventure\" Philip Martin Peter Morgan December 8, 2017 ( ) 12 2 \"A Company of Men\" Philip Martin Peter Morgan December 8, 2017 ( ) 13 3 \"Lisbon\" Philip Martin Peter Morgan December 8, 2017 ( ) 14 4 \"Beryl\" Benjamin Caron Amy Jenkins and Peter Morgan December 8, 2017 ( ) 15 5 \"Marionettes\" Philippa Lowthorpe Peter Morgan December 8, 2017 ( ) 16 6 \"Vergangenheit\" Philippa Lowthorpe Peter Morgan December 8, 2017 ( ) 17 7 \"Matrimonium\" Benjamin Caron Peter Morgan December 8, 2017 ( ) 18 8 \"Dear Mrs. Kennedy\" Stephen Daldry Peter Morgan December 8, 2017 ( ) 19 9 \"Paterfamilias\" Stephen Daldry Tom Edge and Peter Morgan December 8, 2017 ( ) 20 10 \"Mystery Man\" Benjamin Caron Peter Morgan December 8, 2017 ( )\n\nProduction [ edit ]\n\nDevelopment [ edit ]\n\nPeter Morgan, who wrote the 2006 film The Queen and the 2013 stage play The Audience, is the main scriptwriter for The Crown.[26] The directors of the television series who were also involved in the stage production are Stephen Daldry, Philip Martin, Julian Jarrold, and Benjamin Caron.[27] The first 10-part season was the most expensive drama produced by Netflix and Left Bank Pictures to date, costing at least £100 million.[28][29][30][31] A second season was commissioned,[32][33] with the series intended to span 60 episodes over six seasons.[7] By October 2017, \"early production\" had begun on an anticipated third and fourth season,[12] and by the following January, Netflix confirmed the series had been renewed for a third and fourth season.[13]\n\nCasting [ edit ]\n\nBy November 2014, Claire Foy had entered negotiations to portray Queen Elizabeth II in the series.[34] By May 2015, Vanessa Kirby was in negotiations to portray Princess Margaret.[35] In June 2015, John Lithgow was cast as Winston Churchill, and Matt Smith was cast as Prince Philip; Foy was confirmed as Queen Elizabeth II.[36] Also starring in the first season were Victoria Hamilton, Jared Harris, and Eileen Atkins.[37]\n\nThe Left Bank producers noted that Smith was paid more than Foy in the first two seasons, partially because of his Doctor Who fame.[38] This information brought up discussion on the gender pay gap, including the creation of a petition asking Smith to donate the difference between his and Foy's salary to the Time's Up Legal Defense Fund.[39] Left Bank later issued an apology to Foy and Smith for putting them \"at the center of a media storm... through no fault of their own.\" Left Bank also clarified that they \"are responsible for budgets and salaries; the actors are not aware of who gets what, and cannot be held personally responsible for the pay of their colleagues.\" They added that they support \"the drive for gender equality in film and TV and [were] eager to talk to the British Time’s Up campaign and [were] already speaking to Era 50:50, a group campaigning for gender equality on screen and stage.\"[40] Suzanne Mackie, Left Bank's creative director, did note that moving forward, no other actor would be paid more than the actress portraying the Queen.[38] Regarding the controversy, Foy was \"not [surprised about the interest in the story] in the sense that it was a female-led drama. I'm not surprised that people saw [the story] and went, 'Oh, that's a bit odd.' But I know that Matt feels the same that I do, that it's odd to find yourself at the center [of a story] that you didn't particularly ask for.\"[41] Smith noted that he supported Foy and was \"pleased that it was resolved and [the producers] made amends for it because that's what needed to happen.\" The Hollywood Reporter noted it was unclear what Smith was referring to as resolved, since Netflix and Left Bank had not commented on the matter further.[42] Foy later described reports that she had received backpay to bring her salary up to parity as \"not quite correct\".[43]\n\nThe producers will recast some roles with older actors every two seasons, as the timeline moves forward and the characters age.[44] In October 2017, Olivia Colman was cast as Queen Elizabeth II for the third and fourth seasons.[12] By January 2018, Helena Bonham Carter and Paul Bettany were in negotiations to portray Princess Margaret and Prince Philip, respectively, for these seasons.[45][11] However, by the end of the month Bettany was forced to drop out due to the time commitment required.[18] By the end of March 2018, Tobias Menzies was cast as Prince Philip for the third and fourth seasons.[46] In early May 2018, Bonham Carter was confirmed to have been cast, alongside Jason Watkins as Prime Minister Harold Wilson.[47] The next month, Ben Daniels was cast as Antony Armstrong-Jones for the third season,[48] along with Erin Doherty joining the series as Princess Anne.[49] A month later, Josh O'Connor and Marion Bailey were cast as Prince Charles and the Queen Mother, respectively, for the third and fourth seasons.[50] In October 2018, Emerald Fennell was cast as Camilla Shand.[51] In January 2019, Gillian Anderson was cast as Margaret Thatcher for the fourth season.[52] In April 2019, Emma Corrin was cast as Lady Diana Spencer for the fourth season.[53]\n\nFilming [ edit ]\n\nAn estimated 25% of the first season was filmed at Elstree Studios in Borehamwood, Hertfordshire, with the remainder filmed on location, altogether taking 152 days. Sets for private quarters, the interior of a private jet, the cabinet room, and the exterior of 10 Downing Street, were built at Elstree Studios,[33][54] while Lancaster House, Wrotham Park and Wilton House were used to double as Buckingham Palace. Ely Cathedral and Winchester Cathedral stood in for Westminster Abbey, while locations in South Africa doubled as Kenya.[33] Additional locations in the UK included Eltham Palace, the Royal Naval College,[55] Goldsmiths' Hall, Shoreham Airport, New Slains Castle,[56] Balmoral Castle, Cruden Bay, Lyceum Theatre, Loseley Park, Hatfield House,[54] The Historic Dockyard Chatham,[57] Southwark Cathedral, Ardverikie House, Englefield House, and the Glenfeshie Estate.[58] Filming on the second season began in early October 2016.[44] Each episode of the first two seasons would shoot for about 22 days, with each costing about GB£5 million (US$7 million) to produce.[38] The third season began filming in July 2018,[59] and concluded in February 2019. The fourth season will begin filming in August 2019.[60]\n\nHistorical accuracy [ edit ]\n\nPeggy Noonan of The Wall Street Journal highlighted the historical inaccuracy of the series, and argued for \"more truth in art and entertainment\".[61]\n\nThe show has been interpreted as perpetuating the idea that the Queen and the Prime Minister, Winston Churchill, had forced Princess Margaret to give up her plan to marry Group Captain Peter Townsend. In the series the Queen is seen telling her sister that if she marries Townsend she would no longer be a member of the family because of the Royal Marriages Act 1772. Yet there is clear evidence that in reality efforts had been made to prevent any further delay of the marriage, which would have allowed Princess Margaret to keep her royal title and her civil list allowance, stay in the country and even continue with her public duties.[62]\n\nThe re-enactment of the removal of the King's cancerous lung, originally performed by Sir Clement Price Thomas, was researched and planned by Pankaj Chandak, specialist in transplant surgery at Guy's Hospital, London. Chandak and his surgical team also became part of the real scene.[63] The surgical model of King George VI was donated to the Gordon Museum of Pathology for use as a teaching aid.[64]\n\nDespite confirming historical accuracy that Queen Elizabeth did condemn the Duke of Windsor following her informing of The Marburg Files; historians have stated that the episode's implication that the Duke was admonished from the Royal family upon publication is false and that the Duke remained in contact and his public appearances continued.[65]\n\nThe depiction of the relationship with Jackie Kennedy has drawn criticism. Reports indicate that she had described Prince Philip as 'nice but nervous' and overall there was no bond between them.[66] The implication that Queen Elizabeth visited Ghana to compete with Jackie Kennedy's popularity was ridiculed by critics.[67] Reviews of the episode noted that it ignored more significant events of the visit, such that Kennedy’s sister Lee and her husband Prince Stanisław Albrecht Radziwiłł were initially excluded from the banquet invitation list due to both being divorcees, but were eventually invited,[68] while Princess Margaret and Princess Marina did not attend, despite the Kennedys apparently wanting to meet them.[69]\n\nGordonstoun School responded to its negative portrayal in series two, claiming that in fact Prince Charles's personal feedback to the school had been overwhelmingly positive.[70] Royal historian Hugo Vickers said that the same episode inaccurately depicted Philip’s sister’s death in a plane crash as having arisen from his own misbehaviour at Gordonstoun, stating “It is beyond me how serious film-makers would wish to turn such a dreadful tragedy into a series of invented scenes bearing no relation to the truth.\"[70]\n\nRelease [ edit ]\n\nThe series's first two episodes were released theatrically in the United Kingdom on November 1, 2016.[71] The first season was released worldwide in its entirety on November 4, 2016.[73] The second season was released on December 8, 2017.[74] The third season is expected to be released in the second half of 2019.[47][5]\n\nSeason 1 was released on DVD and Blu-ray in the United Kingdom on October 16, 2017[75] and released worldwide on November 7, 2017.[76] Season 2 was released on DVD and Blu-ray in the United Kingdom on October 22, 2018[77] and was released worldwide on November 13, 2018.[78]\n\nReception [ edit ]\n\nCritical response [ edit ]\n\nSeason 1 [ edit ]\n\nThe review aggregator website Rotten Tomatoes reported 89% approval for the first season based on 64 reviews, with an average rating of 8.72/10. Its critical consensus reads, \"Powerful performances and lavish cinematography make The Crown a top-notch production worthy of its grand subject.\"[79] On Metacritic, the series holds a score of 81 out of 100, based on 29 critics, indicating \"universal acclaim\".[80]\n\nThe Guardian's TV critic Lucy Mangan praised the series and wrote that \"Netflix can rest assured that its £100m gamble has paid off. This first series, about good old British phlegm from first to last, is the service's crowning achievement so far.\"[81] Writing for The Daily Telegraph, Ben Lawrence said, \"The Crown is a PR triumph for the Windsors, a compassionate piece of work that humanises them in a way that has never been seen before. It is a portrait of an extraordinary family, an intelligent comment on the effects of the constitution on their personal lives and a fascinating account of postwar Britain all rolled into one.\"[82] Chief television critic Jaci Stephen of The Mail on Sunday lauded the series as \"faultless\" and complimented its \"exquisite writing and magnificent acting\".[83] Writing for The Boston Globe, Matthew Gilbert also praised the series saying it \"is thoroughly engaging, gorgeously shot, beautifully acted, rich in the historical events of postwar England, and designed with a sharp eye to psychological nuance\".[84] Vicki Hyman of The Star-Ledger described it as \"sumptuous, stately but never dull\".[85] The A.V. Club's Gwen Ihnat said it adds \"a cinematic quality to a complex and intricate time for an intimate family. The performers and creators are seemingly up for the task\".[86]\n\nThe Wall Street Journal critic Dorothy Rabinowitz said, \"We're clearly meant to see the duke [of Windsor] as a wastrel with heart. It doesn't quite come off—Mr. Jennings is far too convincing as an empty-hearted scoundrel—but it's a minor flaw in this superbly sustained work.\"[87] Robert Lloyd writing for the Los Angeles Times said, \"As television it's excellent—beautifully mounted, movingly played and only mildly melodramatic.\"[88] Hank Stuever of The Washington Post also reviewed the series positively: \"Pieces of The Crown are more brilliant on their own than they are as a series, taken in as shorter, intently focused films\".[89] Neil Genzlinger of The New York Times said, \"This is a thoughtful series that lingers over death rather than using it for shock value; one that finds its story lines in small power struggles rather than gruesome palace coups.\"[90] The Hollywood Reporter's Daniel Fienberg said the first season \"remains gripping across the entirety of the 10 episodes made available to critics, finding both emotional heft in Elizabeth's youthful ascension and unexpected suspense in matters of courtly protocol and etiquette\".[91] Other publications such as USA Today,[92] Indiewire,[93] The Atlantic,[94] CNN[95] and Variety[96] also reviewed the series positively.\n\nSome were more critical of the show. In a review for Time magazine, Daniel D'Addario wrote that it \"will be compared to Downton Abbey, but that .. was able to invent ahistorical or at least unexpected notes. Foy struggles mightily, but she's given little...The Crown's Elizabeth is more than unknowable. She's a bore\".[97] Vulture's Matt Zoller Seitz concluded, \"The Crown never entirely figures out how to make the political and domestic drama genuinely dramatic, much less bestow complexity on characters outside England's innermost circle.\"[98] Verne Gay of Newsday said, \"Sumptuously produced but glacially told, The Crown is the TV equivalent of a long drive through the English countryside. The scenery keeps changing, but remains the same.\"[99] Slate magazine's Willa Paskin, commented: \"It will scratch your period drama itch—and leave you itchy for action.\"[100] Writing for The Mail on Sunday, Hugo Vickers, an English biographer of the Royal Family, argued that \"while [The Crown] certainly holds the attention, it is marred by a series of sensationalist errors and some quite remarkable lapses into vulgarity.\"[101]\n\nSeason 2 [ edit ]\n\nRotten Tomatoes reported a 91% approval rating for the second season based on 70 reviews, with an average rating of 8.45/10. The website's critical consensus read \"The Crown continues its reign with a self-assured sophomore season that indulges in high drama and sumptuous costumes.\"[102] On Metacritic, the second season holds a score of 87 out of 100, based on 27 critics, retaining the first season's indication of \"universal acclaim\".[103]\n\nFoy and Smith both earned significant praise from critics. Chancellor Agard of Entertainment Weekly wrote \"As always, Claire Foy turns in an amazingly restrained performance.\"[104] Reviewing the first episode, Gabriel Tate of The Daily Telegraph wrote that Foy and Smith have \"seldom been better\".[105] Hugo Rifkind of The Times said \"While ardent monarchists might bristle at the way this is going, for the rest of us it's getting better and better.\"[106]\n\nAlison Keene of Collider said \"each new episode makes its mark and tells its own complete story... It's another exceptionally strong season of television, full of compelling drama and sweeping grandeur.\"[107] Krutika Malikarjuna of TV Guide argued that the public is attracted to the royals' celebrity and star power, and said: \"The brilliance of this framing becomes clear as the show evolves into The Real Housewives of Buckingham.\"[108] Sophie Gilbert wrote for The Atlantic that the portrayal of a monarch who \"would rather be living any other life\" is \"riveting\", and that it is \"gorgeously shot, with flawless re-creations of everything from the Throne Room in Buckingham Palace to a 1950s hospital ward. And it's surprisingly funny.\"[109]\n\nThe Wall Street Journal critic John Anderson said \"The Crown attains genuine sexiness without sex. Margaret, à la Ms. Kirby's interpretation, smolders, as does Elizabeth, at least on occasion.\"[110] Meghan O'Keefe of Decider wrote that the season \"continues to romanticize the British royal family, but the romance comes from how they're normal, not divine\".[111]\n\nLess complimentary reviews saw the season criticised for what some regarded as failing to meet the emotional intensity of the first. John Doyle wrote for Globe and Mail that despite being \"lavishly made\" and \"breathtaking\", it \"now leans toward a three-hanky weeper about marriage. It is less than it was, like the monarchy itself, and of interest to monarchy fans only.\"[112] Alan Sepinwall of Uproxx added \"Many of the season's wounds are self-inflicted\" and that Prince Philip \"still comes across as a whiny man-child\".[113] Phil Owen of The Wrap described the season as \"trashy\" and saw dry comedy in Northam's portrayal of Prime Minister Anthony Eden: \"I'm assuming that creator Peter Morgan meant for it to be comedy. There's really no other explanation for why Jeremy Northam played Prime Minister Anthony Eden like he's having a nervous breakdown in every scene.\"[114]\n\nAccolades [ edit ]\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/1/18/The_Crown_Title_Card.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f4/John_Lithgow_8_by_David_Shankbone.jpg/125px-John_Lithgow_8_by_David_Shankbone.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/1/18/The_Crown_Title_Card.jpg/250px-The_Crown_Title_Card.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/1/18/The_Crown_Title_Card.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/The_Crown_(TV_series)", "title": "The Crown (TV series)", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.13", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/1/18/The_Crown_Title_Card.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}