{"url": "https://www.miamiherald.com/news/local/obituaries/article156070134.html", "text": "Gloria Fajardo, mother of Gloria Estefan, was the focus of a VH-1 Mother’s Day special. Miami Herald File\n\nThe first Gloria Fajardo — “Big Gloria,” as her family affectionately called her — loved song and dance and was once selected to be actress Shirley Temple’s double in Hollywood before the Cuban Revolution took root in 1953.\n\nThe next Gloria Fajardo, the one who, as Gloria Estefan, sang for U.S. presidents, at the Olympics and Super Bowl, and sold millions of records worldwide, credits the first for some of those accolades.\n\n“My mother was my professor,” Estefan told El Nuevo Herald in 2008. “When I was a child, she sang me lullabies so I’d go to sleep. That’s how it began.”\n\nMeeting the president. From left to right: President Bill Clinton, Gloria Fajardo, her daughter Gloria Estefan and Emilio Estefan, in 1997. Estefan Enterprises\n\nUnlimited Digital Access: Only $0.99 For Your First Month Get full access to Miami Herald content across all your devices. SAVE NOW\n\nBoth have their stories told on the Broadway stage in “On Your Feet! The Musical: The Story of Emilio & Gloria Estefan,” a biomusical that will debut its road version at downtown Miami’s Adrienne Arsht Center for the Performing Arts in October.\n\nAs on the Broadway stage, in a role originated by Tony-nominated actress Andrea Burns, Fajardo’s own story should resonate in Miami. It’s a tale of drama, laughs and a big heart.\n\n“Big Gloria” — Fajardo — died Tuesday night. She was 88.\n\n“Tonight at 8:19 p.m. we lost my beloved mother, the inimitable Gloria Fajardo,” Estefan wrote on Instagram. “She went peacefully surrounded by her daughters, grandchildren, son-in-laws, niece, three loving caregivers, extended family and her most trusted friends. I will miss her every moment of every day and I thank her for being the incredible mother, woman and role model that she was to so many people.”\n\nSaid son-in-law Emilio Estefan: “She was such an incredible woman, full of love and energy. And she worked so hard for the kids and her husband. She was so proud of him for being in the military. She loved this country. She came looking for freedom and attended to her family all the way to the end.”\n\nLate in life, at 87, Fajardo had taken up rapping in a series of amusing family videos that her granddaughter, musician Emily Estefan, posted on her Instagram account with the #Rapuela hashtag.\n\nRap grandma. Fajardo was a sensation. Traditional and social media loved the story.\n\nemily grandma rap\n\nBut it was just a lark, an abuela having fun with her family that made #Rapuela charming and guileless. More often, Fajardo could be spotted around Miami supporting her more famous kin: clutching her heart in mock — or maybe not — fear as her daughter did somersaults while suspended by cables 30 feet in the air for a music video in 1998. Or, more recently, beaming with pride at her granddaughter’s major concert debut at Festival Miami in February. Or, in March, at the opening of Emilio Estefan’s new midtown Miami restaurant, Estefan Kitchen.\n\nFajardo’s own dreams of a performing career were quashed by a disapproving father. Instead of taking Hollywood’s offer to double for Temple she became a schoolteacher, wife and mom.\n\nFajardo, and her husband, Cuban volleyball champ and policeman Jose Manuel Fajardo, with their eldest daughter, Gloria, came to Miami in 1959 on a $21 plane ticket after Castro took power. While training the exile brigade’s tank division for the Bay of Pigs invasion, her husband was captured by his cousin, a member of Castro’s army, and imprisoned in Cuba for nearly two years.\n\nIn Miami, Gloria Fajardo, was left to raise their daughter in an apartment near the old Orange Bowl. By Christmas 1962, her husband was released and back in Miami. The family grew with the addition of daughter Rebecca. Jose Fajardo joined the U.S. Army and volunteered to go to Vietnam in 1967.\n\nGloria Estefan (left) with her younger sister Becky and their mother, Gloria Fajardo, in a file photo. Courtesy of Gloria Fajardo Miami Herald file\n\nDuring his two-years of duty, Jose was exposed to the defoliant Agent Orange. Gloria Fajardo taught at James H. Bright/J.W. Johnson Elementary School in Hialeah while her eldest daughter tended to her ailing father’s care. He died in 1980.\n\nWhen Gloria Estefan was 17 she met Emilio Estefan, a percussionist who had a local band. When she approached her mother to tell her she wanted to join them as a singer, Fajardo had a quick response:\n\n“I said no. No!” Fajardo said in a mother-daughter interview on TV’s “Entertainment Tonight” in 2015. Her fear? “That she would forget about her education,” she told the Herald in a 1995 Mother’s Day feature.\n\net interview\n\nEmilio Estefan would have to win her over, too, a process that took about 12 years and was dramatized in “On Your Feet!”\n\nThe musical’s depiction of the estrangement was accurate, Emilio said recently. In 1990, Gloria’s back was fractured when a semi truck plowed into the Estefans’ tour bus on a snowy road in eastern Pennsylvania. Her mother, home in Miami, heard a preliminary news report and three words caught her attention: “Gloria. Estefan. Died.”\n\nFajardo flew to her daughter’s bedside. Gloria had received 48,000 cards and faxes from around the world and 4,000 floral arrangements — gestures of love she later credited with speeding her recovery. But the everlasting gift was having her mother back. Fajardo’s initial misgivings proved unfounded as she found pride in her daughter’s successes: “She graduated from the University of Miami with a major in psychology — and a major in music,” Fajardo told the Herald in 1995. “She’s proud of her Cuban roots and she shows it in her music.”\n\nAlso, “He was the best thing to happen to her — eventually,” Fajardo, a twinkle in her eye, said of Emilio on the “ET” segment.\n\nIn the clip, Estefan looks to her mom and says, “I never grew up thinking there was nothing a woman couldn’t do. My mother went out and worked. She put us through prep school. She renewed her credentials as a teacher and never sat on her laurels.”\n\nFajardo’s survivors include her daughters Gloria Estefan and Rebecca Fajardo; grandchildren Nayib and Emily Estefan; and great-grandson Sasha Argento Estefan-Coppola. Services are pending.", "images": ["https://www.miamiherald.com/latest-news/266pe6/picture230941833/alternates/LANDSCAPE_480/Louis%20Jepeway.jpg", "https://googleads.g.doubleclick.net/pagead/viewthroughconversion/968074018/?value=0&guid=ON&script=0", "https://www.miamiherald.com/latest-news/v1smal/picture231631933/alternates/LANDSCAPE_480/marian.jpg", "https://www.miamiherald.com/latest-news/yalwxs/picture231297908/alternates/LANDSCAPE_480/956017011_fitted.jpeg", "https://www.miamiherald.com/entertainment/movies-news-reviews/f8vn67/picture21096345/alternates/LANDSCAPE_480/Sister%20Jeanne", "https://www.miamiherald.com/latest-news/ntbdy7/picture231860108/alternates/LANDSCAPE_480/KidsFunderaltwomhdcpg", "https://ece-logger.nandomedia.com/analysis-logger/Logger?rt=1&ctxId=5080&contextPath=3179-5080&pubId=7&cat=&meta=read-story&objId=156070134&type=article&title=Gloria+Estefan%E2%80%99s+mother%2C+singer+Gloria+Fajardo%2C+dies+at+88&url=https%3A%2F%2Fwww.miamiherald.com%2Fnews%2Flocal%2Fobituaries%2Farticle156070134.html", "https://www.miamiherald.com/latest-news/hgg1c0/picture231866683/alternates/LANDSCAPE_480/103KameelaR22NEWPPP", "https://www.miamiherald.com/news/local/obituaries/qb90qn/picture156070114/alternates/LANDSCAPE_1140/Gloria%20Fajardo%20portrait%20VH1", "https://www.miamiherald.com/latest-news/43geqr/picture232000302/alternates/LANDSCAPE_1140/norbert%20seals%20.jpg", "https://www.miamiherald.com/wps/build/images/miamiherald/apple-touch-icon-57-precomposed.png", "https://www.miamiherald.com/wps/build/images/miamiherald/logo.svg"], "top_img": "https://www.miamiherald.com/news/local/obituaries/qb90qn/picture156070114/alternates/LANDSCAPE_1140/Gloria%20Fajardo%20portrait%20VH1", "keywords": [], "authors": ["Howard Cohen", "Peter Andrew Bosch"], "canonical_link": "http://www.miamiherald.com/news/local/obituaries/article156070134.html", "title": "Obituary: Gloria Estefan's mother Gloria Fajardo dies at 88", "meta_data": {"msapplication-TileColor": "#FFFFFF", "msapplication-TileImage": "/wps/build/images/miamiherald/windowsmetro-144.png", "twitter": {"card": "summary_large_image", "site": "miamiherald", "title": "Gloria Estefan’s mother, singer Gloria Fajardo, dies at 88", "description": "Gloria Fajardo, who sang in Cuba, became her daughter Gloria Estefan’s inspiration in Miami. The superstar’s mom has her own story featured nightly in the Broadway musical, ‘On Your Feet! The Musical: The Emilio & Gloria Estefan Story.’", "image": "https://www.miamiherald.com/news/local/obituaries/qb90qn/picture156070114/alternates/LANDSCAPE_1140/Gloria%20Fajardo%20portrait%20VH1"}, "og": {"site_name": "miamiherald", "type": "article", "title": "Gloria Estefan’s mother, singer Gloria Fajardo, dies at 88", "url": "https://www.miamiherald.com/news/local/obituaries/article156070134.html", "description": "Gloria Fajardo, who sang in Cuba, became her daughter Gloria Estefan’s inspiration in Miami. The superstar’s mom has her own story featured nightly in the Broadway musical, ‘On Your Feet! The Musical: The Emilio & Gloria Estefan Story.’", "image": "https://www.miamiherald.com/news/local/obituaries/qb90qn/picture156070114/alternates/LANDSCAPE_1140/Gloria%20Fajardo%20portrait%20VH1"}, "fb": {"app_id": 133847067760, "pages": 15440589699}, "title": "Obituary: Gloria Estefan's mother Gloria Fajardo dies at 88 | Miami Herald", "allow-comments": "true", "description": "Gloria Fajardo, who sang in Cuba, became her daughter Gloria Estefan’s inspiration in Miami. The superstar’s mom has her own story featured nightly in the Broadway musical, ‘On Your Feet! The Musical: The Emilio & Gloria Estefan Story.’", "keywords": "gloria fajardo, gloria estefan, emilio estefan, obituary, mother, obituary, cuba, gloria, emily estefan", "news_keywords": "gloria fajardo, gloria estefan, emilio estefan, obituary, mother, obituary, cuba, gloria, emily estefan", "googlebot": "noodp, noarchive", "viewport": "width=device-width, initial-scale=1.0", "original-source": "http://www.miamiherald.com/news/local/obituaries/article156070134.html", "google-site-verification": "CGBP3Njv1HyxLF1VInLHOprjcfJXffMVe5Udr0HQf-U", "parsely-metadata": "{\"article_id\": \"156070134\"}"}, "movies": ["https://www.youtube.com/embed/AJ4A8beY-EI?list=PLCeI9dWAuteFI6e_C-mYcEiwj87yJm4Bb", "https://www.youtube.com/embed/6LWYSZty83Q"], "publish_date": null, "source": "https://www.miamiherald.com", "summary": ""}