{"url": "https://www.cheatsheet.com/health-fitness/signs-pippa-and-kate-middletons-relationship-isnt-as-royalty-proof-as-everyone-thinks.html/", "text": "Pippa Middleton first made headlines when she wore that unforgettable white dress to sister Kate Middleton’s 2011 royal wedding. Since then, the two have been spotted together many times. But their relationship might not be as close as it seems, and it’s definitely not as close as it once was.\n\nThe two sisters were extremely close growing up\n\nKate and Pippa Middleton are less than two years apart. Growing up, the sisters were best friends. The girls grew up with their parents and brother and spent nearly every day together — the two were also very close with their younger brother, James Middleton. Kate has said that she wants to recreate the family dynamic she had while growing up and have a big, close-knit family. However, royalty can get in the way of close family relationships.\n\nNext: It’s hard to forget Pippa’s shining moment.\n\nPippa stole the show at Kate’s wedding\n\nIt was no secret that Pippa turned heads at William and Kate’s 2011 wedding. Pippa, then 27, nearly crashed Twitter when she showed up in a white dress with a neckline that didn’t seem fit for a royal wedding. The following day, there was just as much news about Pippa as there was about William and Kate. Although Kate didn’t have much to say about her sister overshadowing her big day, we’d like to think she probably wished she’d chosen a different outfit for her maid of honor.\n\nNext: Here’s why Kate didn’t get revenge on Pippa’s wedding day.\n\n… And Kate didn’t want the same for her sister\n\nWhen Pippa tied the knot with now-husband James Matthews in 2017, Kate did not play a role in her wedding. Why? Because the Duchess of Cambridge didn’t want to steal the spotlight on her sister’s big day. Instead, Kate decided she wanted to be in the background as much as possible, and only Prince George and Princess Charlotte would be in Pippa’s wedding. Perhaps that’s because Kate knows what it felt like to have someone else steal the limelight at your wedding.\n\nNext: Rumors swirled about Kate’s feelings toward Pippa’s fiancé.\n\nThere were rumors about Kate being annoyed with her sister’s engagement\n\nMultiple reports came out after Pippa’s engagement that claimed Kate was not happy with Pippa’s “wild” fiancé. Reports also claimed that Pippa was sick of Kate’s judgmental attitude, and the two were not getting along since Pippa’s big news. However, William and Kate did release a statement saying they were very happy for Kate’s sister. While the royals always show proper poise and respect, it’s unclear if they released the statement just to avoid the publicized drama, or if they were actually perfectly fine with Pippa tying the knot.\n\nNext: The relationship isn’t like it was growing up.\n\nThey don’t see each other that often\n\nKate is a royal. Royals have things to do. As a result, Kate and Pippa don’t spend as much time together as they used to. When Kate married into the royal family, she gave up any hope of a normal life — which included normal hangouts with her younger sister. The two can’t wander into a coffee shop together without everyone turning heads. They can’t go on a shopping date anymore without tight-knit security. Spending carefree time with one another is a thing of the past, and those strict rules are bound to have some kind of impact on anyone.\n\nNext: Kate’s husband had some words for Pippa.\n\nThe royal family has a different way of life\n\nPippa Middleton’s career plans were put on hold by her sister’s new family. E! Online reported that when Pippa wanted a career in television, she was “reined in” by her brother-in-law, who wasn’t happy with the wave of attention Pippa received at his wedding. A friend of Pippa’s told The Daily Mail, “It was felt by William in particular that she needed some guidance and support.” When Pippa had to be told how to live by her sister’s new husband’s standards, it likely caused some tension in the sisterly relationship.\n\nNext: The royal family keeps growing, which makes Kate and Pippa’s relationship shrink.\n\nKids always make things more complicated\n\nThis goes for any relationship. Once kids are thrown into the mix, it becomes even harder to maintain a close relationship with your siblings. Especially since Kate’s kids happen to include two princes and princess. It’s possible that when Pippa and her new husband decide to have a baby, the families can have play dates all day every day. However, with Kate trying to raise three little ones, and royal little ones nonetheless, it’s easy to drift from those who used to know you best.\n\nNext: An inside look at Kate’s other relationships with the royal family\n\nMeghan Markle\n\nRoyal relation to Kate: sister-in-law\n\nKate and Meghan Markle have met many times, and Prince Harry’s wife has also spent time with Kate and William’s children. Considering Kate’s affinity for her brother-in-law it’s no surprise sources say she defended her sister-in-law as the media reported about Markle’s previous divorce and sometimes-racy career.\n\nRoyal protocol doesn’t allow for a best man or maid of honor at royal weddings, but Prince William broke this rule when Harry was his best man in 2011. Harry returned the favor — and while it was rumored that Kate could be Markle’s matron of honor, the Duchess of Sussex chose not to have a maid of honor at her nuptials.\n\nNext: A controversial cousin in Kate’s corner\n\nPrincess Eugenie\n\nRoyal relation to Kate: cousin-in-law\n\nThe media noticed awkward dynamics between Princess Eugenie and Kate early on. But things seem better in recent years. Of course, Eugenie remains most loyal to her sister, Princess Beatrice (more on that drama later). But Eugenie is reportedly on good terms with the whole family, especially Princes William and Harry.\n\nIn January 2017, Buckingham Palace announced Eugenie’s engagement to long-term boyfriend Jack Brooksbank. Both the royal family and her fiancé’s family expressed delight over the upcoming nuptials. It seems the princess has a future of her own to focus on.\n\nNext: Everyone can see the tension between Kate and this royal.\n\nPrincess Beatrice\n\nRoyal relation to Kate: cousin-in-law\n\nSarah, Duchess of York (commonly known as Fergie) has long caused a rift in the royal family. So much so that it created tension between her daughters, Princess Beatrice and Eugenie, and the rest of the royal family. Many believe this rift translated to the girls not liking Kate — although Eugenie seems to have warmed up to her cousin-in-law.\n\nPrincess Beatrice is reportedly quite icy toward Kate, feeling sidelined due to Kate’s place and popularity in the royal family, especially with her grandmother, Queen Elizabeth. The feud between the two women regularly steals headlines.\n\nNext: A 22-year age gap doesn’t hurt this relationship.\n\nLady Louise of Windsor\n\nRoyal relation to Kate: cousin-in-law\n\nDaughter of Prince Edward and Sophie, Countess of Wessex, Lady Louise caught the public’s attention when she served as one of Kate’s adorable bridesmaids in 2011. Since then, Louise and Kate have enjoyed many public outings together. Despite their age difference (Louise is 14 and Kate is 36), the queen’s granddaughters get along swimmingly. They’re often seen chatting and laughing while representing the royal family.\n\nNext: The important relationship Kate maintains — outside her marriage.\n\nQueen Elizabeth II\n\nRoyal relation to Kate: grandmother-in-law\n\nSome relatives seem to have a problem with the attention Kate Middleton receives. It’s not surprising because she clearly maintains one of the best relationships with Queen Elizabeth. Kate reportedly dated Prince William for a while before meeting the queen for the first time at Peter and Autumn Phillips’ wedding. She and her royal grandmother have only grown closer since then.\n\nAdditional reporting by Chelena Goldman.\n\nCheck out The Cheat Sheet on Facebook!", "images": ["https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "https://www.cheatsheet.com/wp-content/uploads/2018/02/Pippa-Middleton-640x426.jpg?x46112", "https://www.bizographics.com/collect/?pid=4708&fmt=gif", "https://www.cheatsheet.com/wp-content/uploads/2018/02/Kate-Middleton-and-Pippa-Middleton-640x426.jpg?x46112", "https://www.cheatsheet.com/wp-content/uploads/2018/02/Pippa-Middleton-and-James-Mathews-640x476.jpg?x46112", "https://www.cheatsheet.com/wp-content/uploads/2017/12/Kate-Middleton-and-Princess-Eugenie--640x408.png?x46112", "https://www.cheatsheet.com/wp-content/uploads/2017/11/GettyImages-880238024.jpg?x46112", "https://www.cheatsheet.com/wp-content/uploads/2018/01/Catherine-Duchess-of-Cambridge-and-Lady-Louise-Windsor.jpg?x46112", "https://www.cheatsheet.com/wp-content/uploads/2018/02/Pippa-and-Kate-Middleton-640x488.jpg", "https://www.cheatsheet.com/wp-content/uploads/2017/12/Kate-Middleton-and-Princess-Beatrie-603x500.png?x46112", "https://www.cheatsheet.com/wp-content/uploads/2017/12/Prince-George-and-Princess-Charlotte-640x470.png?x46112", "https://www.cheatsheet.com/wp-content/uploads/2018/02/Pippa-and-Kate-Middleton-640x488.jpg?x46112", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.cheatsheet.com/wp-content/uploads/2017/12/GettyImages-818697344-640x445.jpg?x46112", "https://www.cheatsheet.com/wp-content/uploads/2017/11/Queen-Elizabeth-II-and-The-Duke-And-Duchess-Of-Cambridge-Visit-The-East-Midlands-603x500.jpg?x46112", "https://www.cheatsheet.com/wp-content/uploads/2018/02/Pippa-Middleton-at-a-skiing-event-640x431.jpg?x46112"], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2018/02/Pippa-and-Kate-Middleton-640x488.jpg", "keywords": [], "authors": ["Julia Mullaney"], "canonical_link": "https://www.cheatsheet.com/health-fitness/signs-pippa-and-kate-middletons-relationship-isnt-as-royalty-proof-as-everyone-thinks.html/", "title": "Signs Pippa and Kate Middleton’s Relationship Isn’t as Royalty-Proof as Everyone Thinks", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/health-fitness/signs-pippa-and-kate-middletons-relationship-isnt-as-royalty-proof-as-everyone-thinks.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "The two sisters were close growing up, but with one of them constantly in the spotlight, they aren't as close as they seem.", "og": {"locale": "en_US", "type": "article", "title": "Signs Pippa and Kate Middleton’s Relationship Isn't as Royalty-Proof as Everyone Thinks", "description": "The two sisters were close growing up, but with one of them constantly in the spotlight, they aren't as close as they seem.", "url": "https://www.cheatsheet.com/health-fitness/signs-pippa-and-kate-middletons-relationship-isnt-as-royalty-proof-as-everyone-thinks.html/", "site_name": "Showbiz Cheat Sheet", "updated_time": "2018-05-21T18:20:24+00:00", "image": {"identifier": "https://www.cheatsheet.com/wp-content/uploads/2018/02/Pippa-and-Kate-Middleton-640x488.jpg", "secure_url": "https://www.cheatsheet.com/wp-content/uploads/2018/02/Pippa-and-Kate-Middleton-640x488.jpg"}}, "article": {"publisher": "https://www.facebook.com/wallstcheatsheet", "tag": "relationship advice", "section": "Health & Fitness", "published_time": "2018-05-19T12:30:00+00:00", "modified_time": "2018-05-21T18:20:24+00:00"}, "twitter": {"card": "summary_large_image", "description": "The two sisters were close growing up, but with one of them constantly in the spotlight, they aren't as close as they seem.", "title": "Signs Pippa and Kate Middleton’s Relationship Isn't as Royalty-Proof as Everyone Thinks", "site": "@cheatsheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2018/02/Pippa-and-Kate-Middleton-640x488.jpg", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.2.2", "position": 2}, "movies": [], "publish_date": 1526733000.0, "source": "https://www.cheatsheet.com", "summary": ""}