{"url": "https://people.com/tv/rhony-reunion-luann-dagostino-faces-more-runors-tom-cheating/", "text": "Luann D’Agostino may be insisting that Tom D’Agostino was faithful to her during their 7-month marriage and that his infidelities had nothing to do with their split — but three weeks before she announced her divorce, her Real Housewives of New York City costars warned her about Tom’s indiscretions.\n\n“#BlindersOff,” Luann tweeted after Wednesday’ airing of the RHONY reunion part 1 — implying she had opened her eyes now to the realities of their relationship.\n\nDuring the episode, which was filmed on July 12, the 52-year-old former countess was once again tasked with defending her marriage to Tom as her fellow New York City Housewives opened up about the things they’ve heard since the couple said their “I dos.”\n\nIt’s something she’s grown accustom to, having spent two seasons on the hit Bravo show knocking down gossip of Tom’s cheating. But on the reunion, Luann showed a more vulnerable side — admitting that it alarms her to hear the constant rumors and see his “hot mic” moments on the show (including one scene in which he referred to his married self as a “dog with a collar” and another in which he removed his mic while talking to an ex at a party).\n\nImage zoom Tom and Luann D'Agostino Robin Marchant/Getty\n\n“Believe me, I wasn’t happy,” Luann said. “Why do you think I stayed at the hotel last night, okay?”\n\n“I admit his humor is a little off,” Luann continued, indicating that she understood how Tom — who was a lifelong bachelor before they wed — came off on the show. “I always look like the tough guy but I try to look at it like, ‘He’s trying to be funny and he doesn’t know it’s going to look weird.’ I’m going to talk to him about how that might come off and how it made me feel. He shouldn’t say things like that obviously.”\n\nBut it’s been more than just what he’s been caught saying.\n\nImage zoom Tinsley Mortimer, Carole Radziwill, Bethenny Frankel, Ramona Singer, Dorinda Medley, Luann D'Agostino, Sonja Morgan Charles Sykes/Bravo\n\nRamona Singer explained she heard Tom had met a divorced woman from Philadelphia at the bar of New York City’s Regency Hotel and had gone up with her to her room, allegedly telling her he was in an open relationship with Luann.\n\nThat’s the same bar where Tom, 50, was caught on camera by a friend of costar Bethenny Frankel’s making out with a mysterious blonde, who Frankel claimed was a Playboy model, the day before his engagement party.\n\nLuann forgave her then-fiancé for the infidelity, telling PEOPLE at the time she wasn’t going to let “a stupid little kiss ruin the rest of [her] life.” But even after Tom was caught, he still saw his unnamed makeout partner — having lunch with her in Los Angeles where Singer alleged they kissed again.\n\n“It was in the press,” Singer claimed, ignoring Luann’s defense that the woman’s boyfriend was at the lunch too. “You denied it, but her quotes were in the press. And [Tom] laughed and said ‘[Luann] deserved it.’ “\n\n“I heard the same thing. That he was annoyed that you were selling things to the press about your wedding,” confirmed Frankel. “Why would he be going out in N.Y. with the same girl he was making out with another time in L.A. weeks later? That’s out of control.”\n\nImage zoom The Real Housewives of New York City season 9 reunion\n\nSo why didn’t the Housewives bring these things up to Luann earlier? According to Frankel, there was no need.\n\n“It feels to all of us that you have your own particular dynamic,” the Skinnygirl mogul said. “I can’t speak for the group — but I’ve spoken to several of you — but I think we are all being respectful of the fact that they’re married. We do hear things. But what the hell are we going to do now?”\n\nShe continued: “We’ve all heard things, but we’re numb now. We all have heard stuff — she’s married. Whatever their situation is is whatever their situation is. Luann’s not an idiot. Whatever Tom does, she probably knows. Whatever she does, he knows. Or they do nothing. It doesn’t matter to any of us anymore. She’s married. Do you boo!”\n\nSinger concurred. “[Luann’s] happy now, that’s all that counts. Her marriage is working and I’m so happy,” Singer said. “She has to accept him the way he is and that’s it. And she’s more than willing to accept it.”\n\nImage zoom Luann D'Agostino\n\nThat may be the way Singer sees it, but Luann wasn’t willing to accept everything — especially the rumors that she and Tom had an open marriage. “I’m not interested in an open relationship otherwise I wouldn’t be married,” she told Cohen. “It’s not an arrangement — it’s a marriage.”\n\nAsked what she would do if those claims ended up having validity, Luann gave a swift answer. “I would definitely leave,” she told host Andy Cohen. “I would. After I kill him. I’d kill him first and then I’d leave. You can push me so far but once you push me over the line…”\n\nThe mother of two also went back on her previous claim that she didn’t want to hear rumors about Tom’s cheating. It just depends on the source.\n\n“I would want to hear that my husband went up to a hotel room in any capacity and said he was in an open relationship,” she said. “I want to hear that but do you think I trust Ramona and her information? She calls her ex-girlfriends in California trying to get dirt on him. Which is Nancy Drew sneaky!”\n\nRELATED VIDEO: Sonja Morgan Says She Won’t Have A Relationship With Tom D’Agostino Again: ‘That’s Done’\n\nFrankel, shockingly, stood up for Singer. “In all fairness, I don’t love her delivery but her content seems to be true,” Frankel said. “Because the girl in L.A., I’ve heard a similar thing. And I’ve heard other things. It just seems like he’s the type of person to go to a bar with one person and leave with another.”\n\n“Even the way you laugh about it now. You have an inhuman way about you where you have that countess shield up,” Frankel said. “One of 10 things that he ever said to you, I’d be in a ball. If I saw the episode that you saw, I’d be crying in the bathroom.”\n\nThere may be no tears from Luann, but she said Tom’s behavior and the rumors have still hurt.\n\nIt’s been especially tough on her family, including son Noel de Lesseps. “It was hard for [Noel] to accept [Tom] in the beginning because of what happened,” Luann said. “He’s my son — he’s very protective of me. But he loves me, so he stands by my decision. They’re not super close but they do [have their own relationship].”\n\nImage zoom Luann and Tom D'Agostino Jimi Celeste/Patrick McMullan/Getty\n\nStill, Luann appeared to believe the two could work through it all — telling the Housewives she had accepted Tom for the way he is.\n\n“I’m not going to change him at this point in his life. I’m not going to tell him now, ‘You can’t go to the Regency,’ ” she said. “I have suggested it. Listen — he’s a grown man. A 50-year-old man who has lived his whole life as a bachelor. He has friends. I’m friends with [my ex].”\n\n“Right now I like being Mrs. D’Agostino,” she explained. “I don’t miss my [countess] title. I like being Luann D’Agostino.”\n\nRELATED VIDEO: Highlights of Luann de Lesseps & Tom D’Agostino Jr.’s Wedding\n\nThree weeks later, on Aug. 3, Luann announced on Twitter that she and Tom were divorcing, writing: “It’s with great sadness that Tom & I agreed to divorce We care for each other very much, hope you respect our privacy during this sad time!”\n\nDays after, she denied allegations that Tom had been unfaithful.\n\n“I do not think Tom cheated on me, definitely not,” Luann told Page Six when asked the reasons for their divorce. “God knows he’s got himself in some trouble in the past, but I don’t believe that continued [while we were married].”\n\n“It was impossible, we were having problems and we tried really hard to fix things, and we finally came to the conclusion it was just not going to work,” she continued. “It was a tough decision and we are both very sad about it. But the truth is we just weren’t getting along.”\n\nThe Real Housewives of New York City reunion part 2 airs Wednesday (9 p.m. ET) on Bravo.", "images": ["https://peopledotcom.files.wordpress.com/2019/07/66479204_108888670282730_6022764772832245612_n.jpg?crop=0px%2C191px%2C1800px%2C945px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2019/05/zendayaeuphoria.png?crop=0px%2C0px%2C2866px%2C1504.65px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2019/07/james_holzhauer.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2019/06/luanndelessepsclip.png?crop=0px%2C0px%2C2864px%2C1503.6px&resize=1200%2C630", "https://secure.gravatar.com/avatar/59d6486f5205aabdbf65fd1a39fa97ee?s=300&d=blank&r=g", "https://peopledotcom.files.wordpress.com/2019/07/flintstone-social.jpg", "https://peopledotcom.files.wordpress.com/2017/08/rhony-reunion-2.jpg?crop=113px%2C22px%2C1724px%2C906px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2019/05/channing-tatum-jessie-j-3.jpg?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2017/08/rhony-reunion-3.jpg", "https://peopledotcom.files.wordpress.com/2017/04/luanne-dagostino.jpg", "https://peopledotcom.files.wordpress.com/2019/07/million1.jpg?crop=0px%2C0px%2C1280px%2C672px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2018/11/gettyimages-1060374704.jpg?crop=0px%2C0px%2C1800px%2C945px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2019/07/alec-utgoff-stranger-things-1.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2017/08/rhony-reunion-2.jpg", "https://peopledotcom.files.wordpress.com/2018/11/beth-chapman-dog-bounty-hunter-3.jpg?crop=0px%2C0px%2C2026px%2C1063.65px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2019/06/screen-shot-2019-06-27-at-8.57.39-pm.png?crop=0px%2C224px%2C1800px%2C946px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2019/04/jessica-alba-cash-warren-paris-vacation.jpg?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2019/03/john-delaney.jpg?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2019/07/millions2.jpg?crop=0px%2C0px%2C1280px%2C672px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2018/11/gettyimages-1027812288.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2017/05/luann-tom-dagostino.jpg", "https://peopledotcom.files.wordpress.com/2019/06/stranger-things-3.jpg", "https://peopledotcom.files.wordpress.com/2019/07/kristen-chen-split.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2019/04/screen-shot-2019-04-25-at-8.41.31-am.png?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2019/04/couple-1.jpg?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2017/08/rhony-reunion-1.jpg", "https://peopledotcom.files.wordpress.com/2019/07/gettyimages-110240357.jpg", "https://peopledotcom.files.wordpress.com/2019/06/rhony-1.jpg?crop=0px%2C0px%2C1280px%2C672px&resize=1200%2C630", "https://people.com/img/icons/generic-image.svg", "https://peopledotcom.files.wordpress.com/2019/07/bella-chigvintsev-2-2000.jpg?crop=0px%2C57px%2C1333px%2C699px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2018/02/jenelle-evans.jpg?crop=0px%2C158px%2C2000px%2C1051px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2019/04/jenelle-evans.jpg?crop=0px%2C0px%2C2000px%2C1050px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2018/04/mickey-pretzels-1-2000.jpg?&fit=250%2C250"], "top_img": "https://peopledotcom.files.wordpress.com/2017/08/rhony-reunion-2.jpg?crop=113px%2C22px%2C1724px%2C906px&resize=1200%2C630", "keywords": [], "authors": ["Dave Quinn"], "canonical_link": "https://people.com/tv/rhony-reunion-luann-dagostino-faces-more-runors-tom-cheating/", "title": "RHONY: Luann D'Agostino's Blinders Are Off After Tom's Indiscretions", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "RHONY Reunion, Real Housewives of New York City Reunion, Luann D'Agostino, Luann D'Agostino Tom D'Agostino, Luann Tom D'Agostino cheating, Luann de Lesseps, Tom D'Agostino cheating", "news_keywords": "RHONY Reunion, Real Housewives of New York City Reunion, Luann D'Agostino, Luann D'Agostino Tom D'Agostino, Luann Tom D'Agostino cheating, Luann de Lesseps, Tom D'Agostino cheating", "description": "Three weeks before she announced her divorce, Luann D'Agostino's Real Housewives of New York City costars warned her about Tom's \"indiscretions\" on the reunion", "og": {"title": "Luann D'Agostino's RHONY Costars Warned Her About Tom's 'Indiscretions' 3 Weeks Before Their Divorce", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/rhony-reunion-luann-dagostino-faces-more-runors-tom-cheating/", "description": "Three weeks before she announced her divorce, Luann D'Agostino's Real Housewives of New York City costars warned her about Tom's \"indiscretions\" on the reunion", "image": {"identifier": "https://peopledotcom.files.wordpress.com/2017/08/rhony-reunion-2.jpg?crop=113px%2C22px%2C1724px%2C906px&resize=1200%2C630", "width": 1200, "height": 630}}, "pinterest": {"url": "https://people.com/tv/rhony-reunion-luann-dagostino-faces-more-runors-tom-cheating/", "description": "Three weeks before she announced her divorce, Luann D'Agostino's Real Housewives of New York City costars warned her about Tom's \"indiscretions\" on the reunion", "media": "https://peopledotcom.files.wordpress.com/2017/08/rhony-reunion-2.jpg?crop=113px%2C22px%2C1724px%2C906px&resize=1200%2C630"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/rhony-reunion-luann-dagostino-faces-more-runors-tom-cheating/", "title": "Luann D'Agostino's RHONY Costars Warned Her About Tom's 'Indiscretions' 3 Weeks Before Their Divorce", "description": "Three weeks before she announced her divorce, Luann D'Agostino's Real Housewives of New York City costars warned her about Tom's \"indiscretions\" on the reunion", "site": "@people", "image": "https://peopledotcom.files.wordpress.com/2017/08/rhony-reunion-2.jpg?crop=113px%2C22px%2C1724px%2C906px&resize=1200%2C630"}, "fb": {"pages": 95926963131}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}