{"url": "https://en.wikipedia.org/wiki/Kathie_Lee_Gifford", "text": "Kathryn Lee Gifford (née Epstein; born August 16, 1953)[1] is an American television host, singer, songwriter, and author. She is best known for her 15-year run (1985–2000) on the talk show Live! with Regis and Kathie Lee, which she co-hosted with Regis Philbin. She is also known for her 11-year run with Hoda Kotb, on the fourth hour of NBC's Today show (2008-2019). She has received 11 Daytime Emmy nominations and won her first Daytime Emmy in 2010 as part of the Today team. Gifford's first television role had been as Tom Kennedy's singer/sidekick on the syndicated version of Name That Tune, from 1974 to 1978. She also occasionally appeared on the first three hours of Today and was a contributing NBC News correspondent.\n\nKathie Lee married Paul Johnson, a Christian composer/arranger/producer/publisher in 1976. After their divorce in 1982, she married sportscaster and former NFL player Frank Gifford in 1986. He died in 2015. Kathie Lee has released studio albums and written books.\n\nEarly life and beginnings [ edit ]\n\nGifford was born Kathryn Lee Epstein in Paris, France, to American parents, Joan (born Cuttell; January 20, 1930 – September 12, 2017), a singer, and Aaron Epstein (March 19, 1924 – November 19, 2002), a musician and former US Navy Chief Petty Officer. Aaron Epstein was stationed with his family in France at the time of Gifford's birth.[2] Gifford grew up in Bowie, Maryland, and attended Bowie High School.[3]\n\nGifford's paternal grandfather was a Russian Jew from Saint Petersburg and her paternal grandmother was of Native American ancestry. Her mother, a relative of writer Rudyard Kipling, was of French-Canadian, English and German descent.[4][5]\n\nAfter seeing the Billy Graham–produced film The Restless Ones at age 12, Gifford became a born-again Christian. She told interviewer Larry King, \"I was raised with many Jewish traditions and raised to be very grateful for my Jewish heritage.\"[6]\n\nDuring high school, Gifford was a singer in a folk group, \"Pennsylvania Next Right\", which performed frequently at school assemblies. After high school graduation in 1971, Gifford attended Oral Roberts University in Tulsa, Oklahoma, studying drama and music. During a summer in the early 1970s, she was a live-in secretary/babysitter for Anita Bryant at her home in Miami.\n\nLive! with Regis and Kathie Lee [ edit ]\n\nFollowing her divorce from her first husband Paul Johnson in 1983, Gifford met sports commentator Frank Gifford during an episode of ABC's Good Morning America; they were married from 1986 until his death in 2015. At the time she was several months into her role as a full-time morning talk show personality.\n\nOn June 24, 1985, she replaced Ann Abernathy as co-host of The Morning Show on WABC-TV with Regis Philbin. The program went into national broadcast in 1988 as Live! with Regis and Kathie Lee, and Gifford became well-known across the country. Throughout the 1990s, morning-TV viewers watched her descriptions of life at home with Frank, her sportscaster husband and son Cody and daughter Cassidy. Gifford left the show on July 28, 2000.\n\nRegis Philbin and Kathie Lee were jointly nominated eight consecutive years in a row (1993 to 2000) for Outstanding Talk Show Host during the Daytime Emmy Awards.[7]\n\nToday with Kathie Lee and Hoda [ edit ]\n\nOn March 31, 2008, NBC announced that Gifford was to join its morning show, Today, as co-host of the fourth hour titled Today with Kathie Lee and Hoda, alongside Hoda Kotb. This marked her return to morning television; in many markets, she now airs directly after her old show, currently called Live with Kelly and Ryan. Because the fourth hour of Today airs live at 10:00 am ET, and Live with Kelly and Ryan airs live at 9:00 am ET, Gifford's hour does not compete directly with her former show in most markets.[8] Kotb and Gifford replaced Ann Curry and Natalie Morales. In the weeks prior to Gifford's arrival, ratings indicated 1.9 million viewers of the fourth hour of Today.[9] As of 2014, the fourth hour of Today with Gifford and Kotb has averaged 2.15 million total viewers, an increase of 13 percent over the 2008 ratings.[10][11] On December 11, 2018, it was announced that she will be leaving Today in April 2019. Her final Today Show appearance was on April 5, 2019 with a huge party, including a very touching video by her children Cody and Cassidy Gifford.[12]\n\nCurrent career [ edit ]\n\nGifford left Today in order to pursue a movie career both as an actress, and as a director and producer. In 2018 she filmed Then Came You in which she co-stars with Craig Ferguson. In 2018 she also filmed a Hallmark Christmas movie for Hallmark Movies and Mystery called A Godwink Christmas. Gifford intends to make movies about the experiences of losing a loved one and being a widow, which she considers an underrepresented topic in Hollywood.[13] Gifford has several projects in the works including sequels to Then Came You.\n\nMedia appearances and projects [ edit ]\n\nGifford's career took off in the 1970s as a vocalist on the game show Name That Tune with Tom Kennedy. In 1978, she joined the cast of the short-lived Hee Haw spinoff, Hee Haw Honeys.\n\nGifford has made guest appearances in films and television series, and has several independently released albums on CD, including 2000's The Heart of a Woman, featuring the single \"Love Never Fails\".[14][15]\n\nShe appeared as a spokesperson for Slim Fast diet shakes after her son Cody was born. She also was the face of Carnival Cruise Lines in the late 1980s and early 1990s, singing \"If my friends could see me now!\" In 1994, she appeared as herself in an episode of the NBC sitcom Seinfeld.\n\nShe did a number of voice overs most notably as Echidna in the 1998 TV series Hercules and the follow up 1999 comedy-drama and animated television film Hercules: Zero to Hero. In 2004, she was on the show, Higglytown Heroes as the Mail Carrier Hero.\n\nIn September 2005 she became a special correspondent on The Insider, a syndicated entertainment magazine television show, ending her relationship with that program upon her co-hosting role with Today.[16]\n\nShe played the role of Miss Hannigan in a concert performance of Annie at Madison Square Garden in December 2006.[17]\n\nOn an episode that aired March 27, 2010, she guest starred on The Suite Life on Deck, along with her real-life daughter, Cassidy.\n\nShe appeared as herself in the 2015 television film Sharknado 3: Oh Hell No!\n\nShe has written two autobiographical books, Just When I Thought I'd Dropped my Last Egg: Life and Other Calamities in 2010 and The Rock, the Road and the Rabbi to be released in early 2018. She has also written a number of children's books.\n\nMusical theatre [ edit ]\n\nIn the late 1990s, Gifford began working in musical theatre. She contributed a number of musical numbers to Hats, and wrote and produced Under The Bridge,[18] based upon the children's book The Family Under The Bridge by Natalie Savage Carlson. In 2000 she released the album The Heart of a Woman on Universal.\n\nIn 2007, she premiered Saving Aimee, a stage musical about evangelist Aimee McPherson, at the Signature Theatre in Arlington, Virginia.[19][20] The premiere starred actress Carolee Carmello in the lead role.[21] The show, now titled Scandalous: The Life and Trials of Aimee Semple McPherson, ran on Broadway from November 15, 2012, through December 9, 2012,[22] with Carmello reprising her role as McPherson. On April 30, 2013, Carmello received her third Tony Award nomination for the performance.[23]\n\nOn April 16, 2007, Gifford was a guest presenter at the Washington, D.C. Helen Hayes Award Ceremony, honoring contributions and professional accomplishments in theatre.[24]\n\nIn 2008, Gifford and David Friedman wrote a junior high school musical entitled Key Pin It Real.[25] The play depicts a coming-of-age story about a young girl named Key Pin. The first production took place in December 2008 in Kendallville, Indiana, at East Noble High School.[26]\n\nGifford is currently working on a musical adaptation of It's a Wonderful Life with John McDaniel; McDaniel is composing music while Gifford is writing lyrics.[27]\n\nCharity [ edit ]\n\nGifford is a celebrity ambassador for the non-profit organization Childhelp. She regularly makes appearances at fund raisers and events for the child abuse prevention and treatment organization and is an ardent supporter.[28]\n\nFrank and Kathie Lee Gifford raised the money to build and continued to financially support two shelters in New York City for babies born with HIV, or a congenital crack cocaine addiction. These shelters were named in honor of her children, Cody and Cassidy.[29]\n\nLabor rights activity [ edit ]\n\nIn 1996 the National Labor Committee, a human rights group, reported that sweatshop labor was being used to make clothes for the Kathie Lee line, sold at Wal-Mart.[30] The group reported that a worker in Honduras smuggled a piece of clothing out of the factory, which had a Kathie Lee label on it.[31] One of the workers, Wendy Diaz, came to the United States to testify about the conditions under which she worked. She commented, \"I wish I could talk to [Kathie Lee]. If she's good, she will help us.\"[32]\n\nLabor activist Charles Kernaghan spoke to the media and accused Gifford of being responsible for the sweatshop management activity. Gifford addressed Kernaghan's allegations on the air during Live! with Regis and Kathie Lee, explaining that she was not involved with hands-on project management in factories.[33]\n\nGifford later contacted federal authorities to investigate the issue and worked with US federal legislative and executive branch agencies to support and enact laws to protect children against sweatshop conditions. She appeared with President Bill Clinton at the White House in support of the government's initiatives to counter international sweatshop abuses.[34]\n\nPersonal life [ edit ]\n\nKathie Lee and Frank Gifford in 1996\n\nKathie Lee married Paul Johnson, a Christian composer/arranger/producer/publisher in 1976. They gained fame in Christian music, appearing on covers of Christian magazines. But the marriage was strenuous from the start and in 1981, Johnson moved out. The couple divorced in 1982.[35]\n\nOn October 18, 1986, Kathie Lee married a second time, this time to Frank Gifford, an American football player and television sports commentator. It was his third marriage after marriages with Maxine Avis Ewart and Astrid Lindley. With Ewart he had three children.\n\nKathie Lee was 23 years younger than Frank. They had two children together, Cody Newton Gifford (born March 22, 1990) and Cassidy Erin Gifford (born August 2, 1993). They also shared a birthday together–August 16. Frank died on August 9, 2015, from natural causes at their Greenwich, Connecticut, home, a week shy of his 85th birthday.[36][37] In 2017, she released \"He Saw Jesus\", a very personal song Kathie Lee co-wrote (with songwriter Brett James) and dedicated to her husband. All proceeds from the song went to the international evangelical Christian humanitarian aid charity Samaritan's Purse.\n\nDiscography [ edit ]\n\nAlbums [ edit ]\n\n(as Kathie Lee Gifford except where indicated)\n\n1992: Sentimental Journey\n\n1993: It's Christmas Time\n\n1993: Christmas Carols\n\n1993: Sentimental\n\n1993: Christmas With Kathie Lee Gifford (double album)\n\n1995: Dreamship: Lullabies for Little Ones\n\n1995: Kathie Lee's Rock 'N' Tots Cafe: A Christmas \"Giff\"\n\n2000: Heart of a Woman (as Kathie Lee)\n\n2000: Born For You (as Kathie Lee)\n\n2001: Goodnight, Angel (as Kathie Lee)\n\n2004: Gentle Grace\n\n2009: Everyone Has a Story (as Kathie Lee Gifford & Friends)\n\n2009: My Way Home\n\n2010: Super Hits\n\nFilmography [ edit ]\n\n'1996: First Wives Club as Journalist\n\nTelevision series\n\n1978: Days of Our Lives as Nurse Callahan. (credited as Kathie Lee Johnson)\n\nas Nurse Callahan. 1994: Seinfeld as herself\n\nas herself 1998: Hercules as Echidna\n\nas Echidna 2004-2008: Higglytown Heroes as the Mail Carrier\n\nPublications [ edit ]\n\nBiographical\n\n2010: Just When I Thought I'd Dropped my Last Egg: Life and Other Calamities\n\n2018: The Rock, the Road and the Rabbi\n\nChildren's books\n\n2010: Party Animals\n\n2011: The Three Gifts: A Story About Three Angels and the baby Jesus (co-written with Michael Storrings)\n\n2011: The Legend of Messy M'Cheany\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Blue_pencil.svg/10px-Blue_pencil.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/Kathie_Lee_Gifford_in_2017.jpg/220px-Kathie_Lee_Gifford_in_2017.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/NBC_News_2011.svg/80px-NBC_News_2011.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/0/0d/Kathie_Lee_Gifford_in_2017.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/46/Kathie_Lee_and_Frank_Gifford.jpg/220px-Kathie_Lee_and_Frank_Gifford.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/Wiki_letter_w_cropped.svg/20px-Wiki_letter_w_cropped.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/0/0d/Kathie_Lee_Gifford_in_2017.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Kathie_Lee_Gifford", "title": "Kathie Lee Gifford", "meta_data": {"generator": "MediaWiki 1.34.0-wmf.13", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/0/0d/Kathie_Lee_Gifford_in_2017.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}