{"url": "https://movieweb.com/charlize-theron-responds-james-bond-female-rumors/", "text": "Charlize Theron has officially weighed in on the possibility of playing a female version of James Bond. Daniel Craig is still playing 007 for now, but James Bond 25, which is set to arrive in theaters next November, is said to be his last. That means, the franchise is heading for a reboot in the next couple of years and there's been talk, mostly from fans, about having a female Bond. Theron's name has been thrown around and now she's addressed the possibility.\n\nDuring a recent interview, Charlize Theron was asked about playing James Bond. Nobody involved with the franchise, as far as we know, is actually looking at a female to play 007 in the future. Nor is there any indication Theron has been specifically approached, but her name has been bandied about, largely thanks to her roles in movies like Mad Max: Fury Road and Atomic Blonde. Theron says she likes the idea of going against type, but she feels she's too old for the part. Here's what she had to say about it.\n\n\"You know, I don't have a feeling about it one way or the other. I love the idea that people are thinking outside the box. And I know for a long time people were talking about Idris Elba for it. And it's just nice to see people now thinking outside of [these] confined ideas of what we think a character can be. I'm really all for that. I think it's great that we are developing more characters within that genre for females, that they can take ownership. So it's a really nice thing for people to say. I'm very old, though. I would be a very old James Bond.\"\n\nCharlize Theron has made quite the name for herself as a female action star in recent years, so it's understandable that if a gender-swapped version of James Bond is on the horizon, her name would be at the top of people's lists. Some fan art depicting her as the iconic MI6 spy even made the rounds online last year. Gillian Anderson from The X-Files is also a favorite for the part and she's even shown support for the idea.\n\nAs Charlize Theron points out, Idris Elba has been a name thrown out over the years, which also would represent a change for the character, as James Bond has always been portrayed as a white man. In regards to her being too old? That's not necessarily true. Daniel Craig is going to be 50 by the time James Bond 25 gets going and Roger Moore played the part until he was 57. That said, Theron, who is now 42, would be in her mid-40s by the time the opportunity came up, which may be a bit old for someone to start their tenure as the new 007.\n\nRelated: James Bond 25 First Look Video Goes On Set with Daniel Craig in Jamaica\n\nThe producers of the James Bond franchise are going to have a tough time following up Daniel Craig and one way to gain some attention would be to try something different. Though, gender-swapping one of the most iconic characters in cinema history may turn more fans off than it would bring to the franchise. At the very least, some changes could be coming. Producer Barbara Broccoli said last year that she's open to have a female direct a future Bond movie, which could help bring some new perspective to the character and the franchise. In any event, it doesn't sound like Charlize Theron plans on putting on a tux and taking out bad guys with a Walther PPK in the future. This news comes to us courtesy of Yahoo.", "images": ["https://cdn3.movieweb.com/i/author/vODq0IyXG98kxElA8Ykt7NckwBRNA8/60:70/default.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=17091571&cv=2.0&cj=1", "https://cdn3.movieweb.com/i/article/npic5ZrnV6Dyxj2C8UqJnPhUGPgLLP/1200:100/Charlize-Theron-Responds-James-Bond-Female-Rumors.jpg", "https://cdn3.movieweb.com/i/article/npic5ZrnV6Dyxj2C8UqJnPhUGPgLLP/798:50/Charlize-Theron-Responds-James-Bond-Female-Rumors.jpg", "https://certify.alexametrics.com/atrk.gif?account=4fQco1IWNa10zK"], "top_img": "https://cdn3.movieweb.com/i/article/npic5ZrnV6Dyxj2C8UqJnPhUGPgLLP/1200:100/Charlize-Theron-Responds-James-Bond-Female-Rumors.jpg", "keywords": [], "authors": ["Ryan Scott", "Writer Of Various Things On The Internet", "Mostly About Movies", "Since Major Lover Of Popcorn Flicks. Avid Appreciator Of James Bond", "Marvel", "Star Wars. Has A Tremendously Fat Cat Named Buster", "Still Buys Cds. I Ve Got My Reasons."], "canonical_link": "https://movieweb.com/charlize-theron-responds-james-bond-female-rumors/", "title": "Charlize Theron on Playing a Female James Bond: I'm Very Old", "meta_data": {"viewport": "user-scalable=yes, initial-scale=1.0, width=device-width", "description": "Charlize Theron weighs in on the possibility of playing a female version of James Bond in the future.", "og": {"locale": "en_US", "site_name": "Movieweb", "type": "article", "title": "Charlize Theron on Playing a Female ‘James Bond’: I'm Very Old", "url": "https://movieweb.com/charlize-theron-responds-james-bond-female-rumors/", "description": "Charlize Theron weighs in on the possibility of playing a female version of ‘James Bond’ in the future.", "image": "https://cdn3.movieweb.com/i/article/npic5ZrnV6Dyxj2C8UqJnPhUGPgLLP/1200:100/Charlize-Theron-Responds-James-Bond-Female-Rumors.jpg"}, "fb": {"app_id": 357878074202, "pages": 46132502198}, "news_keywords": "James Bond 25,James Bond,Mapplethorpe,Movie News", "twitter": {"card": "summary_large_image", "site": "@movieweb", "creator": "@RyanScottWrites", "title": "Charlize Theron on Playing a Female ‘James Bond’: I'm Very Old", "description": "Charlize Theron weighs in on the possibility of playing a female version of James Bond in the future.", "image": {"identifier": "https://cdn3.movieweb.com/i/article/npic5ZrnV6Dyxj2C8UqJnPhUGPgLLP/1200:100/Charlize-Theron-Responds-James-Bond-Female-Rumors.jpg", "alt": "Charlize Theron on Playing a Female James Bond: I'm Very Old"}, "url": "https://movieweb.com/charlize-theron-responds-james-bond-female-rumors/"}, "article": {"publisher": "https://www.facebook.com/movieweb/", "published_time": "2018-02-28T12:59:12-08:00", "modified_time": "2019-01-09T00:20:14-08:00", "section": "Movie News", "tag": "Movie News"}}, "movies": [], "publish_date": 1519851552.0, "source": "https://movieweb.com", "summary": ""}