{"url": "https://www.wmagazine.com/story/lindsay-lohan-paris-hilton-feud-instagram-pathological-liar", "text": "We may have come full circle to the aughts when it comes to fashion trends, but one reunion that won't be happening anytime soon is between Paris Hilton and Lindsay Lohan . One month after Hilton revealed that Lohan will not be invited to her upcoming wedding with Chris Zylka, explaining \"If you don't have anything nice to say, don't say anything at all,\" Hilton has become more specific about her issues with Lohan.\n\nThe heiress called the actress a \"pathological liar\" on Instagram after the fan account @paris2000s posted a few old videos of Lohan talking about their relationship. The videos, taken in 2006, show Lohan exhibiting conflicting feelings about Hilton. In one clip, Lohan says, \"This is a video that Paris Hilton... and I'm saying this on tape... she hit me last night, for no reason, apparently at my friend's house and I didn't know she'd be there. She hit me; she hit me with a drink and poured it all over me and it hurts and it's not okay.\"\n\nIn another video, though, the pair are still together. As Hilton is getting into a car, she shouts at Lohan who is approaching the vehicle, \"Lindsay, tell them the truth,\" to which Lohan replies, \"Paris is my friend,\" Lohan says, \"She's a nice person. Please leave us alone...she never did that, she's a good girl.\"\n\nThen, in another clip, Lohan calls Paris a \"c-nt,\" before a friend of her whispers something to the actress and Lohan clarifies her stance, saying, \"I never said that. Paris is my friend. I love her. I’ve known her since I was 15 years old.”\n\nLoading View on Instagram\n\nHilton left her own opinion in the comments section of the video, which was posted with the caption, \"The chronicles of the '00s troubled star Lindsay Lohan and her chaotic backtracking situations,\" writing, simply, \"#pathologicalliar.\"\n\nIt's worth noting that 2006 was the year Lohan and Hilton's rumored feud began, after a video of Hilton laughing at their mutual friend Brandon Davis calling the actress a \"fire crotch\" went viral. Last month, Hilton clarified their current relationship status, saying, \"I don't have any drama with anyone but I choose to not surround myself with certain people. Life is too short.\"\n\nPinterest © Instagram\n\nLohan is more or less attempting to do the same as she has stepped away from the spotlight to work on a film with an all-female team in Saudi Arabia. (She's currently based in Dubai.) Lohan recently reflected on how much life has changed since the aughts, telling W , “It’s [called] an iPhone. We didn’t have Instagram.… It would have been a lot calmer for me. When you think about it, paparazzi are not as crazy as they used to be when I used to be in New York. Now I can just [take a picture] before I walk out the door and then there is no story. It’s good, but it’s a little in-genuine.\" One thing about that does seem to be genuine: her and Hilton's feud.\n\nRelated : Reintroducing Lindsay Lohan: The Actress Has Found a Sense of Calm, and Is Now Ready to Launch a Beauty Brand", "images": ["https://www.wmagazine.com/images/w_logo.svg", "https://vulcan.condenastdigital.com/wmag-services/photos/592f1897cc1eac746f6e754f/1:1/w_128,c_limit/Brad%20Pitt.jpg", "https://media.wmagazine.com/photos/5b4f84be01e50e0b71b6fb3e/2:1/w_790,c_limit/Lindsay%20Lohan%20and%20Paris%20Hilton%20feud%20.jpg", "https://vulcan.condenastdigital.com/wmag-services/photos/592f188ecc1eac746f6e754d/1:1/w_128,c_limit/Rihanna.jpg", "https://media.wmagazine.com/photos/5b4f88a357e4ab30c538f5d2/master/w_320,c_limit/paris%2520hilton%2520lindsay%2520lohan%2520feud%2520.jpg", "https://vulcan.condenastdigital.com/wmag-services/photos/592f195a802c577242df3f00/1:1/w_128,c_limit/Cara%20Delevingne.jpg", "https://media.wmagazine.com/photos/5b4f84be01e50e0b71b6fb3e/4:3/w_1536/Lindsay%2520Lohan%2520and%2520Paris%2520Hilton%2520feud%2520.jpg"], "top_img": "https://media.wmagazine.com/photos/5b4f84be01e50e0b71b6fb3e/2:1/w_790,c_limit/Lindsay%20Lohan%20and%20Paris%20Hilton%20feud%20.jpg", "keywords": [], "authors": ["Marissa G. Muller", "J. Vespa Wireimage"], "canonical_link": "https://www.wmagazine.com/story/lindsay-lohan-paris-hilton-feud-instagram-pathological-liar", "title": "Lindsay Lohan and Paris Hilton's Feud Continues as the Heiress Calls Her Former Friend a ‘Pathological Liar’", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=no, width=device-width, initial-scale=1, maximum-scale=1", "msapplication-TileColor": "#ffffff", "msapplication-TileImage": "/images/favicon/ms-icon-144x144.png", "theme-color": "#ffffff", "author": "Marissa G. Muller", "copyright": "Copyright (c) Condé Nast 2019", "description": "We may have come full circle to the aughts, but one reunion that won't be happening any time soon is between Paris Hilton and Lindsay Lohan.", "publishDate": "2018-07-18T19:16:14Z", "keywords": "Paris Hilton,lindsay lohan,feuds,aughts,drama,news", "fb": {"app_id": 230068530489385, "admins": 108943, "pages": 40621875003}, "og": {"site_name": "W Magazine", "title": "Paris Hilton Just Called Lindsay Lohan a \"Pathological Liar,\" and, No, This Isn't a Headline From the Aughts", "url": "https://www.wmagazine.com/story/lindsay-lohan-paris-hilton-feud-instagram-pathological-liar", "description": "Their feud lives on.", "type": "article", "image": "https://media.wmagazine.com/photos/5b4f84be01e50e0b71b6fb3e/2:1/w_790,c_limit/Lindsay%20Lohan%20and%20Paris%20Hilton%20feud%20.jpg"}, "twitter": {"card": "summary_large_image", "site": "wmag", "title": "Paris Hilton Just Called Lindsay Lohan a \"Pathological Liar,\" and, No, This Isn't a Headline From the Aughts", "description": "Their feud lives on.", "image": "https://media.wmagazine.com/photos/5b4f84be01e50e0b71b6fb3e/2:1/w_790,c_limit/Lindsay%20Lohan%20and%20Paris%20Hilton%20feud%20.jpg?mbid=social_retweet", "domain": "wmagazine.com"}, "version": "2.0.0"}, "movies": [], "publish_date": 1531941374.0, "source": "https://www.wmagazine.com", "summary": ""}