{"url": "https://z951.com/news/030030-celine-dion-shares-never-before-seen-photos-to-mark-50/", "text": "Celine Dion celebrated turning 50 with never-before-seen photos in a moving post on Facebook.\n\nThe singer’s team celebrated the milestone birthday in a sweet video shared on the social media site, treating fans to some private family snaps.\n\nSet to Celine’s hits including “I Drove All Night,” “It’s All Coming Back to Me Now” and “Where Does My Heart Beat Now,” the clip revealed snaps from the singer’s childhood, as well as from the beginning of her music career.\n\nIt also documented her romance with late husband Rene Angelil, who lost his battle with cancer in January 2016 at the age of 73, and sweet moments with the couple’s sons Rene-Charles, 17, and seven-year-old twins Nelson and Eddy.\n\n“HAPPY 50th BIRTHDAY CÉLINE!” the video was captioned. “From the very first song written with her Mom and brother, we take a look back at some of the precious moments in Celine’s personal and professional life. Make sure you comment below to wish Celine a Happy Birthday!”\n\nIt’s been a turbulent few months for the singer, who has had to cancel a series of her residency gigs at The Colosseum at Caesars Palace until April 18 after suffering from middle ear condition Patulous Eustachian tube for almost a year, making it “extremely difficult to sing.”\n\nCeline, who tragically lost her brother Daniel two days after Rene died, was keeping the condition under control with ear drops, but made the decision to undergo a “minimally invasive surgical procedure” to help the cure the condition.\n\nA source told “Entertainment Tonight” that Celine planned on celebrating her big birthday during her concert at The Colosseum, but has chosen a quieter alternative now her gigs have been scrapped.\n\n“She is now looking forward to spending time with her kids and loved ones on her big day,” the source said.", "images": ["https://z951.com/wp-content/themes/wqmz/img/logo.png", "https://news.sagacom.com/wp-content/blogs.dir/3/files/2019/07/AP_19179691992870-100x80.jpg", "https://news.sagacom.com/wp-content/blogs.dir/3/files/2019/07/AP_19184485299559-100x80.jpg", "https://news.sagacom.com/wp-content/blogs.dir/3/files/2017/05/donutCLIPART-100x80.jpg", "https://news.sagacom.com/wp-content/blogs.dir/3/files/2019/07/AP_19190543756508-100x80.jpg", "https://news.sagacom.com/wp-content/blogs.dir/3/files/2018/04/celine50212-620x400.jpg", "https://news.sagacom.com/wp-content/blogs.dir/3/files/2019/07/AP_19169703376574-100x80.jpg"], "top_img": "https://news.sagacom.com/wp-content/blogs.dir/3/files/2018/04/celine50212-620x400.jpg", "keywords": [], "authors": [], "canonical_link": "http://z951.com/news/030030-celine-dion-shares-never-before-seen-photos-to-mark-50/", "title": "Celine Dion shares never-before-seen photos to mark 50", "meta_data": {"application-name": "Z 95.1", "msapplication-TileColor": "#000000", "msapplication-TileImage": "https://z951.com/wp-content/themes/wqmz/img/touch-icon-144.png", "og": {"image": "https://news.sagacom.com/wp-content/blogs.dir/3/files/2018/04/celine50212-620x400.jpg", "url": "http://z951.com/news/030030-celine-dion-shares-never-before-seen-photos-to-mark-50/", "site_name": "Z 95.1", "type": "blog", "description": "The singer's team celebrated the milestone birthday in a sweet video shared on the social media site, treating fans to some private family snaps.", "title": "Celine Dion shares never-before-seen photos to mark 50 | Z 95.1"}, "viewport": "width=device-width, initial-scale=1.0, user-scalable=no", "”description”": "”Picks", "generator": "WordPress 5.2.2"}, "movies": [], "publish_date": null, "source": "https://z951.com", "summary": ""}