{"url": "https://www.quora.com/Did-you-like-Gal-Gadot-as-Wonder-Woman", "text": "Gal Gadot’s Wonder Woman is a refreshing update on the character, at once, designed for the modern era, and a classic version for all-time.\n\nCasting by Director/Producer/Writer Zack Snyder\n\nThere’s a cabal of Zack Snyder haters out there (I’m definitely not one of them), but the casting, and much of the character flourishes of Gal Gadot’s Wonder Woman can be attributed to his eye.\n\nLet’s not forget that Gal Gadot was first introduced in Batman v Superman: Dawn of Justice, and that Snyder is listed as a contributing writer for Wonder Woman.\n\nHer accent and her look is much closer to the type of person who would have been a classic Amazon. If they had chosen an actress from Nebraska it wouldn't have worked as well (nothing against the lovely women from Nebraska).\n\nGal Gadot is a Wonder Woman for a new age. Many fanboys wanted a voluptuous clone of 70s Wonder Woman, Linda Carter. What we got instead is someone lithe and graceful which is much more convincing in the role.\n\nMake no mistake though, Gal Gadot is gorgeous—stunning even. She is every bit the goddess she portrays.\n\nThe modern makeover of Wonder Woman includes a costume that looks more like Roman gladiator armor, than a spandex outfit made out of the American flag. Gal Gadot looks fantastic, and still functional, in that costume. In fact, they make fun of how constricting women’s clothing of the day was.\n\nMuch of the success of Wonder Woman, and more importantly, the casting of Gal Gadot, is due to Zack Snyder.\n\nGal Gadot’s Performance\n\nGal Gadot was perfect for the role of Diana/Wonder Woman. She made me believe several different things that usually don't go together.\n\nHer innocence - She’s young and she was raised in an utopian sheltered society with only women. When she ventures into the modern world, at war no less, her ability to portray someone who doesn’t understand why people do the things they do is completely convincing.\n\n- She’s young and she was raised in an utopian sheltered society with only women. When she ventures into the modern world, at war no less, her ability to portray someone who doesn’t understand why people do the things they do is completely convincing. She’s curious - Not everyone can pull off being surprised at the modern world. I was reminded of Jeff Bridges’ Starman\n\n- Not everyone can pull off being surprised at the modern world. I was reminded of Her sense of duty - When she went headlong into battle, despite the warnings from everyone, she demonstrated courage and leadership. Not only is that a great message for everyone, it was inspiring. I’m not sure how many other actresses could have made those speeches, and made me totally buy into her performance.\n\n- When she went headlong into battle, despite the warnings from everyone, she demonstrated courage and leadership. Not only is that a great message for everyone, it was inspiring. I’m not sure how many other actresses could have made those speeches, and made me totally buy into her performance. She's a soldier - Her Wonder Woman is far more physical than the version from the 70s and her fighting prowess translates exceptionally well on film. She can hang with any of the super dudes out there when it comes to combat. Maybe Gal Gadot’s experience as a real soldier\n\n- Her Wonder Woman is far more physical than the version from the 70s and her fighting prowess translates exceptionally well on film. She can hang with any of the super dudes out there when it comes to combat. Maybe Chemistry - The only thing that I didn't entirely buy was the chemistry between her and Chris Pine’s\n\nFrankly, Gal Gadot is perfect as Wonder Woman. And she’s the best that’s ever been.\n\nWhether it’s the perfect casting to match the character, the modern updates to her look, or her wide-ranging performance, Gal Gadot redefined Wonder Woman.\n\nShe completely owns the role now.", "images": ["https://qph.fs.quoracdn.net/main-qimg-c255166b9f3f0504a8437cee92a849d7", "https://qph.fs.quoracdn.net/main-qimg-e0b68b933dfdaf9772b15e0e0ceb5b29-c", "https://qsf.fs.quoracdn.net/-3-images.favicon.ico-26-ae77b637b1e7ed2c.ico", "https://qph.fs.quoracdn.net/main-thumb-3611376-100-mhjwjksqxdxipqzhgdkzvcjgdnkfppuk.jpeg", "https://qph.fs.quoracdn.net/main-qimg-274d73a7e65dd6da23d9d141c4bb07ed"], "top_img": "https://qsf.fs.quoracdn.net/-3-images.favicon.ico-26-ae77b637b1e7ed2c.ico", "keywords": [], "authors": [], "canonical_link": "https://www.quora.com/Did-you-like-Gal-Gadot-as-Wonder-Woman", "title": "Did you like Gal Gadot as Wonder Woman?", "meta_data": {"robots": "noarchive"}, "movies": [], "publish_date": null, "source": "https://www.quora.com", "summary": ""}