{"url": "https://www.cbc.ca/news/entertainment/kathy-griffin-lawyer-presser-1.4142815", "text": "Embattled comedian Kathy Griffin says she's not afraid of Donald Trump and plans to keep making fun of him, but maintained that she's sorry for a video that depicted her holding a likeness of the U.S. president's severed, bloody head.\n\nAt a rambling press conference Friday, Griffin tearfully predicted her career is over and said Trump \"broke me.\" Since the video was posted Tuesday, she has lost her job co-hosting CNN's New Year's Eve special and had five comedy shows cancelled. Trump, first lady Melania Trump and Donald Trump Jr. have publicly criticized the video.\n\nGriffin, who asserted that she has been contacted by the Secret Service, said the Trumps are \"trying to ruin my rights forever.\"\n\nKathy Griffin should be ashamed of herself. My children, especially my 11 year old son, Barron, are having a hard time with this. Sick! —@realDonaldTrump\n\nThe Secret Service declined comment Friday, while White House press secretary Sean Spicer said: \"The president, the first lady and the Secret Service have all made very clear their view on those thoughts.\"\n\nGriffin, 56, repeated her claim that the video was a parody, meant as a pointed comeback to Trump's remark last summer that former Fox News Channel personality Megyn Kelly had \"blood coming out of her eyes, blood coming out of wherever.\"\n\n\"I'm not laying down for this guy,\" she said in one defiant moment. \"I'm going to keep making jokes about this guy.\"\n\nRepublican Party spokesman Mike Reed called the press conference a \"desperate attempt\" to change the conversation.\n\n\"Kathy Griffin's career was over long before she attempted to make a disgusting joke about decapitating the President,\" Reed said. \"What she did was wrong and President Trump and his family have every right to condemn it.\"\n\nGriffin appeared surprised at the number of cameras and reporters in a packed conference room at her lawyer's office, her hands shaking at one point when she took a sip of water. She switched between contriteness and combativeness during the press conference, during which she attempted several nervous jokes that drew laughs mostly from her attorney, Lisa Bloom.\n\nBloom said the comedian has a First Amendment right to make fun of the president.\n\nKathy Griffin on Trump: 'I'm going to make fun of him more now' 0:26\n\n\"Whether or not you get, or like, her artistic expression, in America, Kathy has the right to parody the president,\" Bloom said. \"She never imagined it would be misinterpreted as a threat of violence against Trump.\"\n\nBloom, a former truTV anchor and lawyer Gloria Allred's daughter, has represented Wendy Walsh, who has accused former Fox News Channel personality Bill O'Reilly of hurting her career after she spurned his advances. O'Reilly has denied the accusations\n\nWave of cancellations\n\nVenues in New Jersey, New York, New Mexico and Pennsylvania cancelled upcoming shows. The Community Arts Theater in Williamsport, Penn., posted on its website that the show had been dropped \"due to the recent controversy surrounding Kathy Griffin and the concern for the safety and security of our patrons and staff.\"\n\nKathy Griffin has lost a host of jobs since releasing images from her controversial photo and video shoot. (Lucas Jackson/Reuters)\n\nSen. Al Franken also dis-invited Griffin from an event promoting his new book, Giant of the Senate.\n\n\"After hearing from many Minnesotans who were rightfully offended, I've come to the conclusion that it would be best for her not to participate in the event we had previously scheduled,\" the Minnesota Democrat said Thursday, a day after he had said she was still welcome.\n\n\"I understand why Minnesotans were upset by this, and I take that very seriously.\"\n\nHe said what Griffin did \"was inappropriate and not something that should be anywhere in our national discourse.\"\n\nAn endorsement deal with Squatty Potty also ended.\n\nThough Griffin apologized within hours of the images appearing online Tuesday, they were met with swift and widespread condemnation.\n\nTrump later tweeted that Griffin \"should be ashamed of herself\" for posting the images. New Jersey Gov. Chris Christie on Thursday called Griffin \"disgusting\" and said the photo was \"completely outrageous.\"\n\nFor the record, I am appalled by the photo shoot Kathy Griffin took part in. It is clearly disgusting and completely inappropriate. —@andersoncooper\n\nEven Anderson Cooper, her CNN co-host for the New Year's Eve show, condemned the images. Griffin said she has not spoken to Cooper since, and appeared visibly upset and struggled to speak when fielding questions about Cooper.\n\nThe comic has faced controversies before for her abrasive humour, but none as widespread as the one generated by Tuesday's images. ​\n\nGriffin has had a few high-profile colleagues defend her, including Jim Carrey and Larry King.\n\nJim Carrey defends Kathy Griffin's stunt: \"It's the job of the comedian to cross the line at all times.\" <a href=\"https://t.co/v8cxc5hOHi\">https://t.co/v8cxc5hOHi</a> <a href=\"https://t.co/Wt7rwKgGR3\">pic.twitter.com/Wt7rwKgGR3</a> —@USATODAY", "images": ["https://i.cbc.ca/1.2758524.1410108371!/fileImage/httpImage/image.jpg_gen/derivatives/original_780/joan-rivers-kathy-griffin.jpg", "https://www.cbc.ca/a/static/media/logo_cbc-radio-canada.svg", "https://i.cbc.ca/1.4143399.1496422902!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/700058974ap00028-kathy-grif.jpg", "https://i.cbc.ca/1.4143399.1496422902!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/700058974ap00028-kathy-grif.jpg"], "top_img": "https://i.cbc.ca/1.4143399.1496422902!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/700058974ap00028-kathy-grif.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.cbc.ca/news/entertainment/kathy-griffin-lawyer-presser-1.4142815", "title": "", "meta_data": {"viewport": "width=device-width, initial-scale=1", "og": {"site_name": "CBC", "url": "https://www.cbc.ca/news/entertainment/kathy-griffin-lawyer-presser-1.4142815", "title": "Secret Service investigating Kathy Griffin amid Trump image controversy, comic says | CBC News", "image": "https://i.cbc.ca/1.4143399.1496422902!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/700058974ap00028-kathy-grif.jpg", "description": "Embattled comedian Kathy Griffin says she's not afraid of Donald Trump and plans to keep making fun of him, but maintained that she's sorry for a video that depicted her holding a likeness of the president's severed, bloody head.", "locale": "en_US", "type": "article"}, "fb": {"pages": 5823419603}, "vf": {"section": "2.635", "unique_id": "1.4142815"}, "google-site-verification": "pJy_QmRvDz2tr7X8eQ6Y1L3Se-8RWM_PpJX42Pr_fYo", "twitter": {"site": "@cbc", "card": "summary_large_image"}, "description": "Embattled comedian Kathy Griffin says she's not afraid of Donald Trump and plans to keep making fun of him, but maintained that she's sorry for a video that depicted her holding a likeness of the president's severed, bloody head."}, "movies": [], "publish_date": null, "source": "https://www.cbc.ca", "summary": ""}