{"url": "https://www.gobankingrates.com/net-worth/celebrities/scarlett-johansson-net-worth/", "text": "Scarlett Johansson has gone from being a child actor to the highest paid actress in the world.\n\nStarring as Black Widow in the Marvel Cinematic Universe has been a career-defining role.\n\nShe’ll next appear in the upcoming “Avengers 4” — officially titled “Avengers: Endgame” — in 2019; the film’s first trailer was just released.\n\n\n\nThe fourth “Avengers” film — the direct sequel to the record-breaking “Avengers: Infinity War” — isn’t coming out for another five months, but fans are hungry for any scrap of information they can glean. Anticipation to simply see the film’s trailer reached a fever pitch, and just in time, the first trailer for “Avengers: Endgame” was released. Starring as Black Widow, Scarlett Johansson is featured prominently in it.\n\nFrom “The Horse Whisperer” to “Ghost in a Shell,” Johansson has worked her way up to reign as one of wealthiest women in Hollywood. She has starred as Natasha Romanoff, aka Black Widow, in six Marvel movies so far, with two more — including “Avengers: Endgame” — still to premiere. Learn how Johansson became one of the highest-paid women in Hollywood.\n\n\n\nBirthdate: Nov. 22, 1984\n\nNet Worth: $140 million\n\nMain Source of Income: acting and endorsements\n\nCareer Highlights: Taking the role of Black Widow and acting in at least eight Marvel movies\n\nScarlett Johansson Net Worth: $140 Million\n\nScarlett Johansson earned the No. 1 spot on Forbes’ Highest Paid Actresses list for 2018, with $40.5 million in earnings. She hasn’t always earned top dollar for her work, however. In 2010, Johansson was paid just $400,000 to star in “Iron Man 2,” according to the Los Angeles Times, in her first turn as Natasha Romanoff. Since then, things have changed.\n\nJohansson was paid nearly $20 million for her work as the Black Widow in 2015’s “Avengers: Age of Ultron,” and Forbes cited her earnings at $17.5 million for the 2017 film “Ghost in the Shell.” The publication revealed her standard pay rate is more than $10 million per film. This has boosted her net worth to $140 million, according to Celebrity Net Worth.\n\nDon’t Miss: The Richest Action Stars of All Time — and Their Top-Grossing Films\n\nMovies aren’t Johansson’s only source of income. She has also earned an undisclosed amount of money from Dolce & Gabbana and SodaStream endorsements, according to Forbes. The latter actually cost the actress her longtime role as an Oxfam ambassador; she stepped down from the position in 2014 over a difference in opinion with the group over SodaStream’s West Bank factory.\n\nScarlett Johansson: Black Widow and Other Career Highlights\n\nJohansson began acting in commercials at age 7, but quickly decided she’d prefer to be on the big screen. She started taking acting classes on weekends and landed a part in the off-Broadway production “Sophistry” — opposite Ethan Hawke — by age 8. Her big break came at age 13 when she gained worldwide notoriety for her critically acclaimed performance in “The Horse Whisperer.”\n\nJohansson solidified herself as a superstar with her starring role in 2003’s “Lost in Translation.” This earned her a Golden Globe nomination for best comedic actress. That same year, she earned another Golden Globe nod for her work in “Girl With a Pearl Earring.”\n\nSince then she’s turned into a bona fide blockbuster star, with her Marvel movies raking in hundreds of millions — even billions — of dollars. “Ghost in the Shell” was a rare misfire for Johansson. She might have earned millions for it, but the film only grossed $40 million domestically.\n\nJohansson’s talents extend to the stage, where she has starred in two Broadway plays — “A View From the Bridge” in 2010 and “Cat on a Hot Tin Roof” in 2013. Her performance in “A View From the Bridge” landed her a Tony Award for Best Featured Actress in a Play.\n\nDid You Know? Scarlett Johansson and Other Celebs Who Dabbled in Music\n\nScarlett Johansson and Chris Evans\n\nThroughout the years, Johansson has worked with many Hollywood heavyweights, but none as frequently as Chris Evans. The famous friends have appeared in seven films together, with an eighth on the way.\n\nIn 2004, the duo starred in “The Perfect Score” together, followed by a repeat performance in “The Nanny Diaries” in 2007. Their paths first crossed in the Marvel Cinematic Universe in the 2012 film “The Avengers.” Since that they have been in four more Marvel movies together. The upcoming “Avengers: Endgame” will be their next joint project.\n\nScarlett Johansson’s Personal Life\n\nScarlett Johansson’s divorce from French journalist Romain Dauriac was finalized in September 2017. The couple started dating in late 2012, got engaged in 2013 and welcomed their first child, Rose Dorothy Dauriac, in September 2014.\n\nThey wed in a private ceremony in October 2014, and she filed for divorce in March 2017. Terms of the divorce were not made public.\n\nBefore Dauriac came into the picture, Scarlett Johansson was married to Ryan Reynolds for about three years, beginning in September 2008.\n\nJohansson is currently dating Colin Jost, the co-anchor of Weekend Update and a writer on “Saturday Night Live.” The couple have been dating since shortly after she hosted the show for the fifth time in March 2017, according to an E! News report.\n\nWhat’s Coming Up for Scarlett Johansson?\n\nJohansson’s stand-alone “Black Widow” movie is currently in pre-production. She’ll earn $15 million for the acting turn, according to The Hollywood Reporter. After over two decades in the spotlight, Johansson has proven herself as a Hollywood mainstay. Keep a close eye on this talented actress to see what other projects are in store for her and how much they’ll raise her net worth.\n\nSee how Scarlett Johansson compares to her male counterparts — compare the salaries of the richest actresses with the richest actors’.\n\nMore on Celebrity Net Worths\n\nWe make money easy. Get weekly email updates, including expert advice to help you Live Richer™.", "images": ["https://cdn.gobankingrates.com/wp-content/themes/gbr-v2/img/home/aol.png", "https://cdn.gobankingrates.com/wp-content/themes/gbr-v2/img/home/time-money.png", "https://cdn.gobankingrates.com/wp-content/themes/gbr-v2/img/logo-zergnet.png", "https://cdn.gobankingrates.com/wp-content/themes/gbr-v2/img/gbr-logo.svg.gzip", "https://cdn.gobankingrates.com/wp-content/themes/gbr-v2/img/home/fortune.png", "https://cdn.gobankingrates.com/wp-content/themes/gbr-v2/img/home/cnn-money.png", "https://cdn.gobankingrates.com/wp-content/themes/gbr-v2/img/home/msn.png", "https://cdn.gobankingrates.com/wp-content/themes/gbr-v2/img/home/cbs.png", "https://cdn.gobankingrates.com/wp-content/uploads/2018/12/Scarlett-Johannson-Avengers-Age-of-Ultron-shutterstock_5886283bn-1024x576.jpg"], "top_img": "https://cdn.gobankingrates.com/wp-content/uploads/2018/12/Scarlett-Johannson-Avengers-Age-of-Ultron-shutterstock_5886283bn-1024x576.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.gobankingrates.com/net-worth/celebrities/scarlett-johansson-net-worth/", "title": "Scarlett Johansson’s Net Worth as Fans Eagerly Await ‘Avengers: Endgame’", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, shrink-to-fit=no", "description": "Scarlett Johansson has gone from being a child actor to the highest paid actress in the world. Starring as Black Widow in the Marvel Cinematic Universe has been a career-defining role. She'll next...", "keywords": "GOBankingRates,avengers,avengers 4,chris evans,entertainment,finance,marvel,scarlett johansson,celebrities,net worth", "og": {"title": "Scarlett Johansson’s Net Worth as Fans Eagerly Await ‘Avengers: Endgame’", "type": "article", "url": "https://www.gobankingrates.com/net-worth/celebrities/scarlett-johansson-net-worth/", "image": "https://cdn.gobankingrates.com/wp-content/uploads/2018/12/Scarlett-Johannson-Avengers-Age-of-Ultron-shutterstock_5886283bn-1024x576.jpg", "site_name": "GOBankingRates", "description": "The \"Avengers\" actress sees her net worth continue to grow."}, "article": {"published_time": "2018-12-11T00:10:09Z", "modified_time": "2018-12-11T00:10:23Z"}, "twitter": {"card": "summary_large_image", "title": "Scarlett Johansson’s Net Worth as Fans Eagerly Await ‘Avengers: Endgame’", "description": "The \"Avengers\" actress sees her net worth continue to grow.", "image": "https://cdn.gobankingrates.com/wp-content/uploads/2018/12/Scarlett-Johannson-Avengers-Age-of-Ultron-shutterstock_5886283bn-1024x576.jpg"}, "thumbnail": "https://cdn.gobankingrates.com/wp-content/uploads/2018/12/Scarlett-Johannson-Avengers-Age-of-Ultron-shutterstock_5886283bn-848x477.jpg", "original-source": "https://www.gobankingrates.com/net-worth/celebrities/scarlett-johansson-net-worth/", "google-site-verification": "UM4IRrnbuHbpidFzGcubzUTnYM2nSbbsENyWzajsLtg", "msvalidate.01": "835EF260572EA20ACFC7CE1547620982", "fb": {"pages": 191525857260}, "p": {"domain_verify": "5c213d8c1e1470fb2409d7569153017a"}, "msapplication-TileImage": "https://cdn.gobankingrates.com/wp-content/uploads/2017/04/cropped-gbr-logo_go_site_id-270x270.png", "position": 4}, "movies": [], "publish_date": 1544487009.0, "source": "https://www.gobankingrates.com", "summary": ""}