{"url": "https://www.thethings.com/15-explosive-things-revealed-in-the-bachelorette-men-tell-all/", "text": "There's no denying that The Bachelor franchise has been churning out quality reality TV for years now. Well, maybe \"quality\" isn't the best choice of words, but people can't get enough of it. Fan's are so interested in the drama between contestants that an entire Men Tell All special is dedicated to rehashing the drama of the past season and HOPEFULLY clearing the air.\n\nWell, it's that time of year again, and the men of The Bachelorette got together with Rachel Lindsay to tell their side of the story. There were some hard-hitting subjects; race was definitely a big talking point, and though the guys kept it mostly civil, there were plenty of crazy moments to be had. Here are 15 moments from The Bachelorette Men Tell All that totally shocked us!\n\nContinue scrolling to keep reading Click the button below to start this article in quick view Share Tweet Email Copy Link Copied\n\n15 Lee's Racist Tweets Got Called All The Way Out\n\nLee's presence on The Bachelorette has been infuriating fans for quite a while now. Once the show aired, it came out that Lee had some tweets in his past that contained both very racist and sexist remarks. It left fans to wonder why Lee would go on a show to win the love of a black woman, and also left us wondering why ABC even let him through in the first place. ABC definitely does their research on these guys, which makes us think that they did this all on purpose for shock value. TBH, I'm not surprised, it is The Bachelor franchise after all, but some things just aren't acceptable. One of Lee's worst tweets compares the NAACP to the KKK, calling them both racist organizations. Yikes! At least Anthony was there to give Lee a good reality check.\n\n14 Dean Questioned Rachel's Love For Him\n\nWhen the \"let's take a look\" reel started playing for Dean, I'll admit I started hyperventilating a bit. Knowing Dean would have to relive his horrible family visit and his heartbreak by Rachel again on screen was just too much to bare. A lot of fans were mad at Rachel when she sent Dean home after telling him she was falling in love with him. In his biggest moment of vulnerability, she reassured him of her feelings, all to rip it out from under him the next night at the rose ceremony. So, like us, Dean had a few questions. Rachel stuck with her original sentiment, that she truly did mean it and would never say that just to say it. I do believe her, but I still wish she hadn't brought him up so high just to let him down. Here's a petition to make Dean the next Bachelor!\n\n13 Anthony Explained Systemic Racism And Got A Standing Ovation\n\nYes, we as The Bachelor Nation definitely slept on Fulbright Scholar Anthony up until now. Everyone realized a little too late that Anthony may in fact be the best Bachelorette contestant we've ever had. Anthony called out Lee by perfectly and eloquently explaining his racism to him so that Lee can finally understand the real issue. One particular part of Anthony's speech hit viewers hard:\n\n\"It's ingrained in your behavior to the point of invisibility. It's still pushing you to behave in a certain way towards Kenny, towards Eric, towards me, in a way that you don't even recognize. So where are you now? Are you acknowledging that even if you didn't intend it, are your actions motivated by racist thoughts that are implicitly embedded in your mentality? That's the real question.\"\n\nHe got a well deserved standing ovation from the audience, and a lot of praise on social media, too. Thanks for setting such a great example Anthony and asking the hard questions!\n\n12 DeMario Tried To Justify His Trifling Ways\n\nRemember that iconic moment when DeMario LITERALLY looked right at a woman he had been sleeping with for months and said \"Oh, who's this?\" It's a moment that will go down in Bachelor Nation history, and DeMario will go down for being one of the worst contestants to date. Rachel had a great reason for telling DeMario to \"get the f*ck out,\" and it wasn't because he had a woman recently in his life, it's because he lied about it. DeMario tried to defend his actions on Men Tell All by calling his ex a liar and compared himself to Bill Clinton. Yeah, as you can probably guess, NONE of it went over well, and everyone still basically hates this dude. At this point, it's not much of a surprise that he was involved in the Bachelor in Paradise scandal.\n\n11 Kenny's Daughter Made An Appearance\n\nIf you know anything about Kenny on The Bachelorette, you know that he is absolutely obsessed with his daughter Makenzi. Whenever he Facetimed with her, he would burst into tears, and fans would collectively sob along with him. Ultimately, it seemed like Kenny couldn't be away from his daughter for as long as he thought, and it was part of the reason he ended up being sent home. Rachel and the rest of the viewers definitely saw what a great, loving dad he was, so it was only appropriate for Makenzi to finally make her appearance on the show. And what a beautiful girl she is! Some Twitter users even suggested Makenzi get her own show to help find her dad a wife. Now THAT is the kind of quality TV I want to see on my screen!\n\n10 Rachel Threw Shade At How Josiah Handled Leaving\n\nAh yes, Josiah, one of the most cocky Bachelorette contestants we've ever had the displeasure of watching. I liked Josiah at first. He seemed to be a great fit for Rachel being a lawyer and all. But it turns out that Josiah is just way too cocky for his own good. I don't think Rachel really saw that side of him until she watched the show, and she was not about to let it slide. She made a comment that was DEFINITELY meant to shade the sh*t out of Josiah, saying \"Salty, just like Josiah on his way home.\" This, of course, refers to how poorly he took his rejection, even telling the cameras that something is wrong with Rachel's brain! Next time, just take your L like a champ and move on.\n\n9 The Banana Drama Was Addressed\n\nIf you were looking for answers as to whether Blake actually ate bananas over Whaboom's bed like a psychopath, well, you may never know. Whaboom (aka Lucas) has accused Blake of doing some very strange things to him in the past, and even accused Blake of having a crush on him! If having a crush means looming over someone's bed while eating food, I guess I've never had one. Lucas and Blake had a lot of issues during the filming of The Bachelorette, likely stemming from their history together which involved a girlfriend/roommate situation that is still unclear. Ultimately they couldn't focus enough on Rachel and both got sent home. Will we ever know what happened with the banana? An even better question, do we ever want to know?\n\n8 The Bachelorette Men Served LOOKS\n\nAnyone else ready for this album to drop? 😍 #MenTellAll pic.twitter.com/QvwgVe295X — Caila Quinn (@CailaQuinn) August 1, 2017\n\nImagine for a second being Rachel Lindsay. You have to confront multiple exes on live TV, all while they sit there looking fine AF and reminding you why you fell for them in the first place. It can't be easy looking at this group of guys and not having at least a few past regrets, maybe even questioning if she chose the right one. In this particular picture, Dean, Alex, and Adam are looking straight FIRE! As former Bachelor and BIP contestant Caila pointed out, it looks like they're about to drop the hottest album of the year. Between Dean's family issues, Adam's doll obsession, and Alex's winning looks, this band would have some SERIOUS material to work with. I guess we'll have to settle for seeing a few of them in Paradise!\n\n7 They Forgot To Include Blake K\n\nDid anyone notice that not ALL of Rachel's contestants were actually present for the Men Tell All? Well, TBH, I didn't notice until Twitter pointed it out. Poor Blake K. was completely left out of the show! There was no explanation for this, and nobody who was actually apart of filming seemed to take notice. Well, they probably did, but I guess it wasn't important enough to mention. Blake K. always seemed like one of those guys who's a bit TOO normal for the show. When someone is down to earth with a good head on their shoulders, sometimes it's easy to wonder what they're doing on reality TV at all. Maybe the poor guy just wanted love! Hopefully there's a good reason he wasn't there, and no bad blood between him and the Bachelor franchise.\n\n6 Rachel Addressed Matt And Adam's Lack Of Screen Time\n\nMatt and Adam were a topic of confusion for a long time on The Bachelorette. They made it to fifth and sixth place of all the men, but there was basically little to no focus on their time with Rachel at all. It started to just get confusing as to why they were even still there. Rachel clearly felt the same way, and it bothered her so much that she made sure to address it on the Men Tell All special. She talked to Chris Harrison about how she wishes people could have seen more of Matt and Adam to understand why she kept them around for so long. Uh, yeah, so do we! At least the total lack of focus on the two finalists made it much easier to watch them go.\n\n5 It Was Revealed That Dean Is Going To Paradise\n\nFor those of us in Bachelor Nation who want to see Dean as the next Bachelor, this could actually be great news! It was announced on the Men Tell All special that Dean would, in fact, be joining a bunch of other past Bachelor/Bachelorette rejects in Paradise this summer for the spin-off show; Bachelor in Paradise.\n\nThe reason this could be good news for our possible next Bachelor is that Nick Viall, the most recent Bachelor, followed in these same steps before he was chosen. To be fair, Nick had a rockier road with way more rejection in his past, but Dean has been publicly humiliated a few times now, so they're about even.\n\nIs it bad to say that I hope Dean DOESN'T find love in Paradise so that he's a shoo-in for the next Bachelor? I don't want him to get heartbroken, I just hope he's not interested in anyone and moves onto bigger and better things. He deserves it, and so do our TV screens!\n\n4 Whaboom Was Called Out For His Whabooming\n\nWell, it turns out Blake isn't the only one with a problem with Lucas, better known as Whaboom! They definitely had the biggest feud, but more than a couple of the former contestants had something to say about Lucas' self-promotion on the show. When you wear a shirt with your own face on it AND your own catchphrase—which you also constantly use—it's pretty clear that your motives for being on the show are not pure. There were moments that Lucas tried to keep it real, and he ALMOST sounded sincere a few times. But ultimately, the contestants and Rachel saw right through it. It wasn't exactly a difficult act to spot out. While the whole \"Whaboom!\" thing ruined his chances with Rachel, I'm sure there's a girl out there just as crazy that will be perfect for him.\n\n3 Fred Acted Like He Was A Top Finalist\n\nOne of the more annoying parts of the Men Tell All episodes is that they REALLY rely on dredging up past issues, some of which we've honestly forgotten all about. One of the more strange relationships on Rachel's season was between her and contestant Fred. Fred knew Rachel from childhood, having gone to the same school as her, and he even attended a camp where she was a counselor. Rachel ultimately couldn't get past the bad kid she remembered, and sent Fred home. So, of course, he had to bring up how she meant SO much more to him than the other guys because he had liked her since childhood, and he really thought they had a connection. Sure, Fred, sure. I'm pretty sure there were still, like, 10 guys left when he went home. It sucks, but let's be honest, he was never a front-runner.\n\n2 We Got Recaps Of Past Men Tell All Episodes That Nobody Asked For\n\nNothing says \"we have no material\" like flashing back to previous Men Tell All episodes, reminding us just how insane we are for continuing to watch all these years. TBH, I feel like they had plenty of material to work with, and we really didn't need to hash up contestants from other seasons in a montage to spike interest. For instance, we didn't get to see Peter in ANY bloopers, which gave fans having Peter-withdrawal some serious stuff to vent about on Twitter. We didn't even get to hear from every contestant, and, as usual, the time was taken up by about five of the same guys who caused all the problems from day one. We did, however, have time for Anthony's life changing speech, so I guess all is good in the world.\n\n1 Rachel Clapped Back to Dean\n\nI get tonight is #MenTellAll but we need to honor the most epic clapback in #bachelorette history. pic.twitter.com/Eg7prdcjDt — Alyssa Hyacinthe (@lyss_hyacinthe) August 1, 2017\n\nOkay, so this didn't technically happen on the show, but during the airing of the Men Tell All episode, a tweet started to go viral that showed Rachel clapping back to none other than... DEAN? Well, someone posted an Instagram photo with Dean and a caption joking about Dean's infamous \"I'm ready to go black\" joke. Rachel, however, was having none of it, and had to remind everyone that he went back, just not by his own choice.\n\nDean, the wonderful man he is, actually addressed his comment on another Instagram post, saying \"I would like to apologize for the other day when a caption and comment were posted that came across as insensitive. The last thing that was meant by any of that was to be disrespectful.\" OKAY, you are forgiven! Now get your butt over to the Bachelor mansion and start filming that next season!", "images": ["https://www.thethings.com/public/build/images/cb-logo-full-white.afca2e29.svg", "https://static0.thethingsimages.com/wordpress/wp-content/uploads/2017/08/Feature.jpg", "https://www.thethings.com/public/build/images/tr-logo-full-white.090c581a.svg", "https://www.thethings.com/public/build/images/th-logo-full-white.7684e614.svg", "https://q.quora.com/_/ad/91f52889f6a04390a65ad2591c59986e/pixel?tag=ViewContent&noscript=1", "https://www.facebook.com/tr?id=952311624915190&ev=PageView&noscript=1", "https://www.thethings.com/public/build/images/tq-logo-full-white.7436bde3.svg", "https://www.thethings.com/public/build/images/tt-logo-full-white.04a6f0d4.svg", "https://www.thethings.com/public/build/images/ts-logo-full-white.54beb4cf.svg", "https://www.thethings.com/public/build/images/hc-logo-full-white.5f66cfe4.svg", "https://www.thethings.com/public/build/images/tg-logo-full-white.fc9e742a.svg", "http://b.scorecardresearch.com/p?c1=2&c2=21868715&cv=2.0&cj=1", "https://www.thethings.com/public/build/images/mm-logo-full-white.fe72c74c.svg", "https://www.thethings.com/public/build/images/sr-logo-full-white.b0cc2b44.svg", "https://www.thethings.com/public/build/images/bg-logo-full-white.8242bbb9.svg", "https://www.thethings.com/public/build/images/tv-logo-full-white.642d3d01.svg"], "top_img": "https://static0.thethingsimages.com/wordpress/wp-content/uploads/2017/08/Feature.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.thethings.com/15-explosive-things-revealed-in-the-bachelorette-men-tell-all/", "title": "15 Explosive Things Revealed In 'The Bachelorette Men Tell All'", "meta_data": {"viewport": "user-scalable=yes, initial-scale=1.0, width=device-width", "description": "Well, it's that time of year again, and the men of The Bachelorette got together with Rachel Lindsay to tell their side of the story.", "og": {"title": "15 Explosive Things Revealed In 'The Bachelorette Men Tell All'", "type": "article", "image": {"identifier": "https://static0.thethingsimages.com/wordpress/wp-content/uploads/2017/08/Feature.jpg", "width": 600, "height": 326}, "url": "https://www.thethings.com/15-explosive-things-revealed-in-the-bachelorette-men-tell-all/", "locale": "en_US", "description": "Well, it's that time of year again, and the men of The Bachelorette got together with Rachel Lindsay to tell their side of the story.", "site_name": "TheThings"}, "article": {"published_time": "2017-08-03T12:08:17Z", "section": "Pop Culture"}, "fb": {"app_id": 1704776379798523, "pages": 816297408482105}}, "movies": [], "publish_date": 1501762097.0, "source": "https://www.thethings.com", "summary": ""}