{"url": "http://query.nytimes.com/gst/fullpage.html?res=9402E4D61E3FF93AA25753C1A961958260", "text": "This makes for a strange set of paradoxes, for some of Mr. Giuliani's strengths are his weaknesses as well. The adept and decisive manager can be imperious, to the point where surveys show his manner to be his greatest political liability. The candidate who, according to polls, seems headed to an overpowering victory on Nov. 4, can unleash attacks on his opponent that verge on fury. The man with a clear vision of a safer, more livable city can be disdainful of even well-intentioned critics.\n\n''He is a good mayor, but he'll never be a great one,'' said Edward I. Koch, once a committed ally who now says he will vote for him with a reluctant pull of the lever.\n\n''He can't accept disagreement,'' Mr. Koch said. ''When it occurs, he wants to destroy you. He goes for the jugular.''\n\nDespite -- or perhaps because of -- these contradictions, Mr. Giuliani has risen to become the city's most important politician of his generation, a nationally known figure with larger political aspirations.\n\nTo understand Mr. Giuliani's rise to City Hall, it helps to have a map of his boyhood and earlier career. Signposts include a Roman Catholic education, doting parents and prominent mentors. Directions come from schoolmates, teachers and colleagues.\n\nThe Mayor himself was a grudging participant in this article. For two months, his press office pledged cooperation only to withhold it.\n\nFinally, just before publication, the Mayor agreed to be interviewed. He attributed his wariness to recent articles in several newspapers and magazines about rumors of an extramarital affair, which he has strongly denied. He also complained about what he called unfair political coverage in The New York Times.\n\nAdvertisement Continue reading the main story\n\nSeated in a comfortable armchair in his office, however, the Mayor seemed relaxed and genial. He said he knew all too well that people thought he was harsh and overbearing. But at least on this occasion, such characterizations made him laugh.\n\n''I've been accused of storming out of press conferences that I'd been at for 45 minutes,'' he said with a chuckle. ''Maybe I just had to leave. Maybe I had to go to the bathroom. So I would say, 'That's the last question,' and walk out. The next day it would be written that I stormed out, or that I was bristling. It fits the stereotype.''\n\nAnyway, the perception often works to his advantage, the Mayor added, because when people meet him, they say, ' ''Oh my God, he's very different from what I thought.' ''\n\nParents\n\nStrong Convictions And Early Instruction\n\nA grandson of Italian immigrants, Rudy Giuliani grew up in richly Catholic surroundings, before Vatican II, with meatless Fridays and the mysteries of the Latin Mass. Goodness, he was taught, required diligence. And his teachers say that young Rudy, more than most, was hard-working and intellectually keen.\n\nImmigrant struggle was a staple of family lore. His father, Harold, traced his roots to Florence and nearby Montecatini, and his mother, Helen, to Avellino and other towns near Naples. Their stories were many because their families were big.\n\nHarold and Helen wanted a large family of their own, but year after year they were disappointed. Friends say that on May 28, 1944, when the Giulianis' only child was born, they considered him a miracle baby, a blessing born of prayer.\n\nHarold and Helen took Rudy home to East Flatbush, Brooklyn. Harold supported his family by tending bar at a place he owned with a brother-in-law, near Kings County Hospital.\n\nAt home, Rudy grew up under the instructive hand of his parents and his maternal grandmother. Helen, according to her son, had excelled in high school and been a spelling champion. Her dream had been to be a teacher, but her chance at higher education was frustrated by financial difficulties and, later, the demands of motherhood.\n\nAdvertisement Continue reading the main story\n\nHer son would be her only pupil. Biographies and history books were Helen's selections for reading aloud, even when Rudy was a toddler. Must-see TV included political conventions and the Kefauver hearings on organized crime.\n\nUnlike her husband, Helen was a Republican, though she would switch over to the Democrats with the rise of that wonderful young Catholic, John F. Kennedy.\n\nOf the two, Harold Giuliani, who died of cancer 16 years ago, was more of a churchgoer, attending Mass every week, his son said. Harold suffered bad eyesight and a weak heart. Tending bar did not fulfill the promise of his sharp mind.\n\n''My father wasn't terribly successful, but he had no bitterness,'' the Mayor said, pausing for an afterthought: perhaps his father's need for achievement ''was sort of pushed into me.''\n\nHarold was a forceful, gregarious person who had many friends, though Vincent Noce, whose father owned a funeral parlor near Harold's bar, also recalls a moody man whose smarts often inflated into arrogance.\n\nDuring summers, with doors open and a huge fan blowing, the sound of Harold's voice blustered into the street. ''If you were walking by the bar,'' Mr. Noce said, ''you could hear him yelling, telling people, 'You don't know what the hell you're talking about!' ''\n\nThe Mayor extols his father's warmth and generosity while also recalling an extremely direct man whose temper was sometimes the tripwire to unpredictable explosions.\n\nMany of Harold's convictions were unshakable. Among those beliefs, the Mayor said, were a love of the Yankees -- bold for a bartender in Dodgers territory -- and a hatred of the Mafia, which gave Italian-Americans a bad name.\n\nAdvertisement Continue reading the main story\n\nHarold also believed that life provided a continual series of tests -- of character, of friendship, of respect.\n\nThese tests occurred during times of tragedy and need. A real sign of friendship, the Mayor quoted his father as saying, is showing up ''at wakes and funerals, not at weddings.''\n\n''At a wedding everyone is joyous. They don't need you.''\n\nSchool\n\nA Quick Study Flirts With the Priesthood\n\nPeter J. Powers, the Mayor's friend since high school and until August 1996 his first deputy, commends Mr. Giuliani's ''incredible ability to assess a situation.'' Mr. Powers first observed it, he said, during their senior class trip to Washington. One night, he, Rudy and several others began a carpet-sopping water fight in their hotel. The manager, furious, ordered them to pack up and be downstairs in 10 minutes.\n\n''Most of us were scared silly,'' Mr. Powers recalled. ''We thought we'd get kicked out of school, never graduate. But Rudy just said, 'He's bluffing, and I'm going to bed.' And Rudy was right.''\n\nThey attended Bishop Loughlin Memorial High School in Brooklyn, run by the De La Salle Christian Brothers. Each parish in Queens and Brooklyn and on Long Island could send only two of its best male students.\n\nFor Rudy, the commute to Loughlin required a tedious ride on the Long Island Rail Road. When he was 7, his parents had joined the exodus to suburbia, first to Garden City, then to a split-level in North Bellmore.\n\nMost of the enrollment at Loughlin came from working-class families -- Irish, Italian, Polish -- and nearly all went on to college. It was a rare chance for the sons of blue collars to be like those of blue bloods, good boys with good educations headed for good things.\n\nAdvertisement Continue reading the main story\n\n''We thought he was going to become a priest,'' said a North Bellmore neighbor, Ray Jacobelli.\n\nSo did Rudy. Priests, brothers and nuns were so much a part of growing up Catholic that many young men and women felt the pull of a religious calling.\n\nIndeed, at Loughlin, the air itself seemed consecrated. Each class began with a prayer: ''Let us remember that we are in the holy presence of God.''\n\nRudy thrived. ''He was a bright kid, on the honor roll, a rather charming kind of person,'' said Brother Peter Bonventre, a school administrator. Fellow students recall his mischievous humor -- he could be quite the cutup. But some also thought him an oddball -- enthralled by the Kennedy family and so in love with opera that he started an opera club.\n\nRudy's best friends, Mr. Powers and Alan Placa, were club recruits, sharing in the world of Verdi and Puccini. The students would also double-date, their brotherly companionship often more important than the young women.\n\n''After we'd drop off the girls, Rudy and I would spend hours in the car or walking down the sidewalks, debating ideas: religion, the problems of the world, what we wanted to be,'' Mr. Placa said. Similarly, Mr. Powers recalled he and Rudy abandoning their dates in the living room while the two of them talked current events in the kitchen with Helen Giuliani.\n\nWeekends were often spent near an idyllic cliffside off Sound Beach, at a cottage rented by Rudy's grandmother. Aunts, uncles and cousins frequently spent the night. Suppers brought everyone together, with talk of politics as much a part of mealtime as the pasta.\n\nThe summer of 1961 would bring another topic to the table: Come fall, would Rudy go to college, pursuing vague plans to become a doctor, or to the seminary, to prepare for life as a missionary?\n\nHis parents had a preference. ''The Giulianis wanted grandchildren,'' Mr. Jacobelli recalled.\n\nRudy did not quite decide, enrolling at Manhattan College while still pondering the priesthood. His mind would teeter back and forth during the next four years, he said: Was God truly summoning him?\n\nAdvertisement Continue reading the main story\n\nNot until he began law school did he finally rule it out. ''The priesthood is a vocation,'' the Mayor remembered, ''and I probably didn't have it. I probably just thought I had it.''\n\nLike most young men, he was feeling a hormonal calling as well. ''I had dated and enjoyed it,'' he said.\n\nThe choice would probably have been different ''if the priesthood had encompassed marriage.''\n\nManhattan College, in the Bronx, had much in common with Loughlin. It was all male, overwhelmingly white and run by the Christian Brothers. Mr. Powers and Mr. Placa were at Mr. Giuliani's side.\n\nMr. Giuliani majored in political science and minored in philosophy. He relied more on a good memory than a quick pencil, a former classmate, B. J. Leddy, said: ''He would sit back and make a note or two. He was so self-collected. He knew what would be demanded in the end.''\n\nDoctor, lawyer, priest, pilot, journalist: he considered all of these careers. Once, Mr. Giuliani said, he and Mr. Placa even thought of getting Ph.D.'s and becoming ''practicing philosophers,'' hanging out a shingle and ''just sitting somewhere, developing ideas and thoughts.''\n\nA political career, the Mayor said, was not often on his mind, ''like fourth of fifth on the list.'' Nevertheless, he ran for his first office, winning the sophomore class presidency. He lost the following year, and his main extracurricular interest shifted to Phi Rho Pi, his fraternity.\n\nManhattan College was a commuter school, and none of its fraternities had a house. Still, the groups were a good way to make lasting friendships. Mr. Giuliani had first pledged to high-status Alpha Sigma Beta, but he hated the hazing, especially ''getting beat up with a paddle.''\n\nSo he approached Phi Rho Pi, which had only a few members. They welcomed him and several of his buddies, agreeing to go easy on the humiliations.\n\nAdvertisement Continue reading the main story\n\nMr. Giuliani was a commanding figure at meetings, with ''a sense of standing, a sureness about what is right,'' said a fraternity brother, Thomas Hefele.\n\nAs Phi Rho Pi grew, a rift opened. Sal Scarpato was the leader of a more boisterous faction that wanted more raucous parties, more tormenting of pledges. Mr. Giuliani was the champion of the better-mannered. They ran against each other for the presidency, and Mr. Giuliani won.\n\nMr. Scarpato said that before the vote, he got a very unexpected phone call from Harold Giuliani. As he remembered it: ''Rudy's father took the liberty of asking me to withdraw from the election.\n\n''He said it was more important for Rudy to be the fraternity president, more important because Rudy was someone going places.''\n\nA Law Career\n\nThe Inquisitor Makes The Front Page\n\nIn 1965, Mr. Giuliani and Mr. Powers enrolled at New York University Law School. ''I went in with the mental attitude that if I enjoy it, I'm going to stay,'' the Mayor said. ''If I don't, I'm going to leave, get a master's degree in history or something.''\n\nBut he was quickly smitten with torts, contracts and the rest. The courses stimulated his highly rational mind, the Mayor said. He excelled, making the law review.\n\nIrving Younger was Mr. Giuliani's faculty adviser. The two opera lovers would retreat to the professor's office and listen to an aria while Mr. Younger reminisced about his days as a prosecutor. He made it sound as if no life was complete without a stint as an assistant United States attorney.\n\nMr. Giuliani surely had the makings. To be a prosecutor pointing an accusing finger seemed a natural pose for Mr. Giuliani, with his virtuous ire. His classmates found him bright, memorably combative and, to their astonishment, able to function on four to five hours of sleep a night.\n\nAdvertisement Continue reading the main story\n\n''He was very funny, but he was also much like he is now,'' said Peter D. McKenna, a friend who became the law review's editor in chief. ''He could give a joke but not take one. When he thought he was right, he'd become arrogant and call the other guy a crybaby.''\n\nRepresentative Peter T. King, a Republican from Long Island, said, ''I was struck by him being very, very smart and really, really liberal.''\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You will receive emails containing news content , updates and promotions from The New York Times. You may opt-out at any time. You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nThe two men had met in 1967, when they were summer interns at a law firm that included Richard M. Nixon. Mr. Giuliani, the Kennedy zealot, talked briefly with the future President on two occasions, both times managing to refrain from using his scornful nickname for Nixon: the Trickster.\n\n''That summer, there were riots in Newark and Detroit, and Rudy was very sympathetic to the rioters,'' Mr. King said. ''He told me he had gone to a bar and started in on a black guy because he wasn't radical enough. Rudy said before the conversation was over he'd turned him into a Black Power guy.''\n\nA week before Mr. Giuliani graduated, an assassin murdered his hero, Robert F. Kennedy, but even that could not destroy so promising a spring. He was departing with cum laude honors. He had lined up a prestigious clerkship with Judge Lloyd F. MacMahon of Federal District Court in Manhattan.\n\nAnd he was getting married.\n\nRegina Peruggi and Rudy Giuliani were hardly strangers. They had dated sporadically in high school and college, then more seriously during Mr. Giuliani's final year of law school. Their fathers were first cousins.\n\nThe wedding and reception, on Oct. 26, 1968, was as much a family gathering as a marriage celebration. For their first dance as newlyweds, the couple chose Frank Sinatra's classic pledge of love, ''All the Way.''\n\nAmong the guests was Judge MacMahon. A tall, forbidding man, he could be gruff with his clerks. But he treated Mr. Giuliani as a protege, guiding his young career.\n\nSurely, the clerkship saved that career from an interruption common during the Vietnam War; the judge wrote a letter to the draft board, securing his clerk a deferment. Any further chance of induction was later forestalled by a high number in the draft lottery.\n\nAdvertisement Continue reading the main story\n\nJudge MacMahon strongly recommended Mr. Giuliani for a job as an assistant United States attorney in the Southern District of New York. Once on the job, Mr. Giuliani assumed twice the normal caseload.\n\n''Rudy had this ability to focus, more than any other person I've ever worked with,'' said Michael B. Mukasey, a Federal district judge who was then a fellow prosecutor. He recalled how grateful he was when Mr. Giuliani ''rounded up a bunch of office people and came to my father's funeral,'' barely weeks after the two lawyers had met.\n\nIn the autumn of 1974, Mr. Giuliani's courtroom skills catapulted him onto the front pages during the bribery trial of Bertram L. Podell, a former three-term Brooklyn Congressman. After hours of Mr. Giuliani's grueling cross-examination, Mr. Podell -- quite calm at the start -- became so flustered that he poked out a lens of his glasses, requested a recess and then pleaded guilty.\n\nYet however ferocious Mr. Giuliani might sound as an inquisitor, he hardly looked the part. He was still on the wrong side of pudgy, with an oversized forehead and slouching shoulders.\n\nWhen Bob Leuci, a corrupt police detective who had turned Federal witness, first glanced at Mr. Giuliani, he saw a nerdy kid in a sloppy suit. But as the prosecutor began to talk, Mr. Leuci sensed a rare combination of formal education and street smarts. ''He's asking one question, but he's like seven moves ahead of you in the chess game,'' Mr. Leuci said.\n\nMr. Giuliani's task was to get the detective to testify against his partners -- his best friends. The prosecutor's persuasiveness would later become part of the movie ''Prince of the City.'' Glossed over was the fact that the two men became close friends.\n\nMr. Giuliani was overcoming his social gawkiness as power tilted his way, Mr. Leuci said. ''He could see that when he said something, people would listen and he could develop a fan club. Once Rudy got that, he lost weight, he began working out, he recognized that all of a sudden women were attracted to him.''\n\nThe one thing that did not change, Mr. Leuci said, was the obsessive work. At Mr. Giuliani's office, the detective would sometimes ask: '' 'Don't you have a life?' And he would tell me: 'I have a life. It's right here. I don't enjoy anything more.' ''\n\nAdvertisement Continue reading the main story\n\nWashington\n\nA Rising Star Sees His Marriage Falter\n\nIn 1975, Mr. Giuliani gained a mentor in Harold R. Tyler Jr., a Deputy Attorney General in the Administration of President Gerald R. Ford. Mr. Tyler needed nimble assistants, and his friend Lloyd MacMahon had always filled his ear about Rudy Giuliani.\n\nMr. Tyler brought the young prosecutor to Washington as his deputy. He said he never regretted the choice, though ''once in a while I'd have to tell Rudy to pipe down: 'I'm in charge, you're not.' He was so ambitious, and still is, God love him.''\n\nMr. Tyler was a Republican. But Mr. Giuliani was politically adrift, having grown impatient with a Democratic Party that he thought was ''naively'' sliding far to his left. He registered as a Republican.\n\nThe following year, Jimmy Carter's victory would mean the boot for Republicans in high places. Mr. Tyler accepted a named partnership in what became Patterson, Belknap, Webb & Tyler, a trusted guardian of old money. Mr. Giuliani followed his boss, also becoming a partner.\n\nThe work was tame compared with the pursuit of renegade cops, but Mr. Giuliani became something of a mythic figure to younger associates. Admired for his competence, he was also known for practical jokes, an irreverence toward senior partners and occasional partying at trendy nightspots into the wee hours, sometimes ending one day with breakfast for the next.\n\n''He asked me to dance, and I had no idea who he was,'' recalled Renee Szybala, then a rising young lawyer at the firm. ''He told me he was one of the partners. I was flabbergasted. This was not the usual way to meet partners.''\n\nBy the mid-70's, Mr. Giuliani's marriage was in trouble. The couple agreed to a trial separation in 1975, but the remedy would prove insufficient.\n\n''Rudy's wife was very nice, very quiet, and we could sense the unhappiness there,'' Mr. Tyler said. ''I don't think she liked the limelight.\n\nAdvertisement Continue reading the main story\n\n''And Rudy, of course, did.''\n\nThe Reagan Years\n\nA Crime Fighter Defends a Dictator\n\nThat limelight intensified when Ronald Reagan became President in 1981. The Justice Department needed an experienced crime fighter in its top ranks. With Harold Tyler as an advocate, Mr. Giuliani was given the No. 3 job, in charge of all the United States attorneys, drug enforcement, immigration and prisons.\n\nMuch of his time was spent in South Florida, where each month hundreds of Haitians were floating ashore in flimsy sailboats -- or drowning in the effort. The Administration considered the vast majority to be fugitives from hunger and want, not refugees from political repression. Mr. Giuliani became the point man for a policy that combined attempts to intercept the Haitians at sea and detain those who made it to land.\n\nAmid class-action lawsuits and public quarreling, Mr. Giuliani made a two-day trip to Haiti, then testified about his findings in Federal court. In words that would be unforgettable to a generation of Haitians, he said that ''political repression, at least in general, does not exist'' in that dictatorship, and that the boat people were in no danger when sent back.\n\nMr. Giuliani later insisted that his remarks -- though repeated many times in his testimony -- were quoted out of context. ''I knew there were people who fled political oppression in Haiti and that they were entitled to asylum,'' the Mayor said. ''But I also knew that the vast majority of people were coming for economic reasons.''\n\nThe chief purpose of his trip was to guarantee the Haitians' safety upon return, he said. Indeed, during his testimony, he recalled a 75-minute conversation with President-for-Life Jean-Claude Duvalier: Mr. Giuliani demanded and received the brutal dictator's ''personal assurance'' that the boat people would be safe.\n\nAt the time, Mr. Giuliani seemed to relish the verbal combat, often appearing on network news programs.\n\nBut while his work in the capital carried the weight of importance, he was unhappy living in what he considered a one-industry town. People related to each other according to a pecking order of political clout ''rather than interacting like normal human beings,'' the Mayor said.\n\nRegina Peruggi had not accompanied her husband to Washington. In 1982, Mr. Giuliani filed for a legal separation and, within a year, divorce. After 14 years, the marriage would also be erased in the eyes of the church through annulment.\n\nAdvertisement Continue reading the main story\n\nThe grounds for annulment, the Mayor said, involved the couple's unintended failure to obtain a dispensation -- necessary at the time for ''second cousins once removed'' to marry.\n\n''This has been painted as, well, something sneaky,'' Mr. Giuliani said. ''But I was under the impression that we were third cousins because I never calculated the lines of consanguinity. I can't tell you what Gina thought. I don't think we ever discussed it in any great detail.''\n\nAfter his divorce, the Mayor said, he inquired about a possible annulment to Alan Placa, his longtime friend, who had entered the priesthood.\n\n''He said, 'You were related, you must have gotten a dispensation,' '' Mr. Giuliani remembered. ''I said: 'Alan, I don't recall doing that. I don't recall realizing that I had to get one.' He said, 'Well, you know, the priest may have gone ahead and done it anyway' '' because -- as church experts confirm -- approval would have been routine.\n\nBut a search through church records found none of the required paperwork, said the Mayor, who, like his former wife, had previously refused to discuss the matter. Ms. Peruggi, also a person of accomplishment, has been the president of Marymount Manhattan College since 1990.\n\nDivorce and annulment had become matters of immediacy for Mr. Giuliani. In early 1982, a friend had met Donna Hanover, a divorced Miami newscaster, and later played matchmaker.\n\nMr. Giuliani ordered his secretary to phone her, arranging not a date but an interview. The couple then began a two-month courtship before Mr. Giuliani proposed, at Walt Disney World.\n\nOn April 15, 1984, Father Placa presided at their church wedding.\n\nTo some, returning to Manhattan in 1983 to be the United States Attorney seemed an odd career move. Wasn't he already the boss of all the Federal prosecutors? But at age 38, Mr. Giuliani was returning to the work he loved in the nation's most visible city.\n\nAdvertisement Continue reading the main story\n\nThe Colombo crime family, the mobster Anthony (Fat Tony) Salerno, the briber and former Bronx Democratic leader Stanley M. Friedman, the stock manipulator Ivan F. Boesky: the convictions by Mr. Giuliani's office seemed to connect the dots through the money-mad 1980's.\n\nNever shy about success, Mr. Giuliani was an obliging star at news conferences. When accused of showboating, he would typically respond, ''I feel a Government office should be open, and I have an obligation to maximize public education.''\n\nHis good press would prove insulation from much of the bad -- an important thing, because not every big case went his way.\n\nBy the time Mr. Giuliani left office, critics were accusing him of overzealousness, prosecuting cases to serve his political ambitions.\n\nIn 1987, Mr. Giuliani anguished publicly over whether to run against Senator Daniel Patrick Moynihan. But the decision was never really a close call, the Mayor said. If he was ever going to endure the ''terribly difficult experience'' of a campaign, he wanted to end up running something, not legislating.\n\nHis options, then, were governor or mayor -- and he seemed to favor City Hall. Advisers warned against it, Mr. Giuliani said: The city was a mess, the job a career-killer.\n\nHis last day as a Federal prosecutor was Jan. 31, 1989. By early February, he and Mr. Powers were charting campaign strategies. Presumably, the race would be against Mayor Koch, though possibly his Democratic challenger, David N. Dinkins.\n\n''We had no money,'' Mr. Powers said. ''Politically, it was so naive.''\n\nBut they had read the polls.\n\nThe renowned crime fighter was 20 points ahead.\n\nAdvertisement Continue reading the main story\n\nThe Mayor's Office\n\nA New Giuliani Takes A Political Turn\n\nThe race was the political novice's to lose, and lose it he did, with the help of an elbow to the ribs from Senator Alfonse M. D'Amato.\n\nMr. Giuliani was an awkward campaigner, and he would be bruised before winning the Republican primary. Ronald S. Lauder, heir to a cosmetics fortune, spent $14 million to tarnish his reputation. Mr. Lauder's political oomph was supplied by Mr. D'Amato, whose off-and-on relationship with Mr. Giuliani was in a phase of darkness.\n\nMr. Giuliani lost the general election to Mr. Dinkins, whose victory as the city's first black mayor seemed to be tipped by the racially motivated killing of a black teen-ager in Bensonhurst, Brooklyn.\n\nBut the defeated candidate had someone else to blame: ''To the extent that Al D'Amato was a large part of it, then he has to take responsibility for that.''\n\nThe media, too, had disappointed Mr. Giuliani. When he was a Federal prosecutor, reporters seemed in competition for fresh superlatives. Now, like human seismographs, they recorded his every quake and slip. At times, they made him seem like an ogre.\n\nThe public had him pegged all wrong, he complained. Donna Hanover shared a painful memory several years ago in an interview with The New York Times. On the night of his defeat, Mr. Giuliani crumpled at the foot of their bed and asked, ''Do they really think I'm mean?''\n\nLooking toward a 1993 rematch, the candidate would find ways to become new and improved. He spent hundreds of hours in a self-designed seminar, inviting experts to tutor him on urban reforms. He also submitted to a political airbrushing by new strategists. Weight was lost, a tan was added. He danced a two-step at a hoedown in SoHo, greeting people with ''Howdy.''\n\nAt heart, however, Mr. Giuliani was still the scrappy prosecutor in a city where voters seemed willing to blame the incumbent for a staggering murder rate, homelessness and a general sense of disorder. He believed then -- as he does now -- ''that in New York, you have to be a fighter.''\n\nAdvertisement Continue reading the main story\n\nHe beat Mr. Dinkins by a margin of two percentage points, becoming the city's first Republican mayor in a generation. His campaign themes were true to his roots: part nostalgia, part law and order. He promised nothing less than to restore a better quality of life.\n\nHis inaugural speech seemed the dare of a new sheriff, busting through the saloon doors. ''The era of fear has had a long-enough reign,'' he said. ''As of this moment, the expressions of cynicism -- New York is not governable, New York is not manageable, New York is not worth it -- all of these I declare politically incorrect.''\n\nMr. Giuliani considered himself a warrior in the free-for-all between cops and robbers. He was the people's choice for top cop, and, therefore, to oppose him was to rob the public of its collective will.\n\nIn his third month as Mayor, the one-time political science major had occasion to describe his philosophy of government at a New York Post forum on crime. His passage from the liberal beliefs of his younger years was complete.\n\nFreedom does not mean ''people can do anything they want, be anything they can be,'' he said. ''Freedom is about the willingness of every single human being to cede to lawful authority a great deal of discretion about what you do and how you do it.''\n\nIn New York, he seemed to announce, that lawful authority was his.", "images": ["https://static01.nyt.com/images/icons/t_logo_291_black.png"], "top_img": "https://static01.nyt.com/images/icons/t_logo_291_black.png", "keywords": [], "authors": ["Barry Bearak", "Ian Fisher"], "canonical_link": "https://www.nytimes.com/1997/10/19/nyregion/race-for-city-hall-republican-candidate-mercurial-mayor-s-confident-journey.html", "title": "RACE FOR CITY HALL: The Republican Candidate; A Mercurial Mayor's Confident Journey", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "sourceApp": "nyt-v5", "applicationName": "article", "robots": "noarchive", "hdl_p": "RACE FOR CITY HALL: The Republican Candidate; A Mercurial Mayor's Confident Journey", "description": "Biographical sketch of New York City Mayor Rudolph W Giuliani traces his rise to City Hall from his childhood in East Flatbush, Brooklyn; notes that he was born on May 28, 1944, grandson of Italian immigrants, and was Federal prosecutor; photos (M)", "genre": "Biography", "articleid": 1997101900000689378, "usageTerms": "https://help.nytimes.com/hc/en-us/articles/115014893968-Terms-of-sale", "hdl": "RACE FOR CITY HALL: The Republican Candidate; A Mercurial Mayor's Confident Journey", "col": 1997, "pdate": 19971019, "utime": 19971019010000, "ptime": 19971019010000, "DISPLAYDATE": "Oct. 19, 1997", "dat": "Oct. 19, 1997", "lp": "Biographical sketch of New York City Mayor Rudolph W Giuliani traces his rise to City Hall from his childhood in East Flatbush, Brooklyn; notes that he was born on May 28, 1944, grandson of Italian immigrants, and was Federal prosecutor; photos (M)", "msapplication-starturl": "http://www.nytimes.com", "cre": "The New York Times", "slug": "19giul$06", "article": {"collection": "https://static01.nyt.com/services/json/sectionfronts/nyregion/index.jsonp", "published": "1997-10-19T01:00:00-04:00", "modified": "1997-10-19T01:00:00-04:00", "section": "N.Y. / Region", "section-taxonomy-id": "C4DC8C0C-E148-4201-BF10-82F1C903DBFB", "section_url": "https://www.nytimes.com/section/nyregion", "top-level-section": "nyregion", "author": "https://www.nytimes.com/by/ian-fisher", "tag": "ELECTIONS"}, "sectionfront_jsonp": "https://static01.nyt.com/services/json/sectionfronts/nyregion/index.jsonp", "og": {"url": "https://www.nytimes.com/1997/10/19/nyregion/race-for-city-hall-republican-candidate-mercurial-mayor-s-confident-journey.html", "type": "article", "title": "RACE FOR CITY HALL: The Republican Candidate; A Mercurial Mayor's Confident Journey", "description": "Biographical sketch of New York City Mayor Rudolph W Giuliani traces his rise to City Hall from his childhood in East Flatbush, Brooklyn; notes that he was born on May 28, 1944, grandson of Italian immigrants, and was Federal prosecutor; photos (M)", "image": "https://static01.nyt.com/images/icons/t_logo_291_black.png"}, "fb": {"app_id": 9869919170, "pages": 993603507345855}, "twitter": {"site": "@nytimes", "url": "https://www.nytimes.com/1997/10/19/nyregion/race-for-city-hall-republican-candidate-mercurial-mayor-s-confident-journey.html", "title": "RACE FOR CITY HALL: The Republican Candidate; A Mercurial Mayor's Confident Journey", "description": "Biographical sketch of New York City Mayor Rudolph W Giuliani traces his rise to City Hall from his childhood in East Flatbush, Brooklyn; notes that he was born on May 28, 1944, grandson of Italian immigrants, and was Federal prosecutor; photos (M)", "card": "summary"}, "author": "Barry Bearak and Ian Fisher", "tone": "biography", "isFullText": 1, "pdfUrl": "https://timesmachine.nytimes.com/svc/tmach/v1/refer?res=9402E4D61E3FF93AA25753C1A961958260&pdf=true", "resKey": "9402E4D61E3FF93AA25753C1A961958260", "byl": "By BARRY BEARAK and IAN FISHER", "PT": "article", "CG": "nyregion", "SCG": "full-text", "PST": "Biography", "tom": "Biography", "edt": "Late Edition - Final", "geo": "NEW YORK CITY", "per": "GIULIANI, RUDOLPH W", "des": "ELECTIONS", "keywords": "NEW YORK CITY,GIULIANI  RUDOLPH W,MAYORS,BIOGRAPHICAL INFORMATION,ELECTIONS", "dfp-ad-unit-path": "nyregion", "dfp-amazon-enabled": "false"}, "movies": [], "publish_date": null, "source": "http://query.nytimes.com", "summary": ""}