{"url": "https://www.fame10.com/entertainment/teen-mom-15-shocking-revelations-from-amber-portwoods-never-too-late/", "text": "Back in June of 2009, MTV fans were introduced to Amber Portwood with her episode of 16 & Pregnant, and for the subsequent seven years, she has continued to share her story as one of the four women picked for the hugely popular spin-off series, Teen Mom. In those seven years, Amber has shared all of the very high highs and very low lows of her life, and has had one of the most tumultuous journeys out of all the young women on the series. Then in 2014, Amber put out her first memoir “Never Too Late” and it became apparent that not everything was shared with the MTV cameras. So, go behind-the-scenes, and find 15 of the most shocking things about Amber, her life and filming that you never knew!\n\n15. Early Life\n\nAmber’s story on 16 & Pregnant jumps right into her pregnancy with Leah, but her book gives fans a better idea just who Amber was before becoming pregnant at a young age. Amber goes into detail about her childhood, which started off with normal and happy family memories, but everything changed when her younger sister Candace, died at only two weeks old of SIDS (Sudden Infant Death Syndrome). “After Candace died, my family started to deteriorate. That was the start of the bad times that turned everything into a blur in my memory,” she wrote in the book and went on to reveal how both her parents developed drinking problems, but her dad’s alcoholism turned her parent’s relationship into nothing but screaming matches.\n\nADVERTISEMENT\n\n2\n\n14. Suicide Attempt\n\nOne of the most shocking things in “Never Too Late” is Amber’s admittance that as a young child she “just felt wrong,” and was already battling depression before she could comprehend what it was which eventually led to a suicide attempt when she was only 11 years. “No one was home when I did it. I just took a cord into the bathroom and hung it on the fan in the ceiling, and I looped it around my neck […] I just leaned into it and picked up my feet. It’s so hazy that I only remember certain details, like feeling tons of pressure behind my ears and then waking up on the floor. […] I didn’t try again, I just kind of chalked it up to a failure. And I couldn’t get the fan back up right because the screw was stripped, so after that it was always kind of messed up and made this weird sound when it was on.” She went on to add that every day she would notice that sound and would “have to remember what I’d done that day.”\n\n3\n\n13. Gary\n\nIn their episode of 16 & Pregnant, Amber gives a quick recap of her relationship with Gary, but in the book she gives a better explanation of how they met. Although she knew he was her older brother Shawn’s friend, the first she ever saw Gary was in the school library. Amber remembers being sent there to catch up on homework and a senior class was in there, including Gary who, according to her, “was freaking huge.” “I didn’t even see his face, but I remember thinking to myself, ‘Oh my god, this guy is huge. He’s gotta be the biggest guy in the school.'” Then, only one week later, the two were finally introduced when Amber was home sick from school and Shawn and Gary came over. Interestingly, Amber makes a point of never saying Gary’s name in her book — she calls him “future-fiance,” “fiance,” and then “ex-fiance,” or simply refers to him as “Leah’s father.”\n\n4\n\n12. Early Relationship\n\nEventually, something blossomed between the two when Gary called the house looking for Shawn, but Shawn was at work. Little did Amber know, Gary was the one who had taken Shawn to work and knew exactly where he was, he just needed an excuse to call and strike up a conversation with Amber. The most shocking part is how she talks about Gary in this part. The two have been down a very rough and difficult road, and it seems fans never got a true sense of how in love they once were. “He played the guitar for me. I love a man with a guitar, but he was very, very good. He’s probably the best guitar player out of any of the guys I’ve been around. The way he plays is just so gentle, and he has a beautiful singing voice. […] We had something special.” It is interesting for fans to see Amber talking about Gary that way and revealing his secret talent, and she also went on to reveal that the pair were both virgins before getting together.\n\n5\n\n11. Telling Her Parents\n\nAfter Gary and Amber had been on and off for three years, things were looking good for the pair, Gary was working really hard to become a nurse’s assistant and Amber was on her way to a management position at Wendy’s, but then she found out she was pregnant after taking a pregnancy test in her work’s bathroom. Gary handled the news really well, but then they had to tell her parents. “I called up my mom to have her come over so I could tell her what was up. I think it was actually her birthday the day I found out. She came home for five minutes, which was long enough to sit down, hear the news, freak out a little bit, call my dad, and leave with her boyfriend. Pretty smooth, Can’t say I blame her.” Her dad didn’t handle it well either: “I’ll never forget his reaction. He was so pissed he just slowly turned away and went into the kitchen to get away from us for a minute […] Both of my parents were seriously shocked. They thought I was a virgin. My bad.”\n\n6\n\n10. Fame Changes People\n\nEarly on in her pregnancy, Amber heard about MTV’s new show 16 & Pregnant and decided to apply, but had absolutely no idea how it would change her’s, her daughter’s, Gary’s and their family’s lives forever. “We had absolutely no idea the show was going to turn into the huge thing it is today. We [thought] we were going to be on TV for a little while and everyone would forget about us afterwards,” Amber said of getting selected for the show. After describing how hard she and Gary worked together to get ready for Leah, which included getting their own place, she went on to explain that it didn’t take long before the effects of MTV fame became to hit. “All that attention was the last thing we expected. Leah’s dad started getting all of these girls talking to him. I don’t know how many times I saw messages on his account from girls, risque pictures from all these randos, and him writing back saying, ‘ooh, sexy’ and things like that.” She added, “It started out slow but we would end up losing ourselves in the money and that weird kind of fame we had landed in. Leah’s dad wound up becoming someone who was far, far away from the person he used to be in my memory.”\n\n7\n\n9. Pill Abuse\n\nLong before her pregnancy, before Gary, but also throughout their relationship, Amber began using pills as her party substance. Although she stopped using pills when she found out she was pregnant, it didn’t take long for the addiction to take over. “For six months after she was born, I stayed sober. But I was already reaching my limit with unhappiness and stress, and I was almost begging for something to come along and offer me a way of escape.” Amber then got a Klonopin prescription for her anxiety. “But almost right away, I started eating them all up, and that was the beginning of me becoming an addict.” Shortly after getting the prescription, MTV producers came by to reveal Amber had been picked to star on Teen Mom. “I was so blissed out on my new pills I had to think kind of carefully about how to say ‘Yayyy… woohoo.'”\n\n8\n\n8. Valentine’s Day – Cheating\n\nAs their fame increased with filming for Teen Mom, and Amber’s addiction got worse, Gary and Amber’s relationship started to break down even more, and it was on Valentine’s Days she found out he was messing around with other girls. Gary left Amber to go to the mall because he hadn’t had the chance to get anything for her for Valentine’s Day yet. After he was gone for many hours, she called him, and heard girls in the background. Gary said he met them at the mall and gave them a ride home, and it turned into a huge fight which continued when he got home, and he left again to go stay with his mom. “Before long, he called me up crying, or at least acting like he was crying, and saying he had something to tell me. ‘I cheated on you.’ Those weren’t girls he just picked up at the mall. He didn’t even go to the mall to get me a present for Valentine’s Day. He went to hang out with those girls because he was messing around with one of them […] Nothing between us was ever the same after that…I look back on that day as the day everything completely changed.”\n\n9\n\n7. Fighting and The Other Girl\n\nFans of Teen Mom OG who have followed Amber and Gary’s story know that the one defining moment out of it all was when their fights turned physical, and Amber actually hit Gary. In the book, she delves into how things got so bad and the behind-the-scenes information that got them to that destructive point. Amber reveals in the book that the girl Gary had cheated on her with actually appeared on the show. “The whole thing was kept under wraps. He actually filmed with this girl one time, and people who were watching didn’t realize he’d cheated on me with her. It was kept covered up for a long time.” Despite all of this, Amber really wanted things to work out with Gary, and she describes a nice night the two had that quickly went bad. “I got up and sort of quietly went down the hallway to listen. And there he was, on the phone, talking to this girl. In my freaking house, he was sitting there talking to the girl he cheated with.” She added, “I know people might think they know how bad it was from that they saw, but what was inside our world, what we did keep from showing other people, was even worse. There were times we’d physically fight, both of us. He’d spit on my face and I’d spit back in his face.”\n\n10\n\n6. Signing Over Custody\n\nAfter the fight, Amber’s downward spiral continued, but it was signing over custody of Leah to Gary that drove her deeper into a mess of depression, anxiety and self-medicating with pills. “I can tell you that the day I signed over custody rights to Leah’s father was the day I completely broke […] Everything that happened around that time is a complete jumble, because after I lost Leah I literally went insane.” Afterwards, Amber attempted suicide for the second time in her life. “I went into the bathroom of my house and tried to hang myself. Before I did it, I called up Leah’s dad and told him I love him […] I took a bunch of pills and tried to get a rope around my neck. I can’t even remember clearly exactly what I did. When the police came, I was unconscious, just moaning.” Ten days later she headed for her rehab trip to Malbu, Califronia which was documented by Teen Mom.\n\n11\n\n5. Sex Addiction\n\nOne of the most shocking parts of Amber’s recollection is what happened in her life between signing over custody and her trip to rehab. “It was a bad time. I started going out, fighting, and partying […] I finally got to a place where the attention and money started getting to me, too.” “I was always extreme when it came to partying and sex. When it really got down to it, my life at that time was nothing but pills and men […] Looking back I think it’s obvious I had a bad sex addiction along with the pill addiction.” She explained, “I used to get into fights with boyfriends over how much sex I wanted. If they weren’t in the mood or they were too tired, I would go off. How insane is that?” Amber also revealed that the whole time Gary was trying to get her back and he “would come over and dig through my trash can for condoms, even though we were completely broken up.”\n\n12\n\n4. Partying with Paparazzi\n\nAs Amber’s reputation as a partier began to precede her, she wound up in some interesting situations which MTV crews never documented, one of which was crazy nights she had partying with paparazzi. “I was pretty good at avoiding them, usually. I’d just sneak in and out of my house through the back. But there was one time when I’d just gotten out of the shower and I heard a knock on the door. I went and answered in a towel, and so of course there were four guys standing there. One of them was a guy from a pretty well-known publication who said he’d heard I could party […] so I went along and partied with him at the hotel where they were staying. You think teenaged reality TV stars are crazy? Well, listen up: paparazzi are crazy.” “We went to the hotel and stayed the whole night hanging out and partying. There were people there who were trading pills and getting all messed up. We got crazy in the hot tub, rocking out and acting wild, and early in the morning we went back out and these guys stole a bunch of balloons from some store parking lot and handed them to me. There were pictures online of me walking down the street with this big bunch of balloons while they were just taking photos of me.”\n\n13\n\n3. Dan\n\n“Never Too Late” makes it quite clear that Teen Mom fans only see a small sliver of the star’s lives, and that is never more evident than when Amber opens up about one of the loves of her life…Dan, who Amber never speaks of now, and fans didn’t even know about. “One night, I dragged my friend Sallie out to this bar called Jimmy’s, and we were talking and drinking and having fun when these two dudes walked in with a girl. One of these guys was f–king hot. He was just chiseled to the core. Like a country boy with the body of a Greek god, I swear to you, and these beautiful blue eyes!” Amber describes how she and this guy, Dan, got together and how amazing everything was. “We ended up getting together and having a beautiful relationship. We were so happy. We never fought. We made love five times a day, whenever we could. It was insane. Perfect, really.” Despite being happy, and even though he was a “good influence,” Amber was already “beyond reach,” and she writes, “The amazing thing about Dan was the he stuck by my side as long as he did. In another life, I think we could have had something special. Unfortunately, we weren’t cut out for making it together in this one.”\n\n14\n\n2. Jail…Twice\n\nOne night, Dan found Amber passed out with a bottle of pills beside her and freaked out worrying she had overdosed, but she woke up and reassured him. Unfortunately she wasn’t able to wake up again for her appointment with her probation officer the next morning. Once the probation officer showed up at her house and found Amber’s stash of pills, she was sent to the courthouse where she was sentenced to a jail stint of three months. This also meant a huge withdrawal from her pills. “I weighed about 115 lbs, and every day, about every four to six hours, I was taking eight or ten of my 1o mg Hydros, which is an unholy amount of those to take. Then I was rounding that out with three Klonopins, two Valiums, and a Soma.” Unfortunately after getting out, things arguably got worse for the reality star. Amber started using Fentanyl patches to get high, which are not only dangerous, but don’t show up on regulated drug tests. “I fell in love with those things so hard I became an addict on a completely different level.” After another near death experience because of taking drugs, Amber finally woke up enough to know she had to do something and at her next court date said she wanted jail time.\n\n15\n\n1. The Last Straw\n\nAmber’s description of her time in prison is one of both hardship, but also success. She achieved things in prison that never would have happened had she continued on the path she was on with pills and partying. As it turns out, despite everything they had been through, when Amber was in prison, she and Gary were “working things out.” They decided they were getting together when she got out, and she sent him $1000 to help him get a place for the two of them and Leah. Then, one night, she figured it out that, through everything he was saying, he had a girlfriend. Once again, Amber realized her family with Gary could not be mended, and it was the last time she tried.", "images": ["https://www.fame10.com/wp-content/themes/fametenV2/images/logo-white.png", "https://www.fame10.com/wp-content/uploads/2016/09/Amber-Portwood-Never-Too-Late-620x400.jpg", "https://www.fame10.com/wp-content/themes/fametenV2/images/trending_up.png", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_100,$w_100/f10/2015/09/Amber-Portwood-Teen-Mom-400x400.jpg", "https://www.fame10.com/wp-content/themes/fametenV2/images/qool-logo-white.png", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_100,$w_100/f10/2017/07/Cate-and-Tyler-Dr.-Drew-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_74,$w_115/f10/2017/05/Eric-Martsolf-620x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_100,$w_100/f10/2017/05/Maci-Ryan-and-Bentley-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_74,$w_115/f10/2018/08/19598558-620x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_140,$w_140/f10/2016/12/Amber-Portwood-Reunion-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_170,$w_170/f10/2015/09/08737093-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_170,$w_170/f10/2018/04/Catelynn-and-Tyler-Reunion-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_100,$w_100/f10/2017/04/Gary-and-Amber-Reunion-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_74,$w_115/f10/2016/01/Anthony-Geary-620x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_170,$w_170/f10/2018/03/Ashley-Young-and-Pregnant-400x400.jpg", "https://www.fame10.com/wp-content/themes/fametenV2/images/logo.png", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_170,$w_170/f10/2014/12/00608306-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_100,$w_100/f10/2016/12/Amber-Portwood-Reunion-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_140,$w_140/f10/2015/09/Amber-Portwood-Teen-Mom-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_170,$w_170/f10/2018/09/02875828-400x400.jpg", "https://www.fame10.com/wp-content/themes/fametenV2/images/concourse-logo-white.png", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_80,$w_125/f10/2016/09/Maci-Bookout1.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_170,$w_170/f10/2017/07/Matt-Baier-Book-400x400.png", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_170,$w_170/f10/2017/10/Farrah-and-Sophia-Baby-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_170,$w_170/f10/2018/09/GettyImages-1020457050-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_170,$w_170/f10/2017/10/12698759-400x400.jpg", "https://cl.fame10.com/image/upload/t_tn,f_auto,q_auto,$h_170,$w_170/f10/2017/06/maci-bookout-bulletproof-2017-400x400.jpg"], "top_img": "https://www.fame10.com/wp-content/uploads/2016/09/Amber-Portwood-Never-Too-Late-620x400.jpg", "keywords": [], "authors": ["Telisa Carter"], "canonical_link": "https://www.fame10.com/entertainment/teen-mom-15-shocking-revelations-from-amber-portwoods-never-too-late/", "title": "Teen Mom: 15 Shocking Revelations From Amber Portwood’s ‘Never Too Late’", "meta_data": {"viewport": "width=1130, maximum-scale=1.0", "description": "Back in June of 2009, MTV fans were introduced to Amber Portwood with her episode of 16 & Pregnant, and for the subsequent seven years, she has continued to share her story as one of the four women picked for the hugely popular spin-off series, Teen Mom. In those seven years, Amber has shared all […]", "fb": {"pages": 412887198817411}, "og": {"url": "https://www.fame10.com/entertainment/teen-mom-15-shocking-revelations-from-amber-portwoods-never-too-late/", "title": "Teen Mom: 15 Shocking Revelations From Amber Portwood’s ‘Never Too Late’", "description": "Back in June of 2009, MTV fans were introduced to Amber Portwood with her episode of 16 & Pregnant, and for the subsequent seven years, she has continued to share her story as one of the four women picked for the hugely popular spin-off series, Teen Mom. In those seven years, Amber has shared all […]", "type": "article", "image": "https://www.fame10.com/wp-content/uploads/2016/09/Amber-Portwood-Never-Too-Late-620x400.jpg"}, "ob": {"image": "https://www.fame10.com/wp-content/uploads/2016/09/Amber-Portwood-Never-Too-Late-620x400.jpg"}}, "movies": [], "publish_date": null, "source": "https://www.fame10.com", "summary": ""}