{"url": "https://screenrant.com/pitch-perfect-3-andy-allo-cast/", "text": "Share Tweet Email Copy Link Copied\n\nWhile Elizabeth Banks is best known as an actress, there is no denying that she's also been successful as a producer. The second film she produced, Pitch Perfect (2012) made over 100 million dollars and was the second highest-grossing musical comedy of all time. It no longer holds that honor however, because the 2015 sequel, Pitch Perfect 2, surpassed its predecessor in five days and ended up more than doubling the gross of the first film, becoming the highest grossing musical comedy. Making Pitch Perfect 3 an inevitability.\n\nPitch Perfect tells the story of reluctant college student Beca, who found a place to belong when she joined an all-girls a capella group called The Bellas and helped lead them to victory in a national competition. Along the way she makes friends with the other girls and even falls in love. In Pitch Perfect 2, the Bellas are nationally disgraced and the only chance they have to salvage their reputation is to win a world championship. They also bring in a new member, who perhaps will one day lead the Bellas once Beca is gone.\n\nAnd now, the Bellas have new challenges to face. According to EW, one of those challenges is a rival group called Dew, lead by a singer named Charity. Charity will be played by singer/actress Andy Allo, who was a protege of the late singer Prince. She was a member of his backing group, The New Power Generation, and Prince even helped her with her second album, Superconductor. Allo wrote and sang the song Stalker for the film Dear White People and has been the musical guest on Jimmy Kimmel Live!\n\nAllo has only a handful of credits as an actress, but with the success and popularity of the Pitch Perfect series, this is the kind of opportunity that could make her a star. So far, the Pitch Perfect movies have helped the careers of Anna Kendrick, Rebel Wilson, Anna Camp, and Brittany Snow - though the latter two were likely well known going into the initial film.\n\nKendrick, Wilson, and Camp are all scheduled to appear in Pitch Perfect 3, even though their characters were all seniors in Pitch Perfect 2 and would have probably graduated by now. Except perhaps Snow's character Chloe, who was a three time super senior in the most recent film. The third movie's story will likely be about why the girls return to the Bellas and where they will encounter the Dews.\n\nPitch Perfect 3 is directed by Trish Sie and produced once again by Elizabeth Banks. It's currently scheduled to be released later this year - just in time for the holidays.\n\nPitch Perfect 3 hits theaters December 22, 2017.\n\nSource: EW\n\nThe Shining Replaces Jack Nicholson With Jim Carrey in Unnerving Deepfake Videos", "images": ["https://screenrant.com/public/build/images/tg-logo-full-white.fc9e742a.svg", "https://screenrant.com/public/build/images/sr-logo-full-white.b0cc2b44.svg", "https://q.quora.com/_/ad/91f52889f6a04390a65ad2591c59986e/pixel?tag=ViewContent&noscript=1", "https://screenrant.com/public/build/images/th-logo-full-white.7684e614.svg", "https://screenrant.com/public/build/images/hc-logo-full-white.5f66cfe4.svg", "https://screenrant.com/public/build/images/tr-logo-full-white.090c581a.svg", "https://screenrant.com/public/build/images/mm-logo-full-white.fe72c74c.svg", "https://screenrant.com/public/build/images/tv-logo-full-white.642d3d01.svg", "https://static2.srcdn.com/wordpress/wp-content/uploads/pitch-perfect-3.jpg", "https://screenrant.com/public/build/images/tt-logo-full-white.04a6f0d4.svg", "https://screenrant.com/public/build/images/cb-logo-full-white.afca2e29.svg", "https://screenrant.com/public/build/images/bg-logo-full-white.8242bbb9.svg", "https://screenrant.com/public/build/images/tq-logo-full-white.7436bde3.svg", "https://www.facebook.com/tr?id=297467373958238&ev=PageView&noscript=1", "https://screenrant.com/public/build/images/ts-logo-full-white.54beb4cf.svg", "http://b.scorecardresearch.com/p?c1=2&c2=21868715&cv=2.0&cj=1"], "top_img": "https://static2.srcdn.com/wordpress/wp-content/uploads/pitch-perfect-3.jpg", "keywords": [], "authors": ["Sandy Schaefer", "Craig Elvy", "Daniel Alvarez"], "canonical_link": "https://screenrant.com/pitch-perfect-3-andy-allo-cast/", "title": "Pitch Perfect 3 Casts Prince Protege Andy Allo", "meta_data": {"viewport": "user-scalable=yes, initial-scale=1.0, width=device-width", "description": "Actress and singer Andy Allo, protege of Prince, will play a member of a rival a cappella group in the upcoming Pitch Perfect 3.", "og": {"title": "Pitch Perfect 3 Casts Prince Protege Andy Allo", "type": "article", "image": {"identifier": "https://static2.srcdn.com/wordpress/wp-content/uploads/pitch-perfect-3.jpg", "width": 1200, "height": 600}, "url": "https://screenrant.com/pitch-perfect-3-andy-allo-cast/", "locale": "en_US", "description": "Actress and singer Andy Allo, protege of Prince, will play a member of a rival a cappella group in the upcoming Pitch Perfect 3.", "site_name": "ScreenRant"}, "article": {"published_time": "2017-01-05T18:01:41Z", "section": "Movie News"}, "fb": {"app_id": 822150531210883, "pages": 10765693196}}, "movies": [], "publish_date": 1483639301.0, "source": "https://screenrant.com", "summary": ""}