{"url": "https://rollingout.com/2017/09/06/meghan-markle-professes-love-prince-harry/", "text": "Meghan Markle proclaims her love for Prince Harry in a rare interview with Vanity Fair.\n\nIt’s no secret that the actress and royal bad boy have been entangled in a super private, magical love story. Now, the actress has broken her silence on their epic romance.\n\n“We’re a couple. We’re in love,” she shared in the publication’s October issue, on stands Sept. 12. “I’m sure there will be a time when we will have to come forward and present ourselves and have stories to tell, but I hope what people will understand is that this is our time. This is for us.”\n\nShe added, “It’s part of what makes it so special, that it’s just ours. But we’re happy. Personally, I love a great love story.”\n\nAs previously reported, it was love at first sight for the duo who began dating in July of 2016 and have since been spotted globetrotting in Botswana, Jamaica, and London.\n\nSurprisingly, the pair has been quite successful at dodging the paparazzi, despite a growing obsession surrounding their relationship status.\n\n“It has its challenges, and it comes in waves—some days it can feel more challenging than others,” said Markle referencing all the attention. “And right out of the gate it was surprising the way things changed. But I still have this support system all around me, and, of course, my boyfriend’s support.”\n\nFortunately, the “Suits” star has a few strong women by her side (new mom Serena Williams and “Suits” co-star Abigail Spencer) holding her hand through it all.\n\n“Her personality just shines,” Williams commented to the magazine. “I told her, ‘You’ve got to be who you are, Meghan. You can’t hide.'”\n\n“She’s got warm elegance, though her style is hard to pin down. It’s classy and timeless. When you’re talking to her, you feel like you’re the only person on the planet. And it’s just wonderful to see her so in love,” added Spencer in the piece.\n\nWhile fans continue to speculate whether Harry will pop the question, Markle admits that the press, mainly tabloids, don’t always get it right. “I can tell you that at the end of the day I think it’s really simple,” she explained. “We’re two people who are really happy and in love. We were very quietly dating for about six months before it became news, and I was working during that whole time, and the only thing that changed was people’s perception. Nothing about me changed. I’m still the same person that I am, and I’ve never defined myself by my relationship.”\n\nWhat are your thoughts on the actress finding love with a prince? Sound off in the comment section below.", "images": ["https://rollingout.com/wp-content/uploads/2016/12/Ruu-Hawkins_avatar_1483156460-164x164.jpg?x12879", "https://rollingout.com/wp-content/uploads/2017/09/meghanmarklevanity.jpg?x12879", "https://rollingout.com/wp-content/uploads/2018/06/ro-logo-18.png?x12879", "https://rollingout.com/wp-content/uploads/2019/06/fcclub.jpg?x12879", "https://rollingout.com/wp-content/uploads/2019/05/sws2b.jpg?x12879", "https://rollingout.com/wp-content/uploads/2018/06/ro-logo-18-100.png?x12879", "https://rollingout.com/wp-content/uploads/2016/11/2016-11-01.png", "https://www.facebook.com/tr?id=666484143716324&ev=PageView\r\n&noscript=1"], "top_img": "https://rollingout.com/wp-content/uploads/2016/11/2016-11-01.png", "keywords": [], "authors": ["R. Hawkins"], "canonical_link": "https://rollingout.com/2017/09/06/meghan-markle-professes-love-prince-harry/", "title": "Meghan Markle professes her love for Prince Harry", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, user-scalable=1", "google-site-verification": "0Yj3tUrHdnc2yWCwimJKlw92aQSuA-NlLsRRxJ8FFOI", "dailymotion-domain-verification": "dmo4qzl4r7iqtl9wm", "og": {"title": "Meghan Markle professes her love for Prince Harry", "description": "Meghan Markle proclaims her love for Prince Harry in a rare interview with Vanity Fair. It’s no secret that the actress and royal bad boy have been entangled in a super private, magical love story. Now, the actress has broken her silence on their epic romance. “We’re a couple. We’re in love,” she shared in…", "image": "https://rollingout.com/wp-content/uploads/2016/11/2016-11-01.png", "url": "https://rollingout.com/2017/09/06/meghan-markle-professes-love-prince-harry/"}, "description": "Meghan Markle proclaims her love for Prince Harry in a rare interview with Vanity Fair. It's no secret that the actress and royal bad boy have been", "twitter": {"card": "summary_large_image", "description": "Meghan Markle proclaims her love for Prince Harry in a rare interview with Vanity Fair. It's no secret that the actress and royal bad boy have been", "title": "Meghan Markle professes her love for Prince Harry - Rolling Out", "site": "@rollingoutnews", "image": "https://rollingout.com/wp-content/uploads/2016/11/2016-11-01.png", "creator": "@ruubabie"}, "generator": "WordPress 5.2.1"}, "movies": [], "publish_date": 1504670400.0, "source": "https://rollingout.com", "summary": ""}