{"url": "https://greys.fandom.com/wiki/Callie_Torres", "text": "Dr. Calliope Iphegenia \"Callie\" Torres\n\nattending, specializing in orthopedics, at Grey-Sloan Memorial Hospital.\n\nContents show]\n\nCharacter History Edit\n\nGrey's Anatomy, Season 2 Edit\n\nCallie Torres first appears in season 2 episode 19. In season two she comes on to Alex Karev, because she thinks he's \"the guy in the elevator\". When she finds out that \"the guy in the elevator\" is George O 'Malley, she starts flirting with him. Callie and George end up dating.\n\nGrey's Anatomy, Season 3 Edit\n\nCallie and George O' Malley got married in Las Vegas\n\nGrey's Anatomy, Season 4 Edit\n\nCallie then started sleeping with Mark Sloan. Callie and Mark never were anything serious, they were friends with benefits. In the season 4 finale Callie, Erica Hahn and Mark are in an elevator together. Callie says Mark has been thinking about threesome all day, Erica says he wouldn't be able to handle them both. He disagrees, Erica then kisses Callie and says \"see I told you\". In the end of the season 4 finale episode Callie kisses Erica back.\n\nGrey's Anatomy, Season 5 Edit\n\nCallie and Erica start dating but break up in the beginning of season 5.\n\n. Callie and Arizona start dating. The relationship between Callie and Arizona has many bumps. One is the time Callie had to tell her father. Her father doesn't accept that she is bisexual, they have a big fight that ends up with him cutting her off (disowning her) and not speaking to her.\n\nGrey's Anatomy, Season 6 Edit\n\nGrey's Anatomy, Season 7 Edit\n\nIn season 7 episode 7 Arizona is going to Africa. Callie doesn't want to spend three years without her, so she goes with her. At the airport Callie and Arizona have a fight that ends with them breaking up. In season 7 episode 10 Arizona returns, saying she returned because she missed Callie, but without saying anything Callie closes the door on her. Arizona keeps trying to get Callie back, without luck. In the end of season 7 episode 12 Arizona begs Callie for a second chance, Callie tells her she is pregnant with Marks baby leaving Arizona shocked. They end up being back together in the next episode. In the season 7 finale Arizona and Callie drive to a house to take a weekend off. On the way Arizona asks Callie to marry her. Callie looks forward not knowing what to say, when she gets a scared look on her face and gasps, Arizona right away looks forward and the screen goes blank.\n\nCallie and Arizona break up, have been in a car accident. Arizona wakes up to see Callie lying outside the car, gone through the front window. When they get to hospital, Callies baby has to be premature born to save them both. When Callie wakes up she says to Arizona \"Yes, I'll marry you\". Arizona and Callie get married and Miranda Bailey, a co-worker, officiates.\n\nGrey's Anatomy, Season 8\n\nIn the season 8 finale, Mark, Derek, Lexie, Arizona, Meredith and Cristina are all in a plane crash and Lexie is the first to die.\n\nGrey's Anatomy, Season 9 Edit\n\nIn season 9 episode 1 Mark dies and Arizona has lost her left leg. Arizona thinks that Callie was the one that cut it off, betraying her trust. Callie takes the blame, even though it was Alex that did it. On the day that Bailey gets married, Arizona finally forgives Callie. Everything is going good for Callie and Arizona until the season 9 finale. In two episode a doctor, Lauren, has been flirting with Arizona. In the season 9 finale Arizona cheats on Callie. Callie finds out and they have a huge fight, it comes out that Arizona hasn't forgiven Callie for what she did. Arizona also tells Callie that she lost her leg but Callie didn't lose anything. While crying Callie answers \"apparently I lost you.\"\n\nGrey's Anatomy, Season 10 Edit\n\nGrey's Anatomy, Season 11 Edit\n\nlhrhrcbhucdthnb\n\nTrivia Edit\n\nCallie is an orthopedic surgeon.", "images": ["data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D", "https://vignette.wikia.nocookie.net/spotlightsimagestemporary/images/d/d5/Harry-Potter-Wizards-Unite-EN.jpg/revision/latest/zoom-crop/width/100/height/56?cb=20190629130333", "https://images.wikia.nocookie.net/__cb15/greys/images/8/89/Wiki-wordmark.png", "https://vignette.wikia.nocookie.net/greys/images/b/be/CallieS10-2.jpg/revision/latest/scale-to-width-down/250?cb=20140212183335", "https://vignette.wikia.nocookie.net/penguinsofmadagascar/images/9/97/FANDOM_Spotlight_-_Proposed_Banner_Art.png/revision/latest/zoom-crop/width/100/height/56?cb=20190709142444", "https://vignette.wikia.nocookie.net/universeconquest/images/3/38/UC_Wiki_Image.png/revision/latest/zoom-crop/width/100/height/56?cb=20190712164346", "https://vignette.wikia.nocookie.net/greys/images/b/be/CallieS10-2.jpg/revision/latest?cb=20140212183335", "https://slot1-images.wikia.nocookie.net/__cb1562940152319/common/extensions/wikia/WikiaBar/images/wikiabarIcon.png"], "top_img": "https://vignette.wikia.nocookie.net/greys/images/b/be/CallieS10-2.jpg/revision/latest?cb=20140212183335", "keywords": [], "authors": [], "canonical_link": "https://greys.fandom.com/wiki/Callie_Torres", "title": "Callie Torres", "meta_data": {"viewport": "width=device-width, user-scalable=yes", "generator": "MediaWiki 1.19.24", "keywords": "Grey's Wiki,greys,Callie Torres,Ep/GA2x19,GAcharacternav,Carlos Torres,Arizona Robbins,Sofia Torres,Grey Sloan Memorial Hospital,Grey's Anatomy,Meredith Grey,Alex Karev,Miranda Bailey", "description": "Dr. Calliope Iphegenia &quot;Callie&quot; Torres attending, specializing in orthopedics, at Grey-Sloan Memorial Hospital.", "twitter": {"card": "summary", "site": "@getfandom", "url": "https://greys.fandom.com/wiki/Callie_Torres", "title": "Callie Torres | Grey's Wiki | FANDOM powered by Wikia", "description": "Dr. Calliope Iphegenia \"Callie\" Torres attending, specializing in orthopedics, at Grey-Sloan Memorial Hospital."}, "fb": {"app_id": 112328095453510}, "og": {"type": "article", "site_name": "Grey's Wiki", "title": "Callie Torres", "description": "Dr. Calliope Iphegenia \"Callie\" Torres attending, specializing in orthopedics, at Grey-Sloan Memorial Hospital.", "url": "https://greys.fandom.com/wiki/Callie_Torres", "image": "https://vignette.wikia.nocookie.net/greys/images/b/be/CallieS10-2.jpg/revision/latest?cb=20140212183335"}, "apple-itunes-app": "app-id=422467074, app-arguments=https://greys.fandom.com/wiki/Callie_Torres"}, "movies": [], "publish_date": null, "source": "https://greys.fandom.com", "summary": ""}