{"url": "http://time.com/money/5390761/gwyneth-paltrow-goop-net-worth/", "text": "Goop, Gwyneth Paltrow’s wildly popular and, for some observers, often bewildering lifestyle company, will have to pay $145,000 as a result of a lawsuit regarding the Goop Jade Egg. But that’s chump change compared to the website’s value and how much it’s earned Paltrow.\n\nWhile it’s hard to say precisely what Gwyneth Paltrow has earned from Goop, the private startup has been on a roll as of late. This year, it received an infusion of $50 million in investment cash, bringing its total valuation to $250 million. And the actress—who’s spending a lot less time on the big screen—stands to gain a lot as founder and CEO. Her personal net worth was estimated at $140 million in 2014.\n\nIf Goop and Paltrow’s second career are still a bit unfamiliar to you, here’s a brief rundown of how she built her wellness empire.\n\n2008: Goop starts as a modest newsletter\n\nThe beginnings of Goop seem almost laughably humble in retrospect. Paltrow, an Oscar winner who rode the success of Shakespeare in Love to lucrative projects including the role of Pepper Potts in the Iron Man movie franchise, started Goop with the aims of recommending things—from a detox plan to her own recipes for turkey ragù and banana-nut muffins. She personally sent out the Goop newsletter from her kitchen, finding a select audience of people who wanted to live, or at least eat and train, like her. She had about 150,000 subscribers in 2009. She remembers sitting at home in London around this time and being thrilled when $45 came in as a result of an advertising partnership.\n\nGoop sort of gets it name from Paltrow herself, who goes by “G.P.” and especially in those early days, the brand and its face were virtually synonymous. “My life is good because I am not passive about it,” she wrote in a website posting. “I want to nourish what is real, and I want to do it without wasting time.” Then, as now, the Goop content is free, even if the promoted products can be exorbitantly costly, like $956 toilet paper.\n\nPredictably, Goop also faced backlash that hasn’t died, though back then it was more about Paltrow’s ostentatious display of wealth and privilege.\n\n2014: Goop makes a hard push into e-commerce\n\nThe next logical step for Goop was to actually sell the things it recommended. As part of this mission, the company brought in Lisa Gersh, former CEO and president of Martha Stewart Living Omnimedia, to be its chief executive. Goop expanded its e-commerce offerings, shipping its own wares. The site now sells everything from fashion to vitamins and household goods, including some products it manufactures itself, geared toward customers aspiring to the ideal Goop life. But many items—including, say, a $725 pajama set—certainly aren’t suitable for everyone’s wallets.\n\n“Our stuff is beautiful,” Paltrow said, according to The New York Times. “The ingredients are beautiful. You can’t get that at a lower price point. You can’t make these things mass-market.”\n\n2017: Goop Wellness launches\n\nGoop-branded products quadrupled in sales revenue in 2017, when the company brought in an estimated $45 to $60 million, a jump from $15 to $20 million the year before.\n\nIn an effort to ramp up its own product offerings, in the same year it started Goop Wellness, a set of vitamins that, in the vague wording of a press release, are “supplement regimens that address the acute needs of modern women.” The Times reports that Goop says it sold $100,000 of the vitamins in their first day on the market.\n\nThe criticisms against Goop became more worrying. In 2017, the watchdog group Truth in Advertising Inc. filed a complaint with California health regulators charging that the site was making dubious health claims about its products, which became the basis of the lawsuit that Goop just settled. The vaginal jade eggs it sold were said to “increase vaginal muscle tone, hormonal balance, and feminine energy in general.” (Those claims have been removed from Goop’s site.)\n\n2018: Tripled revenue and global expansion\n\nAt least so far, the scandals don’t seem to have slowed down Goop’s gravy train. Its latest round of funding has brought its total investment to $82 million, and Goop told Fortune that it has tripled its revenue for the past two years and is on track to more than double revenue in 2018.\n\nGoop even hosts wellness summits now, with tickets ranging from $500 to $4,500. In exchange, fans of the brand experience products, panels, doctors, and “healers.” And it has a print magazine, putting Paltrow alongside the likes of Martha Stewart and Oprah Winfrey in the media realm. The company also has plans for an international rollout.\n\nAs for the $250 million valuation, if Goop sells or goes public—assuming the controversy doesn’t make it go bust—Paltrow stands to gain quite a good chunk of that coin. And that $140 million net worth might keep rising.", "images": ["http://subscription-assets.timeinc.com/current/1012_top1_205_thumb.jpg", "https://timedotcom.files.wordpress.com/2017/09/money-newsletter-tout-footer.png", "http://subscription-assets.timeinc.com/current/1012_top2_205_thumb.jpg", "https://moneydotcomvip.files.wordpress.com/2018/09/180910-gwyneth-paltrow-goop.jpg?quality=85"], "top_img": "https://moneydotcomvip.files.wordpress.com/2018/09/180910-gwyneth-paltrow-goop.jpg?quality=85", "keywords": [], "authors": ["Paul Schrodt"], "canonical_link": "http://money.com/money/5390761/gwyneth-paltrow-goop-net-worth/", "title": "Gwyneth Paltrow's Goop Is Valued at $250 Million. Here Are All the Ways She Makes Money From the Cult Lifestyle Brand", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "celebrity", "news_keywords": "celebrity", "description": "From jade eggs to magazines and positive vibes.", "og": {"title": "Gwyneth Paltrow's Goop Is Valued at $250 Million. Here Are All the Ways She Makes Money From the Cult Lifestyle Brand", "type": "article", "site_name": "Money", "url": "http://money.com/money/5390761/gwyneth-paltrow-goop-net-worth/", "description": "From jade eggs to magazines and positive vibes.", "image": {"identifier": "https://moneydotcomvip.files.wordpress.com/2018/09/180910-gwyneth-paltrow-goop.jpg?quality=85", "width": 1024, "height": 683}}, "pinterest": {"url": "http://money.com/money/5390761/gwyneth-paltrow-goop-net-worth/", "description": "From jade eggs to magazines and positive vibes.", "media": "https://moneydotcomvip.files.wordpress.com/2018/09/180910-gwyneth-paltrow-goop.jpg?quality=85"}, "twitter": {"card": "summary_large_image", "url": "http://money.com/money/5390761/gwyneth-paltrow-goop-net-worth/", "title": "Gwyneth Paltrow's Goop Is Valued at $250 Million. Here Are All the Ways She Makes Money From the Cult Lifestyle Brand", "description": "From jade eggs to magazines and positive vibes.", "site": "@MONEY", "image": "https://moneydotcomvip.files.wordpress.com/2018/09/180910-gwyneth-paltrow-goop.jpg?quality=85"}, "fb": {"app_id": 53177223193, "pages": 119930514707114}, "google-site-verification": "5w1rl4iwAR7kN1jfJEXz5hqEVP7X_HAasGoC7R_LpDE"}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}