{"url": "https://money.usnews.com/money/blogs/my-money/articles/2017-05-25/best-memorial-day-sales-for-2017", "text": "Memorial Day on May 27 kicks off summer and brings an end to the monthslong spring sales lull. Big-box stores and specialty retailers alike will throw sales during the long weekend, with appliances, furniture, home decor and clothing being some of the most commonly discounted items.\n\nIf you're busy with barbecues and pool parties during the holiday weekend, don't worry. Many sales begin early and run a few days past May 27. These are some of the best sales to shop during Memorial Day 2019.\n\nAcademy Sports + Outdoors\n\nBest Buy\n\nBig Lots\n\nBrooklyn Bedding\n\nHome Depot\n\nJet.com\n\nJockey\n\nLowe's\n\nMattress Firm\n\nModsy\n\nNordstrom\n\nOverstock\n\nPier 1\n\nSerta\n\nThe Container Store\n\nRead on for more information on the best Memorial Day sales for 2019.\n\nAcademy Sports + Outdoors\n\nMilitary veterans and first responders who shop now through May 27 in stores and online will receive 10% off their purchases. All bikes are also on sale through June 1 in honor of National Bike Month. Starting May 19, the Memorial Day deals start rolling in, including $50 off the Pelican Challenger 130T Tandem Kayak, $10 off Crocs flip-flops and buy one, get one half off all Magellan Outdoors fishing shirts.\n\nBest Buy\n\nIf you're shopping for new appliances, take advantage of the Best Buy Memorial Day appliance sale, which runs through June 5. The sale features up to 40% off refrigerators, ranges, dishwashers, washing machines and dryers from brands including Maytag, Whirlpool and Samsung. Plus, when you purchase two or more major appliances totaling $1,500 or more, you will receive a free $100 Best Buy gift card.\n\nBig Lots\n\nThe store's Memorial Day sale, which runs through the weekend, includes a slew of discounts in various departments. Highlights include up to 25% off gazebos and outdoor dining sets, up to $100 off sofas and various buy one, get one 50% off promos on select home decor and kitchen items.\n\nBrooklyn Bedding\n\nGet 25% off across the entire site, including mattresses, pillows and bedding, from May 20 to 27.\n\nHome Depot\n\nAppliances are up to 40% off until June 5. That includes major appliances, as well as floor care products and vacuums (various iRobot Roomba robotic vacuums are 10% to 20% off). As for the rest of the store, save up to 40% on patio furniture, up to 25% on smart home products, up to 20% on outdoor power equipment and lawn mowers and up to 15% on grills and gardening supplies.\n\nJet.com\n\nThrough Memorial Day, get 50% off select dinnerware products from the brand Royal Doulton and 70% off select Adidas footwear.\n\nJockey\n\nUse promo code 15OFF to get 15% off your entire online purchase through May 31.\n\nLowe's\n\nLowe's is holding an appliance sale that runs through June 5, featuring up to 40% off major appliances and free local delivery on major appliances costing $299 or more. Plus, find Memorial Day savings throughout the entire store through Memorial Day weekend, including up to 30% off outdoor furniture, up to 25% outdoor power equipment and up to 15% off grills.\n\nMattress Firm\n\nShop by May 27, and get a king mattress for the price of a queen or a queen mattress for the price of a twin. Plus, get a free adjustable base (up to a $699 value) with a purchase of $499 or more. More sales on specific brands will be rolling out during the weekend as well.\n\nModsy\n\nThe online interior design company is offering 20% off all its design packages with promo code MEMORIAL May 20 to May 27. Plus, use promo code YESWAY through May 31 to get free shipping on orders over $500.\n\nNordstrom\n\nThe Half-Yearly Sale encompasses Memorial Day weekend and continues until June 2. Get up to 50% off select clothing, bags, shoes and accessories. Plus, through Memorial Day weekend (while supplies last), get a free Clinique gift with a $29 Clinique purchase.\n\nOverstock\n\nThe Memorial Day Blowout sale runs through May 27 and offers up to 70% off and free shipping. Highlights include up to 65% off mattresses, up to 30% off luggage and bags, up to 25% off rugs and up to 20% off living room and dining room furniture. Miss the sale? Extended savings will be offered on select items through June 3.\n\nPier 1\n\nMay 22 to May 27, get up to 50% off store wide, plus an extra 25% off clearance items.\n\nSerta\n\nUntil June 3, save up to $200 on Serta iComfort mattresses and up to $400 on select Serta adjustable foundations.\n\nThe Container Store\n\nGladiator brand items are up to 20% off until May 30. If your closets need an upgrade, the Custom Closet Event continues through June 30 and offers free installation on Elfa purchases over $750.", "images": ["https://www.usnews.com/static/img/usn-logo-large.svg", "https://money.usnews.com/static/img/circle-email-icon.svg", "https://www.usnews.com/dims4/USNEWS/a5b7d0a/2147483647/resize/1200x%3E/quality/85/?url=http%3A%2F%2Fcom-usnews-beam-media.s3.amazonaws.com%2Fbb%2Fd3%2Ffa8945eb4e39b4019c6914b51dd2%2Fshoppingclothesman.jpg", "https://www.usnews.com/dims4/USNEWS/5854199/2147483647/thumbnail/640x420/quality/85/?url=http%3A%2F%2Fcom-usnews-beam-media.s3.amazonaws.com%2Fbb%2Fd3%2Ffa8945eb4e39b4019c6914b51dd2%2Fshoppingclothesman.jpg", "https://media.beam.usnews.com/50/3c/5438b2f142939830f903a1757d17/181116-wealthofknowledge-logo-design.jpg", "https://www.usnews.com/dims4/USNEWS/165fb08/2147483647/thumbnail/640x420/quality/85/?url=http%3A%2F%2Fcom-usnews-beam-media.s3.amazonaws.com%2F31%2F48%2Fea3d2d1a440ebc9b4858c0466c04%2F151130-brokenpiggy-stock.jpg", "https://www.usnews.com/dims4/USNEWS/908688c/2147483647/thumbnail/84x84/quality/85/?url=http%3A%2F%2Fcom-usnews-beam-media.s3.amazonaws.com%2Fcc%2F98%2F75cb376641019c29d74644ebc57e%2Fkristin-mcgrath.jpg"], "top_img": "https://www.usnews.com/dims4/USNEWS/a5b7d0a/2147483647/resize/1200x%3E/quality/85/?url=http%3A%2F%2Fcom-usnews-beam-media.s3.amazonaws.com%2Fbb%2Fd3%2Ffa8945eb4e39b4019c6914b51dd2%2Fshoppingclothesman.jpg", "keywords": [], "authors": [], "canonical_link": "https://money.usnews.com/money/blogs/my-money/articles/best-memorial-day-sales", "title": "Best Memorial Day Sales for 2019", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0", "description": "These best Memorial Day sales are offering top deals on mattresses, appliances, furniture, clothing and other goods.", "keywords": "Kristin McGrath ,personal finance,personal budgets,shopping,money,My Money,Spending", "site": "money-news", "zone": "blogs/my-money/articles", "fb": {"pages": 5834919267, "app_id": 130063997038366}, "og": {"title": "Best Memorial Day Sales for 2019", "description": "Here's where to save the most on furniture, mattresses and fashion during the Memorial Day weekend.", "image": "https://www.usnews.com/dims4/USNEWS/a5b7d0a/2147483647/resize/1200x%3E/quality/85/?url=http%3A%2F%2Fcom-usnews-beam-media.s3.amazonaws.com%2Fbb%2Fd3%2Ffa8945eb4e39b4019c6914b51dd2%2Fshoppingclothesman.jpg", "type": "article", "site_name": "US News & World Report", "url": "https://money.usnews.com/money/blogs/my-money/articles/best-memorial-day-sales"}, "twitter": {"image": "https://www.usnews.com/dims4/USNEWS/a5b7d0a/2147483647/resize/1200x%3E/quality/85/?url=http%3A%2F%2Fcom-usnews-beam-media.s3.amazonaws.com%2Fbb%2Fd3%2Ffa8945eb4e39b4019c6914b51dd2%2Fshoppingclothesman.jpg", "card": "summary_large_image", "site": "@USNews", "title": "Best Memorial Day Sales for 2019", "description": "Here's where to save the most on furniture, mattresses and fashion during the Memorial Day weekend."}, "google-site-verification": "owJBuFHD3VHcTSsnPSOYizmUcs3GSBjbx09vBbBi1MM", "msvalidate.01": "A8E47FA91124063A4A9C78AD5273DC0F", "optimizely": "Optimizely is supported by this application but is not enabled for this page."}, "movies": [], "publish_date": 1495684800.0, "source": "https://money.usnews.com", "summary": ""}