{"url": "https://abcnews.go.com/Entertainment/video/club-mickey-mouse-newest-mouseketeers-revealed-49708764", "text": "Transcript for 'Club Mickey Mouse' newest Mouseketeers revealed\n\nThen I got home. Look I. Eight. Here if you were thinking along. That as I'm active and a lot that the Mickey Mouse club in back. Only digital reboot it be viewing today on FaceBook and am totally remade totally new cash. And here in our New York media. Thinks. I let it Jana the end test that gave. And will congratulations on being asked if you're have a field where the jacket. In the slayings come two yeah. Corporate and you guys are all here together you've only been together like two months old yes how is it going well and that's it won't really well you know at first the very first day the you know it's right to the song processed into. Yes cleanup at the and now we're here just so happy and wants so far loving work and you'll be seeing our videos at Friday. And when he. Yet to be creating all the time it's not just one show that comes once a week no matter how you doing that how you like bringing creativity keep producing news. Well basically over the course of the next seven weeks against the act on and on her face looking incidence of ackland making mask he could follow our journey by it's basically. Always on. It's gonna be every day contact posting constantly and that every Friday night well this Annie get I think music Danielle. It's going to be sent every week you're gonna do oh holy music video and every week. Avalanche effect that it. You've got to where every week until. It's also unique in every single episode that you watch and it like we haven't really seen pat and so we're going to be watching it just about everyone else and it's going to be late and since it's a lot of it is an exceptionally interacting with people to fewer people to write in Italy with the answer so like what people's. All our content like instrument boomerang and to Graham lives and hopefully we'll be getting less answer a lot of questions up they have for us. But you know it's just so much fun of a process just getting to work with these creative minds there was. So so inspiring I got inspired every day tecumseh and just like be around with vanity that all of these guys out there that we're likely have a great time everyday within your favorite parts of. Car bomb my favorite part is just getting now anything. Senate and it county PDAs along thanked me it's a really humbling experience. Because you go land and you just surrounded with a blank check amazing energy and talent and we get to heat up and tired and I really enjoy that because. They had a huge impact on me with it. Even. He even if you probably even in Latin that they were on like shaking hands holding it. But you guys have all the individually performing for a really long time and a thick enough to bring you together but will tell me that he started performing in the first thing. Well I started dancing around ran five because my sister you know she had problems with inflation into DNC. So I'm almost like all eyes he stands on the site when she's only you know. States like you know what I capitals outside dancing right away and then from there two agents in the industry side dancing in. With everyone doesn't either and you know huge times just incredible and dance was the first lap for all right yeah asking. That I you it's kind of fight so I started five years old but dancing actually like discovering that honking with the accident to me because. I had asthma when I was younger and whenever I try outdoor sports. Every time I play I get sick so I knew finance hinders indoor sport (%expletive) act the same time and my sister. Was operating answers the dancing was I running in the Stanley as in the rest up into the first dance class. I just didn't want anything else but and for the rest of them but he that in big sister's fame and yeah. Yeah. A huge impact on us lit up you. Now I've been full and ends saying pass at the same time and has about 56. But yet and anything has always been a passion of mine and I've been able to do competitions he's an. And act like them as Welker and industry in just like me every month because LA they're really like small communities a lake. We really know each other that well that's why this program box to get there but it's great night's tonight. And. Did you. Well I started at sixty is I was a baby shine painful enough they have going but I can't say they found. The answer every brought out my personality. And I add me heated. Really. She'll light hand and here is the most incredible feeling being able share mentioning any people and it's a greatly acts of eyes. And trendy and oh yeah delegates and the exactly. Have you guys for the speed yourself in the history that you are now carrying forward this either third. Remake ranked. Have lauded show have you been looking back at all episode militants that it. Yeah. Yeah laugh when we pressed. Got put on president's program. We get everything if you look at the old Mickey Mouse class and on mean making out clad. And just seeing omni meaning people who came out of there like Jackson Christine Mac guy and for eighteen and that means hello there like those are all legends. And it's yes. And I look. I mean cleaner it's because like. Going on at teen led you're on social media and it ends in inspecting constantly think let these old isn't like Justin Timberlake and Gosling and seeing all these people being icons in today's society and like they're really like click in the fact that we're in the next in addition it. It felt like overwhelmingly started where he is patently just like they left the huge legacy. Act. Their culture and now that we're part of this new generations of slick. Will the standards are high that it. Public confidence they got that we got it can't press yeah yeah. It is high but you guys got the energy got the town Patrick mr. New game. Yeah. I believe I have only been together for months but is that you can back with you know each other really well let them down arsenic birthday and mid Atlantic avenues. Give me ask the question. And that whoever you think best fits that description just went to back earth god. Ready ready ready or raise your hand if you think. A batting okay. A guy who in the ground and the group. Well it runs and high. I read me. Yeah I'm hurt I eat clowns. Yeah honestly I mean he or Clinton. Is asking them to look partner its food theory. I. I don't know all this. And close all of it meanwhile let me compete let you know I'm old I. How did you ready or not you'll be okay. I I don't know how to explain it won't let there like well is always going about letting out a game and not let the man doesn't care business as he got it. It is that the it. That's another game gave state control panel but hey moved are. Many women think they know what they hit lately anyway anything I think there should be we're gonna have acted out later that he is eater. Us really well yeah what do you not I usually don't eat hamburgers hot dogs. It's me it's a little. What do you eat with you hear it hello ticking pizza pops back frank frank. Silicon there'd eat. That than those shoes. A little a little competition. Radio does little guy very. You game city transit elements day as well we spent the most time on their. On yeah. Yeah. I mean that keep up with everything from the movement that we threw. Yeah. You know I yeah. Yeah he's such a struggle to wake him up and actually filling seek him. Obama rhetoric yet been living in new let me not much Havoc on. Hello yeah. If you. It looked like aren't likely to. I got this. Different books I would adjustments. Doesn't think. What do you guys and most excited about acting viewing today there and start looking at all the things even working so hard I'd what do you most looking forward to. And I mean I want. Having both excited to see you like how many people this region is because fur I couldn't speak for all of us like this witness Brian Rooney Jasper. To see like all the kids that watches all the adults watches people excited. They're out like everywhere and think so excited to see how people react. Yet and yet span eighteen to seventeen are making in nineteen it's all eight he can't. Well in the mouth club. And then you grant. That can't bring the plumbing and apparently didn't new. Are ideally I would definitely gets excited to release all the content that we worked over like the passover and it's been the best summer console fire. And anywhere all craters on the show we meet we wrote our own songs craft guidance videos and I mean that's why they're called creators on the show and it's just really such an honor and just. Being able to inspire everyone around the room. But I Yuma of them I'm really excited. And all of our content I'll be coming out this at any basement club Mickey Mouse. And I just can't wait to you know threaten a card has evolved into our music. Midnight in enter the on the road. But I just roots to every generation Montana say it's not just twelfth eighteen it's. And re seeing each generation every month canola and asking me better but he's positive he. What's great about that because this is the first time program that's going to be online is that first of its kind it's gonna be great he can reach music online on. Walt Disney records in every Friday that can be dropping Marseille and sell it going to be like he's either reached. And communicate and Mickey Mouse quoting one of Disney's for shows and now we are one of Disney's first digital programs. Well and.\n\nThis transcript has been automatically generated and may not be 100% accurate.", "images": ["https://s.abcnews.com/images/US/190712_abc_rkelly_presser_hpMain_16x9_384.jpg", "https://s.abcnews.com/images/Entertainment/190712_abcnl_dispatch_rkelly_hpMain_16x9_384.jpg", "https://s.abcnews.com/images/GMA/190712_gma_hotlist_hpMain_16x9_384.jpg", "https://s.abcnews.com/images/Entertainment/170908_gostream_brianna2_16x9_384.jpg", "https://s.abcnews.com/images/WNT/190712_wn_index4_hpMain_16x9_384.jpg", "https://s.abcnews.com/images/Entertainment/170908_gostream_mousecheer3_16x9_384.jpg", "https://s.abcnews.com/images/WNT/190712_wn_davis_639_hpMain_16x9_384.jpg", "https://s.abcnews.com/images/GMA/190713_gma_pop2_hpMain_16x9_384.jpg", "https://s.abcnews.com/images/Nightline/190713_ntl_stapp_hpMain_16x9_384.jpg", "https://s.abcnews.com/images/GMA/190712_gmaday_lunch_topics_hpMain_16x9_384.jpg", "https://s.abcnews.com/images/GMA/190712_gma_struts_primadonna_fix_hpMain_16x9_384.jpg", "https://s.abcnews.com/images/Entertainment/170908_gostream_mousekaterr_revealed_16x9_992.jpg", "https://s.abcnews.com/images/US/170516_abc_social_mickey_gender_reveal_16x9_384.jpg", "https://s.abcnews.com/images/Entertainment/190712_abcnl_dispatch_goodburger_hpMain_16x9_384.jpg", "https://s.abcnews.com/images/GMA/190713_gma_serena5_hpMain_16x9_384.jpg", "https://s.abcnews.com/images/GMA/190712_gmaday_romeo_keke_intro1_hpMain_16x9_384.jpg", "https://s.abcnews.com/images/Entertainment/190712_vod_danielle_brooks_crop_hpMain_16x9_384.jpg", "https://s.abcnews.com/images/GMA/190712_gma_struts_kissthis_fix_hpMain_16x9_384.jpg", "https://s.abcnews.com/images/Entertainment/190712_vod_kym_whitley_crop_hpMain_16x9_384.jpg", "https://s.abcnews.com/images/GMA/190712_gma_struts_couldhave2_hpMain_16x9_384.jpg", "https://s.abcnews.com/images/GMA/190712_gmaday_jason_jones2_hpMain_16x9_384.jpg"], "top_img": "https://s.abcnews.com/images/Entertainment/170908_gostream_mousekaterr_revealed_16x9_992.jpg", "keywords": [], "authors": ["Abc News"], "canonical_link": "https://abcnews.go.com/Entertainment/video/club-mickey-mouse-newest-mouseketeers-revealed-49708764", "title": "'Club Mickey Mouse' newest Mouseketeers revealed Video", "meta_data": {"robots": "index, follow", "author": "ABC News", "copyright": "Copyright (c) 2019 ABC News Internet Ventures", "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "description": "ABC News' Amna Nawaz talks with the newest members of the club about the new launch of 'Club Mickey Mouse.'", "news_keywords": "Club Mickey Mouse, Mouseketeer cheer, mickey mouse club, Club Mickey Mouse cheer, Mickey Mouse, Disney,entertainment news, celebrity news, celebrity gossip", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "fb_title": "Video: 'Club  Mickey Mouse' newest Mouseketeers revealed", "og": {"site_name": "ABC News", "title": "Video: 'Club  Mickey Mouse' newest Mouseketeers revealed", "description": "ABC News' Amna Nawaz talks with the newest members of the club about the new launch of 'Club Mickey Mouse.'", "url": "https://abcnews.go.com/Entertainment/video/club-mickey-mouse-newest-mouseketeers-revealed-49708764", "image": {"identifier": "https://s.abcnews.com/images/Entertainment/170908_gostream_mousekaterr_revealed_16x9_992.jpg", "type": "image/jpeg"}, "type": "video", "video": {"identifier": "https://abcnewsplayer-a.akamaihd.net/player/2.19.0.0004/amp.premier/AkamaiPremierPlayer.swf?settings_url=https://abcnewsplayer-a.akamaihd.net/player/2.19.0.0004/amp.premier/amp.premier.flashonly.xml?sec=1&params=%7B%22playerId%22%3A%22facebookHTTP%22%7D&data_feed_url=https://abcnews.go.com/video/itemfeed?id=49708764&auto_play=true&ad_control_enabled=false", "width": 470, "height": 265, "type": "application/x-shockwave-flash", "secure_url": "https://abcnewsplayer-a.akamaihd.net/player/2.19.0.0004/amp.premier/AkamaiPremierPlayer.swf?settings_url=https://abcnewsplayer-a.akamaihd.net/player/2.19.0.0004/amp.premier/amp.premier.flashonly.xml?sec=1&params=%7B%22playerId%22%3A%22facebookHTTPS%22%7D&data_feed_url=https://abcnews.go.com/video/itemfeed?id=49708764&auto_play=true&ad_control_enabled=false"}}, "twitter": {"image": "https://s.abcnews.com/images/Entertainment/170908_gostream_mousekaterr_revealed_16x9_992.jpg", "card": "player", "site": "@ABC", "player": {"identifier": "https://abcnews.go.com/video/twittercard?id=49708764", "stream": {"identifier": "http://once.unicornmedia.com/now/od/auto/98330877-5095-4ac9-9a8c-7cdcd3944274/15a750c8-e7be-4371-b5c3-dd911c0d8bb0/entertainment-49708764/content.once", "content_type": "video/mp4"}}, "app": {"name": {"iphone": "ABC News", "ipad": "ABC News"}, "id": {"iphone": 300255638, "ipad": 306934135}, "url": {"iphone": "abcnewsiphone://link/video,49708764", "ipad": "abcnewsipad://link/video,49708764"}}}, "video": {"duration": 674}, "al": {"iphone": {"url": "abcnewsiphone://link/video,49708764", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}, "ipad": {"url": "abcnewsipad://link/video,49708764", "app_store_id": 380520716, "app_name": "ABC News for iPad"}}}, "movies": [], "publish_date": null, "source": "https://abcnews.go.com", "summary": ""}