{"url": "https://www.healthbreakingnews.net/2018/07/prince-harry-carries-on-princess-dianas-legacy-by-announcing-aids-initiative-with-elton-john/", "text": "When it comes to the AIDS epidemic, Prince Harry is carrying on Princess Diana’s legacy while simultaneously forging his own. The Duke of Sussex has been a longtime public advocate of providing resources, expanding education and inciting policy change in the ongoing fight against HIV and AIDS. He took yet another step in that longtime endeavor by joining forces with Sir Elton John to announce the launch of the MenStar coalition during a plenary session at the 2018 International AIDS Conference in Amsterdam on Tuesday. The coalition is aimed at expanding the diagnoses and treatment of HIV infections in men with the goal of ultimately ending the AIDS epidemic by 2030. In the process, the coalition will support and fund innovative approaches to delivering effective HIV/AIDS services for men, including aiming to increase earlier uptake of testing and treatment. “Inspired by the growing alarm at the rate of new HIV infections among young women, the MenStar coalition is bravely tackling the root cause of this problem–the lack of awareness of HIV prevention amongst hard-to-reach young men,” Prince Harry said in a speech during the session. “And it will be guided by listening to and respecting the voices of the young men the coalition is trying to reach.” Rescue-pet-turned-Instagram-star Mervin the Chihuahua and dog dad Joey Teixeira share why adoption is their first option, along with some tips on how to make your pet a social media celebrity. (Published 4 hours ago) Prince Harry &Meghan Markle: Romance Rewind “We cannot solve… [Read full story]", "images": ["https://media.nbcnewyork.com/images/1200*675/harryelton1.jpg"], "top_img": "https://media.nbcnewyork.com/images/1200*675/harryelton1.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.healthbreakingnews.net/2018/07/prince-harry-carries-on-princess-dianas-legacy-by-announcing-aids-initiative-with-elton-john/", "title": "Prince Harry Carries on Princess Diana’s Legacy by Announcing AIDS Initiative With Elton John", "meta_data": {"viewport": "width=device-width, initial-scale=1", "og": {"image": "https://media.nbcnewyork.com/images/1200*675/harryelton1.jpg", "site_name": "Health Breaking News", "type": "article", "locale": "en_US", "url": "https://www.healthbreakingnews.net/2018/07/prince-harry-carries-on-princess-dianas-legacy-by-announcing-aids-initiative-with-elton-john/", "title": "Prince Harry Carries on Princess Diana’s Legacy by Announcing AIDS Initiative With Elton John", "description": "When it comes to the AIDS epidemic, Prince Harry is carrying on Princess Diana's legacy while simultaneously forging his own. The Duke of Sussex has been a longtime public advocate of providing resources, expanding education and inciting policy change in the ongoing fight against HIV and AIDS. He took yet another step in that longtime…"}, "article": {"published_time": "2018-07-24T18:36:14+00:00", "modified_time": "2018-07-24T18:36:14+00:00", "author": "https://www.healthbreakingnews.net/author/nbcnewyork/", "section": "entertainment news"}, "msapplication-TileImage": "https://www.healthbreakingnews.net/uploads/sites/12/2017/10/cropped-healthbreakingnews-icon-270x270.png"}, "movies": [], "publish_date": 1532457374.0, "source": "https://www.healthbreakingnews.net", "summary": ""}